jsonp(2,{"name":"dc","start":887},`【李文會曰】即不名菩薩者。二乘之人。若有煩惱妄想。不能除滅。即同凡夫。滅色取空。不了色性。即非菩薩。
【淨名經云】色性自空。非色滅空。如病眼人見空中花。無有是處。
【傅大士云】名因共業變。萬象即微生。若悟真空色。翛然獨有名。
^r17:25何以故。須菩提。實無有法。名為菩薩
【王日休曰】佛又自問。何故上文之意。謂一切眾生為有者。不名為覺眾生乎。乃呼須菩提而自答云。實無有法名為覺眾生者。謂真性中實無法以名為覺眾生也。且修行而至於菩薩者。誠賴佛所說之法。故知修行之理。而此言實無有法者。特謂真性中無此法耳。
【李文會曰】實無有法名為菩薩者。一切空寂。本來不生。不見有生死。不見有涅槃。不見有善惡。不見有凡聖。不見一切法。是名見法。正見之時。了無可見。即是菩薩。故云實無有法。名為菩薩。
^r17:28是故佛說一切法。無我無人無眾生無壽者
【王日休曰】是故者。謂上文所言之故也。乃謂實無有法名為覺眾生之說也。佛說一切法。無我。無人。無眾生。無壽者。謂佛說諸法。皆謂我人眾生壽者本無有也。此四者。統而言之。皆謂之眾生。此眾生既本無有。烏得有覺眾生乎。
【陳雄曰】上文言實無有法。尚何有法可說耶。然佛本無言說。其所說者。不過真空無相。維摩經云。法無眾生。離眾生垢故。法無有我。離我垢故。法無壽命。離生死故。法無有人。前後際斷故。此真空無相法也。佛說一切法者此耳。外此則我佛無所說。
【顏丙曰】色身長大。爭奈有生滅。有限量。即非大身。若造作此言。我當滅度無量眾生。即不名菩薩。迷則佛眾生。悟則眾生佛。實無有法名為菩薩。是故佛說一切法。無四相可得。
【川禪師曰】喚牛即牛。呼馬即馬。頌曰。借婆衫子拜婆門。禮數周旋已十分。竹影掃堦塵不動。月輪穿海水無痕。
^r17:29須菩提。若菩薩作是言。我當莊嚴佛土。是不名菩薩
【疏鈔云】言佛土者。心土也。佛土無相。云何莊嚴。若有莊嚴。法即是增。
【陳雄曰】以㝎慧之寶。莊嚴心佛土者。菩薩也。不言其功。而人莫見其迹。以金珠之寶莊嚴世間佛土者。凡夫也。自言其功而常急於人知。文殊般若經云。為一切眾生。發大莊嚴。而心不見莊嚴之相。菩薩如是。豈肯自言其功哉。若作是言。是四種相未除。即凡夫之見。其誰名為菩薩耶。
【李文會曰】我當莊嚴佛土是不名菩薩者。妙定經云。若人造作白銀精舍滿三千大千世界。雖有無量布施福德。謂心有能所。即非菩薩。不如一念無能所心所得功德。勝前功德百千萬倍。
^r17:30何以故。如來說莊嚴佛土者。即非莊嚴。是名莊嚴
【肇法師曰】此明不達法空。取莊嚴淨土。故非菩薩。復明離相無為莊嚴佛土也。
【王日休曰】此與苐十分之意同(溥本第十分。王本十一分)。於此再言者。為續來聽者說。故兼說下文也。
【陳雄曰】如來所說者。莊嚴心佛土也。心佛土本來清淨無相。何假莊飾。故云即非莊嚴。常人以莊嚴為莊嚴。而如來則以非莊嚴為莊嚴。有妙莊嚴存焉是則所以名其為莊嚴。故淨土論云。備諸珎寶性。具足妙莊嚴。世人著世間佛土而不知反。佛前言而此復言。救弊云爾。
【顏丙曰】心常清淨。不染世緣。是為莊嚴佛土也。雖日莊嚴。不可作莊嚴相。故曰即非莊嚴。但強名而已。
【李文會曰】即非莊嚴是名莊嚴者。實無有法可得阿耨多羅三藐三菩提。實無有法名為菩薩。豈復取莊嚴相如是。即逍遙自在。無纖毫罣礙。云何是莊嚴。云何不是莊嚴。故云即非莊嚴。是名莊嚴也。
^r17:31須菩提。若菩薩。通達無我法者。如來說名真是菩薩
【王日休曰】據楞伽經說二無我謂人無我與法無我也。人無我者。謂人無本軆因業而生法無我者。謂法無本軆。因事而立。若作富貴之業。則生於富貴中。作貧賤之業。則生於貧賤中。是人無本軆也。若因欲渡水。則為舟楫之法。因欲行陸。則為車輿之法。是法本無軆也。一切法皆因事而立。即是假合。假合即為虛妄。若信此理而悟解之。是真菩薩之見識。故云如來說名真是菩薩。
【顏丙曰】通達無我法者。直下大悟。如漆桶底脫。四通八達。廓然無我。我身既無。何更有法。人法雙忘。只這真是菩薩。更莫別求。
【李文會曰】通達無我法者。於諸法相無所滯礙。是名通達。若作有所能解。是名我相。若作無所能解。湛然清淨。是名無我。故云真是菩薩。僧問馬祖作何見解。即得達道。答云。自性本來具足。但於善惡事上不滯。方喚作道。人的取善捨惡。觀空入定。皆属造作。更若向外馳求。轉踈轉遠。一念妄想。便是三界生死根本。但無一念。是除生死根本。即得法王無上珎寶。
【傅大士頌曰】人與法相待。二相本來如。法空人是妄。人空法亦祛。人法兩俱實。授記可非虛一切皆如幻。誰言得有無。
【川禪師曰】寒即普天寒。熱即普天熱。頌曰。有我元無我。寒時燒軟火。無心似有心。半夜拾金針。無心無我分明道。不知道者是何人。呵呵。
^ck18【一體同觀】
^r18:1須菩提。於意云何。如來有肉眼不。^r18:2如是。世尊。如來有肉眼。^r18:3須菩提。於意云何。如來有天眼不。^r18:4如是。世尊。如來有天眼。^r18:5須菩提。於意云何。如來有慧眼不。^r18:6如是。世尊。如來有慧眼。^r18:7須菩提。於意云何。如來有法眼不。^r18:8如是。世尊。如來有法眼須菩提。^r18:9於意云何。如來有佛眼不。^r18:10如是。世尊。如來有佛眼
【日月殊光如來解曰】言肉眼者。照見胎卵濕化。色身起滅因緣也。言天眼者。照見諸天宮殿。雲雨明暗。五星二曜。旋伏因緣也。言慧眼者。照見眾生慧性深淺。上品下生。輪廻託隂因緣也。言法眼者。照見法身遍充三界。無形無相。盡虛空遍法界因緣也。言佛眼者。照見佛身世界無比。放光普照。破諸黑暗。無障無礙。圓滿十方。尋光見軆。知有涅槃國土也。此五眼如來其中若有上根上智之人。能識此五種因緣。即名為大乘菩薩也。
【陳雄曰】華嚴經云。肉眼見一切色故。天眼見一切眾生心故。慧眼見一切眾生諸根境界故。法眼見一切法如實相故。佛眼見如來十力故(一是處非處如實力。二知三世報業力。三知諸禪解脫三昧力。四知眾生諸根上下力。五知眾生種種欲力。六知世間種種性力。七知一切道至力。八得夙命智力。九得天眼能觀一切力。十得漏盡智力)大般若經。所謂清淨五眼是也。世尊設五眼之問。須菩提皆答以有如是之理。可謂善問答矣。
【顏丙曰】化身觀見為肉眼。普照大千為天眼。智燭常明為慧眼。了諸法空為法眼。自性常覺為佛眼。有僧問尊宿云。觀音菩薩用許多手眼作麼。尊宿云。通身是手眼。若人於這裏薦得。一眼也無。豈更落三落四。然雖如是。須是箇漢始得。能具足此五眼者。唯自性如來也。五眼度世品經云。佛言隨世開化。入於五道而淨五眼。一肉眼。處於世間。現四大身。因此開化。度脫眾生。
二天眼。諸天在上。及在世間。未識至道。示以三乘。三慧眼。其不能解智度無極皆開化之。使入大慧。四法眼。其在褊局。不能恢泰。悉開化之。解法身一無去來。令平等三世。五佛眼。其迷惑者。不識正真。隂盖(盖者遮也)所覆。譬如睡眠。示以四等四恩之行。布施持戒忍辱精進。一心智慧。善權方便。進退隨宜。不失一切。令發正真道意。
【李文會曰】一切凡夫皆具五眼。而被迷心盖覆。不能自見。若無迷心妄念。如得翳障退滅五眼開明。見一切色也。內外空寂。名為肉眼。見自真性。是法平等。名為天眼。見自性中。般若之智。名為慧眼。見諸色相心不動搖。見一切法無一切法。見一切相無一切相。是名法眼。見前際無煩惱可斷。中際無自性可守。後際無佛可求。三際清淨。是名佛眼。
又云。若以無相為法身者。名為慧眼而見如來指空論有。假立名相。名為法眼。而見如來。若了有無即非有無。二邊寂滅。全軆法身周徧法界者。具足佛眼。而見如來。
【傅大士頌曰】天眼通非閡。肉眼閡非通。法眼唯觀俗。慧眼直緣空。佛眼如千日。照異軆還同。圓明法界內。無處不含容。
【川禪師云】盡在眉毛下。頌曰。如來有五眼。張三秪一雙。一般分皁白。的的別青黃。其間些子爻訛處。六月炎天下雪霜。
^r18:11須菩提。於意云何。如恒河中所有沙。佛說是沙不。^r18:12如是。世尊。如來說是沙。^r18:13須菩提。於意云何。如一恒河中所有沙。有如是沙等恒河。是諸恒河所有沙數佛世界。如是寧為多不。^r18:14甚多。世尊。
【六祖曰】恒河者。西國祇洹精舍側近之河。如來說法。常指此河為喻。佛說此河中沙一沙况一佛世界以為多不須菩提言甚多。世尊。
【王日休曰】恒河中所有沙。有如是沙等恒河者。謂一粒沙為一恒河也。是諸恒河所有沙數佛世界如是者。是諸恒河。謂一粒沙。為一恒河。如此恒河中所有之沙。則不勝其多矣。佛世界如是者。謂世界如是之多也。此其為多。不在所言矣。然而佛又以問須菩提者何也。亦以廣坐說法。欲人先明了於心。故不厭其詳復。而將為下文之說也。佛世界者。謂凡一大世界。必有一佛設化。故凡大世界。皆謂之佛世界。
【顏丙曰】以沙數世界。言其多也。有如是等恒河。是諸恒河所有沙者等者。比也。將如此沙。比恒河之多。又將諸多恒河中之沙。而數佛世界。佛舉此以問。如是寧為多不。須菩提答云甚多。
【僧若訥曰】明諸恒河中沙。一沙為一世界。舉此為問。
【李文會曰】恒河沙數者。欲明眾生有種種妄念。故舉無窮之沙以為喻耳。
【楞嚴經云】琉璃光法王子觀世間眾生。皆是妄緣風力所轉。觀世動時。觀身動止。觀心動念。諸動無二。等無差別。此羣動性。來無所從。去無所至。十方卻塵。顛倒眾生。盡同一虛妄也。
^r18:15佛告須菩提。爾所國土中所有眾生若干種心。如來悉知
【王日休曰】所有眾生。謂彼世界中。凡有之眾生。乃一切眾生也。其眾生之心。如來所以悉知者。以此心為妄想。乃自真性中現。既生此妄想心。自佛觀之。則有形相矣。有形相。故可得而知也。若寂然如虛空。則無得而知矣。且所謂他心通者(六通。天眼通。徹視大千。天耳通。洞視十方。他心通。悉知種類。宿命通。達三世事神境通。形無窒礙。如意通。任運自在)。
謂彼既起心念。則此可得而知也。聞有人把棊子於手中。令他心通者觀之。則知其為棊子。以己知為棊子故也。然己則不知其數之多寡。使彼言之。則亦不知其數。以己不知其數故也。由是言之。若一起心念。則如有形相。故可得而知。如佛者。豈止他心通而已哉。故無量眾生。一起心念。皆悉知見。無足疑也。
【顏丙曰】若干。乃幾多之意。若幾多心。如來悉知。心鏡一明。無不遍知。
【僧若訥曰】若干者。若如也。干數也。顏師古云。設數之辭也。若干有二種。一世間凡夫心。二出世間聖人心。如來盡能知之。故名正遍知也。
【李文會曰】若干種心。如來悉知者。眼耳鼻舌身意。若起心動念處皆是國土。於國土中。所有眾生。若干種種差別之心。心數雖多。緫名妄心。既覺是妄。故云悉知。
【川禪師云】曾為浪子偏憐客。慣愛貪盃識醉人。頌曰。眼觀東南。意在西北。將謂猴白。更有猴黑。一切眾生一切心。盡逐無窮聲與色。喝。
^r18:16何以故。如來說諸心。皆為非心。是名為心
【六祖曰】爾所國土中所有眾生。一一眾生。皆有若干差別。心數雖多。緫名妄心。識得妄心非心。是名為心。
【顏丙曰】如來說諸心。實無心可得。故曰非心。但強名曰心。
【李文會曰】覺妄之心。即是非心。本無妄念。不起妄心。即是自性本心。故云是名為心。即是菩薩心。亦名涅槃心。亦名大道心。亦名佛心。故。
【臨濟禪師云】若一念心能解縛。此是觀音三昧法。
【川禪師云】病多諳藥性。頌曰。一波纔動萬波隨。似蟻循環豈了期。咄。今日為君都割斷。出身方號丈夫兒。
^r18:17所以者何。須菩提。過去心不可得。現在心不可得。未來心不可得
【肇法師曰】聞說諸心。謂有實心。故須破遣。明三世皆空。故論云。過去已滅。未來未起。現在虛妄。三世推求。了不可得。
【疏鈔云】未覺不知。隨時流轉。故有三世。若悟真一之心。即無過去現在未來。若有過去心可滅即是自滅。若有未來心可生。即是自生。既有生有滅。即非常住真心。即為依他心。虛妄心。若一念有生滅心。即成六十二種邪見。九百種煩惱。
【王日休曰】常住真心。即真性也。是以自無量無數劫來。常一定而不變動。豈有過去未來現在哉。若有過去未來現在。則為妄想。此三心是也。且若飽而未欲食。則欲食之心為未來。飢而正欲食。則欲食之心為現在。食畢而放匕箸。則欲食之心為過去。是此心因事而起。事過而滅。故為妄想也。不可得者。謂無也。言此三心本來無有。乃因事而有耳。圓覺經所以言六塵緣影為自心相者。謂眾生以六種塵緣之影為自己之心相也。
【僧若訥曰】本生心地觀經云。如佛所說。唯將心法為三界主。心法本源。不染塵穢。云何心法。染貪瞋癡。於三世法。誰說為心。過去心已滅。未來心未至。現在心不住。諸法之內性不可得。諸法之外相不可得。諸法中間都不可得。心法本來無有形相。心法本來無有住處。一切如來尚不可見心。何况餘人得見心法。
【顏丙曰】謂思念前事者為過去心。思念令事者為現在心。思念後事者為未來心。三念緫放下著。謂之不可得。經云。前念後念及今念。念念不被邪見染。此為三心不可得。古云。一念不生全軆現。亦謂三際俱斷。三念俱妄。了不可得。
【傅大士頌曰】依他一念起。俱為妄所行。便分六十二。九百亂縱橫(法華經二卷。世尊偈言。薄德少福人。眾苦所逼迫。入邪見稠林。若有若無等。依止此諸見。具足六十二。毗婆沙論云。六十二見者。五蘊中各起四見。四五二十。三世各二十。通為六十。斷常二見為根本。揔為六十二見。且於色蘊中。即色是我。離色非我。我中有色。色中有我。五蘊中具有此四。疏鈔解三心云。若一念有生滅心。即成六十二種邪見。九百種煩惱)。過去滅無滅(一作不滅)當來生不生。常能作此觀(去聲)。真妄坦然平(晁文元公遇高士劉惟一。訪以生滅之事。劉曰。人常不死。公駭之。劉曰。形死性不滅。是知此性。歷劫長存)。
【川禪師曰】低聲低聲。直得鼻孔裏出氣。頌曰。三際求心心不見。兩眼依然對兩眼。不須遺劒刻舟尋。雪月風花常見靣。
【未曾有經云】妙吉祥菩薩因見一人。言我造殺業。决墮地獄。如何救度。菩薩即化一人。亦曰我造殺業。决墮地獄。前人聞已。言我亦然。化人告之。唯佛能救。相隨共詣。化人白佛。我造殺業。怖墮地獄。願佛救度。佛即告言。如汝所說造殺業者。汝從何心而起業相。為過去耶。未來耶。見在耶。若起過去心者。過去已滅。心不可得。若起未來心者。未來未至。心不可得。
若起見在心者。見在不住。心不可得。三世俱不可得故。即無起作。無起作故。於其罪相何所見耶。善男子。心無所住。不在內外中間。心無色相。非青黃赤白。心無造作。無作者故。心非幻化。本真實故。心無邊際。非限量故。心無取捨。非善惡故。心無轉動。非生滅故。心等虛空。無障礙故。心非染淨。離一切數故。善男子。作是觀者。即於一切法中。求心不可得。何以故。心之自性。即諸法性。諸法性空。即真實性。由是義故。汝今不應妄生怖畏。是時化人聞佛說法。
即白佛言。我今得悟罪業性空。不生怖畏。尓時實造業者。亦白佛言。我今得悟罪業性空。而不復生怖畏之想。
【李文會曰】謂三世心無性可得。故可從緣而生。
【肇法師云】聞說諸心。謂有實心。故須破遣。明三世皆空。故云過去已滅。未來未起。現在虛妄。三世推求。了不可得。故云若悟無法無相無事平常真心。即法軆空寂。不生不滅。湛然清淨。豈有前念今念後念可得也。
【馬祖云】道不用修。但莫洿染。何謂洿染。但有生死造作趣向。皆是洿染。若欲直會其道。平常心即是道。何謂平常心。無造作。無是非。無取捨。無憎愛。無凡聖。是故經云。非凡夫行。非聖賢行。是菩薩行。
【趙州問南泉云】如何是道。泉云。平常心是道。
【圜悟禪師頌曰】欲識平常道。天真任自然。行船宜舉棹。走馬即加鞭。若遇飢來飯。還應困即眠。盡從緣所得。所得亦非緣。
^ck19【法界通化】
^r19:1須菩提。於意云何。若有人滿三千大千世界七寶。以用布施。是人以是因緣。得福多不。^r19:2如是。世尊。此人以是因緣得福甚多。^r19:4須菩提。若福德有實。如來不說得福德多。以福德無故。如來說得福德多
【自在力王如來解曰】此雖如是布施。只是有礙之寶。不是無為清淨功德。是故如來不說多也。若有菩薩。以盧舍那身中七覺菩提。持齋禮讚。從其心燈。化生功德。不生不滅。堅如金剛。乘香花雲。入無邊界。起光明臺。供養十方。一切諸佛。此是無為功德。見性之施。化為菩薩。頌曰。廣將七寶持為施。如來不說福田多。若用心燈充供養。威光徧照滿娑婆。
【疏鈔云】若據捨大千珎寶布施。其福極多。若執著。希望福德。有餘則有盡。故云若福德執實有。如來不說得福德多。此是反釋之義。言以福德無者。無希望心也。既無希望。即為無住相施。是名無為福。若依無住無為而施者。故如來說得福德多。
【僧若訥曰】福有者。取相也。福無者。離相也。離相故稱性。性如虛空。其福無量。
【顏丙曰】假使盡世界七寶布施。此乃人天小果。有漏之因。終不免輪廻。畢竟有墮落。不足為多。以福德無故。此其所以為多也。所謂無之一字。趙州教人見性看話頭。自云。狗子還有佛性無。應云無。只將這無字。貼向鼻頭上。崖來崖去。久久自然有箇入頭處。是則是。切不得作無字會。
【僧微師曰】世尊召云須菩提。若能施之人。以妄識為本。修布施行。即取著能所者。以為實有此福。即成顛倒。如來不說此福德多。以福德無故者。若能施之人。以佛智為本。修布施行。悉皆離相。不見福為實有。即非顛倒。如來說此人福德甚多。
【智者禪師頌曰】三千大世界。七寶滿其中。有人持布施。得福也如風。猶勝慳貪者。未得達真宗。終須四句偈。知覺證全空。
【李文會曰】凡夫住相。布施七寶。希求福利。此是妄心。所得福德。不足為多。不如淨妙無住之福。無得之德。同於虛空。無有邊際。
【川禪師云】猶勝別勞心。頌曰。羅漢應供薄。象身七寶珎。雖然多濁富。爭似少清貧。冈象只因無意得。離婁失在有心親。
^ck20【離色離相】
^r20:1須菩提。於意云何。佛可以具足色身見不。^r20:2不也。世尊。如來不應以具足色身見
【陳雄曰】色身者。三十二相也。具足者。無一而虧欠也。備三十二行而具足是相。三十二行。法身中有之。欲見法身如來識自本心。見自本性足矣。豈應見於具足色身也哉。
^r20:3 何以故。如來說具足色身。即非具足色身。是名具足色身
【陳雄曰】壇經云。皮肉是色身。華嚴經云。色身非是佛。觀此則知肉身無如來。殊不知有生如來存焉。知色身非法身。殊不知有妙色身存焉。華嚴經又云。清淨妙色身。神力故顯現。曰妙色身。則現一切色身三昧。便是法身如來。即非具足色身可知。以非具足色身。而名為具足色身者。盖得其所以具足色身故也。
^r20:4須菩提。於意云何。如來可以具足諸相見不。^r20:5不也。世尊。如來不應以具足諸相見。^r20:6何以故。如來說諸相具足。即非具足。是名諸相具足
【陳雄曰】楞伽經云。相者。若處所形相。色像等現。是名為相。此言諸相者。種種變現神通之。相也。又不止於三十二相而已。如來離色離相。以淨行則具足三十二。以智慧則具足八萬四千。具足三明。六神通。八解脫(法華經三卷云。佛於天人大眾之中。說是法時。六百萬億那由他人。皆得三明六通。具八解脫)此之具足。即非諸相之所謂具足也。然此之具足。乃其實也。而諸相具足。特其華耳。充其實則其華必副之。是以有諸相具足之名。
【顏丙曰】佛。覺也。覺性如虛空。不應以具足色身見。唯見性人。方知即非色身。如夫子毋我。顏子坐忘是也。自性如來。不應以具足諸相見。性尚不可得。又何有諸相。故以即非之說為掃除之。
【王日休曰】此分與苐五分苐十三分之意同。於此再言者。為續來聽者說也(傳本十三分。王本十六分)。
【李文會曰】心既空寂。湛然清淨。豈有色身諸相可得。凡夫既不著有。即著於空。有此斷常二見。謂觀空莫非見色。觀色莫不皆空。即是具足色身具足諸相。非具足也。空色一如。有無不異。方可能觀。無身而見一切身。無相而見一切相。是名色身具足。諸相具足也。
【僧問趙州】狗子有佛性麼。州云。狗子無佛性。進云。蠢動含靈。皆有佛性。為什麼狗子無佛性。州云。為他有業識在。夫有業識之人。種種著於有。起諸妄想者。此名顛倒知見。種種落於空。都無所悟者。此名斷滅知見。宿有善根之人。無此顛倒斷滅二病。而能洞曉空趣。此名正真知見。若悟此理。乃可隨時著衣喫飯。長養聖胎。任運過時。更有何事。
【四祖謂牛頭融禪師云】百千妙門。同歸方寸。恒沙功德。緫在心源。一切空門。一切慧門。一切行門。悉皆具足。神通妙用。只在你心。業障煩惱。本來空寂。一切果報。性相平等。大道虛曠。絕思絕慮。如是之法。無欠無餘。與佛無殊。更無別法。但只令心自在。莫懷妄想。亦莫歡欣。莫起貪瞋。莫生憂慮。蕩蕩無礙。任意縱橫。不作諸善。不作諸惡。行住坐臥。觸目遇緣。皆是佛之妙用。
【祖印明禪師云】養就家欄水牯牛。自歸自去有來由。如令穩坐深雲裏。秦不管兮漢不收。
【傅大士頌曰】八十隨形好。相分三十二(般若經第十卷。言八十種好。文繁不錄)。應物萬般形理中非一異。人法兩俱遣。色心齊一棄。所以證菩提。實由諸相離(去聲)。
【川禪師云】官不容針。私通車馬。頌曰。請君仰靣看虛空。廓落無邊不見蹤。若解轉身些子力。頭頭物物緫相逢。
^ck21【非說所說】
^r21:3須菩提。汝勿謂如來作是念。我當有所說法。莫作是念。何以故。若人言如來有所說法。即為謗佛。不能解我所說故
【李文會曰】心既清淨。語默皆如。遇緣即施。緣散即寂。
【張無盡云】非法無以談空。非人無以說法。此謂不同生滅之心有法可說也。若有生滅心在而說法者。是教一切人不能得見自性。謂之謗佛。但無生滅心。方可說法。
【川禪師云】是即是。大藏小藏從甚處得來。頌曰。有說皆為謗。無言亦不容。為君通一線。日出嶺東紅。
^r21:4須菩提。說法者。無法可說是名說法
【王日休曰】若人言。如來有所說法。即為謗佛者。謂佛本不說法。以真性無法可說。若以為佛本說法。即為志在於法耳。佛豈志在於法哉。此所以為謗佛。所以為不能解佛所說之故也。佛又呼須菩提。而言說法者實無有法。謂本來無法。特為眾生去除外妄而說耳。此法豈真實哉。眾生既悟。則不用此法矣。故但虛名為說法而已。此分與第七分。言無有少法如來所得之意大略同。亦與十三分。所謂無有少法如來所說之意同(傳本在十三分。王本在十五分)。然此再舉者。後詳言之。亦為續來聽者說也。
【顏丙曰】終日喫飯。不曾咬著一粒米。終日著衣。不曾掛著一莖絲。所以我佛橫說直說。四十九年未嘗道著一字。唯同道方知。若言如來有所說。即為謗佛。不能解會我所說。直饒說得天花亂墜。也落在苐二著。唯能坐斷十方。打成一片。非言語可到。是名真說法也。所以道。墻壁瓦礫。說禪浩浩。前輩頌云。也大奇。也大奇。無情說法不思議。若將耳聽終難會。眼處聞聲方得知。
【謝靈運曰】教傳者。說法之意也。向言無說。非杜默而不語。但無存而說。則說滿天下。無乖。法理之過。無存。謂不著諸相。心無所住也。
【傅大士云】相寂名亦遣。心融境亦亡。去來終莫見。語默永無妨。智入圓成理。身同法性常。證真還了俗。不廢是津梁。
【川禪師云】兔角𣐀。龜毛拂。頌曰。多年石馬放毫光。鐵牛哮吼入長江。虛空一喝無蹤跡。不覺潛身北斗藏。且道是說法不是說法。
^r21:5爾時慧命須菩提
【疏鈔云】尓時。當起問之時也。言慧命者。善現達佛智海入深法門。悟慧無生。覺本源之命非去非來。故曰慧命須菩提。
【陳雄曰】慧命須菩提。見於法華經信解品。慧以德言。命以壽言。即長老之異名也。
【顏丙曰】慧命者。具智慧性也。故曰。天命之謂性。
^r21:6白佛言。世尊。頗有眾生於未來世。聞說是法。生信心不。^r21:7佛言。須菩提。彼非眾生。非不眾生。^r21:8何以故。須菩提。眾生眾生者。如來說非眾生。是名眾生
【疏鈔云】佛言彼非眾生者。皆具真一之性。與佛同源。故曰非眾生。言非不眾生者。背真逐妄。句喪己靈。故曰非不是眾生。
【王日休】解第二分云。命者壽之意。壽者老之意。其言慧命者。以須菩提既得慧眼。且年高矣。須菩提於此問頗有眾生。於未來世。聞說是法。生信心不。佛言彼非眾生非不眾生者。恐聽法者誤認眾生以為實有。故曰彼非眾生。謂自業緣中現。業盡則滅。豈有真實眾生也。然亦有眾生之身現在。此又不可謂之非眾生。故曰非不眾生。但非真實而為虛幻耳。佛又自問云。何以故者。謂何故非不眾生。乃呼須菩提而自答云眾生眾生者。謂凡為眾生者。則所謂一切眾生也。如來說非眾生。是名眾生者。謂一切眾生。佛皆以為非真實眾生。但虛名為眾生而已。此佛自言也。而又言如來說者。豈非諸佛亦如是說乎。
【顏丙曰】須菩提問佛。眾生於未來世。聞說是法。生信心不。佛答曰。彼非眾生。非不眾生者。盖眾生屬有。不眾生屬無。彼眾生性。本同太虛。不落有無二見。如來說非眾生。但假名眾生。故佛嘗曰。我不敢輕於汝等。汝等皆當作佛。我佛未嘗輕眾生也如此。
【智者禪師頌曰】不言有所說。所說妙難窮。有說皆為謗。至道處其中。多言無所解。默耳得三空(二空。即見第一分。又疏鈔云。有無中道。亦曰三輪軆空)。智覺剎那頃。無生無始終(俱舍等論。謂時之最少。名一剎那。一百二十剎那。名一怛剎那。六十怛剎那。名一羅婆。三十羅婆。名一牟呼栗多。亦云須㬰。三十牟呼栗多。為一晝夜)。
【川禪師曰】火熱。風動。水濕。地堅。頌曰。指鹿豈能成駿馬。言鳥誰謂是翔鸞。雖然不許纖毫異。馬字驢名幾百般。靈幽法師。加此慧命須菩提六十二字。是唐長慶二年。今在濠州鍾離寺石碑上記。六祖解在前故無解。今亦存之。
【李文會曰】此則魏譯偈也。長慶中僧靈幽入冥所。指魏譯則存。秦譯則無也。謂言若敬信佛法。即著聖見。非眾生也。若不信佛法。即著凡夫見。非不眾生。若起此二見者。是不了中道也。須是令教凡聖皆盡。不住兩頭。方是真正見解。故云眾生眾生者。如來說非眾生是名眾生也。
^ck22【無法可得】
^r22:2須菩提。白佛言。^r22:3世尊。佛得阿耨多羅三藐三菩提。為無所得耶。^r22:4佛言如是如是。須菩提。我於阿耨多羅三藐三菩提。乃至無有少法可得。是名阿耨多羅三藐三菩提
【王日休曰】此分與第七分。大槩同。於此再言者。為續來聽者說也。佛言如是如是者。盖深許其言之當也。阿耨多羅三藐三菩提無有少法可得者。謂性中無有少法可得。無有所得。則蕩然空空。是不可以形相求。不可以言說求也。但說名為無上正等止覺而已。
【陳雄曰】壇經云。妙性本空。無有一法可得。既無一法可得。寧須有菩提可證耶。我佛無得無證。無名可名。是以強名曰阿耨菩提。
【顏丙曰】有法可得。是名法縛。無法可得。方名解脫。須菩提。以無所得之辭而告世尊。世尊即以如是如是而證據之。佛又云。我於無上正等正覺。乃至無少法可得。虛名而已。
【智者禪師頌曰】諸佛智明覺。覺性本無涯。佛因有何得。所得為無耶。妙性難量比。得理即無差。執迷不悟者。路錯幾河沙。
【李文會曰】若有少法可得。亦是著相。
【誌公云】但有纖毫即是塵。舉意便遭魔所擾。經云。若人欲識佛境界。當淨其意如虛空。學道之人。但於一切諸法無取無捨。見如不見。聞如不聞。心如木石。刮削併當令內外清淨。方是逍遙自在底人。
【法句經云】雖終日見。猶為無見。雖終日聞。猶為無聞。
【草堂清和尚云】擊石乃出火。火光終不然。碧潭深萬丈。直下見青天。
【逍遙翁云】內覺身心空。外覺萬事空。破諸相訖。自然無可執。無可爭。此謂禪悅。所謂大明了人。勿令有秋毫許障礙。微塵許染著。堅久不渝。便是無上士不動尊也。
【琪禪師云】念念釋迦出世。步步弥勒下生。分別現文殊之心。運用動普賢之行。門門而皆出甘露。味味而盡是醍醐。不出旃檀之林。長處華藏之境。若如此也。行住坐臥。觸目遇緣。雖應用千差。且湛然清淨。
【川禪師云】求人不如求己。頌曰。滴水生氷信有之。綠楊芳草色依依。春花秋月無窮事。不妨閑聽鷓鴣啼。
^ck23【淨心行善】
^r23:1復次須菩提。是法平等。無有高下。是名阿耨多羅三藐三菩提
【王日休曰】六本皆作是法平等無有高下。然此所謂是法。乃真性也。真性豈可謂之法哉。強名曰法耳。上自諸佛。下至蠢動含靈其真性一同。故云平等無有高下。謂色身則有高下。真性則無高下也。
【謝靈運曰】結成菩提義也。人無貴賤。法無好醜。蕩然平等。菩提義也。
【肇法師曰】明此法身菩提。在六道中亦不減下。在諸佛心中。亦不增高。是名平等無上菩提。
【真武說報父母恩重經云】物不能平物。惟水不動。則可以平物。物不能等物。惟權衡之公。則可以等物。平則無高無下。等則無重無輕。
【李文會曰】是法平等無有高下者。凡夫不見自性。妄識分別。自生高下。謂佛是高眾生是下。菩薩了悟人法二空。上至諸佛。下至螻蟻。皆有佛性。無所分別。故一切法皆平等。豈有高下也。
【黃蘖禪師云】若觀佛作清淨光明解脫之相。觀眾生作垢濁暗昧生死之相。作此解者。歷恒河沙劫。終不能得阿耨菩提。又云。心若平等。不分高下。即與眾生諸佛。世界山河。有相無相。徧十方界一切平等。無彼我相。此本源清淨心。常自圓滿。光明徧照也。
【傅大士云】水陸同真際。飛行軆一如。法中何彼此。理上起親踈。自他分別遣。高下執情除。了斯平等性。咸共入無餘。
^r23:2以無我。無人。無眾生。無壽者
【王日休曰】所以名為無上正等正覺者。以真性中本無我人眾生壽者。此四者乃妄緣中現。而真性則平等。豈有四者之異哉。故名為無上正等正覺也。
^r23:3修一切善法。即得阿耨多羅三藐三菩提
【王日休曰】一切善法。乃佛接引眾生悟明真性之法也。依此法修行。即得無上正等正覺之真性。此真性我本有之。豈可謂之得哉。盖凡言得者。皆謂自外而得。此則非自外而得。故不可謂之得。然此則言得者。盖不得已而強名曰得耳。
【李文會曰】修一切善法者。若不能離諸相而修善法。終不能得解脫。但離諸相而修善法。即得阿耨多羅三藐三菩提也。又云。若人於一切事。無染無著。於一切境。不動不搖。於一切法。無取無捨。於一切時。常行方便。隨順眾生。令皆歡喜。而為說法。令悟菩提真性。此即名為修善法也。
【川禪師云】山高水深。日生月落。頌曰。僧是僧兮俗是俗。喜則笑兮悲則哭。若能於此善參詳。六六從來三十六。
^r23:4須菩提。所言善法者。如來說即非善法。是名善法
【王日休曰】佛又呼須菩提。而謂所言善法者即非善法。謂本來無此善法。乃假此以開悟眾生耳。故但虛名為善法而已。
【顏丙曰】兩頭話有三十六對。善與惡對。有與無對。生與死對。去與來對。動與靜對。語與默對。勝與負對。高與下對。不作兩頭見。是為平等法。亦名無上正等正覺。以無四相心。修一切善法。即得阿耨多羅三藐三菩提。所謂即非善法者。盖凡夫執惡。聲聞著善。若不離善法。又落兩頭機。豈為平等。
【傅大士頌曰】水陸同真際。飛行軆一如(子榮曰。水陸同真際者。緫標四生有情之本。皆有一真之性。故云飛行軆一如。今據經云。是法平等無有高下。故此頌亦緫四生而言之也。水之所產。陸之所生。水陸雖不同。而一性之真際則未嘗不同也。有翼者能飛。有足者能行。飛行雖不一。而一性之本軆則未嘗不一也)法中何彼此。理上豈親踈(性中所有之法。曾何彼此之間。性中所具之理。豈有親踈之殊)自他分別遣(自者。己也。他者。人也。自己他人妄生分別者。皆當遣去。圓覺經曰。自他身心。注云。自之身心。即我相也。他之身心。即人相也。
又曰。自性憎愛故。注云。於自則愛。於他則憎)高下執情除(妄分高下而生執著之情亦當除之)。
了斯平等性。咸共入無餘(經曰。是法平等。無有高下。有人若能了悟平等之性。則咸共入於無餘涅槃矣。寒山詩曰。佛性元平等。緫有真如性。但自審思量。不用閑爭競)。
【李文會曰】不住相故。即非善法。無漏福故。是名善法。
【法華經云】初善中善後善者。初謂發善心時。須是念念精進。不生疑惑懈怠之心。中謂常修一切善法。令悟真性。不著諸法相也。後謂即破善法。直教一切善惡凡聖。無取捨憎愛之心。平常無事。故云即非善法是名善法也。
【古德云】了取平常心是道。飢來喫飯困來眠。又云。常平等心。如此廣大。妙觀察智。如日光明。軆用及此。是佛境界。
【川禪師云】靣上夾竹桃花。肚裏侵天荊棘。頌曰。是惡非惡。從善非善。將逐符行。兵隨印轉。有時獨上妙高峯。却來端坐閻王殿。見盡人間祇點頭。大悲手眼多方便。
^ck24【福智無比】
^r24:1須菩提。若三千大千世界中。所有諸須彌山王。如是等七寶聚。有人持用布施
【疏鈔云】大千世界中。所有須弥山王。上至忉利天。下至崐崘際。若有將七寶如須弥山高。持用布施。獲福不可知數。問。還有過此福者不。下文答。
【僧微師曰】佛召云。須菩提。且如一四天下。則有一須弥山。若據三千大千世界。所有百億須弥山。是眾山之最。故言山王。
^r24:2 若人以此般若波羅蜜經。乃至四句偈等。受持讀誦。為他人說。於前福德。百分不及一。百千萬億分。乃至筭數譬喻。所不能及
【疏鈔云】若於無住般若。受持真四句偈。及書寫誦念。為他人演說。如是等人。所得功德。不可稱計。何以故。悟性圓融。不斷有為而證無為。不除妄想而趣真常。達第一義。於一念之間。得無為福。無為福德。量等虛空。不可思議。故經云於前捨須弥山珎寶布施福德。若比無為福。百千萬億倍。不及一倍。
【王日休曰】此言所有諸須弥山王。如是等七寶聚布施。而不可以比受持演說之功者。以彼則世間福。終有時而受盡。此則為出世間福。愈增長而終無窮故也。
【陳雄曰】佛以性上福德為最上。以身中七寶為希有。儻七寶滿三千大千世界之多。等須弥山之高大。有能持以布施。則其福德。想不下於須弥山。令有人焉持誦真經。并四句渴說與他人。是修自性上福德。是聚自身中七寶。回視多施七寶之福。萬萬不侔。五祖曰。自性若迷。福何可救。六祖曰。乘船永世求珠。不知身是七寶。二佛之言。皆為世人不修身修性。徒施寶以為求福之道。
【顏丙曰】此一分專較量福德輕重。若有人將七寶比於須弥山王布施。所得福德。比之持經之人。百分不及一分。况持經之人。又能悟四句偈等。受持讀誦。為他人說。不特自利。又且利他。如此福德無量。有百千萬億分。乃至不可筭數譬喻。正如寒山云。無物堪比倫。教我如何說。
【李文會曰】聚七寶布施。如三千大千世界中須弥山王。所得無量無邊功德。此為住相布施。終無解脫之期。不如受持讀誦此經乃至四句偈等。所得無住相淨妙功德。勝前功德百千萬倍。
【傅大士頌曰】施寶如沙數。唯成有漏因。不如無我觀(去聲)。了妄乃名真。欲證無生忍。要假離貪嗔。人法知無我。逍遙出六塵。
【川禪師曰】千錐劄地。不如鈍鍬一捺。頌曰。麒麟鸞鳳不成群。尺璧寸珠那入市。逐風之馬不並馳。倚天長劒人難比。乾坤不覆載。劫火不能壞。凜凜威光混太虛。天上人間緫不如。噫。
^ck25【化無所化】
^r25:1須菩提。於意云何。汝等勿謂如來作是念。我當度眾生。須菩提。莫作是念。^r25:2何以故。實無有眾生如來度者
【僧若訥曰】如來雖設法施。廣度眾生。而不作是念。故誡云。汝等勿謂也。莫作是念者重誡也。度無度相。能所一如故論偈云。平等真法界。佛不度眾生。
【李文會曰】實無有眾生如來度者。如來不見有眾生可度。又云。謂諸眾生起無量無邊煩惱妄想。於一切善惡凡聖等見。有取捨分別之心。迷情盖覆菩提之性。佛出于世。教令覺悟。降六賊。斷三毒。除人我。若能了悟人法二空。無諸妄念。心常空寂。湛然清淨。更不停留纖毫滯礙。即是見性實無眾生可化度也。
【石霜禪師云】休去歇去。古廟香爐去。枯木寒灰去。一念萬年去。如大死人去。若能如此用心。安有不成道乎。
^r25:3 若有眾生如來度者。如來即有我人眾生壽者
【王日休曰】佛謂須菩提云。汝等勿謂如來作是念。我當度眾生。又呼須菩提而再言曰。莫作是念。何以故者。以實無眾生如來所度。謂一切眾生。皆是妄緣中現。其實無有。若言有眾生如來所度。即是執著。於有我人眾生壽者也。
【僧若訥曰】若見有可度者。即同凡夫有我執也。
【李文會曰】若有眾生如來度者。即有我人眾生壽者者。人人具足。箇箇圓成。本來是佛。與佛無異。
【圜悟禪師云】赤肉團上。人人古佛家風。毘盧頂門。處處祖師巴鼻。若也恁麼返照。凝然一段光明。非色非心。非內非外。行棒也打他不著。行喝也驚他不得。直得淨躶躶。赤洒洒。是箇無生法忍。不退轉輪。截斷兩頭。歸家穩坐。正當恁麼時。不須他處覓。秪此是西方。
【傅大士云】夜夜抱佛眠。朝朝還共起。起坐鎮相隨。語默同居止。纖毫不相離。如身影相似。欲識佛去處。只這語聲是。眾生但為業障深重。與佛有殊。若能廻光返照。一刀兩段。即便見自性也。若不因佛經教。一切眾生無因自悟。憑何修行得至佛地。此是如來無所得心。故云若有眾生如來度者。即有我人眾生壽者相也。
【川禪師曰】春蘭秋菊。各自馨香。頌曰。生下東西七步行。人人鼻直兩眉橫。哆啝悲喜皆相似。那時誰更問尊堂。還記得在麼。
^r25:4須菩提。如來說有我者。即非有我。而凡夫之人。以為有我
【僧若訥曰】如來既無我人等相。云何有時稱我。須知假名稱我。對所度眾生。隨時說我。
【李文會曰】有我者即是凡夫。非我者隨處作主。應用無方。故云。凡是佛因。佛是凡果。
【境界經云】三世諸佛皆無所有。唯有自心。既明因果無差。乃知心外無法。二乘之人執有我相。欲離生死而求涅槃。欲捨煩惱而求滅度。是捨一邊。不了中道乃同凡夫行也。
^r25:5 須菩提。凡夫者。如來說即非凡夫。是名凡夫
【王日休曰】佛又呼須菩提而言凡夫者。謂非有真實凡夫。但虛名為凡夫而已。此所謂隨舉隨掃也。上言凡夫。是之謂舉。下必言無真實凡夫。是之謂掃。與其掃之。曷若不舉。盖不舉則無以明其理。譬如過渡而不用筏者也。不掃則恐人泥其說譬如到岸而不登。乃住於筏上者也。此所以必舉之而又必掃之。
【僧若訥曰】因上如來說我釋非凡夫。却見佛與凡夫有隔。於是止泯。則聖凡平等。故云即非凡夫。
【顏丙曰】當人自性自度。迷來悟度。邪來正度。從上諸佛言句。但為指出路頭。須是自行自履。豈由他人。所以道。實無眾生如來度者。若有可度。是如來有四相。如來。乃見性人也。所以無我。凡夫。未見性人也。所以我相未忘。佛又恐人落分別界。故曰即非凡夫。所以見如來凡夫本同一性。不容分別。
【智者禪師頌曰】眾生修因果。果熟自然圓。法船自然度。何必要人牽。恰似捕魚者。得魚忘却筌。若道如來度。從來度幾船(經上文曰。實無有眾生如來度者。一切眾生本來是佛。何生可度)。
【李文會曰】即非凡夫者。一念清淨。非凡非佛。故云即非凡夫。凡夫亦空。迷者妄執。但無執著。即一切清淨耳。
【川禪師云】前念眾生後念佛佛與眾生是何物。頌曰。不見三頭六臂。却能拈匙放筯。有時醉酒罵人。忽爾燒香作禮。手把破沙盆。身披羅錦綺。做模打樣百千般。驀鼻牽來秪是你。嗄。
^ck26【法身非相】
^r26:1須菩提。於意云何。可以三十二相觀如來不。^r26:2須菩提言。如是如是。以三十二相觀如來
【王日休曰】如來。謂真佛也。苐五分已言此意矣。於此再言者。為續來聽者說。故兼及轉輪聖王之說也。
【李文會曰】空生疑謂眾生是有。可他成聖。法身不無。可以妙相而見妙也。
【川禪師云】錯。頌曰。泥塑木雕縑綵畫。堆青抹綠更裝金。若言此是如來相。笑殺南無觀世音。
^r26:3佛言。須菩提。若以三十二相觀如來者。轉輪聖王。即是如來。^r26:4須菩提白佛言。世尊。如我解佛所說義。不應以三十二相觀如來
【六祖曰】世尊大慈。恐須菩提執相之病未除。故作此問。須菩提未知佛意。乃言如是如是之言。早是迷心。更言以三十二相觀如來。又是一重迷心。離真轉遠。故如來為說。除彼迷心。若以三十二相觀如來者。轉輪聖王即是如來。轉輪聖王雖有三十二相。豈得同如來。世尊引此言者。以遣須菩提執相之病。令其所悟深澈。須菩提被問。迷心頓釋。故云如我解佛所說義。不應以三十二相觀如來。須菩提是大阿羅漢。所悟甚深。得方便門。不生迷路。以冀世尊除遣細惑。令後世眾生所見不謬也。
【王日休曰】佛又呼須菩提而言。若以三十二相觀如來者。轉輪聖王即是如來。且轉輪聖王是為四天王。乃管四天下。正五九月照南閻浮提。二六十月。照西瞿耶尼。三七十一月。照北鬱單越。四八十二月。照東弗婆提。常如輪之轉。以照四天下。察人間善惡。故名轉輪聖王以其福業之多。故色身亦具足三十二相一如佛。佛故謂若以三十二相為佛。則轉輪聖王亦當為佛。是不可以三十二相見佛故繼云不應以三十二相觀如來也。
【李文會曰】轉輪聖王即是如來者。佛以近事質之。令其自解。又云。未達我人眾生壽者四相。即是心有生滅。生滅即是轉輪義王者。心也。雖修三十二淨行。生滅心即轉多。終不契清淨本來心。故云不應以三十二相觀如來也。
【川禪師云】錯。頌曰。有相身中無相身。金香爐下鐵崐崘。頭頭盡是吾家物。何必靈山問世尊。如王秉。
^r26:5 爾時世尊。而說偈言：^r26:6若以色見我　以音聲求我　是人行邪道　不能見如來
【劉虯云】音聲色相。本自心生。分別之心。皆落邪道。若能見無所見。聞無所聞。知無所知。證無所證。軆茲妙理。方見如來。虛皇天尊經章四十四妙行曰。妄為妙相七十二。頂負九色光。諸大仙人。以是覩天尊也。天尊曰。我以非色。汝妄為色。我以非相。汝妄為相。若以九色七十二相觀我。即是離無著有。不可與聞無上之義。
【疏鈔云】佛言善現汝不可以眼見我之法身。何故。法身無色相。云何見得。眾生妙性。亦復如是不可以見之。又言以音聲求我者。佛之法身。還可耳音而聞。若以耳聞者。亦非法身。如眾生自性。還可以耳聞。若以耳聞者。即非佛性。所以佛言若以見聞我法身者。是人行邪道。不能見如來。如來法身者。非色非聲無形無狀。不可以心思。不可以識識。在凡不少。至聖不增。看時不見。悟則全彰。
【王日休曰】我謂真我。乃性佛也。此如來亦謂真性之佛。若以色見我。以音聲求我。是人行邪道者。謂真性佛。無形無相。故不可以形色見。亦不可以音聲求。若以形色見。以音聲求。是人所行者乃邪道也。真性乃正。故非邪也。形色音聲。則為邪耳。故以形色音聲求佛。則是所行者邪道。豈可以見正覺常住之真性佛哉。故曰不能見如來。如來。即所謂真我。即所謂性佛也。
【僧若訥曰】言我者。此是法身真常淨我。隨流布而說。若以色見聲求。心遊理外。皆名邪見。不能見法身。
【肇法師云】所謂諸相煥目而非形。八音盈耳而非聲。應化非真佛。亦非說法者。法軆清淨。猶若虛空。無有染礙。不落一切塵境。今且略舉聲色。
【陳雄曰】我者。我之性也。法身如來。即我性是。視之不見。以色相取不可也。聽之不聞。以音聲求不可也。華嚴經云。色身非是佛。音聲亦復然。又云。不了彼真性。是人不見佛。惟內觀反照。即性而修。則如來得之於方寸之間矣。
【顏丙曰】轉輪聖王。外貌端嚴。具足三十二相。然不明佛性。但享頑福。有時而盡。佛言若以三十二相觀如來者。轉輪聖王即是如來。須菩提後聞佛語。方始稱如我解佛義。不應以三十二相觀如來。所以世尊。為說偈言。若以色見我。以音聲求我。我者有我相也。不得大自在。欲以形色言音而求見我相者。是人乃行邪道。即非正見。不能見如來者。不能得見此如如之性也。
【傅大士頌曰】涅槃含四德。唯我契真常(楞嚴四卷。非大涅槃。非常。非樂。非我。非淨。註云。非所證法。涅槃四德是也。涅槃是緫。四德是別)。齊名八自在。獨我最靈長(懺法云。身常覺諸佛涅槃。八自在觸)非色非聲相。心識豈能量。看時不可見。悟理即形彰。
【川禪師曰】直饒不作聲求色見。亦未見如來在。且道如何得見。不審不審。頌曰。見色聞聲世本常。一重雪上一重霜。君今要見黃頭老(黃頭老。乃釋迦佛也)。走入摩耶(摩耶夫人。乃釋迦佛母)腹內藏。噫。此語三十年後。擲地金聲在。
^ck27【無斷無滅】
^r27:1須菩提。汝若作是念。如來不以具足相故。得阿耨多羅三藐三菩提。^r27:2須菩提。莫作是念。^r27:3如來不以具足相故。得阿耨多羅三藐三菩提。須菩提。汝若作是念。發阿耨多羅三藐三菩提心者。說諸法斷滅。莫作是念。^r27:5何以故。發阿耨多羅三藐三菩提心者。於法不說斷滅相。
此一分經。緫是四章。原佛之意。初則反其辭而語須菩提曰。汝若作是念。如來以具足相故。得阿耨多羅三藐三菩提。次則正其辭而謂之曰。莫作是念。如來不以具足相故。得阿耨多羅三藐三菩提。如下文亦然。初則反其辭而語須菩提曰。汝若作是念。發阿耨多羅三藐三菩提心者。說諸法斷滅相。次則正其辭而謂之曰。莫作是念。發阿耨多羅三藐三菩提心者。於法不說斷滅相。世本第一章多誤作如來不以具足相故。新州印六祖註本。南浦陳氏施本。第一章並無不字。於理為當。王虛中註本。武夷張公綽施本。並作如來可以具足相故其理亦通(壽州石本皆有不字。經義尤明)。
【王日休曰】諸法斷滅者。謂一切法皆斷之滅之而不用也。相。謂凡法之相也。佛經所謂相者。凡有者皆謂之相。故晝明則謂之明相。夜暗則謂之暗相。經所說之法則謂之法相。非佛經所說之法則謂之非法相。所以於此言不用法而斷滅之者。則謂之斷滅相也。且法者。固不可以泥。然亦豈可以斷滅之哉。譬如渡水。既渡之後。固不須舟楫。未渡之前。豈可無舟楫耶。是故既悟之後。不須佛法。未悟之前。不可以無佛法。所以發求無上正等正覺真性之心者。必須依佛法修行。不可遂斷滅佛法。而謂不用法。
故云汝若作是念發求無上正等正覺真性心者。說諸法斷滅相。不可作是念也。何故不可作是念乎。以發求真性心者。必依佛法以修行。故於法不可斷滅也。
【顏丙曰】此一卷經。雖然只說無之一字。佛又恐人執著。此無。一向沉空滯寂。弃有著無。反成斷滅相。何異證道歌云。弃有著空病亦然。還如避溺而投火。故此一分。專戒人不可斷滅。令人或已悟。或未悟。便以無為極則。誤汝去在。昔張拙秀才參西堂藏禪師。問山河大地。三世諸佛。是有是無。藏荅云。有。拙云錯。藏云先軰曾參見什麼人來。拙云。參見徑山來。某甲問徑山。皆言無。藏云。待先輩得似徑山時。一切皆無即得。大凡未見性人。如何便說一切皆無。所以佛告須菩提。汝莫作是念。如來不以具足相故。得阿耨多羅三藐三菩提。汝若果作是念發心。即是說諸法斷滅相。何故。凡發無上正等正覺心。不可說斷滅相。
【智者禪師頌曰】相相非有相。具足相無憑。法法生妙法。空空軆不同。斷滅不斷滅。知覺悟深宗。若無人我念。方知是至公。
【李文會曰】如來不以具足相故者。佛恐須菩提落斷滅見。是故令離兩邊。然性含萬法。不自具足。應用徧知。一即一切。一切即一。去來自由。無所罣礙。此法上至諸佛。下至含識。本無欠少。是名具足相也。說諸法斷滅莫作是念者。諸法性空。空即是常。是故不斷不滅。若作念云無相而有道心者。是斷一切行。滅一切法。此乖中道也。又云。若作有相觀。即是一邊見。若作無相觀。亦是一邊見。若不作有無觀。即是斷滅法。故知真如法性。不是有不是無。湛然不動。觀與不觀。皆是生滅。故云莫作是念也。於法不說斷滅相者。見性之人。自當窮究此理。若人空心靜坐。百無所思以為究竟。即著空相。斷滅諸法。
【晁大傅云】諸佛說空法。為治於有故。若復著於空。諸佛所不化。故云。大士軆空而進德。凡夫說空而退善。當知有為是無為之軆。無為是有為之用也。
【川禪師云】翦不齊兮理還亂。拽起頭來割不斷。頌曰。不知誰解巧安排。捏聚依前又放開。莫謂如來成斷滅。一聲還續一聲來。
^lb^ck28【不受不貪】
^r28:1 須菩提。若菩薩以滿恒河沙等世界七寶。持用布施。^r28:2若復有人知一切法無我。得成於忍。此菩薩勝前菩薩所得功德
【六祖曰】通達一切法。無能所心。是名為忍。此人所得福德勝前七寶之福。
【李文會曰】知一切法無我者。一切萬法本來不生。本來無我相。所得功德。即非七寶布施等福所能比也。得成於忍者。既知人法無我。則二執不生。成無生忍。此乃勝前七寶布施菩薩。夫萬法本來無性。皆因自己之所顯發。且如眼對色謂之見。耳對聲謂之聞。見聞是根。色聲是塵。色聲未對之時。我性常見常聞。未曾暫滅。色聲相對之時。我性未曾暫生。
此是菩薩了悟真性。活潑潑地。洞然同於太虛。所以不曾生滅。凡夫即被妄心所覆。隨六塵轉。即有生滅。故塵起即心起。塵滅即心滅。不知所起滅心皆是妄念也。若見六塵起滅不生。即是菩提。
【川禪師云】耳聽如聾。口說如瘂。頌曰。馬下人因馬上君。有高有下有踈親。一朝馬死人歸去。親者如同陌路人。只是舊時人。改却舊時行履處。
^r28:3何以故。須菩提。以諸菩薩不受福德故
【王日休曰】以諸菩薩不受福德故者。謂菩薩濟度眾生。無非得福。然菩薩不享世間富貴。但積福於虛空而已。故曰不受福德。積於虛空愈久而不已。直至於成佛。故成佛得其福德如天地廣大。所以佛稱兩足尊者。謂福與慧兩者皆足也。
^r28:4須菩提白佛言。世尊。云何菩薩不受福德。^r28:5須菩提。菩薩所作福德。不應貪著。是故說不受福德
【王日休曰】菩薩所作福德不應貪著者。謂菩薩本不為作福德而度眾生。其福德自然隨之。如人行日中。本不為日影而日影自然隨之。若為作福德而度眾生。則是貪著其福德而欲享受也。為其非貪著而享受。是故說不受福德。其言是故者。盖為不貪之故。所以言不受也。
【李文會曰】不貪世間福德果報謂之不受。又云。菩薩所作福德不為自己。止欲利益一切眾生。此是無所住心。即無貪著故云不受福德。
【智者禪師頌曰】布施有為相三生却被吞(證道歌曰。住相布施生天福。猶如仰箭射虛空。勢力盡。箭還墜。招得來生不如意。註云古德云。人天福報為三生冤人罕知之。良由世人因其福力。不明其本。就上增添以此世福恣情娛樂。臨命終時。福盡業在。反墮惡道。受種種苦。故云招得來生不如意也。
此頌言布施有為相。三生却被吞者。其說亦同。三生者。今生後生。再後生是也)七寶多行慧。那知捨六根。但離諸有欲。旋棄愛情恩(六根。乃眼。耳。鼻。舌。身。意。但能離諸有欲。施即棄捨愛情之恩。旋。疾也。旋旬緣切)若得無貪相。應到法王門。
【川禪師曰】裙無腰。袴無口。頌曰。似水如雲一夢身。不知此外更何親。箇中不許容他物。分付黃梅路上人(蘄州黃梅縣東。五祖弘忍大師。傳法與六祖慧能)。
^ck29【威儀寂靜】
^r29:1須菩提。若有人言如來若來。若去。若坐。若臥。是人不解我所說義
【疏鈔云】佛言。若有人言如來有來有去有坐有臥。即不解佛意也。何故。只如眾生妙性。還有來去坐臥否。眾生亦如是。如來亦如是。行住坐臥四威儀中。常住寂滅。若有動者。即云不解所說義。
^r29:2何以故。如來者。無所從來。亦無所去。故名如來
【疏鈔云】如來者。來而無來。去而不去。住而不住。非動非靜。上合諸佛下等群生。一性平等。故號如來。
【王日休曰】此分三言如來。皆謂真性佛也。若有人言如來若來若去。若坐若臥。是人不解我所說義者。真佛無相。故不可以若來若去若坐若臥形容之。若可以形容者。則是有相。故此人不曉解我所說義也。何以故者佛又自問何故不解我所說義乎。乃自答云。我所謂如來者。謂真佛也。真佛既無形相。又徧虛空世界。豈有去來哉。
故云無所從來。亦無所去。其言故名如來者。謂真性自如而無所不可。凡其所現。乃隨眾生業緣而來現。其實則徧虛空世界而未嘗有去來。此所以名之曰如來而已。而其言如來者。亦強為之名耳。真性不可以形容故也。詳見苐二分與此後分。
【陳雄曰】如來現千百億化身。演真空無相法。如鏡中像。無生滅義。故人不知其何所從來。亦不知其何所從去。華嚴經云。上覺無來處。去亦無所從。清淨妙色身。神力故顯現。三昧經云。亦無來相。及以去相。不可思議。六祖云。諸法空寂。是如來清淨坐。無住云。身心寂滅。是如來臥處。然則來去坐臥。又孰得而輕議哉。
今有人焉。輙言如來具四威儀。所見謬甚。夫何了得如來所說真空義趣。圓覺經著真空之說曰。雲駛(音史疾也)月運。舟行岸移。盖謂月未嘗運。岸未嘗移。真如軆性。未嘗作止任滅。皆人謬見耳。
【顏丙曰】行住坐臥。謂之四威儀。見性能行持人。所謂行住坐臥。常若虛空。若人言如來尚属來去坐臥。是人不解會所說義理。何故。如來者。如如本性也。本無動靜。所以無去無來。故假名如來。昔肅宗皇帝。詔國一禪師入內道塲。師見帝起身。帝曰。禪師何必見寡人起身。曰。檀越何得以四威儀中見貧道。如此步步行持。謂之寂靜。
【智者禪師頌曰】如來何所來。修因幾劫功。斷除人我見。方用達真宗。見相不求相。身空法亦空。往來無所著。來去盡皆通。
【李文會曰】來無所從。去無所至。來去皆如。其誰來去。又云。無所從來者。不生。亦無所去者。不滅。不生者謂煩惱不生。不滅者謂覺悟不滅也。又云。知色聲起時。即知從何而來。知色聲滅時。即知從何而去。故色聲香味觸。法自有起滅。我心湛然。豈有來去生滅相耶。寂而常照。照而常寂。行住坐臥四威儀中無不清淨也。
【川禪師云】山門頭合掌。佛殿裏燒香。頌曰。衲捲秋雲去復來。幾回南嶽與天台。寒山拾得相逢笑。且道笑箇什麼。笑道同行步不擡。
^ck30【一合理相】
^r30:1須菩提。若善男子。善女人。以三千大千世界碎為微塵。於意云何。是微塵眾。寧為多不。^r30:2須菩提言。甚多。世尊。^r30:3何以故。若是微塵眾實有者。佛即不說是微塵眾。^r30:4所以者何。佛說微塵眾。即非微塵眾。是名微塵眾。^r30:5世尊。如來所說三千大千世界。即非世界。是名世界
【王日休曰】微塵眾。盖謂微塵如此之多也。須菩提既答佛言甚多。又呼世尊而自問云。何以故者。謂彼微塵眾。何故甚多乎。又自答云。若是微塵眾實有者。佛即不說是微塵眾。盖謂真性為實有。則不可說。而此微塵眾非實有。故佛說之。是其可說。皆為虛妄。唯真性為真實。故不可說。
所以佛嘗言不可說不可取者。盖謂此也。所以者何。乃須菩提自問云。所以微塵眾。若為實有。佛即不說是微塵眾何也。又自答云。佛說微塵眾。即非微塵眾。是名微塵眾者。謂佛所說為微塵眾。即非有真實微塵眾。乃虛名為微塵眾而已。須菩提又呼世尊而言。如來所說三千大千世界。即非世界。是名世界者。謂世界亦非為真實。
但虛名為世界而已。詳見十三分解。以佛嘗言之。故此稱如來說也。
【李文會曰】微塵者。妄念也。世界者。身之別名也。微塵是因。世界是果。微塵世界者。謂因果也。然自己真性。非因非果。能與六道眾生為因果也。謂自性是因六道是果。故知微塵起於世界。輪廻由於一念。雖見小善不可執著。雖逢小惡。必須除去。且眾生於妄念中起貪瞋癡業。妄受三界夢幻之果。
如彼微塵積成世界。不知因果元是妄心。自作自受。一念悟來。即無微塵。世界何有。故云即非微塵是名微塵。即非世界是名世界。
若欲建立世界。一任微塵熾然。若欲除滅世界。覺悟人法俱空。了無一法可得。湛然清淨。不被諸境所轉。皆由於自己也。
【僧了性曰】此分。佛恐末劫人。重重執著因果。不相離捨。故重囑須菩提。人人身中。有微細善惡雜念。猶如大千世界微塵之多。此念無非影響虛妄建立。故云非微塵眾。亦因轉却無明煩惱之心。變作慈悲無礙之智。方入空寂智解。得大安樂。是名微塵眾。
【傅大士云】欲證無生忍。要假離貪瞋。人法知無我。逍遙出六塵。
【川禪師云】若不入水。爭見長人。頌曰。一塵纔起翳摩空。碎抹三千數莫窮。野老不能收拾得。任教隨雨又隨風。
^r30:6何以故。若世界實有者。即是一合相
【王日休曰】何以故者。須菩提自問。何故世界非真實乎。乃自答云。若世界實有者。即是一合相。一合相。謂真性也。真性徧虛空世界。又無形相。故一而不可分之以為二。合而不可析之以為離。非有相也強名曰相耳。若以世界為實有。則是真性耳。盖真性方為實有。何則。自無始以來。常存而無變壞。自然而非假合。一切虛幻者皆非真性之本。豈非實有乎。而世界烏可以比之哉。以世界亦是假合。劫數盡時。亦有變壞。此所以為虛幻。而不可以為實有。故不可以比真性也。
【李文會曰】微塵謂因。世界謂果。若執因果為實有者。即被相之所縛。故云即是一合相。
【金海光如來曰】世界者。如來自說盧舍那佛住持三千大千世界。身上化生菩提之樹。號蓮花藏世界。不說窒礙世界也。一合相者。一切眾生身中佛性。與盧舍那法身是一合相也。頌曰。如來自說蓮花藏。負荷(下可切)三千擐(胡貫切穿也)大千。菩薩了空歸一合。凡夫貪著被魔纏。
^r30:7如來說一合相。即非一合相。是名一合相
【王日休曰】如來說一合相者。須菩提謂佛嘗說真性為一合相也。即非一合相者。謂真性如虛空。然非實有物。如一之而不可二。合之而不可離者也。是名一合相者。謂但強名為一合相而已。凡言即非。皆謂實無也。凡言是名。皆謂虛名也。
【李文會曰】但莫執為實有。亦莫執為實無。於相離相。故云即非一合相。是名一合相也。
^r30:8須菩提。一合相者。即是不可說
【王日休曰】佛唯曾說真性為一合相。故須菩提於此以為實有。佛乃又呼須菩提而言一合相者則是不可說。以真性不可言說。但強名為一合相耳。
【李文會曰】即是不可說者。須是學人自省自悟。於理事上各無罣礙。今凡夫一向貪著事相。不達於理。所以說因果著因果。說世界著世界也。
^r30:9但凡夫之人。貪著其事
【王日休曰】佛謂凡夫之人。不知明悟真性。乃貪著真性中所現之事耳。謂色身六根也。凡夫者。泥此色身與六根為我。故沉淪六道。無由脫離。此所以為凡夫也。
【華嚴經云】離諸和合相。是名無上覺。佛以覺言。外覺離一切有相。內覺離一切空相。於相而離相。於空而離空。得夫真空無相之妙。所以名其為佛。
【六祖曰】一合相者。眼見色愛色。即與色合。耳聞聲愛聲。即與聲合。至於六塵若散。即是真世界。合即是凡夫。散即非凡夫。凡夫之人。於一切法皆合相。若菩薩。於一切法皆不合而散。何以故。合即繫縛起生滅。散即解脫。亦不生。亦不滅。若有繫縛生滅者。即是凡夫。所以經云。但凡夫之人。貪著其事。
【顏丙曰】微塵雖多。未足為多。世界幻成。終無實義。若說實有微塵。實有世界。即是彼此著相。彼既是相。我又著相。兩相相合。謂一合相。所謂一合相。即是不可說。但凡夫未悟。妄生貪著。
【圜悟禪師云】你但上不見有諸佛。下不見有眾生。外不見有山河大地。內不見有見聞覺知。好惡長短。打成一片。一一拈出。更無異見。
【傅大士云】界塵何一異。報應亦同然。非因亦非果。誰後復誰先。事中通一合。理則兩俱捐。欲達無生路。應當識本源。
【逍遙翁云】學道之人。但只了悟靈明之心。是謂本源所有。念念妄想。皆為塵垢。勿令染著。久當證知清淨法身也。
【川禪師云】捏聚放開。兵隨印轉。頌曰。渾圇成兩片。擘破却團圓。細嚼莫咬碎。方知滋味全。
^ck31【知見不生】
^r31:1須菩提。若人言佛說我見。人見。眾生見。壽者見。須菩提。於意云何。是人解我所說義不。不也。^r31:2世尊。是人不解如來所說義。^r31:3何以故。世尊說我見。人見。眾生見。壽者見。即非我見。人見。眾生見。壽者見。是名我見。人見。眾生見。壽者見
【通王如來解曰】佛言此四句等之相。只見其性。不見其相。疊前三遍再說者。是佛分別棄身見性之義也。頌曰。佛說我見眾生見。為觀其性不觀身。破相取空歸寂滅。脫除枷鎻出迷津。
【王日休曰】我見者。謂其見識以為實有我也。人見眾生見壽者見者。謂其見識以為實有人有眾生有壽者也。此言無此四者之見識。謂真性中皆無此也。以此四見。非為真實。故云即非我見人見眾生見壽者見。但為虛名而已。故云是名我見人見眾生見壽者見。謂此見。非真性中所有。亦為虛妄故也。
【李文會曰】佛說般若金剛之法。始即令諸學人先除麄重四相。如大乘正宗分中說也。次即令見自性之後。復除微細四相。如究竟無我分中說也。此二分中。即皆顯出理中清淨四相。若於自心無求無得。湛然常住。是清淨我見。
【黃蘖禪師云】百種多知。不如無求最苐一也。道人是無事人。實無許多般。心無事亦無。又云。諸學道人。若欲得成佛。一切佛法。緫不用學。但學無求無著。無求即心不生。無著即心不滅。不生不滅。便是佛也。若見自性本自具足。是清淨人見。於自心中本無煩惱可斷。是清淨眾生見。自性無變無異。無生無滅。是清淨壽者見。故云即非我人眾生壽者見。是名我人眾生壽者見也。
^r31:4須菩提。發阿耨多羅三藐三菩提心者。於一切法。應如是知。如是見。如是信解。不生法相。^r31:5須菩提。所言法相者。如來說即非法相。是名法相
【顏丙曰】如是二字。可謂親切。若發無上正等正覺心者。於一切法。應當如此知。如此見。如此信解。不必外求法相。然初入道時。不假法相。故無入頭處。既見性了。亦當遠離。不必執著。所謂得魚忘却筌。到岸不須船之說。所以末後為汝剗却云。即非法相。假名法相。
【智者禪師頌曰】非到真如理。棄我入無為。眾生及壽者。悟見緫皆非。若悟菩提道。彼岸更求離。法相與非相。了應如是知。
【李文會曰】發阿耨多羅三藐三菩提心者。應知一切眾生。皆有佛性。應見一切眾生。無漏智慧。本自具足。應信一切眾生。靈源真性。無生無滅。若能了悟此意。即是一切智慧。不作有能所心。不存智解相。口說無相法。心悟無相理。常行無相行。故云不生法相是名法相也。
【川禪師云】飯來開口。睡來合眼。頌曰千尺絲綸直下垂。一波纔動萬波隨。夜靜水寒魚不食。滿船空載月明歸。
^ck32【應化非真】
^r32:1 須菩提。若有人以滿無量阿僧祇世界七寶。持用布施。^r32:2若有善男子。善女人。發菩提心者。持於此經。乃至四句偈等。受持讀誦。為人演說。其福勝彼
【法常滿如來解曰】緣此經根本。以破相為宗。了空為義。迷性布施。皆不證真。能識四句涅槃之門。演說法身如如不動。觀有為法。同於夢幻。若作此見教化眾生。勝彼所用七寶布施之福也。頌曰。此經破相依空寂。勸持四句最為尊。佛斷有為六種錯。齊心歸信涅槃門。
【王日休曰】無量。在西土亦為數名。梵語阿僧祇。此云無央數。亦為數名。此二者之為數。但積數至多。然後至此。此言無量無央數者。謂無量之無央數。盖自一無央數。至十無央數。以至百千萬億無央數。然後積而至於無量無央數也。
由是言之。則所謂無量阿僧祇世界者。不止如恒河沙數世界而已。發菩提心者。謂發廣大濟度眾生之心也。是以前言恒河沙等世界七寶。
此則言無量阿僧祇世界七寶。是尚以彼為少。而此則極言其多者也。以是布施。尚不及受持演說此經得福為多者。以彼則世間福。終有時而盡。况因受福而又作惡乎。此則出世間之福。故其福則無時而盡。第有增長。終無受福作惡之理。此所以勝於彼無量無數也。
【李文會曰】發菩提心者。謂大乘最上乘種性人也。
【老子云】不見可欲。使心不亂。此小乘之力。若見可欲而心亦不亂。此大乘之力也。
【踈山如禪師云】一波纔動萬波隨。汩沒塵寰幾箇知。突兀須弥橫宇宙。縱橫妙用更由誰。持於此經四句偈等受持讀誦者。七寶有竭。四句無窮。悟達本心。了無所得。持於此經。其福勝前七寶布施之功德也。
^r32:3云何為人演說
【李文會曰】云何為人演說者。四大色身不解說法聽法。是你靣前孤明歷歷。通徹十方底。解說解聽。莫要記他語言。縱饒說得天花亂墜。其心不曾增。便緫不說。其心不曾減。求著轉遠。學著轉踈。惟在默契悟者自知也。
【川禪師云】要說有甚難。只今便請諦聽諦聽。頌曰。行處坐臥。是非人我。勿喜勿瞋。不離這箇。只這箇劈靣唾。平生肝膽一時傾。四句妙門都說破。
^r32:4 不取於相。如如不動
【王日休曰】佛自問云。如何為人演說。乃自答云。不取於相。如如不動者。盖謂真性。不取於形相。謂無形相也。惟如如不動耳。如如不動者。如者。自如之謂。如如則自如之甚也。真性中。欲現而為天人。則為天人。欲見而為異類。則為異類。譬如鏡中現影。無所不可。是自如之甚也。
而徧虛空世界常住而未嘗動。故曰不動。佛鑑和尚示眾。舉僧問法眼。不取於相如如不動。如何不取於相。見於不動去。法眼云。日出東方夜落西。其僧有省。若也於此見得。方知道旋風偃岳。本來常靜。江河競注。元自不流。如或未然。不免更為饒舌。天左旋。地右轉。古往今來經幾徧。金烏飛。玉兔走。纔方出海門。又落青山後。江河波渺渺。淮濟浪悠悠。直入滄溟晝夜流。遂高聲云。諸禪德。還見如如不動麼。
【李文會曰】此謂悟達無心無相。可取之人。若是有心不取於相。却是取相。心本是空。相亦是空。人法俱空。有何可取也。
【真淨文禪師云】但無一切心。自然合天道。應用在臨時。莫言妙不妙。如如不動者。學人若謂我知也。學得也。契悟也。解脫也。似此見解。皆是有動心。即是有生滅。若無此心。即一切法皆攝不動。不動即內外皆如。故云如如不動也。
【川禪師云】末後一句。始到牢關。直得三世諸佛。兩目相觀。六代祖師。退身有分。可謂是江河徹凍。水泄不通。極目荊榛。難為措足。到這裹添一絲毫。如眼中著刺。减一絲毫。似肉上剜瘡。非為生斷要津。盖為識法者恐。雖然恁麼。佛法只如此。便見陸地平沉。豈有燈燈續焰。川上座今日不免向猛虎口中奪食。獰龍頷下爭珠。豁開先聖妙門。後學進身有路。放開一線。又且何妨。
語則全彰法軆。默則獨露真常。動則隻鶴片雲。靜則安山列嶽。舉一步如象王廻顧。退一步若獅子嚬呻。法王法令當行。便能於法自在。
秖如末後一句。又作麼生道。還委悉麼。雲在嶺頭閑不徹。水流澗下太忙生頌曰。得優游處且優游。雲自高飛水自流。秖見黑風翻大浪。未聞沉却釣魚舟。
^r32:5何以故？一切有為法　如夢幻泡影　如露亦如電　應作如是觀
【王日休曰】何以故者。佛自問何故為人演說。不取於相。如如不動也。佛乃自答云。一切有為法。如夢幻泡影。如露亦如電。應作如是觀者。謂有為法。則有相而動。故如此六者。真性則無相而不動。故異於六者也。所謂法者。謂凡有所為者皆是也。上自天地造化。下至人之所為。皆有為法也。然此稱六如以設教化。則止謂人事耳。佛以無形相而無所為者為真性。故以有形相而一切有為者為偽妄。其言如夢者。謂當時認以為有。覺則悟其為無也。
如幻者。謂有為法非真實。如幻人以草木。化作車馬倉庫之類也。如泡者。謂外像雖有。其中實無。如影者。謂光射則有。光滅則無也。如露者。謂不牢也。如電者。謂不久也。此有為法。應如是以觀看。則悟其為空。乃知真性方為真實。不可以不明悟也。
經多言四句偈者。以前四句。則言真佛之無形相。此則言有為法之不為真實。此不問其是偈非偈。若於二者之中一有所悟。則非淺淺矣。佛所以言四句偈等者。謂不必專於偈。凡可以演說者皆是。况此為言之要者乎。
【僧若訥曰】言一切有為法者。謂眾生界內遷流造作。皆是虛妄。終有敗壞。如夢幻等。畢竟不實。當作如是觀。豈為生死流動耶。
【陳雄曰】佛所謂一切法者。真空無相法也。故一切賢聖皆以無為法曰有為法。則夢幻泡影露電之如。不其妄乎。惟了真空無相者。能作是觀。以悟六如之妄。則必離六如以證如如不動之理。
優波離尊者語阿難曰。諸有為法。並是無常。想夫觀六如而得是句。
【顏丙曰】四句偈者。乃此經之眼目。雖經八百手註解。未聞有指示下落處。人多不悟自己分上四句。却區區向紙上尋覔。縱饒尋得。亦只是死句。非活句也。
活句者。直下便是。然雖如此。也須親見始得。佛眼云。千說萬說。不如親見一靣。縱不說亦自分明。要須返己自參切不可騎牛覔牛也。
若人將七寶無量布施。不如發菩提心。受持自己四句。為人開演解說。使一切眾生。皆得見性成佛。其福勝彼。
云何為人演說。不取著於相。如如不動。湛若太虛。
何以故。盖世間一切有為之法。如夢寐之非真。如燈幻之眩惑。如水泡之暫時。如人影之易滅。如朝露之易消。如閃電之倏忽。應作如是觀者。應立如此見性之法。
【僧微師曰】如夢幻泡影。如露。亦如電。令行人了萬法。如夜夢睡時似有。覺了全無。萬法迷無似有。悟得全無。故觀如夢。
淨名云。是身如夢。為虛妄見。
幻者。幻術也。結巾成兔結草為馬。本無實軆。萬法緣生妄有。本無自軆故如幻。
淨名云。是身如幻。從顛倒起。
泡者。風擊水成泡。豈能久住。觀萬法似浮漚不實。
淨名云。是身如泡。不得久立。
影者。水中月影。光射物影。全軆虛假亦然故如影。
淨名云。是身如影。從業緣現。
露者。晨朝濕露也。暫有即無。觀萬法亦然。
電者閃電也。忽有忽無。念念無常。觀萬法亦如電光。剎那生滅故如電。
淨名云。是身如電。念念不住(維摩詰經註云。維摩詰。秦言淨名)。
【李文會曰】一切有為法者。生老病死。貧富貴賤。士農工商。赤白青黃。馨香臭穢。有無虛實。深淺高低。皆是妄心起滅有為之法也。如夢幻泡影。如露亦如電者。一切有為之法即是。世間萬事皆如夢幻泡影。不得久長。
夢者。妄想也。幻者。幻化也。泡者。如水上之泡。易生易滅也。
影者。如身之影。無所捉撮也。露者。霧露之露。不得久停也。
電者。雷電之電。頃刻之光也。
【傅大士頌曰】如星翳燈幻。皆為喻無常(王曰。如星者。謂暗時則現。明時則無。喻眾生愚暗。故有此有為法。若明悟則無也。
如翳者。謂眾生自有光明於內。乃為有為法所蔽。如眵翳障目之光明也。如燈者。謂暗時則用。明時則不用。喻眾生愚暗。故用有為法。明悟則不用也。幻法在前)漏識修因果。
誰言得久長。危脆同泡露。如雲影電光(王曰。如雲影者。謂聚散不常也。電注在前)饒經八萬劫。終是落空亡(楞嚴經云。有十種仙。皆於人中煉心。不修正覺。別得生理。壽千萬歲。妄想流轉。不修三昧。報盡還來。散入諸趣。
學者觀此十仙之始末。則傳頌所謂饒經八萬劫。終是落空亡者。亦可默俞矣)應作如是觀者。有為無為皆由自己。心常空寂。湛然清淨。無纖毫停留罣礙。自然無心。如如不動。應作如是觀也。
【僧問雲門大師云】如何是佛。門云乾屎橛。太平古禪師為作頌曰。我佛如來乾屎橛。隨機平等徧塵寰。迷頭認影區區者。目對慈顏似等閑。
【蟾首坐問洞山云】佛真法身。猶若虛空。應物現形。如水中月。作麼生是應底道理。洞云。如驢覷井。蟾云。恁麼則正是迷頭認影。洞云。首坐又作麼生。蟾云。何不道似井覷驢也。還會麼。若教有意千般境。纔覺無心萬事休。
【川禪師云】行船盡在把梢人。頌曰。水中捉月。鏡裏尋頭。刻舟求劒。騎牛覔牛。空華陽燄。夢幻浮漚。一筆勾斷。要休便休。巴歌社酒村田樂。不風流處也風流。
^r32:6佛說是經已。長老須菩提。及諸比丘。比丘尼。優婆塞。優婆夷。一切世間天人阿修羅。聞佛所說。皆大歡喜。信受奉行
【顏丙曰】僧謂之比丘。師姑謂之比丘尼。居士謂之優婆塞。道姑謂之優婆夷。一切世間之人。及天上之人。阿修羅神。乃六道中之三道也。聞佛所說此經。皆生大歡喜心。信而承受。尊奉行持佛教。
【李文會曰】夫至理無言。真空無相。謂都寂默也。但不著言說。不著知解。即是無言無相。金剛經之旨趣。本謂此也。是以旋立旋破。止要諸人乃至無有少法可得。即不被一切諸境所惑。若得心地休歇。即謂之清淨心。亦謂之本來心。亦謂之到彼岸。亦謂之涅槃。亦謂之解脫其實一也。
【四祖問三祖云】如何是古佛心。祖云。汝今是什麼心。四祖云。我今無心。三祖云。汝既無心。諸佛豈有耶。即於言下省悟。此是學人標致。
【法華經云】資生業等。皆順正法。
【張無盡云】傅大士。龐居士。豈無妻子哉。若也身處塵勞。心常清淨。便能轉識為智。猶如握土成金。一切煩惱皆是菩提。一切世法。皆是佛法。若能如是。即為在家菩薩。了事凡夫豈不韙歟。
上根之人。一聞千悟。得大緫持。又何假如許開示耶論語所謂學而時習之。不亦悅乎。
【法華經云】其不習學者。不能曉了此。
【逍遙翁曰】人天路上。以福為先。生死海中。修道為急。若欲快樂人天而不植福。出離生死而不明道。是猶鳥無翼而欲飛。木無根而欲茂。奚可得哉。
又云。夫英雄之士。圖王不成。猶得為霸。馳騁之人。逐鹿不成。尚能得兔。學大乘者。設使未成。猶勝人天之福。
【古德頌曰】歷劫相隨心作身。幾回出沒幾因循。此身不向今生度。更向何時度此身。幸冀勉旃。莫教當靣蹉過。
【川禪師云】三十年後。莫教忘却老僧。不知誰是知恩者。呵呵。將謂無人。
頌曰。飢得食。渴得漿。病得差。熱得涼。貧人遇寶。嬰子見娘。飄舟到岸。孤客還鄉。旱逢甘雨。國有忠良。四夷拱手。八表來降。頭頭總是。物物全彰。古今凡聖。地獄天堂。東西南北。不用思量。剎塵沙界諸群品。盡入金剛大道塲。
^r32:7
^pb1^ak#amtb^folio#amtb<lines=6>【阿彌陀經】^bk#amtb〔佛說阿彌陀經〕^lb^au〔　　　姚秦龜茲三藏　鳩摩羅什　譯〕
^lb^ck1【序分】
^lb如是我聞：
一時，佛在舍衛國祇樹給孤獨園，
^lb與大比丘僧千二百五十人俱，皆是大阿羅^lb漢，眾所知識。
長老舍利弗、摩訶目乾連、摩訶^lb迦葉、摩訶迦栴延、摩訶拘絺羅、離婆多、周梨^pb2槃陀迦、難陀、阿難陀、羅睺羅、憍梵波提、賓頭^lb盧頗羅墮、迦留陀夷、摩訶劫賓那、薄俱羅、阿^lb㝹樓馱，
如是等諸大弟子，并諸菩薩摩訶薩——
^lb文殊師利法王子、阿逸多菩薩、乾陀訶提菩^lb薩、常精進菩薩——
與如是等諸大菩薩，
及釋提^lb桓因等
無量諸天大眾俱。
^pb3^ck2【極樂世界】
爾時，佛告長老舍利弗：
「從是西方過十萬億^lb佛土，有世界名曰極樂。
其土有佛，號阿彌陀，^lb今現在說法。
舍利弗！彼土何故名為極樂？
其^lb國眾生無有眾苦，但受諸樂，故名極樂。
^lb^ck3【四寶七重】
又舍利弗！極樂國土，七重欄楯、七重羅網、七^lb重行樹，皆是四寶周匝圍繞，

是故彼國名曰^pb4極樂。
^lb^ck4【寶池蓮花】
「又舍利弗！極樂國土有七寶池，

八功德水充^lb滿其中，池底純以金沙布地。


四邊階道，
金、銀、^lb琉璃、頗梨合成；
上有樓閣，
亦以金、銀、琉璃、玻^lb梨、車磲、赤珠、碼碯而嚴飾之。
池中蓮花，大如^lb車輪，青色青光，
黃色黃光，
赤色赤光，
白色白^pb5光，
微妙香潔。
舍利弗！極樂國土成就如是功^lb德莊嚴。
^lb^ck5【天雨曼華】
「又舍利弗！彼佛國土，常作天樂，黃金為地，




晝^lb夜六時，天雨曼陀羅華。
其國眾生，常以清旦，^lb各以衣裓盛眾妙華，供養他方十萬億佛；
即^lb以食時，還到本國，飯食經行。
舍利弗！極樂國^pb6土成就如是功德莊嚴。
^lb^ck6【鳥宣法音】
「復次舍利弗！彼國常有種種奇妙雜色之鳥——
^lb白鶴、孔雀、鸚鵡、舍利、迦陵頻伽、共命之鳥。
是^lb諸眾鳥，晝夜六時出和雅音，其音演暢五根、^lb五力、七菩提分、八聖道分如是等法。
其土眾^lb生聞是音已，皆悉念佛、念法、念僧。
舍利弗！汝^pb7勿謂此鳥實是罪報所生。
所以者何？彼佛國^lb土無三惡趣。
舍利弗！其佛國土尚無三惡道之^lb名，何況有實？
是諸眾鳥，皆是阿彌陀佛欲令^lb法音宣流，變化所作。

^ck7【寶樹羅網】
舍利弗！彼佛國土微風^lb吹動，諸寶行樹及寶羅網出微妙音，
譬如百^lb千種樂同時俱作，

聞是音者，皆自然生念佛、^pb8念法、念僧之心。
舍利弗！其佛國土成就如是^lb功德莊嚴。


^lb^ck8【無量光明】
「舍利弗！於汝意云何？彼佛何故號阿彌陀？
舍^lb利弗！彼佛光明無量，照十方國無所障礙，是^lb故號為阿彌陀。
^lb^ck9【無量壽命】
又舍利弗！
彼佛壽命及其人民，無量無邊阿^pb9僧祇劫，
故名阿彌陀。
舍利弗！阿彌陀佛成佛^lb已來，於今十劫。
^lb^ck10【無量弟子】



又舍利弗！彼佛有無量無邊聲聞弟子，皆阿^lb羅漢，非是算數之所能知；
諸菩薩，亦復如^lb是。
舍利弗！彼佛國土成就如是功德莊嚴。
^lb^ck11【一生補處】
「又舍利弗！極樂國土眾生生者，皆是阿鞞跋^pb10致。其中多有一生補處，
其數甚多，非是算數^lb所能知之，但可以無量無邊阿僧祇劫說。



^lb舍利弗！眾生聞者，應當發願，願生彼國。
所以^lb者何？得與如是諸上善人俱會一處。
^ck12【臨終七日】
「舍利弗！^lb不可以少善根福德因緣得生彼國。
舍利弗！^lb若有善男子、善女人，聞說阿彌陀佛，執持名^pb11號，若一日、若二日、若三日、若四日、若五日、若^lb六日、若七日，一心不亂。
其人臨命終時，阿彌^lb陀佛與諸聖眾，現在其前。
是人終時，心不顛^lb倒，即得往生阿彌陀佛極樂國土。
舍利弗！我^lb見是利，故說此言。
若有眾生聞是說者，應當^lb發願生彼國土。
^pb12^ck13【東方諸佛】
「舍利弗！如我今者，讚歎阿彌陀佛不可思議^lb功德；
東方亦有阿閦鞞佛、^lb須彌相佛、大須彌佛、須彌光佛、妙音佛，
如是等恒河沙數^lb諸佛，各於其國出廣長舌相，遍覆三千大千^lb世界，說誠實言：
『汝等眾生，當信是稱讚不可^lb思議功德一切諸佛所護念經。』
^pb13^ck14【南方諸佛】
「舍利弗！南方世界有日月燈佛、名聞光佛、大^lb焰肩佛、須彌燈佛、無量精進佛，
如是等恒河^lb沙數諸佛，各於其國出廣長舌相，遍覆三千^lb大千世界，說誠實言：
『汝等眾生，當信是稱讚^lb不可思議功德一切諸佛所護念經。』
^lb^ck15【西方諸佛】
「舍利弗！西方世界有無量壽佛、無量相佛、無^pb14量幢佛、大光佛、大明佛、寶相佛、淨光佛，
如是^lb等恒河沙數諸佛，各於其國出廣長舌相，遍^lb覆三千大千世界，說誠實言：
『汝等眾生，當信^lb是稱讚不可思議功德一切諸佛所護念經。』
^lb^ck16【北方諸佛】
「舍利弗！北方世界有焰肩佛、最勝音佛、難沮^lb佛、日生佛、網明佛，
如是等恒河沙數諸佛，各^pb15於其國出廣長舌相，遍覆三千大千世界，說^lb誠實言：
『汝等眾生，當信是稱讚不可思議功^lb德一切諸佛所護念經。』
^lb^ck17【下方諸佛】
「舍利弗！下方世界有師子佛、名聞佛、名光佛、^lb達摩佛、法幢佛、持法佛，
如是等恒河沙數諸^lb佛，各於其國出廣長舌相，遍覆三千大千世^pb16界，說誠實言：
『汝等眾生，當信是稱讚不可思^lb議功德一切諸佛所護念經。』
^lb^ck18【上方諸佛】
「舍利弗！上方世界有梵音佛、宿王佛、香上佛、^lb香光佛、大焰肩佛、雜色寶華嚴身佛、娑羅樹^lb王佛、寶華德佛、見一切義佛、如須彌山佛，
如^lb是等恒河沙數諸佛，各於其國出廣長舌相，^pb17遍覆三千大千世界，說誠實言：
『汝等眾生，當^lb信是稱讚不可思議功德一切諸佛所護念^lb經。』
^ck19【東南諸佛】



^ck20【西南諸佛】



^ck21【西北諸佛】



^ck22【東北諸佛】



^ck23【佛所護念】
「舍利弗！於汝意云何？何故名為『一切諸佛^lb所護念經』？
舍利弗！若有善男子、善女人，聞是^lb經受持者，及聞諸佛名者；
是諸善男子、善女^lb人，皆為一切諸佛共所護念，皆得不退轉於^pb18阿耨多羅三藐三菩提。
是故舍利弗！汝等皆^lb當信受我語及諸佛所說。
^lb^ck24【三願三生】
「舍利弗！若有人已發願、今發願、當發願，欲生^lb阿彌陀佛國者；
是諸人等，皆得不退轉於阿^lb耨多羅三藐三菩提，於彼國土若已生、若今^lb生、若當生。
是故舍利弗！諸善男子、善女人若^pb19有信者，應當發願生彼國土。
^lb^ck25【穢土成佛】
「舍利弗！如我今者，稱讚諸佛不可思議功德；^lb彼諸佛等，亦稱說我不可思議功德，而作是^lb言：
『釋迦牟尼佛能為甚難希有之事，
能於娑^lb婆國土五濁惡世，劫濁、見濁、煩惱濁、眾生濁、^lb命濁中，得阿耨多羅三藐三菩提，為諸眾生^pb20說是一切世間難信之法。』
^lb^ck26【難信之法】
舍利弗！當知我於五濁惡世行此難事，得阿^lb耨多羅三藐三菩提，
為一切世間說此難信^lb之法，是為甚難！」
^lb^ck27【流通分】
佛說此經已，
舍利弗及諸比丘，
一切世間天、^lb人、阿修羅等，聞佛所說，歡喜信受，作禮而去。
^pb21
^pb1^lb^lb^lb^lb^folio#amtb_xuanzang<lines=6>【玄奘】^bk#amtb_xuanzang〔稱讚淨土佛攝受經〕
^pb2^au〔　　　　　大唐三藏法師玄奘奉　詔譯〕
^lb^ck1【序分】
如是我聞：
一時，薄伽梵在室羅筏住誓多林^lb給孤獨園，
與大苾芻眾千二百五十人俱，一^lb切皆是尊宿聲聞眾望所識大阿羅漢，
其名^lb曰：尊者舍利子、摩訶目犍連、摩訶迦葉、阿泥^lb律陀，如是等諸大聲聞而為上首。
復與無量^pb3菩薩摩訶薩俱，一切皆住不退轉位，無量功^lb德眾所莊嚴，
其名曰：妙吉祥菩薩、無能勝菩^lb薩、常精進菩薩、不休息菩薩，
如是等諸大菩^lb薩而為上首。
復有帝釋、大梵天王、堪忍界主、^lb護世四王，
如是上首百千俱胝那庾多數諸^lb天子眾，及餘世間無量天、人、阿素洛等，為聞^pb4法故，俱來會坐。
^lb^ck2【極樂世界】
爾時，世尊告舍利子：
「汝今知不？於是西方，去^lb此世界過百千俱胝那庾多佛土，有佛世界^lb名曰極樂。
其中世尊名無量壽及無量光，如^lb來、應、正等覺十號圓滿，今現在彼安隱住持，^lb為諸有情宣說甚深微妙之法，令得殊勝利^pb5益安樂。
「又，舍利子！何因何緣，彼佛世界名為^lb極樂？
舍利子！由彼界中諸有情類，無有一切^lb身心憂苦，唯有無量清淨喜樂，是故名為極^lb樂世界。
^ck3【四寶七重】
「又，舍利子！極樂世界淨佛土中，處處^lb皆有七重行列妙寶欄楯、七重行列寶多羅^lb樹，及有七重妙寶羅網，周匝圍繞，四寶莊嚴——
^pb6金寶、銀寶、吠琉璃寶、頗胝迦寶，妙飾間綺。
舍^lb利子！彼佛土中有如是等眾妙綺飾，功德莊^lb嚴甚可愛樂，是故名為極樂世界。
^lb^ck4【寶池蓮花】
「又，舍利子！極樂世界淨佛土中，處處皆有七^lb妙寶池，

八功德水彌滿其中。何等名為八功^lb德水？
一者澄淨，二者清冷，三者甘美，四者輕^pb7軟，五者潤澤，六者安和，七者飲時除飢渴等^lb無量過患，八者飲已定能長養諸根四大；
增^lb益種種殊勝善根，多福眾生常樂受用。
是諸^lb寶池底布金沙，四面周匝有四階道，四寶莊^lb嚴甚可愛樂。

諸池周匝有妙寶樹，間飾行列^lb香氣芬馥，七寶莊嚴甚可愛樂。
言七寶者，一^pb8金、二銀、三吠琉璃、四頗胝迦、五赤真珠、六阿^lb濕摩揭拉婆寶、七牟娑落揭拉婆寶。
是諸池^lb中常有種種雜色蓮華，量如車輪，青形青顯^lb青光青影，
黃形黃顯黃光黃影，
赤形赤顯赤^lb光赤影，
白形白顯白光白影，
四形四顯四光^lb四影。
舍利子！彼佛土中有如是等眾妙綺飾，^pb9功德莊嚴甚可愛樂，是故名為極樂世界。
^lb^ck5【天雨曼華】
「又，舍利子！極樂世界淨佛土中，自然常有無^lb量無邊眾妙伎樂，音曲和雅甚可愛樂。
諸有^lb情類聞斯妙音，諸惡煩惱悉皆消滅，無量善^lb法漸次增長，速證無上正等菩提。
舍利子！彼^lb佛土中有如是等眾妙綺飾，功德莊嚴甚可^pb10愛樂，是故名為極樂世界。
^lb「又，舍利子！極樂世界淨佛土中，周遍大地真^lb金合成，其觸柔軟，香潔光明，無量無邊妙寶^lb間飾。
舍利子！彼佛土中有如是等眾妙綺飾，^lb功德莊嚴甚可愛樂，是故名為極樂世界。
^lb「又，舍利子！極樂世界淨佛土中，晝夜六時常^pb11雨種種上妙天華，光澤香潔，細軟雜色，雖令^lb見者身心適悅而不貪著，增長有情無量無^lb數不可思議殊勝功德。
彼有情類，晝夜六時^lb常持供養無量壽佛；每晨朝時，持此天華，於^lb一食頃，飛至他方無量世界，供養百千俱胝^lb諸佛，
於諸佛所各以百千俱胝樹花持散供^pb12養，還至本處遊天住等。
舍利子！彼佛土中有^lb如是等眾妙綺飾，功德莊嚴甚可愛樂，是故^lb名為極樂世界。
^lb^ck6【寶樹羅網】
「又，舍利子！極樂世界淨佛土中，常有種種奇^lb妙可愛雜色眾鳥，所謂：
鵝鴈、鶖鷺、鴻鶴、孔雀、^lb鸚鵡、羯羅頻迦、命命鳥等。
如是眾鳥，晝夜六^pb13時恒共集會，出和雅聲，隨其類音宣揚妙法，^lb所謂：甚深念住、正斷、神足、根、力、覺、道支等無^lb量妙法。
彼土眾生聞是聲已，各得念佛、念法、^lb念僧無量功德熏修其身。
汝舍利子，於意云^lb何？彼土眾鳥豈是傍生惡趣攝耶？勿作是見。
^lb所以者何？彼佛淨土無三惡道，尚不聞有三^pb14惡趣名，何況有實罪業所招傍生！
眾鳥當知^lb皆是無量壽佛變化所作，
令其宣暢無量法^lb音，作諸有情利益安樂。
舍利子！彼佛土中有^lb如是等眾妙綺飾，功德莊嚴甚可愛樂，是故^lb名為極樂世界。
^lb^ck7【寶樹羅網】
「又，舍利子！極樂世界淨佛土中，常有妙風吹^pb15諸寶樹及寶羅網出微妙音。
譬如百千俱胝^lb天樂同時俱作，出微妙聲甚可愛玩；
如是彼^lb土常有妙風吹眾寶樹及寶羅網，擊出種種^lb微妙音聲說種種法。
彼土眾生聞是聲已，起^lb佛、法、僧念作意等無量功德。
舍利子！彼佛土^lb中有如是等眾妙綺飾，功德莊嚴甚可愛樂，^pb16是故名為極樂世界。
^lb「又，舍利子！極樂世界淨佛土中，有如是等無^lb量無邊不可思議甚希有事。
假使經於百千^lb俱胝那庾多劫，以其無量百千俱胝那庾多^lb舌，一一舌上出無量聲讚其功德亦不能盡，^lb是故名為極樂世界。
^ck8【無量光明】


^ck9【無量壽命】
^pb17「又，舍利子！極樂世界淨佛土中，佛有何緣名^lb無量壽？
舍利子！由彼如來及諸有情，壽命無^lb量無數大劫；
由是緣故，彼土如來名無量壽。
^lb舍利子！無量壽佛證得阿耨多羅三藐三菩^lb提已來經十大劫。
^ck10【無量弟子】
舍利子！何緣彼佛名無量^lb光？
舍利子！由彼如來恒放無量無邊妙光，遍^pb18照一切十方佛土，施作佛事無有障礙；
由是^lb緣故，彼土如來名無量光。
舍利子！彼佛淨土^lb成就如是功德莊嚴甚可愛樂，是故名為極^lb樂世界。
^lb「又，舍利子！極樂世界淨佛土中，無量壽佛常^lb有無量聲聞弟子，一切皆是大阿羅漢，具足^pb19種種微妙功德，其量無邊不可稱數。
舍利子！^lb彼佛淨土成就如是功德莊嚴甚可愛樂，是^lb故名為極樂世界。
^lb^ck11【一生補處】
「又，舍利子！極樂世界淨佛土中，無量壽佛常^lb有無量菩薩弟子，一切皆是一生所繫，
具足^lb種種微妙功德，其量無邊不可稱數，假使經^pb20於無數量劫讚其功德終不能盡。
舍利子！彼^lb佛土中成就如是功德莊嚴甚可愛樂，是故^lb名為極樂世界。
^lb「又，舍利子！若諸有情生彼土者皆不退轉，必^lb不復墮諸險惡趣、邊地下賤蔑戾車中，常遊^lb諸佛清淨國土，殊勝行願念念增進，決定當^pb21證阿耨多羅三藐三菩提。
舍利子！彼佛土中^lb成就如是功德莊嚴甚可愛樂，是故名為極^lb樂世界。
^lb「又，舍利子！若諸有情聞彼西方無量壽佛清^lb淨佛土無量功德眾所莊嚴，皆應發願生彼^lb佛土。
所以者何？若生彼土，得與如是無量功^pb22德眾所莊嚴諸大士等同一集會，受用如是^lb無量功德眾所莊嚴清淨佛土，大乘法樂常^lb無退轉，無量行願念念增進，速證無上正等^lb菩提。
^ck12【臨終七日】
故，舍利子！生彼佛土諸有情類成就無^lb量無邊功德，非少善根諸有情類當得往生^lb無量壽佛極樂世界清淨佛土。
^pb23「又，舍利子！若有淨信諸善男子或善女人，得^lb聞如是無量壽佛無量無邊不可思議功德^lb名號、極樂世界功德莊嚴，聞已思惟，若一日^lb夜，或二、或三、或四、或五、或六、或七，繫念不亂。
^lb是善男子或善女人臨命終時，無量壽佛與^lb其無量聲聞弟子、菩薩眾俱前後圍繞，來住^pb24其前，慈悲加祐，令心不亂；
既捨命已，隨佛眾^lb會，生無量壽極樂世界清淨佛土。
^lb「又，舍利子！我觀如是利益安樂大事因緣，說^lb誠諦語。
若有淨信諸善男子或善女人，得聞^lb如是無量壽佛不可思議功德名號、極樂^lb界淨佛土者，一切皆應信受發願，如說修行，^pb25生彼佛土。
^lb^ck13【東方諸佛】
「又，舍利子！如我今者，稱揚讚歎無量壽佛無^lb量無邊不可思議佛土功德；
如是東方亦有^lb現在不動如來、山幢如來、大山如來、山光如^lb來、妙幢如來，
如是等佛如殑伽沙住在東方，^lb自佛淨土各各示現廣長舌相遍覆三千大^pb26千世界周匝圍繞，說誠諦言：
『汝等有情皆應^lb信受如是稱讚不可思議佛土功德一切諸^lb佛攝受法門。』
^lb^ck14【南方諸佛】
「又，舍利子！如是南方亦有現在日月光如來、^lb名稱光如來、大光蘊如來、迷盧光如來、無邊^lb精進如來，
如是等佛如殑伽沙住在南方，自^pb27佛淨土各各示現廣長舌相遍覆三千大千^lb世界周匝圍繞，說誠諦言：
『汝等有情皆應信^lb受如是稱讚不可思議佛土功德一切諸佛^lb攝受法門。』
^lb^ck15【西方諸佛】
「又，舍利子！如是西方亦有現在無量壽如來、無^lb量蘊如來、無量光如來、無量幢如來、大自在^pb28如來、大光如來、光焰如來、大寶幢如來、放光^lb如來，
如是等佛如殑伽沙住在西方，自佛淨^lb土各各示現廣長舌相遍覆三千大千世界^lb周匝圍繞，說誠諦言：
『汝等有情皆應信受如^lb是稱讚不可思議佛土功德一切諸佛攝受^lb法門。』
^pb29^ck16【北方諸佛】
「又，舍利子！如是北方亦有現在無量光嚴通^lb達覺慧如來、無量天鼓震大妙音如來、大蘊^lb如來、光網如來、娑羅帝王如來，
如是等佛如^lb殑伽沙住在北方，自佛淨土各各示現廣長^lb舌相遍覆三千大千世界周匝圍繞，說誠諦^lb言：
『汝等有情皆應信受如是稱讚不可思議^pb30佛土功德一切諸佛攝受法門。』
^lb^ck17【下方諸佛】
「又，舍利子！如是下方亦有現在示現一切妙^lb法正理常放火王勝德光明如來、師子如來、^lb名稱如來、譽光如來、正法如來、妙法如來、法^lb幢如來、功德友如來、功德號如來，
如是等佛^lb如殑伽沙住在下方，自佛淨土各各示現廣^pb31長舌相遍覆三千大千世界周匝圍繞，說誠^lb諦言：
『汝等有情皆應信受如是稱讚不可思^lb議佛土功德一切諸佛攝受法門。』
^lb^ck18【上方諸佛】
「又，舍利子！如是上方亦有現在梵音如來、宿^lb王如來、香光如來、如紅蓮華勝德如來、示現^lb一切義利如來，
如是等佛如殑伽沙住在上^pb32方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck19【東南諸佛】
「又，舍利子！如是東南方亦有現在最上廣大^lb雲雷音王如來，
如是等佛如殑伽沙住東南^pb33方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck20【西南諸佛】
「又，舍利子！如是西南方亦有現在最上日光^lb名稱功德如來，
如是等佛如殑伽沙住西南^pb34方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck21【西北諸佛】
「又，舍利子！如是西北方亦有現在無量功德^lb火王光明如來，
如是等佛如殑伽沙住西北^pb35方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck22【東北諸佛】
「又，舍利子！如是東北方亦有現在無數百千^lb俱胝廣慧如來，
如是等佛如殑伽沙住東北^pb36方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck23【佛所護念】
「又，舍利子！何緣此經名為『稱讚不可思議佛^lb土功德一切諸佛攝受法門』？舍利子！由此經^pb37中稱揚讚歎無量壽佛極樂世界不可思議^lb佛土功德，及十方面諸佛世尊為欲方便利^lb益安樂諸有情故，各住本土現大神變說誠^lb諦言，勸諸有情信受此法，是故此經名為『稱^lb讚不可思議佛土功德一切諸佛攝受法門』。
^lb「又，舍利子！若善男子或善女人，或已得聞，或^pb38當得聞，或今得聞，聞是經已，深生信解；生信^lb解已，必為如是住十方面十殑伽沙諸佛世^lb尊之所攝受；
如說行者，一切定於阿耨多羅^lb三藐三菩提得不退轉，一切定生無量壽佛^lb極樂世界清淨佛土。
是故，舍利子！汝等有情^lb一切皆應信受領解我及十方佛世尊語，當^pb39勤精進，如說修行，勿生疑慮。
^lb^ck24【三願三生】
「又，舍利子！若善男子或善女人，於無量壽極^lb樂世界清淨佛土功德莊嚴，若已^lb發願，若當發願，若今發願，必為如是住十方面十殑伽^lb沙諸佛世尊之所攝受；
如說行者，一切定於^lb阿耨多羅三藐三菩提得不退轉，一切定生^pb40無量壽佛極樂世界清淨佛土。
是故，舍利子！^lb若有淨信諸善男子或善女人，一切皆應於^lb無量壽極樂世界清淨佛土，深心信解，發願^lb往生，勿行放逸。
^lb^ck25【穢土成佛】
「又，舍利子！如我今者，稱揚讚歎無量壽^lb佛極樂世界不可思議佛土功德；彼十方面^pb41諸佛世尊，亦稱讚我不可思議無邊功德，皆^lb作是言：
『甚奇希有！釋迦寂靜釋迦法王如來、^lb應、正等覺、明行圓滿、善逝、世間解、無上丈夫、^lb調御士、天人師、佛世尊，乃能於是堪忍世界^lb五濁惡時，所謂：
劫濁、諸有情濁、諸煩惱濁、見^lb濁、命濁，於中證得阿耨多羅三藐三菩提，為^pb42欲方便利益安樂諸有情故，說是世間極難^lb信法。』
是故，舍利子！當知我今於此雜染堪忍^lb世界五濁惡時，證得阿耨多羅三藐三菩提，^lb為欲方便利益安樂諸有情故，說是世間極^lb難信法，甚為希有，不可思議。
^lb^ck26【難信之法】
「又，舍利子！於此雜染堪忍世界五濁惡時，若^pb43有淨信諸善男子或善女人，聞說如是一切^lb世間極難信法，能生信解、受持、演說、如教修^lb行。當知是人甚為希有，無量佛所曾種善根。
^lb是人命終定生西方極樂世界，受用種種功^lb德莊嚴清淨佛土大乘法樂，日夜六時親近^lb供養無量壽佛，遊歷十方供養諸佛，於諸佛^pb44所聞法受記，福慧資糧疾得圓滿，速證無上^lb正等菩提。」
^lb^ck27【流通分】
時，薄伽梵說是經已。
尊者舍利子等諸大聲聞，
^lb及諸菩薩摩訶薩眾，無量天、人、阿素洛等，一^lb切大眾聞佛所說皆大歡喜信受奉行。
^lb稱讚淨土佛攝受經^pb45
^pb1^folio#bhaisajya【藥師經】^bk#bhaisajya〔藥師瑠璃光如來本願功德經〕^ck0【序】^lb^gatha^au【　　　唐三藏法師．玄奘．奉詔〕
^ck1【敘事證信】
^lb如是我聞：
一時，薄伽梵遊化諸國，

至廣嚴城，
^lb住樂音樹下，與大苾芻眾．
八千人俱，菩薩摩^lb訶薩三萬六千，
及國王、大臣、婆羅門、居士、天、^pb2龍、藥叉、人、非人等．無量大眾，恭敬圍繞，而為^lb說法。
^ck2【禮請】
爾時，曼殊室利法王子，承佛威神，從座^lb而起，
偏袒一肩，右膝著地，向薄伽梵，曲躬．合^lb掌，白言：
「世尊！惟願演說如是相類諸佛名號，^lb及本大願．殊勝功德，
令諸聞者．業障銷除，
為^pb3欲利樂．像法轉時．諸有情故。」
^ck3【起說】
佛告曼^lb殊室利，童子言：
「善哉、善哉，曼殊室利汝以大^lb悲勸請，
我說諸佛名號本願功德，為^lb所纏有情利益安樂，像法轉時諸有情故，
汝^lb今諦聽極善思惟，當為汝說：
曼殊室利言：「唯^pb4然，願說。我等樂聞。」
^ck4【總標依正】
佛告曼殊室利：
「東方，去此，^lb過．
十殑伽沙等．佛土，
有世界，名．淨琉璃，
佛號．^lb藥師．琉璃光．如來．應．正等覺．
明行圓滿．善逝．^lb世間解．無上丈夫調御士．
天人師．佛．薄伽梵。
^ck5【行願】
^lb曼殊室利！彼佛．世尊．藥師．琉璃光．如來，本行菩^pb5薩道時，發十二大願，令諸有情．所求皆得。

^ck6【生佛平等願】
^lb第一大願：
願我來世．得阿耨多羅三藐三菩^lb提時，自身光明熾然，照曜無量、無數、無邊世^lb界，
以三十二大丈夫相、八十隨好．莊嚴其身；
^lb令一切有情．如我無異。
^ck7【開曉事業願】
^pb6第二大願：
願我來世．得菩提時，
身如琉璃，內^lb外明徹，淨無瑕穢，
光明廣大，功德巍巍，身善^lb安住，
焰網莊嚴，過於日月；
幽冥眾生，悉蒙開^lb曉，
隨意所趣，作諸事業。
^ck8【無盡資生願】
^lb第三大願：
願我來世．得菩提時，
以無量、無邊^pb7智慧、方便，令諸有情．皆得無盡所受用物，
莫^lb令眾生有所乏少。
^ck9【安立大道願】
^lb第四大願：
願我來世．得菩提時，
若諸有情行^lb邪道者，悉令安住菩提道中；
若行聲聞、獨覺乘者，皆以大^lb乘而安立之。
^ck10【戒行清淨願】
^pb8第五大願：
願我來世．得菩提時，
若有無量、無^lb邊有情，於我法中．修行梵行，
一切皆令得不^lb缺戒，具三聚戒。
設有毀犯，聞我名已，還得清^lb淨，不墮惡趣。
^ck11【諸根具足願】
^lb第六大願：
願我來世．得菩提時，
若諸有情．其^pb9身下劣、諸根不具、醜陋、頑愚、盲、聾、瘖瘂、攣躄、^lb背僂、白癩、癲狂．
種種病苦；聞我名已，一切皆^lb得端正、黠慧，諸根完具，無諸疾苦。
^ck12【身心康樂願】
^lb第七大願：
願我來世．得菩提時，
若諸有情．眾^lb病逼切，無救、無歸、無醫、無藥、無親、無家、貧窮、^pb10多苦；
我之名號，一經其耳，
眾病悉得除，身心安^lb樂，家屬、資具．悉皆豐足，
乃至證得無上菩提。
^ck13【轉女成男願】
^lb第八大願：
願我來世．得菩提時，
若有女人．為^lb女百惡．之所逼惱，極生厭離，願捨女身；
聞我^lb名已，一切皆得轉女成男，具丈夫相，乃至證^pb11得無上菩提。
^ck14【回邪歸正願】
^lb第九大願：
願我來世．得菩提時，
令諸有情．出．^lb魔羂網，解脫一切外道纏縛；
若墮種種惡見^lb稠林，皆當引攝，置於正見，漸令修習諸菩薩^lb行，速證無上正等菩提。
^ck15【從縛得脫願】
^pb12第十大願：
願我來世．得菩提時，
若諸有情．王^lb法所錄，縲縛、鞭撻，繫閉牢獄，或當刑戮，及餘^lb無量災難凌辱，悲愁煎迫，身心受苦；
若聞我^lb名，以我福德威神力故，皆得解脫一切憂苦。
^ck16【得妙飲食願】
^lb第十一大願：
願我來世．得菩提時，
若諸有情．^pb13飢渴所惱，為求食故，造諸惡業；
得聞我名，專^lb念受持；
我當先以上妙飲食．飽足其身，後以^lb法味，畢竟安樂，而建立之。
^ck17【得妙衣具願】
^lb第十二大願：
願我來世．得菩提時，
若諸有情．^lb貧、無衣服，蚊、虻、寒、熱，晝、夜逼惱；
若聞我名，專^pb14念受持，如其所好，即得種種上妙衣服，
亦得^lb一切寶莊嚴具，華、鬘、塗香、鼓、樂．眾伎，隨心所^lb翫，皆令滿足。
^ck18【總結】
曼殊室利！是為彼世尊．藥師．琉^lb璃光．如來．應．正等覺．行菩薩道時，所發十二^lb微妙上願。
^ck19【說略指廣】
復次，曼殊室利！彼世尊．藥師．琉璃^pb15光．如來，行菩薩道時．所發大願，及彼佛土功^lb德、莊嚴，
我若一劫，若一劫餘，說不能盡。
^ck20【以西喻東】
然，彼^lb佛土，一向清淨，無有女人，亦無惡趣，及苦音^lb聲。
琉璃為地，金繩．界道，城闕、宮閣、軒窓、羅網，^lb皆七寶成。
亦如西方極樂世界，功德、莊嚴，等^pb16無差別。
^ck21【以伴讚主】
於其國中，有二菩薩摩訶薩：

一名．日^lb光遍照，二名．月光遍照；
是彼無量、無數菩薩^lb眾之上首，悉能持彼世尊．藥師．琉璃光．如來^lb正法寶藏。
^ck22【結勸往生】
是故，曼殊室利！諸有信心善男子、^lb善女人等，
應當願生彼佛世界。」
^ck23【離慳吝】
爾時，世尊復^pb17告曼殊室利童子言：
「曼殊室利！有諸眾生，不^lb識善惡，
唯懷貪悋，不知布施及施果報，
愚癡^lb無智，闕於信根，多聚財寶，勤加守護；
見乞者^lb來，其心不喜；
設不獲已而行施時，如割身肉，^lb深生痛惜。
復有無量慳貪有情，積集資財，於^pb18其自身尚不受用，
何況能與父、母、妻、子、奴婢、^lb作使，及來乞者。
彼諸有情，從此命終，生餓鬼^lb界，或傍生趣。
^ck24【離貪惜】
由昔人間．曾得暫聞藥師．琉璃^lb光．如來名故，
今在惡趣，暫得憶念彼如來名。
^lb即於念時，從彼處沒，還生人中，得宿命念。
畏^pb19惡趣苦。不樂欲樂，
好行惠施，讚歎施者。
一切^lb所有悉無貪惜，漸次尚能以頭、目、手、足、血、肉、^lb身分，
施來求者，況餘財物。
^ck25【離毀犯】
復次，曼殊室利，若^lb諸有情，雖於如來．受諸學處，
而破尸羅；有．雖^lb不破尸羅，而破軌則；
有．於尸羅、軌則，雖得不^pb20壞，然毀正見；
有．雖不毀正見，而棄多聞，
於佛^lb所說契經深義．不能解了；
有．雖多聞，而增上^lb慢，由增上慢．覆蔽心故，自是、非他，
嫌謗正法，^lb為魔伴黨。
如是愚人，自行邪見，
復令無量俱^lb胝有情．墮大險坑。
此諸有情，應於地獄、傍生、^pb21鬼趣，流轉無窮。
^ck26【離見慢】
若得聞此藥師．琉璃光．如來^lb名號，便捨惡行，修諸善法，不墮惡趣。
設有不^lb能捨諸惡行．修行善法．墮惡趣者，以彼如來^lb本願威力，令其現前暫聞名號；
從彼命終，還^lb生人趣，得正見，精進，善調意樂；
便能捨家，趣^pb22於非家；如來法中，受持學處，無有毀犯；正見、^lb多聞，解甚深義，離增上慢，不謗正法，不為魔^lb伴黨，漸次修行諸菩薩行，速得圓滿。
^ck27【離嫉妬】
復次，曼^lb殊室利！若諸有情，慳貪、嫉妬，自讚、毀他，
當墮^lb三惡趣中，無量千歲．受諸劇苦。
受劇苦已，從^pb23彼命終，來生人間，
作牛、馬、駝、驢，
恒被鞭撻，飢^lb渴逼惱；又常負重，隨路而行。
或得為人，生．居^lb下賤，
作人奴婢，受他驅役，恒不自在。
^ck28【斷魔羂】
若昔人^lb中，曾聞世尊．藥師．琉璃光．如來名號，
由此善^lb因，今復憶念，至心歸依，
以佛神力，眾苦解脫。^pb24諸根聰利，智慧、多聞，恒求勝法；
常遇善友，永^lb斷魔羂，
破無明㲉，竭煩惱河，
解脫一切生、老、^lb病、死、憂、悲、苦、惱。
^ck29【離鬥訟咒詛】
復次，曼殊室利！若諸有情，
好^lb喜乖離，更相鬪、訟，惱亂自他，
以身、語、意，造作、^lb增長種種惡業；
展轉常為不饒益事，互相謀^pb25害。
告召山、林、樹、塚等神；

殺諸眾生，
取其血、肉，^lb祭祀藥叉、羅剎娑等；
書．怨人名，作其形像，以^lb惡呪術而呪詛之；
厭媚、蠱道，呪．起屍鬼，令斷^lb彼命，及壞其身。
^ck30【轉起慈心】
是諸有情，若得聞此藥師．琉^lb璃光．如來名號，
彼諸惡事，悉不能害。
一切展^pb26轉皆起慈心，利益安樂，無損惱意及嫌恨心；
^lb各各歡悅，於自所受．生於喜足；不相侵凌，互^lb為饒益。
^ck31【往生極樂】
復次，曼殊室利！若有四眾——苾芻、苾芻^lb尼、鄔波索迦、鄔波斯迦——
及餘淨信善男子、善^lb女人等，有能受持八分齋戒，
或經一年，或復三^pb27月，受持學處；
以此善根，願生西方．極樂世界．^lb無量壽佛所。聽聞正法，而未定者。
^ck32【自然化生】
若聞世尊．^lb藥師．琉璃光．如來名號；
臨命終時，有八菩薩，^lb乘神通來，示其道路，
即於彼界．種種雜色．眾^lb寶華中，自然化生
^ck33【上生天國】
或有因此生於天上；
雖生^pb28天中，而本善根亦未窮盡，
不復更生諸餘惡^lb趣。
^ck34【還生人間】
天上壽盡，還生人間，
或為輪王，統攝四洲，
^lb威德自在，安立無量百千有情於十善道。
^ck35【生剎帝利】
或^lb生剎帝利、婆羅門、居士．大家，多饒財寶，倉庫^lb盈溢；
形相端嚴，眷屬具足，聰明智慧，勇健威^pb29猛，如大力士。
^ck36【轉生丈夫】
若是女人，得聞世尊．藥師如來．^lb名號，至心受持，於後，不復更受女身。」
^ck37【曼殊護持】
爾時，曼^lb殊室利童子白佛言：
「世尊！我當誓於像法轉^lb時，以種種方便，令諸淨信善男子、善女人等，
^lb得聞世尊．藥師．琉璃光．如來名號，
乃至睡中．^pb30亦以佛名．覺悟其耳。
^ck38【諸天護持】
世尊！若於此經受持、讀^lb誦，或復為他演說、開示；
若自書，若教人書；恭^lb敬、尊重，
以種種花、香、塗香、末香、燒香、花鬘、瓔^lb珞、幡蓋、伎樂，而為供養；
以五色綵，作囊．盛之；^lb掃灑淨處，敷設高座，而用安處。
爾時，四大天^pb31王與其眷屬，及餘無量百千天眾，皆詣其所，^lb供養、守護。
世尊！若此經寶流行之處，
有能受^lb持，以彼世尊．藥師．琉璃光．如來本願功德，及^lb聞名號，當知．是處無復橫死。
亦復不為諸惡^lb鬼神奪其精氣；
設已奪者，還得如故，身心安^pb32樂。」
^ck39【受持儀軌】
佛告曼殊室利：「如是，如是，如汝所說。
曼殊^lb室利！若有淨信善男子、善女人等，欲供養彼^lb世尊．藥師．琉璃光．如來者，應先造立彼佛形^lb像，敷清淨座而安處之；
散種種花，燒種種香，^lb以種種幢、幡．莊嚴其處。
七日七夜，受持八分齋^pb33戒，食清淨食；
澡浴、香潔，著新淨衣。
應生無垢^lb濁心，無怒害心；於一切有情，起利益、安樂、慈、^lb悲、喜、捨、平等之心。
鼓樂歌讚，右繞佛像。
復應^lb念彼如來本願功德，讀誦此經，思惟其義，演^lb說、開示。
^ck40【獲福益】
隨所樂願，一切皆遂。
求長壽，得長壽；
^pb34求富饒，得富饒；
求官位，得官位；
求男女，得男^lb女。
^ck41【百怪出現難】
若復有人，忽得惡夢，見諸惡相，或怪鳥來^lb集；
或於住處，百怪出現；
此人若以眾妙資具，^lb恭敬、供養彼世尊．藥師．琉璃光．如來者，
惡夢、^lb惡相、諸不吉祥，皆悉隱沒，不能為患。
^ck42【一切怖畏難】
或有水、^pb35火、刀、毒、懸嶮、惡象、師子、虎、狼、熊、羆、毒蛇、惡蠍、^lb蜈蚣、蚰蜒、蚊、虻等怖；
若能至心憶念彼佛，恭^lb敬、供養，
一切怖畏皆得解脫。
^ck43【內亂外患難】
若他國侵擾，盜^lb賊反亂；
憶念、恭敬彼如來者，亦皆解脫。
^ck44【】


^ck45【】





^ck46【毀犯墮落難】
復次，^lb曼殊室利！若有淨信善男子、善女人等，
乃至^pb36盡形，不事餘天，惟當一心歸佛、法、僧，受持禁^lb戒，
若五戒、十戒、
菩薩四百戒、
苾芻二百五十^lb戒、
苾芻尼五百戒，
於所受中，或有毀犯，怖．墮^lb惡趣；
若能專念彼佛名號，恭敬、供養者，
必定^lb不受三惡趣生。









































^ck47【女人生產難】
或有女人，臨當產時，受於極^pb37苦；
若能至心稱名、禮讚、恭敬、供養彼如來者，^lb眾苦皆除。
所生之子，身分具足，形色端正，見^lb者歡喜，利根聰明，
安隱少病，無有非人奪其^lb精氣。」
^ck48【問答決定】
爾時，世尊告阿難言：
「如我稱揚彼佛．世^lb尊．藥師．琉璃光．如來所有功德，此是諸佛甚^pb38深行處，難可解了:；汝為信不？」
阿難白言：
「大德！^lb世尊！我於如來所說契經，不生疑惑。
所以者^lb何？
一切如來身、語、意業，無不清淨。
世尊！此日、^lb月輪，可令墮落；
妙高山王，可使傾動。
諸佛所^lb言，無有異也。


^ck49【信謗德失】
世尊！有諸眾生，信根不具，
聞說^pb39諸佛甚深行處，作是思惟：
『云何但念藥師．琉^lb璃光．如來一佛名號，便獲爾所功德、勝利？』
由^lb此不信，反生誹謗；
彼於長夜，失大利樂，墮諸^lb惡趣，流轉無窮。」
佛告阿難：
「是諸有情，若聞世^lb尊．藥師．琉璃光．如來名號，至心受持，不生疑^pb40惑，墮惡趣者——
無有是處。
^ck50【信解希有】
阿難！此是諸佛甚深^lb所行，難可信解；
汝今能受，當知皆是如來威^lb力。
阿難！一切聲聞、獨覺、及未登地諸菩薩等，^lb皆悉不能如實信解；惟除一生所繫菩薩。
阿^lb難！人身難得；
於三寶中，信敬、尊重，亦難可得；
^pb41得聞世尊．藥師．琉璃光．如來名號，復難於是。






^ck51【功德無盡】
^lb阿難！彼藥師．琉璃光．如來，無量菩薩行、
無量^lb善巧方便、無量廣大願；
我若一劫，若一劫餘．^lb而廣說者，劫可速盡；
彼佛行願、善巧方便，無^lb有盡也。」








^ck52【說延壽法】
爾時，眾中，有一菩薩摩訶薩，名曰救^pb42脫，即從座起，
偏袒右肩，右膝著地，曲躬．合掌，^lb而白佛言：
^ck53【病患垂危】
「大德！世尊！像法轉時，有諸眾生，為^lb種種患之所困厄，
長病、羸瘦，不能飲食，喉、脣^lb乾燥；見諸方暗；
死相現前，父母、親屬、朋友、知^lb識，啼泣圍繞。
^ck54【神識受報】
然，彼自身，臥在本處，見．琰魔使，^pb43引其神識，至于琰魔法王之前。
^ck55【神識受報】
然，諸有情，有^lb俱生神；
隨．其所作．若罪、若福，皆具書之，
盡持^lb授與琰魔法王。
爾時，彼王，推問其人，算計所^lb作，隨其罪福，而處斷之。
^ck56【作福續命】
時，彼病人親屬、知識，^lb若能為彼歸依世尊．藥師．琉璃光．如來，請諸^pb44眾僧，轉讀此經，然七層之燈，懸五色續命神^lb幡，
或有是處——
^ck57【勵力行善】
彼識得還，如在夢中，明了自見。
^lb或經七日，或二十一日，或三十五日，或四十^lb九日，彼識還時，
如從夢覺，皆自憶知善不善^lb業所得果報。
由自證見業果報故，乃至命難，^pb45亦不造作諸惡之業。
^ck58【結勸】
是故，淨信善男子、善女^lb人等，皆應受持藥師．琉璃光．如來名號；
隨力^lb所能，恭敬、供養。」
^ck59【明延壽儀】
爾時，阿難問救脫菩薩曰：
「善^lb男子！應云何恭敬、供養彼世尊．藥師．琉璃光．^lb如來．續命幡燈？復，云何造？」
^ck60【明延壽儀】
救脫菩薩言：
「大德！^pb46若有病人，欲脫病苦，當為其人，七日七夜，受^lb持八分齋戒；
應以飲食及餘資具，隨力所辦，^lb供養苾芻僧；
晝夜六時，禮拜、供養彼世尊．藥^lb師．琉璃光．如來；
讀誦此經四十九遍；
然四十^lb九燈；
造彼如來形像七軀；
一一像前，各置七^pb47燈，
一一燈．量．大如車輪，
乃至四十九日，光明^lb不絕；
造五色綵幡，長四十九搩手；應放雜類^lb眾生．至四十九——可得過度危厄之難，不為諸^lb橫惡鬼所持。
^ck61【救國難以延命】
復次，阿難！若剎帝利灌頂王等，^lb災難起時——
所謂人眾疾疫難，他國侵逼難，自^pb48界叛逆難，星宿變怪難，日月薄蝕難，非時．風^lb雨難，過時．不雨難——
彼剎帝利灌頂王等，爾時，^lb應於一切有情起慈悲心，赦．諸繫閉；
依前所^lb說供養之法，供養彼世尊．藥師．琉璃光．如來。
^lb由此善根，及彼如來本願力故，令其國界即^pb49得安隱；
風雨順時，穀稼成熟。
一切有情，無病、^lb歡樂。
於其國中，無有暴虐藥叉等神．惱有情^lb者；
一切惡相，皆即隱沒。
而剎帝利灌頂王等，^lb壽命、色、力，無病、自在，皆得增益。
^ck62【救眾難以延命】
阿難！若帝后、^lb妃主、儲君、王子、大臣、輔相、中宮婇女、百官、黎^pb50庶，為病所苦，及餘厄難；
亦應造立五色神幡，^lb然燈續明，放諸生命，散雜色華，燒眾名香，病^lb得除愈，眾難解脫。」
^ck63【增益已盡之命】
爾時，阿難問救脫菩薩言：
^lb「善男子！云何已盡之命而可增益？」
救脫菩薩^lb言：
「大德！汝豈不聞如來說有九橫死耶？
是故，^pb51勸造續命幡燈，修諸福德；
以修福故，盡其壽^lb命，不經苦患。」
阿難問言：「九橫，云何？」
救脫菩薩^lb言：「
^ck64【九種橫死】
若諸有情，得病雖輕，
然無醫藥及看病者；
^lb設復遇醫，授以非藥；
實不應死，而便橫死。
又，^lb信世間邪魔、外道、妖㜸之師，妄說禍福，便生^pb52恐動，心不自正，卜問、覓禍，殺．種種眾生，解奏^lb神明，呼．諸魍魎，請乞．福祐，欲冀延年，終不能^lb得；
愚癡、迷惑，信．邪倒見，遂令橫死，入於地獄，^lb無有出期——是名初橫。
二者，橫．被王法之所誅^lb戮。
三者，畋獵、嬉戲，耽婬、嗜酒，放逸無度，橫．為^pb53非人奪其精氣。
四者，橫．為火焚。
五者，橫．為水^lb溺。
六者，橫．為種種惡獸所噉。
七者，橫．墮山崖。
^lb八者，橫．為毒藥、厭禱、呪詛、起屍鬼等．之所中^lb害。
九者，飢渴所困，不得飲、食，而便橫死。
是為^lb如來略說橫死，有此九種。
其餘，復有無量諸^pb54橫，難可具說。
^ck65【結勸修度】
復次，阿難！
彼琰魔王，主領世間^lb名籍之記。
若諸有情，不孝、五逆、破辱三寶、壞^lb君臣法、毀於信戒，琰魔法王，
隨罪輕重，考而^lb罰之。

是故，我今勸諸有情，然燈、造幡，放生、修^lb福，令度苦厄，不遭眾難。」
^ck66【藥叉誓護】


爾時，眾中有十二藥^pb55叉大將，俱在會坐，


所謂：
^lb^gatha宮毘羅大將．伐折羅大將．迷企羅大將，^lb^gatha安底羅大將．頞儞羅大將．珊底羅大將^lb^gatha因達羅大將．波夷羅大將．摩虎羅大將^lb^gatha真達羅大將．招杜羅大將．毘羯羅大將。
^pb56此十二藥叉大將，一一各有七千藥叉以為^lb眷屬，同時舉聲白佛言：
「世尊！我等今者，蒙佛^lb威力，得聞世尊．藥師．琉璃光．如來名號；不復^lb更有惡趣之怖。
我等相率，皆同一心，乃至盡^lb形．
歸佛、法、僧，
誓當荷負一切有情，為作義利、^pb57饒益、安樂。
隨於何等村城、國邑、空閑林中，
若^lb有流布此經，或復受持藥師．琉璃光．如來名^lb號，恭敬、供養者，
我等眷屬，衛護是人，皆使解^lb脫一切苦難；
諸有願求，悉令滿足。
或有疾厄．^lb求度脫者，亦應讀誦此經，以五色縷，結我名^pb58字，得如願已，然後解結。」
爾時，世尊讚諸藥叉^lb大將言：
「善哉，善哉。大藥叉將！汝等念報世尊．^lb藥師．琉璃光．如來恩德者，常應如是利益、安^lb樂一切有情。」
^ck67【呪】


^ck68【阿難問名】

爾時，阿難白佛言：
「世尊！當何名^lb此法門？我等云何奉持？」
佛告阿難：「此法門，名．^pb59說藥師．琉璃光．如來本願功德；
亦名．說十二^lb神將．饒益有情．結願神呪；
亦名．拔除一切業^lb障——應如是持。」
^ck69【大眾奉行】
時，薄伽梵說是語已，
諸菩薩摩^lb訶薩，
及大聲聞、
國王、大臣、婆羅門、居士，
天、龍、^lb藥叉、揵達縛、阿素洛、揭路荼、緊捺洛、莫呼洛^pb60伽、人、非人等，一切大眾，聞佛所說，皆大歡喜，^lb信受奉行。
^lb^lb^lb藥師．琉璃光．如來本願功德經^pb61
^pb1^folio#bhaisajya_gupta【笈多】^bk#bhaisajya_gupta〔佛說藥師如來本願經〕^ck0【序】^lb^gatha^au〔　　　隋　天竺三藏　達摩笈多　譯〕
^ck1【敘事證信】
^lb如是我聞：
一時婆伽婆遊行人間

至毘舍離^lb國
住樂音樹下，與大比丘眾
八千人俱、菩薩^lb三萬六千、
國王、大臣、婆羅門、居士、天龍、阿修^pb2羅、揵達婆、伽樓茶、緊那羅、摩呼羅伽等，大眾^lb圍遶於前說法。
^ck2【禮請】
爾時，曼殊室利法王子，承佛^lb威神，即從座起，
偏露一髆，右膝著地，向婆伽^lb婆合掌曲躬白言：
「世尊！唯願演說諸佛名號^lb及本昔所發殊勝大願，
令眾生聞已，業障消^pb3除，
攝受來世正法壞時諸眾生故。」
^ck3【起說】
爾時，婆伽^lb婆讚曼殊室利童子言：
「善哉！善哉！曼殊室利^lb大慈悲者，起無量悲，勸請我說，
為欲義利種^lb種業障所纏眾生，饒益安樂諸天人故。
曼殊^lb室利！當善憶念，聽我所說。」
時曼殊室利童子^pb4樂聽佛說，白言：「唯然，世尊！」
^ck4【總標依正】
佛告曼殊室利：
「東^lb方過此佛土
十恒河沙等佛土之外，
有世界^lb名淨琉璃，
彼土有佛，名藥師琉璃光如來、應、^lb正遍知、
明行足、善逝、世間解、無上士、調御丈^lb夫、
天人師、佛、世尊。
^ck5【行願】
「曼殊室利！彼世尊藥師琉^pb5璃光如來本行菩薩行時，發十二大願。
何者^lb十二？
^lb^ck6【生佛平等願】
「第一大願：
願我來世於佛菩提得正覺時，自^lb身光明熾然，照曜無量無數無邊世界，
三十^lb二丈夫大相及八十小好以為莊嚴；
我身既^pb6爾，令一切眾生如我無異。
^lb^ck7【開曉事業願】
「第二大願：
願我來世得菩提時，
身如琉璃，內^lb外清淨，無復瑕垢，
光明曠大，威德熾然，身善^lb安住，
焰網莊嚴，過於日月，
若有眾生，生世界^lb之間，或復人中昏暗及夜，莫知方所，
以我光^pb7故，隨意所趣，作諸事業。
^lb^ck8【無盡資生願】
^lb「第三大願：
願我來世得菩提時，
以無邊無限^lb智慧方便，令無量眾生界受用無盡，
莫令一^lb人有所少乏。
^lb^ck9【安立大道願】
「第四大願：
願我來世得菩提時，
諸有眾生行^pb8異道者，一切安立菩提道中，
行聲聞道、行辟^lb支佛道者，皆以大乘而安立之。
^lb^ck10【戒行清淨願】
「第五大願：
願我來世得菩提時，
若有眾生於^lb我法中修行梵行，
此諸眾生無量無邊，一切^lb皆得不缺減戒，具三聚戒，
無有破戒趣惡道^pb9者。
^lb^ck11【諸根具足願】
「第六大願：
願我來世得菩提時，
若有眾生，其^lb身下劣，諸根不具，醜陋頑愚，聾盲跛躄，身攣^lb背傴，白癩癲狂，
若復有餘種種身病，聞我名^lb已，一切皆得，諸根具足，身分成滿。
^pb10^ck12【身心康樂願】
「第七大願：
願我來世得菩提時，
若有眾生，諸^lb患逼切，無護無依，無有住處，遠離一切資生^lb醫藥，又無親屬，貧窮可愍，
此人若得聞我名^lb號，
眾患悉除，無諸痛惱，
乃至究竟無上菩提。
^lb^ck13【轉女成男願】
「第八大願：
願我來世得菩提時，
若有女人，為^lb婦人百惡所逼惱故，厭離女身，願捨女形，
聞^lb我名已，轉女人身成丈夫相，乃至究竟無上^lb菩提。
^lb^ck14【回邪歸正願】
「第九大願：
願我來世得菩提時，
令一切眾生^lb解脫魔網，
若墮種種異見稠林，悉當安立置^pb12於正見，次第示以菩薩行門。
^lb^ck15【從縛得脫願】
「第十大願：
願我來世得菩提時，
若有眾生，種^lb種王法，繫縛、鞭撻、牢獄、應死，無量災難，悲憂^lb煎迫，身心受苦，
此等眾生，以我福力，皆得解^lb脫一切苦惱。
^pb13^ck16【得妙飲食願】
「十一大願：
願我來世得菩提時，
若有眾生，飢^lb火燒身，為求食故，作諸惡業，

我於彼所，先以^lb最妙色香味食，飽足其身，後以法味，畢竟安^lb樂而建立之。
^pb14^ck17【得妙衣具願】
「十二大願：
願我來世得菩提時，
若有眾生，貧^lb無衣服，寒熱蚊虻，日夜逼惱，
我當施彼，隨用^lb衣服，種種雜色，如其所好，
亦以一切寶莊嚴^lb具，花鬘、塗香、鼓樂、眾伎，隨諸眾生所須之，具^lb皆令滿足。
^ck18【總結】
「此十二大願，是彼世尊藥師琉璃^lb光如來、應、正遍知，行菩薩時，本昔所作。
^ck19【說略指廣】
「復次，^pb15曼殊室利！藥師琉璃光如來所有諸願，及彼^lb佛土功德莊嚴，
乃至窮劫說不可盡。
^ck20【以西喻東】
彼佛國^lb土一向清淨，無女人形，離諸欲惡，亦無一切^lb惡道苦聲，
琉璃為地，城闕、垣墻、門窓、堂閣柱^lb架、斗拱、周匝羅網，皆七寶成，
如極樂國，淨琉^pb16璃界莊嚴如是。
^ck21【以伴讚主】
「於其國中有二菩薩摩訶薩，

^lb一名日光，二名月光，
於彼無量無數諸菩薩^lb眾，最為上首，持彼世尊藥師琉璃光如來正^lb法之藏。
^ck22【結勸往生】
「是故，曼殊室利！信心善男子、善女人，
^lb應當願生彼佛國土。」
^ck23【離慳吝】
爾時，世尊復告曼殊室^pb17利童子言：
「曼殊室利！或有眾生，不識善惡，
多^lb貪無厭，不知布施及施果報，
愚癡無智，闕於^lb信根，聚財護惜，不欲分施。
此等眾生，無施心^lb故，見乞者來，其心不喜，
如割身肉。
復有無量^lb慳貪眾生，自不受用，
亦不欲與父母、妻子，況^pb18奴婢、作使及餘乞人。
此等眾生，人間命終，生^lb餓鬼道，或畜生道。
^ck24【離貪惜】
由昔人間，曾得聞彼藥師^lb琉璃光如來名號故，
或在鬼道，或畜生道，如^lb來名號暫得現前，
即於念時，彼處命終，還生^lb人道，得宿命智，
怖畏惡趣，不樂欲樂，
好行慧^pb19施，讚歎施者，
一切所有，悉能捨施，漸以頭目、^lb手足、血肉、身分
皆與求者，況餘財物。
^ck25【離毀犯】
「復次，曼^lb殊室利！有諸眾生，雖奉如來，受持學句，
然破^lb戒、破行、破於正見；
或受學句，護持禁戒，
然不^lb求多聞，
不解如來所說修多羅中甚深之義；
^pb20或復多聞，而增上慢，自是非他，
嫌謗正法，為^lb魔伴黨。
此等癡人，
及餘無量百千俱胝那由^lb他眾生，行邪道者，當墮地獄。
此等眾生，應於^lb地獄流轉無期，
^ck26【離見慢】
以得聞彼世尊藥師琉璃光^lb如來名號故，於地獄處，
彼佛威力，如來名號^pb21暫得現前，
即時捨命，還生人道，正見精進，淳^lb善淨心，
便能捨家，於如來教中出家學道，漸^lb次修行菩薩諸行。
^ck27【離嫉妬】
「復次，曼殊室利！或有眾生，^lb以妬忌故，但自稱讚，不讚他人。
此諸眾生，以^lb自高輕他故，於三惡道，無量千歲，受諸苦毒；
^pb22過無量千歲已，於彼命終，
生畜生趣，作牛馬^lb駝驢，
鞭杖捶擊，飢渴逼惱，身負重擔，隨路而^lb行；
若生人道，常居下賤，
為人奴婢，受他驅役。
^ck28【斷魔羂】
^lb若昔人中，聞彼世尊藥師琉璃光如來名號^lb者，
以此善根，
眾苦解脫，諸根猛利，聰慧博識，^pb23恒求善本，
得與良友常相隨逐，能斷魔羂，
破^lb無明㲉，竭煩惱河，
解脫一切生老病死，憂悲^lb苦惱。
^ck29【離鬥訟咒詛】
「復次，曼殊室利！有諸眾生，
好喜乖離，更^lb相鬪訟，此等互起惡心眾生，
身口及意，恒作^lb諸惡，
為欲相損，各各常以無益相加，
或告林^pb24神、樹神、山神、塚神種種別神，

殺諸畜生，
取其血肉，祭祀一切夜叉、羅剎食^lb血肉者，
書怨人^lb字，并作其形，成就種種毒害、呪術、
厭魅、蠱道、^lb起屍鬼呪，欲斷彼命及壞其身。
^ck30【轉起慈心】
由聞世尊藥^lb師琉璃光如來名號故，
此諸惡事不能傷損，
^pb25皆得互起慈心、益心、無嫌恨心，
各各歡悅，更^lb相攝受。
^ck31【往生極樂】
「復次，曼殊室利！此諸四眾——比丘、比丘^lb尼、優婆塞、優婆私——
及餘信心善男子、善女人^lb等，受八分齋，
或復一年，或復三月受持諸戒，
^lb以此善根，隨所憙樂，隨所願求，若欲往生西^pb26方極樂世界阿彌陀如來所者，
^ck32【自然化生】
由得聞彼世^lb尊藥師琉璃光如來名號故，
於命終時，有八^lb菩薩乘空而來，示其道徑，
即於彼界，種種異^lb色波頭摩華中自然化生；
^ck33【上生天國】
若復此人欲生天^lb上，
即得往生，本昔善根無有窮盡，
不復更生^pb27諸餘惡趣，
^ck34【還生人間】
天上命盡，當生人間，
為轉輪王，四^lb洲自在安立，
無量百千俱胝那由他眾生於^lb十善業道，
^ck35【生剎帝利】
或復生於剎利大族、婆羅門大族、^lb居士大家，金銀、粟帛、倉庫盈滿，
形色具足，自^lb在具足，眷屬具足，勇健多力如大力士；
^ck36【轉生丈夫】
若有^pb28女人得聞說此如來名號至心受持，此人於^lb後永離女身。」
^ck37【曼殊護持】
爾時，曼殊室利童子白佛言：
「世^lb尊！我於後時，以彼世尊藥師琉璃光如來名^lb號，於信心善男子、善女人所，
種種方便流布^lb令聞，
乃至睡中亦以佛名覺寤其耳。
^ck38【諸天護持】
若受持^pb29此經讀誦宣說，或復為他分別開解，
若自書，^lb若令人書，若取經卷，五色淨綵以盛裹之，灑^lb掃淨處以安置之，
持種種華、種種香、塗香、華^lb鬘、寶幢、幡蓋而用供養，

爾時，四大天王，與其^lb眷屬，并餘百千俱胝那由他諸天，皆詣其所。
^pb30若此經卷流行之處，
若復有人誦持此經，以^lb得聞彼世尊藥師琉璃光如來名號，及本昔^lb所發殊勝大願故，當知是處無復橫死，
亦復^lb不為諸鬼所持奪其魂魄，
設已奪者，還復如^lb故。」
^ck39【受持儀軌】
佛言：「如是，如是！曼殊室利！如汝所說。
曼殊^pb31室利！信心善男子、善女人，若欲供養彼如來^lb者，
此人應作如來形像，七日七夜受八分齋^lb食清淨食，
於清淨處散種種華，燒種種香，以^lb種種繒綵，種種幡幢，莊嚴其處，
澡浴清潔，著^lb新淨衣，
應生無垢濁心，無怒害心，於一切眾^pb32生起利益心，慈悲喜捨平等之心，
鼓樂歌讚，^lb右遶佛像，
應念彼如來本昔大願并解釋此^lb經，
^ck40【獲福益】
如所思念，如所願求，一切所欲，皆得圓滿——
^lb求長壽得長壽，
求福報得福報，
求自在得自^lb在，
求男女得男女。
^ck41【百怪出現難】
「或復有人忽得惡夢，或見^pb33諸惡相，或怪鳥來集，
於其住所百怪出現，
此^lb人若能以種種眾具，供養恭敬彼藥師琉璃^lb光如來者，
一切惡夢、惡相、不吉祥事皆悉隱^lb沒，
^ck42【一切怖畏難】
或有水怖、火怖、刀怖、毒怖、懸嶮之怖，惡象、^lb師子、虎狼、熊羆、毒蛇、惡蝎、蜈蚣、蚰蜒如是等^pb34怖，
憶念供養彼如來者，
一切怖畏皆得解脫。
^ck43【內亂外患難】
^lb若他國侵擾、賊盜反亂、
如是等怖，亦應念彼^lb如來恭敬尊重。
^ck44【華報如是】


^ck45【橫病除愈】





^ck46【毀犯墮落難】
「復次，曼殊室利！若有信心善^lb男子、善女人，
乃至盡形受三歸依，不事餘天，
^lb或持五戒，或持十戒，
或持菩薩一百四戒，
或^pb35復出家受持比丘二百五十戒，
若比丘尼受^lb持五百戒，
於隨所受中，毀犯禁戒，畏墮惡道，
^lb若能供養彼世尊藥師琉璃光如來者，
決定^lb不受三惡道報。









































^ck47【女人生產難】
或有女人臨當產時，受於極^lb苦，
若能稱名供養彼世尊藥師琉璃光如來^pb36者，速得解脫，
所生之子身分具足，形色端正，^lb見者歡喜，利根聰明，
安隱少病，無有非人奪^lb其魂魄。」
^ck48【問答決定】
爾時，世尊告慧命阿難言：
「阿難！如我^lb稱揚彼世尊藥師琉璃光如來所有功德，汝^lb信受耶？汝於如是諸佛如來甚深境界多生^pb37疑惑。」
時，慧命阿難白佛言：
「大德世尊！我於如^lb來所說法中，無復疑惑。
何以故？
一切如來身^lb口意行無不清淨。
世尊！此日月，有如是大神^lb通，有如是大威力，可令墮落，
須彌山王可得^lb移動，
諸佛所言無有差異。


^ck49【信謗德失】
大德世尊！或有眾^pb38生信根不具，
聞說如來佛境界已，作是思惟：
^lb『云何但念彼如來名獲爾許功德？』
心不信受，^lb生於誹謗，
此等長夜無義饒益，當墮苦趣。」
佛^lb言：
「阿難！若彼如來所有名號入其耳中，此人^lb墮惡道者，
無有是處。
^ck50【信解希有】
阿難！諸佛境界誠為難^pb39信，
汝今信受，應知皆是如來威力，
非一切聲^lb聞、辟支佛地所能信受，唯除一生補處菩薩^lb摩訶薩。
阿難！人身難得，
於三寶中信敬尊重^lb亦難可得，
聞彼如來名號倍難於此。






^ck51【功德無盡】
阿難！彼^lb世尊藥師琉璃光如來無量菩薩行，
無量諸^pb40巧便，無量曠大願，
我欲一劫若過一劫說彼^lb如來菩薩行願，乃至窮劫，
彼世尊藥師琉^lb璃光如來本昔所行及殊勝大願，亦不究盡。」








^ck52【說延壽法】
^lb爾時，眾中有菩薩摩訶薩名曰救脫，即從座^lb起，
偏露一髆，右膝著地，向婆伽婆合掌曲躬^pb41白言：
^ck53【病患垂危】
「大德世尊！於未來世，當有眾生，身嬰重^lb病，
長患羸瘦，不食飢渴，喉脣乾燥，
死相現前，^lb目無所見，父母、親眷、朋友、知識啼泣圍遶，
^ck54【引其神識】
其^lb人屍形臥在本處，閻摩使人引其神識，置於^lb閻摩法王之前，
^ck55【神識受報】
此人背後有同生神，隨其所^pb42作，
若罪若福一切皆書，
盡持授與閻摩法王。
^lb時閻摩法王推問其人，算計所作，隨善隨惡^lb而處分之。
^ck56【作福續命】
若能為此病人歸依彼世尊藥師^lb琉璃光如來，如法供養，
即得還復。
^ck57【勵力行善】
此人神識^lb得迴還時，如從夢覺皆自憶知，
或經七日、或^pb43二十一日、或三十五日、或四十九日，神識還^lb已，
具憶所有善惡業報，
由自證故，乃至失命^lb不造惡業。
^ck58【結勸】
是故信心善男子、善女人，
應當供^lb養藥師如來。」
^ck59【明延壽儀】
爾時，慧命阿難問救脫菩薩言：
^lb「善男子！應云何供養彼世尊藥師琉璃光如^pb44來也？」
^ck60【答延壽儀】
救脫菩薩言：
「大德阿難！若有患人欲脫^lb重病，當為此人七日七夜受八分齋，
當以飲^lb食，及種種眾具，隨力所辦，供養比丘僧，
晝夜^lb六時，禮拜供養彼世尊藥師琉璃光如來，
四^lb十九遍讀誦此經，
然四十九燈，
應造七軀彼^pb45如來像，
一一像前各置七燈，
一一燈量大如^lb車輪，
或復乃至四十九日光明不絕，
當造五^lb色綵幡長四十九尺。
^ck61【救國難以延命】
「復次，大德阿難！灌頂剎^lb利王等，若災難起時——
所謂人民疾疫難、他方^lb侵逼難、自界反逆難、星宿變怪難、日月薄蝕^pb46難、非時風雨難、過時不雨難——
爾時，此灌頂剎^lb利王，當於一切眾生，起慈愍心，赦諸繫閉，
依^lb前所說供養法式，供養彼世尊藥師琉璃光^lb如來。
時灌頂剎利王用此善根，由彼世尊藥^lb師琉璃光如來本昔勝願故，其王境界即得^pb47安隱，
風雨以時、禾稼成就、國土豐熟，
一切國^lb界所有眾生，無病安樂，多生歡喜，
於其國界^lb亦無夜叉、羅剎、毘舍闍等諸惡鬼神擾亂眾^lb生，
所有惡相皆即不現，
彼灌頂剎利王，壽命^lb色力無病自在並得增益。」
^ck62【救眾難以延命】


^ck63【增益已盡之命】
爾時，慧命阿難問^pb48救脫菩薩言：
「善男子！云何已盡之命而可更^lb延？」
救脫菩薩言：
「阿難！汝豈不聞如來所說九^lb橫死耶？




^ck64【九種橫死】
是故教以呪藥方便；或有眾生，得病^lb非重，
然無醫藥及看病人，
或復醫人療治失^lb所，
非時而死，

是為初橫；
第二橫者，王法所殺；
^pb49第三橫者，遊獵、放逸、婬醉無度，為諸非人害^lb其魂魄；
第四橫者，為火所燒；
第五橫者，為水^lb所溺；
第六橫者，入師子、虎豹、諸惡獸中；
第七^lb橫者，飢渴所困，不得飲食，因此致死；
第八橫^lb者，厭禱、毒藥、起屍鬼等之所損害；
第九橫者，^pb50投巖取死，
是名如來略說大橫有此九種，
其^lb餘復有無量諸橫。」
^ck65【結勸修度】






^ck66【藥叉誓護】


爾時，眾中有十二夜叉大^lb將，俱在會坐，


所謂：
^lb^gatha宮毘羅大將．跋折羅大將．迷佉羅大將、^lb安捺羅大將．安怛羅大將．摩涅羅大將．^pb51因陀羅大將．波異羅大將．摩呼羅大將^lb真達羅大將．招度羅大將．鼻羯羅大將，
^lb此等十二夜叉大將，一一各有七千夜叉以^lb為眷屬，皆同一聲白世尊言：
「我等今者蒙佛^lb威力，得聞世尊藥師琉璃光如來名號已，不^pb52復更有惡道之怖。
我今相與皆同一心，乃至^lb壽盡
歸依佛、歸依法、歸依僧，
皆當荷負一切^lb眾生，為作義利，饒益安樂，
隨於何等村城聚^lb落阿蘭拏處，
若流布此經，若復持彼世尊藥^lb師琉璃光如來名號親近供養者，
我等眷屬^pb53衛護是人，皆使解脫一切苦難，
諸有所求，悉^lb令滿足。」

爾時，世尊讚諸夜叉大將言：
「善哉，善^lb哉！大夜叉將！汝等若念彼世尊藥師琉璃光^lb如來恩德者，當念饒益一切眾生。」
^ck67【呪】


^ck68【阿難問名】

爾時，慧命^lb阿難白佛言：
「世尊！此經何名？云何奉持？」
佛言：^pb54「阿難！此法門者，名為『藥師琉璃光如來本昔^lb所發殊勝大願』，當如是持；
名為『十二夜叉大^lb將自誓』，當如是持；
名為『淨一切業障』，當如是^lb持。」
^ck69【大眾奉行】
時婆伽婆說是語已，
諸菩薩摩訶薩、
諸大^lb聲聞、
國王、大臣、婆羅門、居士，
及一切大眾阿^pb55修羅、揵達婆等，聞佛所說，歡喜奉行。
^lb^lb^lb佛說藥師如來本願經^pb56
^pb1^folio#bhaisajya_srimitra【尸梨蜜多】^bk#bhaisajya_srimitra〔佛說灌頂拔除過罪生死得度經卷第十二〕
^ck0【序】^lb^au〔東晉天竺三藏帛尸梨蜜多羅譯〕
^ck1【敘事證信】^lb灌頂章句拔除過罪生死得度經第十
^lb聞如是：
一時，佛遊

維耶離
音樂樹下，與八千^lb比丘眾、
菩薩三萬六千人俱，
國王、大臣、^pb2人民，及諸天龍八部、鬼神共會說法。
^ck2【禮請】
於是，文^lb殊師利法王子菩薩摩訶薩，承佛威神從座^lb而起，
長跪叉手，前白佛言：
「世尊！願為未來像^lb法眾生，宣揚顯說往昔過去諸佛名字及
清^lb淨國土莊嚴之事，
願為解說得聞法要。」
^ck3【起說】
佛告^pb3文殊師利：
「善哉，善哉！汝大慈無量，愍念罪苦^lb一切眾生，
問此往昔諸佛名字及國土清淨^lb莊嚴之事，利益一切無量眾生，度諸危厄令^lb得安隱。
汝今諦聽、諦受！善思念之！吾當為汝^lb分別說之。」
眾坐諸菩薩摩訶薩無央數眾，及^pb4諸應真、國王、長者、大臣、人民、天龍、鬼神、四輩^lb弟子，皆各默然聽佛所說，莫不歡喜一心樂^lb聞。
^ck4【總標依正】
佛告文殊師利：
「東方去此佛剎
十恒河沙^lb世界，
有佛名曰藥師琉璃光如來、
無所著、至^lb真、等正覺、
明行足、善逝、世間解、無上士、調御^pb5丈夫、
天人師、佛、世尊，度脫生老病死苦患。
^ck5【行願】
此^lb藥師琉璃光，本所修行菩薩道時，發心自^lb誓行十二上願，令一切眾生所求皆得。

^lb^ck6【生佛平等願】
「第一願者，
使我來世得作佛時，自身光明普^lb照十方，
三十二相八十種好而自莊嚴，
令一^pb6切眾生如我無異。
^lb^ck7【開曉事業願】
「第二願者，
使我來世自身猶如瑠璃，
內外明徹淨^lb無瑕穢，
妙色廣大功德巍巍，
安住十方如日^lb照世，
幽冥眾生悉蒙開曉。

^lb^ck8【無盡資生願】
「第三願者，
使我來世
智慧廣大，如海無窮潤^pb7澤枯涸無量眾生普使蒙益，
悉令飽滿無飢^lb渴想，甘食美饍悉持施與。
^lb^ck9【安立大道願】
「第四願者，
使我來世佛道成就，
巍巍堂堂如^lb星中之月，消除生死之雲令無有翳，
明照世^lb界行者見道，熱得清涼解除垢穢。
^pb8^ck10【戒行清淨願】
「第五願者，
使我來世發大精進，
淨持戒地令^lb無濁穢，慎護所受令無缺犯，
亦令一切戒行^lb具足，堅持不犯至無為道。

^lb^ck11【諸根具足願】
「第六願者，
使我來世若有眾生，
諸根毀敗盲^lb者使視，䏊者能聽啞者得語，軁者能申跛者^pb9能行，
如是不完具者悉令具足。
^lb^ck12【身心康樂願】
「第七願者，
使我來世十方世界，
若有苦惱無^lb救護者，我為此等攝大法藥，

令諸疾病皆得^lb除愈，
無復苦患至得佛道。
^lb^ck13【轉女成男願】
「第八願者，
使我來世以善業因緣，
為諸愚冥^pb10無量眾生講宣妙法，
令得度脫入智慧門，普使明了無諸疑惑。
^lb^ck14【回邪歸正願】
「第九願者，
使我來世
摧伏惡魔及諸外道，
顯^lb揚清淨無上道法，使入正真無諸邪僻，迴向^lb菩提八正覺路。
^pb11^ck15【從縛得脫願】
「第十願者，
使我來世
若有眾生，王法所加臨^lb當刑戮，無量怖畏愁憂苦惱。若復鞭撻枷鎖^lb其體，種種恐懼逼切其身，
如是無量諸苦惱^lb等，悉令解脫無有眾難。
^lb^ck16【得妙飲食願】
「第十一願者，
使我來世若
有眾生飢火所惱，

^pb12令得種種甘美飲食，天諸餚饍種種無數，悉^lb以賜與令身充足。
^lb^ck17【得妙衣具願】
「第十二願者，
使我來世
若有貧凍裸露眾生^lb即得衣服，窮乏之者施以珍寶，倉庫盈溢無^lb所乏少。
一切皆受無量快樂，乃至無有一人^pb13受苦，
使諸眾生和顏悅色，形貌端嚴人所憙^lb見，琴瑟鼓吹如是無量最上音聲，施與一切^lb無量眾生。是為十二微妙上願。」
^lb^ck18【總結】
佛告文殊師利：「此藥師琉璃光佛本願功德^lb如是。
^ck19【說略指廣】
我今為汝略說其國莊嚴之事。

^ck20【以西喻東】
此藥師^pb14琉璃光如來國土清淨，無五濁、無愛欲、無意^lb垢，
以白銀琉璃為地，宮殿樓閣悉用七寶，
亦^lb如西方無量壽國無有異也。
^ck21【以伴讚主】
有二菩薩：

一名日曜、二名月淨，
是二菩薩次^lb補佛處。
^ck22【結勸往生】

諸善男子及善女人，亦當願生彼^pb15國土也。」
^ck23【離慳吝】
文殊師利白佛言：「唯願演說藥^lb師琉璃光如來無量功德，饒益眾生令得佛^lb道。」佛言：「若有男子、女人，新破眾魔來入^lb正道，得聞我說是藥師琉璃光如來名字者，^lb魔家眷屬退散馳走，如是無量拔眾生苦，我^pb16今說之。」佛告文殊師利：
「世間有人不解罪福，
^lb慳貪不知布施今世後世當得其福，
世人愚^lb癡
但知貪惜，
寧自割身肉而噉食之，
不肯持^lb錢財布施求後世之福。
世又有人身不衣食，
^lb此大慳貪命終已後，當墮餓鬼及在畜生^pb17中，
^ck24【離貪惜】
聞我說是藥師琉璃光如來名字之時，

無^lb不解脫憂苦者也。
皆作信心貪福畏罪，

人從^lb索頭與頭索眼與眼，
乞妻與妻匃子與子，求^lb金銀珍寶皆大布施一時歡喜，即發無上正^lb真道意。」
^ck25【離毀犯】
佛言：「若復有人受佛淨戒，
遵奉明法^pb18不解罪福，


雖知明經不及中義，不能分別曉^lb了中事，
以自貢高恒常矒憒，
乃與世間眾魔^lb從事，
更作縛著不解行之。
戀著婦女恩愛之^lb情，口為說空行在有中，不能發覺復不自知，
^lb但能論說他人是非，如此人輩皆當墮三^pb19惡道中。
^ck26【離見慢】
聞我說是藥師瑠璃光佛本願功德，

^lb無不歡喜，
念欲捨家行作沙門者也。」
^ck27【離嫉妬】
^lb佛言：「世間有人，好自稱譽皆是貢高，
當墮三^lb惡道中，
後還為人，
作牛馬、奴婢，

生下賤中人，
當^lb乘其力負重而行，困苦疲極亡失人身。
^ck28【斷魔羂】
聞我^pb20說是藥師瑠璃光佛如來本願功德者，
皆當一^lb心歡喜踊躍更作謙敬，即得解脫眾苦之患，
^lb長得歡樂聰明智慧，遠離惡道得生善處，
與^lb善知識共相值遇
無復憂惱，
離諸魔縛長得安隱。」
^ck29【離鬥訟咒詛】
佛言：^lb「世間愚癡人輩，
兩舌、鬪諍、惡口、

罵詈更相嫌^pb21恨。
或就山神樹下鬼神，日月之神南斗北辰^lb諸鬼神，所作諸呪誓。



或作人名字，或作人^lb形像，
或作符書以相厭禱呪咀言說，
^ck30【轉起慈心】
聞我說^lb是藥師瑠璃光佛本願功德，
無不兩作和解，
^lb俱生慈心惡意悉滅，
各各歡喜無復惡念。」
^ck31【往生極樂】
佛^pb22言：「若四輩弟子——比丘、比丘尼、
清信士、清信女——^lb常修月
六齋年三長齋，或晝夜精勤一心苦^lb行，
願欲往生西方阿彌陀佛國者，憶念晝夜，^lb若一日、二日、三日、四日、五日、六日、七日，
^ck32【自然化生】
或復^lb中悔，聞我說是藥師瑠璃光佛本願功德，
盡^pb23其壽命欲終之日，有八菩薩，其名曰：「文殊師^lb利菩薩、觀世音菩薩、得大勢菩薩、無盡意^lb菩薩、寶壇華菩薩、藥王菩薩、藥上菩薩、彌勒^lb菩薩。
如是八菩薩摩訶薩等皆當飛往迎其^lb精神，不經八難生蓮華中，自然音樂而相娛^pb24樂。」
^ck33【上生天國】
佛言：「假使壽命自欲盡時臨終之日，得聞^lb我說是藥師瑠璃光佛本願功德者，命終之^lb後皆得上生天上，

不復歷三惡道中。
^ck34【還生人間】
天上^lb福盡若下生人間，
當為帝王家作子，

^ck35【生剎帝利】
或於豪^lb姓長者居士富貴家生，
皆當端正聰明智慧^pb25高才勇猛。
^ck36【轉生丈夫】
若是女人化成男子，無復憂苦患^lb難者也。」
^ck37【曼殊護持】
佛語文殊：
「我稱譽顯說藥師瑠^lb璃光佛、至真、等正覺，
本所修集無量行願功^lb德如是。」

^ck38【諸天護持】
文殊師利從坐而起，長跪叉手，白佛^lb言：
「世尊！佛去世後，當以此法開化十方一切^pb26眾生，使其受持是經典也。
若有男子女^lb人愛樂是經，受持讀誦宣通之者，復能專念，^lb若一日、二日、三日、四日、五日，乃至七日憶念^lb不忘，
能以好素帛紙書取是經，五色雜綵作囊^lb盛之者，
是時當有諸天善神、四天大王、龍神^pb27八部，當來營衛愛敬此經。

能日日作禮，是持經^lb者不墮橫死，
所在安隱惡氣消滅，
諸魔鬼神^lb亦不中害。」
^ck39【受持儀軌】
佛言：「如是，如是！如汝所說。」文殊師^lb利言：「天尊所說，言無不善。」
佛言：「文殊！^lb若有善男子、善女人等，
發心造立藥師瑠璃^pb28光如來形像，
供養禮拜懸雜色幡蓋，燒香散^lb華歌詠讚歎，
圍繞百匝還本座處，
端坐思惟^lb念藥師瑠璃光佛無量功德。
若有男子、女人，七日七夜菜食長齋，

^ck40【獲福益】
供養禮拜藥師瑠^lb璃光佛，求心中所願者無不獲得。
求長壽得^pb29長壽，
求富饒得富饒，求安隱得安隱，
求男女^lb得男女，
求官位得官位。
^ck41【百怪出現難】
若命過已後，欲生妙^lb樂天上者，亦當禮敬藥師瑠璃光佛、至真、等^lb正覺；若欲上生三十三天者，亦當禮敬^lb瑠璃光佛必得往生；若欲與明師世世相值遇^pb30者，亦當禮敬瑠璃光佛。」

佛告文殊：^lb「若欲生十方妙樂國土者，亦當禮敬瑠^lb璃光佛。欲得生兜率天見彌勒者，亦應禮敬藥師瑠璃光佛。
若欲遠諸邪道，亦應^lb禮敬藥師瑠璃光佛。若夜惡夢鳥鳴百怪蜚^pb31尸邪忤，魍魎鬼神之所嬈者，亦當禮敬^lb藥師瑠璃光佛。
^ck42【一切怖畏難】
若為水火所焚漂者，亦當禮敬^lb藥師瑠璃光佛。若入山谷為虎狼熊羆蒺䔧^lb諸獸象龍，蚖蛇蝮蠍種種雜類，
若有惡心來^lb相向者，心當存念瑠璃光佛，
山中諸難^pb32不能為害。
^ck43【內亂外患難】
若他方怨賊偷竊惡人，怨家債主^lb欲來侵陵，
心當存念瑠璃光佛，則不為^lb害。
^ck44【華報如是】
以善男女禮敬瑠璃光如來^lb功德，所致華報如是，況果報也。
是故，吾今勸^lb請四輩，禮事瑠璃光佛、至真、等正覺。」
^ck45【橫病除愈】
佛告^pb33文殊：「我但為汝略說藥師瑠璃光佛^lb禮敬功德。
若使我廣說是瑠璃光佛無^lb量功德，與一切人求心中所願者，
從^lb一劫至一劫故無不周遍，其世間人若有著床痿黃困^lb篤惡病，
連年累月不差者，聞我說是藥師^pb34瑠璃光佛名字之時，
橫病之厄無不^lb除愈，唯宿殃不請耳。」
^ck46【毀犯墮落難】
佛告文殊：「若男子、^lb女人，
受三自歸，
若五戒、若十戒、
若善信菩薩^lb二十四戒、
若沙門二百五十戒、
若比丘尼五^lb百戒、若菩薩戒，
若破是諸戒，若能至心一^pb35懺悔者，
復聞我說藥師瑠璃光佛，
終不墮^lb三惡道中，必得解脫。




























若人愚癡不受父母師^lb友教誨，不信佛、不信經戒、不信聖僧，應墮三^lb惡道中者，亡失人種受畜生身，聞我說是藥^lb師瑠璃光佛善願功德者，即得解脫。」
佛告文^pb36殊師利：「世有惡人，雖受佛禁戒觸事違犯，
或^lb殺無道、偷竊他人財寶、欺詐妄語、婬他婦女、^lb飲酒、鬪亂兩舌惡口罵詈毀人，
犯戒為惡，^lb復祠祀鬼神，有如是過罪當墮地獄中。
若當^lb屠割，若抱銅柱，若臥鐵床，若鐵鉤出舌，若洋^pb37銅灌口者，
聞我說是藥師瑠璃光佛，無不即^lb得解脫者也。」
佛告文殊：「其世間人豪貴^lb下賤，不信佛、不信經道、不信沙門、不信有須^lb陀洹、不信有斯陀含、不信有阿那含、不信有^lb阿羅漢、不信有辟支佛、不信有十住菩薩、不^pb38信有三世之事、不信有十方諸佛、不信有本^lb師釋迦文佛、不信人死神明更生，善者受^lb福惡者受殃，有如是之罪應墮惡道。
聞^lb我說是藥師瑠璃光佛名字之者，一切過罪^lb自然消滅。」
佛告文殊：「若有善男子、善女^pb39人，聞我說是藥師瑠璃光佛、至真、等正覺，其^lb誰不發無上正真道意，後皆當得作佛。
人居^lb世間仕官不遷，治生不得飢寒困厄，亡失財^lb產無復方計，
聞我說是藥師瑠璃光佛，各各^lb得心中所願，仕官皆得高遷，
財物自然長^pb40益，飲食充饒皆得富貴。
若為縣官之所拘錄，^lb惡人侵枉，若為怨家所得便者，心當存念藥^lb師瑠璃光佛。
^ck47【女人生產難】
若他婦女生產難者，
皆當念是^lb藥師瑠璃光佛，
兒則易生身體平正，無諸疾^lb痛六情完具，聰明智慧壽命得長，
不遭抂橫^pb41善神擁護，不為惡鬼舐其頭也。」
^ck48【問答決定】
佛說是語時，^lb阿難在右邊。佛顧語阿難言：
「汝信我為文殊^lb師利說往昔東方過十恒河沙有佛名藥^lb師瑠璃光本願功德者不？」
阿難白佛言：
「唯，^lb天中天！佛之所說何敢不信耶！」
佛復語阿難^pb42言：
「如世間人，雖有眼耳鼻舌身意，人常用是^lb六事以自迷惑。
但信世間魔邪之言，不信至^lb真至誠度世苦切之語，如是輩人難可開化^lb也。」
阿難白佛言：「世尊！世人多有惡逆下賤之^lb者，
若聞佛說經開人耳目破治人病，除人^pb43闇冥使覩光明，
解人疑結去人重罪，千劫萬^lb劫無復憂患，
皆因佛說是藥師瑠璃光佛本^lb願功德，悉令安隱得其福也。」
^ck49【信謗德失】
佛言：「阿難！汝口^lb為言善，而汝內心狐疑不信我言。
阿難！汝莫^lb作是念，以自毀敗汝之功德。」
佛言：「阿難！我見汝心，我知^pb44汝意，汝知之不？」
阿難即以頭面著地長跪，白^lb佛言：
「審如天中天所說，我造次，聞佛說是藥^lb師瑠璃光極大尊貴，智慧巍巍難可度量，^lb我心有小疑耳，敢不首伏。」
佛言：
「汝智慧狹劣^lb少見少聞，汝聞我說深妙之法無上空義，
應^pb45生信敬貴重之心，必當得至無上正真道^lb也。」
^ck50【信解希有】
文殊問佛言：「世尊！佛說是藥師瑠璃^lb光如來無量功德，
如是不審誰肯信此^lb言者？」
佛答文殊言：「唯有百億諸菩薩摩^lb訶薩當信是言耳，唯有十方三世諸佛當信^pb46是言。」
佛言：「我說是藥師瑠璃光佛如來本願功^lb德，難可得見何況得聞，亦難得說難得書^lb寫亦難得讀。
文殊師利！若有男子、女人，^lb能信是經，受持讀誦書著竹帛，復能為他人^lb解說中義，此皆先世已發道意，
今復得聞此^pb47微妙法，開化十方無量眾生，^lb當知此人必當得至無上正真道也。」






^ck51【功德無盡】
佛告阿難：「我作佛以^lb來，從生死復至生死，勤苦累劫無所不經無^lb所不歷，
無所不作無所不為，如是不可思議，
^lb況復瑠璃光佛本願功德者乎！
汝所以^pb48有疑者，亦復如是。
「阿難！汝聞佛所說，汝諦信^lb之莫作疑惑。
佛語至誠，無有虛偽亦無二言，^lb佛為信者施，不為疑者說也。
「阿難！汝莫作小^lb疑以毀大乘之業，汝却後亦當發摩訶衍心，^lb莫以小道毀汝功德也。」
阿難言：「唯唯，^pb49天中天！我從今日以去無復爾心，唯佛自當^lb知我心耳。」
佛語阿難：「此經能照諸天宮宅，若^lb三災起時，中有天人發心念此瑠璃光^lb佛本願功德經者，皆得離於彼處之難；
是經^lb能除水涸不調；是經能除他方逆賊悉令斷^pb50滅，四方夷狄各還正治不相嬈惱，國土交通^lb人民歡樂；
是經能除穀貴飢凍；是經能滅惡^lb星變怪；是經能除疫毒之病；是經能救三惡^lb道苦，地獄餓鬼畜生等苦。
若人得聞此經典^lb者，無不解脫厄難者也。」
^ck52【說延壽法】
爾時，眾中有一菩薩^pb51名曰救脫，從座而起整衣服，叉手合掌而^lb白佛言：
「我等今日聞佛世尊演說過東方^lb十恒河沙世界有佛號瑠璃光，一切眾^lb會靡不歡喜。」
^ck53【病患垂危】



^ck54【引其神識】

^ck55【神識受報】




^ck56【作福續命】


^ck57【勵力行善】
救脫菩薩又白佛言：「若族姓^lb男女其有尫羸，著床痛惱無救護者，
我今當^pb52勸請眾僧，七日七夜齋戒一心，受持八禁^lb六時行道，
四十九遍讀是經典，勸然七層之^lb燈，
亦勸懸五色續命神幡。」
^ck58【結勸】


^ck59【明延壽儀】
阿難問救脫菩薩^lb言：
「續命幡燈法則云何？」
^ck60【答延壽儀】
救脫菩薩語阿難言：
^lb「神幡五色，四十九尺，燈亦復爾。
七層之燈，一^pb53層七燈，燈如車輪。
若遭厄難閉在牢獄枷鎖^lb著身，
亦應造立五色神幡、
然四十九燈，
應放^lb雜類眾生至四十九，
可得過度危厄之難，
不^lb為諸橫惡鬼所持。」


^ck61【救國難以延命】










^ck62【救眾難以延命】
救脫菩薩語阿難言：「若國^lb王、大臣，及諸輔相、王子、妃主、中宮、婇女，若為^pb54病苦所惱，亦應造立五色繒幡、然燈續明、救^lb諸生命，散雜色華燒眾名香，王當放赦屈厄^lb之人徒鎖解脫，王得其福天下太平，雨澤以^lb時人民歡樂，惡龍攝毒無病苦者，四方夷狄^lb不生逆害，國土通洞，慈心相向無諸怨害，四^pb55海歌詠稱王之德。
乘此福祿在意所生，見佛^lb聞法信受教誨，從是福報至無上道。」
^ck63【增益已盡之命】
阿難又^lb問救脫菩薩言：
「命可續也？」
救脫菩薩答阿難^lb言：

「我聞世尊說有諸橫，勸造幡蓋令其修福。」
^lb又言：「阿難！昔沙彌救蟻，以修福故，盡其壽命^pb56不更苦患身體安寧，福德力強使之然也。」
阿^lb難因復問救脫菩薩言：「橫有幾種？」
救脫菩薩答阿難言：
^ck64【九種橫死】
「世尊說言^lb橫乃無數，略而言之大橫有九：
一者、橫病；




二^lb者、橫有口舌；
三者、橫遭縣官；
四者、身羸無福，^lb又持戒不完橫為鬼神之所得便；
五者、橫為^pb57劫賊之所剝脫；
六者、橫為水火之所災漂；
七^lb者、橫為雜類禽獸所噉；
八者、橫為怨讎符書^lb厭禱邪神牽引，未得其福，但受其殃先亡牽^lb引，亦名橫死；
九者、有病不治，又不修福，湯藥^lb不順，針炙失度，不值良醫，為病所困於是滅^pb58亡。
又信世間妖㜸之師，為作恐動寒熱言語^lb妄發禍福，所犯者多，心不自正不能自定，卜^lb問覓禍，殺猪狗牛羊種種眾生，解奏神明，呼^lb諸邪妖魍魎鬼神請乞福祚，欲望長生終不^lb能得，愚癡迷惑信邪倒見，死入地獄展轉^pb59其中無解脫時。是名九橫。」
救脫菩薩語阿難言：^lb「其世間人，痿黃之病困篤著床，求生不得求^lb死不得考楚萬端，此病人者或其前世造作^lb惡業，罪過所招殃咎所引故使然也。」
^ck65【結勸修度】
救脫菩^lb薩語阿難言：
「閻羅王者，主領世間名籍之記。
^pb60若人為惡作諸非法，無孝順心造作五逆，破^lb滅三寶無君臣法。又有眾生不持五戒不信^lb正法，設有受者多所毀犯，於是地下鬼神及^lb伺候者奏上五官，五官料簡除死定生，或注^lb錄精神未判是非。
若已定者奏上閻羅，閻羅^pb61監察隨罪輕重考而治之。
世間痿黃之病，困^lb篤不死一絕一生，由其罪福未得料簡，錄其^lb精神在彼王所，或七日、二三七日乃^lb至七七日名籍定者，放其精神還其身中，如^lb從夢中見其善惡。其人若明了者，信驗罪福。
^pb62是故我今勸諸四輩，造續命神旛、然四十九^lb燈、放諸生命，以此旛燈放生功德，拔彼精神^lb令得度苦，今世後世不遭厄難。」
^ck66【藥叉誓護】
救脫菩薩語^lb阿難言：
「如來世尊說是經典，威神功德利益^lb不少。」
座中諸鬼神有十二神王，從座而起往^pb63到佛所，胡跪合掌，白佛言：
「我等十二鬼神^lb在所作護，若城邑聚落空閑林中，若四輩弟^lb子誦持此經，令所結願無求不得。」
阿難問言：^lb「其名云何？為我說之。」
救脫菩薩言：「灌頂章句^lb其名如是：
^pb64「神名金毘羅．神名和耆羅．神名彌佉羅^lb神名安陀羅．神名摩尼羅．神名宋林羅^lb神名因持羅．神名波耶羅．神名摩休羅^lb神名真陀羅．神名照頭羅．神名毘伽羅」
^lb救脫菩薩語阿難言：「此諸鬼神別有七千以^pb65為眷屬，皆悉叉手低頭，
聽佛世尊說是藥師^lb瑠璃光如來本願功德，莫不一時捨鬼神形^lb得受人身，長得度脫無眾惱患。







若人疾急厄^lb難之日，當以五色縷結其名字，得如願已然^lb後解結，令人得福。

灌頂章句法應如是。」
^ck67【呪】
即說^pb66呪曰：
^lb^gatha「南謨鼻殺(所界反)遮．俱嚧吠瑠璃耶．鉢^lb^gatha波喝邏社耶．哆姪他．鼻殺遮．鼻殺遮^lb^gatha娑婆揭帝．薩婆訶」
^lb^ck68【阿難問名】
佛說是經時，比丘僧八千人、諸菩薩三萬^pb67六千人、諸天、龍、鬼神、八部大王無不歡喜。
^lb阿難即從座起，前白佛言：
「世尊、演說此經當^lb何名之？」
佛言：「此經凡有三名：一名『藥師瑠璃^lb光如來本願功德』，
二名『灌頂章句十二神王^lb結願神呪』，
三名『拔除過罪生死得度』。」
^ck69【大眾奉行】
佛說^pb68經竟，
大眾、


人民作禮奉行。
^lb佛說灌頂經卷第十二
^lb^lb^pb69
^pb1^folio#ksitigarbha1【地藏經】^bk#ksitigarbha〔地藏菩薩本願經〕卷上^lb^au〔唐于闐國三藏沙門實叉難陀譯〕
^lb^ck1〔忉利天宮神通品第一〕
^lb如是我聞：
一時，佛在忉利天，為母說法。
爾時，^lb十方無量世界，不可說不可說一切諸佛，及^pb2大菩薩摩訶薩，皆來集會。
讚歎釋迦牟尼佛，^lb能於五濁惡世，現不可思議大智慧神通之^lb力，調伏剛強眾生，知苦樂法，各遣侍者，問訊^lb世尊。
是時，如來含笑，放百千萬億大光明雲——
^lb所謂大圓滿光明雲、大慈悲光明雲、大智慧^pb3光明雲、大般若光明雲、大三昧光明雲、大吉^lb祥光明雲、
大福德光明雲、大功德光明雲、大^lb歸依光明雲、大讚歎光明雲。
放如是等不可^lb說光明雲已，又出種種微妙之音——
所謂檀波^lb羅蜜音、尸波羅蜜音、羼提波羅蜜音、毘離耶^pb4波羅蜜音、禪波羅蜜音、般若波羅蜜音、
慈悲^lb音、喜捨音、解脫音、無漏音、智慧音、大智慧音、^lb師子吼音、大師子吼音、雲雷音、大雲雷音。

出^lb如是等不可說不可說音已，娑婆世界及他^lb方國土，有無量億天龍鬼神，亦集到忉利天^pb5宮。
所謂四天王天、忉利天、須焰摩天、兜率陀^lb天、化樂天、他化自在天、梵眾天、梵輔天、大梵^lb天、
少光天、無量光天、光音天、少淨天、無量淨^lb天、遍淨天、福生天、福愛天、廣果天、
無想天、無^lb煩天、無熱天、善見天、善現天、色究竟天、摩醯^pb6首羅天，乃至非想非非想處天，
一切天眾、龍^lb眾、鬼神等眾，悉來集會。

復有他方國土，及娑^lb婆世界海神、江神、河神、樹神、山神、地神、川澤^lb神、苗稼神、晝神、
夜神、空神、天神、飲食神、草木^lb神，如是等神，皆來集會。

復有他方國土，及娑^pb7婆世界諸大鬼王——
所謂惡目鬼王、噉血鬼王、^lb噉精氣鬼王、噉胎卵鬼王、行病鬼王、攝毒鬼^lb王、慈心鬼王、福利鬼王、大愛敬鬼王，如是等^lb鬼王，皆來集會。

爾時，釋迦牟尼佛告文殊師^lb利法王子菩薩摩訶薩：
「汝觀是一切諸佛菩^pb8薩，及天龍鬼神，此世界，他世界，此國土，他國^lb土，如是今來集會，到忉利天者，汝知數不？」
文^lb殊師利白佛言：「世尊！若以我神力，千劫測度，^lb不能得知。」
佛告文殊師利：「吾以佛眼觀故，猶^lb不盡數。
此皆是地藏菩薩久遠劫來，已度、當^pb9度、未度，已成就、當成就、未成就。」
文殊師利白^lb佛言：「世尊！我已過去久修善根，證無礙智，聞^lb佛所言，即當信受。
小果聲聞、天龍八部，及未^lb來世諸眾生等，雖聞如來誠實之語，必懷疑^lb惑，設使頂受，未免興謗。
唯願世尊，廣說地藏^pb10菩薩摩訶薩因地作何行、立何願，而能成就^lb不思議事？」
佛告文殊師利：「譬如三千大千世^lb界，所有草木叢林，稻麻竹葦，山石微塵，
一物^lb一數，作一恒河，一恒河沙，一沙一界。
一界之^lb內，一塵一劫，一劫之內，所積塵數，盡克為劫。
^pb11地藏菩薩證十地果位已來，千倍多於上喻。
^lb何況地藏菩薩在聲聞、辟支佛地。
文殊師利！^lb此菩薩威神誓願，不可思議。
若未來世，有善^lb男子、善女人，聞是菩薩名字，或讚歎，或瞻禮，^lb或稱名，或供養，
乃至彩畫、刻鏤、塑漆形像，是^pb12人當得百返生於三十三天，永不墮惡道。

「文^lb殊師利！是地藏菩薩摩訶薩，於過去久遠不^lb可說不可說劫前，身為大長者子。
時世有佛，^lb號曰師子奮迅具足萬行如來。
時長者子，見^lb佛相好，千福莊嚴，因問彼佛：『作何行願，而得^pb13此相？』
時師子奮迅具足萬行如來告長者子：^lb『欲證此身，當須久遠度脫一切受苦眾生。』
「文^lb殊師利！時長者子，因發願言：
『我今盡未來際^lb不可計劫，為是罪苦六道眾生，廣設方便，盡^lb令解脫，而我自身，方成佛道。』
以是於彼佛前，^pb14立斯大願，于今百千萬億那由他不可說劫，^lb尚為菩薩。

「又於過去，不可思議阿僧祇劫，時^lb世有佛，號曰覺華定自在王如來。
彼佛壽命，^lb四百千萬億阿僧祇劫。
像法之中，有一婆羅^lb門女，宿福深厚，眾所欽敬；行住坐臥，諸天衛^pb15護。
其母信邪，常輕三寶。
是時聖女，廣說方便，^lb勸誘其母，令生正見。
而此女母，未全生信，不^lb久命終，魂神墮在無間地獄。
時婆羅門女，知^lb母在世不信因果，計當隨業，必生惡趣。
遂賣^lb家宅，廣求香華，及諸供具，於先佛塔寺，大興^pb16供養。
見覺華定自在王如來，其形像在一寺^lb中，塑畫威容，端嚴畢備。
時婆羅門女，瞻禮尊^lb容，倍生敬仰。
私自念言：『佛名大覺，具一切智，^lb若在世時，我母死後，儻來問佛，必知處所。』
時^lb婆羅門女，垂泣良久，瞻戀如來。
忽聞空中聲^pb17曰：『泣者聖女！勿至悲哀，我今示汝母之去處。』
^lb婆羅門女合掌向空，而白空曰：『是何神德，寬^lb我憂慮。
我自失母已來，晝夜憶戀，無處可問^lb知母生界。』
時空中有聲，再報女曰：『我是汝^lb所瞻禮者，過去覺華定自在王如來。
見汝憶母，^pb18倍於常情眾生之分，故來告示。』
婆羅門女聞^lb此聲已，舉身自撲，支節皆損。
左右扶侍，良久^lb方穌，而白空曰：『願佛慈愍，速說我母生界。
我^lb今身心，將死不久。』
時覺華定自在王如來告^lb聖女曰：
『汝供養畢，但早返舍。端坐思惟吾之^pb19名號，即當知母所生去處。』
「時婆羅門女，尋禮^lb佛已，即歸其舍。
以憶母故，端坐念覺華定自^lb在王如來，經一日一夜。
忽見自身，到一海邊。
^lb其水涌沸，多諸惡獸，盡復鐵身，飛走海上，東^lb西馳逐。
見諸男子女人，百千萬數，出沒海中，^pb20被諸惡獸爭取食噉。
又見夜叉，其形各異，或^lb多手多眼，多足多頭，口牙外出，利刃如劍，
驅^lb諸罪人，使近惡獸，復自搏攫，頭足相就。
其形^lb萬類，不敢久視。
時婆羅門女，以念佛力故，自^lb然無懼。

「有一鬼王，名曰無毒，稽首來迎，白聖^pb21女曰：
『善哉！菩薩何緣來此？』
時婆羅門女問鬼^lb王曰：『此是何處？』
無毒答曰：『此是大鐵圍山西^lb面第一重海。』
聖女問曰：『我聞鐵圍之內，地獄^lb在中，是事實不？』
無毒答曰：『實有地獄。』
聖女問^lb曰：『我今云何，得到獄所？』
無毒答曰：『若非威神，^pb22即須業力，非此二事，終不能到。』
聖女又問：『此^lb水何緣，而乃涌沸？多諸罪人，及以惡獸？』
無毒^lb答曰：『此是閻浮提造惡眾生新死之者，經四^lb十九日後，
無人繼嗣為作功德，救拔苦難，生^lb時又無善因，當據本業所感地獄，自然先渡^pb23此海。
海東十萬由旬，又有一海，其苦倍此。
彼^lb海之東，又有一海，其苦復倍。
三業惡因之所^lb招感，共號業海，其處是也。』
聖女又問鬼王無^lb毒曰：『地獄何在？』
無毒答曰：『三海之內，是大地^lb獄，其數百千，各各差別。
所謂大者，具有十八。
^pb24次有五百，苦毒無量。
次有千百，亦無量苦。』
聖^lb女又問大鬼王曰：『我母死來未久，不知魂神^lb當至何趣？』
鬼王問聖女曰：『菩薩之母，在生習^lb何行業？』
聖女答曰：『我母邪見，譏毀三寶。設或^lb暫信，旋又不敬。死雖日淺，未知生處。』
無毒問^pb25曰：『菩薩之母，姓氏何等？』
聖女答曰：『我父我母，^lb俱婆羅門種。
父號尸羅善現，母號悅帝利。』
無^lb毒合掌，啟菩薩曰：『願聖者却返本處，無至憂^lb憶悲戀。
悅帝利罪女，生天以來，經今三日。
云^lb承孝順之子，為母設供、修福，布施覺華定自^pb26在王如來塔寺。
非唯菩薩之母得脫地獄，應^lb是無間罪人，此日悉得受樂，俱同生訖。』鬼王^lb言畢，合掌而退。
婆羅門女，尋如夢歸。
悟此事^lb已，便於覺華定自在王如來塔像之前，立弘^lb誓願：
『願我盡未來劫，應有罪苦眾生，廣設方^pb27便，使令解脫。』」
佛告文殊師利：「時鬼王無毒者，^lb當今財首菩薩是。
婆羅門女者，即地藏菩薩^lb是。」
^lb^ck2〔分身集會品第二〕
^lb爾時，百千萬億不可思、不可議、不可量、不可^pb28說、無量阿僧祇世界，所有地獄處，
分身地藏^lb菩薩，俱來集在忉利天宮。
以如來神力故，各^lb以方面，與諸得解脫從業道出者，
亦各有千^lb萬億那由他數，共持香華，來供養佛。
彼諸同^lb來等輩，皆因地藏菩薩教化，永不退轉於阿^pb29耨多羅三藐三菩提。
是諸眾等，久遠劫來，流^lb浪生死，六道受苦，暫無休息。
以地藏菩薩廣^lb大慈悲，深誓願故，各獲果證。
既至忉利，心懷^lb踊躍，瞻仰如來，目不暫捨。

爾時，世尊舒金色^lb臂，摩百千萬億不可思、不可議、不可量、不可^pb30說、
無量阿僧祇世界諸分身地藏菩薩摩訶^lb薩頂，而作是言：
「吾於五濁惡世，教化如是剛^lb強眾生，令心調伏，捨邪歸正。
十有一二，尚惡^lb習在。
吾亦分身千百億，廣設方便。
或有利根，^lb聞即信受。
或有善果，勤勸成就。
或有暗鈍，久^pb31化方歸。
或有業重，不生敬仰。
如是等輩眾生，^lb各各差別，分身度脫。
或現男子身，或現女人^lb身，或現天龍身，或現神鬼身，或現山林川原、^lb河池泉井，利及於人，悉皆度脫。
或現天帝身，^lb或現梵王身，或現轉輪王身，或現居士身，或^pb32現國王身，
或現宰輔身，或現官屬身，或現比^lb丘、比丘尼、優婆塞、優婆夷身，
乃至聲聞、羅漢、^lb辟支佛、菩薩等身，而以化度。
非但佛身，獨現^lb其前。
汝觀吾累劫勤苦，度脫如是等難化剛^lb強罪苦眾生。
其有未調伏者，隨業報應。
若墮^pb33惡趣，受大苦時，汝當憶念吾在忉利天宮，殷^lb勤付囑。
令娑婆世界，至彌勒出世已來眾生，^lb悉使解脫，永離諸苦，遇佛授記。」
爾時，諸世界^lb分身地藏菩薩，共復一形，涕淚哀戀，白其佛^lb言：
「我從久遠劫來，蒙佛接引，使獲不可思議^pb34神力，具大智慧。
我所分身，遍滿百千萬億恒^lb河沙世界。
每一世界，化百千萬億身。
每一身，^lb度百千萬億人，令歸敬三寶，永離生死，至涅^lb槃樂。
但於佛法中，所為善事，一毛一渧，一沙^lb一塵，或毫髮許，我漸度脫，使獲大利。
唯願世^pb35尊不以後世惡業眾生為慮。」如是三白佛言：^lb「唯願世尊不以後世惡業眾生為慮。」
爾時，佛^lb讚地藏菩薩言：「善哉！善哉！吾助汝喜。
汝能成^lb就久遠劫來，發弘誓願，廣度將畢，即證菩提。」
^lb^ck3〔觀眾生業緣品第三〕
^pb36爾時，佛母摩耶夫人，恭敬合掌，問地藏菩薩^lb言：
「聖者！閻浮眾生，造業差別，所受報應，其事^lb云何？」
地藏答言：「千萬世界，乃及國土，或有地^lb獄，或無地獄，或有女人，或無女人，或有佛法，
^lb或無佛法，乃至聲聞、辟支佛，亦復如是。
非但^pb37地獄，罪報一等。」
摩耶夫人重白菩薩：「且願聞^lb於閻浮罪報，所感惡趣。」
地藏答言：「聖母！唯願^lb聽受，我麁說之。」佛母白言：「願聖者說。」
爾時，地^lb藏菩薩白聖母言：「南閻浮提罪報，名號如是：
^lb若有眾生，不孝父母，或至殺害，當墮無間地^pb38獄，千萬億劫，求出無期。
若有眾生，出佛身血，^lb毀謗三寶，不敬尊經，亦當墮於無間地獄，千^lb萬億劫，求出無期。`)