jsonp(3,{"name":"dc","start":3172},`若有眾生，出佛身血，^lb毀謗三寶，不敬尊經，亦當墮於無間地獄，千^lb萬億劫，求出無期。
若有眾生，侵損常住，點污^lb僧尼，或伽藍內，恣行淫欲，或殺或害，
如是等^lb輩，當墮無間地獄，千萬億劫，求出無期。
若有^pb39眾生，偽作沙門，心非沙門，破用常住，欺誑白^lb衣，違背戒律，種種造惡，
如是等輩，當墮無間^lb地獄，千萬億劫，求出無期。
若有眾生，偷竊常^lb住財物穀米、飲食衣服，乃至一物不與取者，^lb當墮無間地獄，千萬億劫，求出無期。」
地藏白^pb40言：「聖母！若有眾生，作如是罪，當墮五無間地^lb獄，求暫停苦，一念不得。」
摩耶夫人重白地藏^lb菩薩言：「云何名為無間地獄？」
地藏白言：「聖母！^lb諸有地獄，在大鐵圍山之內。
其大地獄，有一^lb十八所。
次有五百，名號各別。
次有千百，名字^pb41亦別。
無間獄者，其獄城，周匝八萬餘里，其城^lb純鐵，高一萬里，城上火聚，少有空缺。
其獄城^lb中，諸獄相連，名號各別。

「獨有一獄，名曰無間。
^lb其獄周匝萬八千里，獄墻高一千里，悉是鐵^lb為，上火徹下，下火徹上，鐵蛇鐵狗，
吐火馳逐，^pb42獄墻之上，東西而走。
獄中有床，遍滿萬里。
一^lb人受罪，自見其身，遍臥滿床。
千萬人受罪，亦^lb各自見，身滿床上。
眾業所感，獲報如是。
又諸^lb罪人，備受眾苦。
千百夜叉，及以惡鬼，口牙如^lb劍，眼如電光，手復銅爪，拖拽罪人。
復有夜叉，^pb43執大鐵戟，中罪人身，或中口鼻，或中腹背，拋^lb空翻接，或置床上。
復有鐵鷹，啗罪人目。
復有^lb鐵蛇，繳罪人頸。
百肢節內，悉下長釘，拔舌耕^lb犁，抽腸剉斬，洋銅灌口，熱鐵纏身。
萬死千生，^lb業感如是。
動經億劫，求出無期。
此界壞時，寄^pb44生他界。
他界次壞，轉寄他方。
他方壞時，展轉^lb相寄。
此界成後，還復而來。
無間罪報，其事如^lb是。

「又五事業感，故稱無間。
何等為五？一者，日^lb夜受罪，以至劫數，無時間絕，故稱無間。
二者，^lb一人亦滿，多人亦滿，故稱無間。
三者，罪器叉^pb45棒，鷹蛇狼犬，碓磨鋸鑿，剉斫鑊湯，鐵網鐵繩，^lb鐵驢鐵馬，生革絡首，
熱鐵澆身，飢吞鐵丸，渴^lb飲鐵汁。
從年竟劫，數那由他，苦楚相連，更無^lb間斷，故稱無間。
四者，不問男子女人，羗胡夷^lb狄，老幼貴賤，或龍或神，或天或鬼，罪行業感，^pb46悉同受之，故稱無間。
五者，若墮此獄，從初入^lb時，至百千劫，一日一夜，萬死萬生。
求一念間，^lb暫住不得。
除非業盡，方得受生。
以此連綿，故^lb稱無間。」
地藏菩薩白聖母言：「無間地獄，麁說^lb如是。
若廣說地獄罪器等名，及諸苦事，一劫^pb47之中，求說不盡。」
摩耶夫人聞已，愁憂合掌，頂^lb禮而退。
^lb^ck4〔閻浮眾生業感品第四〕
^lb爾時，地藏菩薩摩訶薩白佛言：
「世尊！我承佛^lb如來威神力故，遍百千萬億世界，分是身形，^pb48救拔一切業報眾生。
若非如來大慈力故，即^lb不能作如是變化。
我今又蒙佛付囑，至阿逸^lb多成佛已來，六道眾生，遣令度脫。
唯然，世尊，^lb願不有慮。」
爾時，佛告地藏菩薩：「一切眾生，未^lb解脫者，性識無定。
惡習結業，善習結果，為善^pb49為惡，逐境而生。
輪轉五道，暫無休息，動經塵^lb劫，迷惑障難。
如魚遊網，將是長流，脫入暫出，^lb又復遭網。
以是等輩，吾當憂念。
汝既畢是往^lb願，累劫重誓，廣度罪輩，吾復何慮？」
說是語時，^lb會中有一菩薩摩訶薩，名定自在王，白佛言：
^pb50「世尊！地藏菩薩累劫已來，各發何願？今蒙世^lb尊，殷勤讚歎。
唯願世尊，略而說之。」
爾時，世尊^lb告定自在王菩薩：「諦聽！諦聽！善思念之，吾當^lb為汝，分別解說。
乃往過去，無量阿僧祇那由^lb他不可說劫，爾時有佛，號一切智成就如來——
^pb51應供、正遍知、明行足、善逝、世間解、無上士、調^lb御丈夫、天人師、佛、世尊，其佛壽命六萬劫。
未^lb出家時，為小國王，與一隣國王為友，同行十^lb善，饒益眾生。
其隣國內，所有人民，多造眾惡。
^lb二王議計，廣設方便。
一王發願，早成佛道，當^pb52度是輩，令使無餘。
一王發願，若不先度罪苦，^lb令是安樂，得至菩提，我終未願成佛。」
佛告定^lb自在王菩薩：「一王發願早成佛者，即一切智^lb成就如來是。
一王發願永度罪苦眾生，未願^lb成佛者，即地藏菩薩是。
復於過去，無量阿僧祇^pb53劫，有佛出世，名清淨蓮華目如來，其佛壽^lb命四十劫。
像法之中，有一羅漢，福度眾生。
因^lb次教化，遇一女人，字曰光目，設食供養。
羅漢^lb問之：『欲願何等？』
光目答言：『我以母亡之日，資^lb福救拔，未知我母生處何趣？』
羅漢愍之，為入^pb54定觀，見光目女母墮在惡趣，受極大苦。
羅漢^lb問光目言：『汝母在生，作何行業？今在惡趣，受^lb極大苦。』
光目答言：『我母所習，唯好食噉魚鼈^lb之屬。
所食魚鼈多食其子，或炒或煮，恣情食^lb噉。
計其命數，千萬復倍。尊者慈愍，如何哀救？』
^pb55羅漢愍之，為作方便，勸光目言：
『汝可志誠念^lb清淨蓮華目如來，兼塑畫形像，存亡獲報。』
「光^lb目聞已，即捨所愛，尋畫佛像，而供養之。
復恭^lb敬心，悲泣瞻禮。
忽於夜後，夢見佛身，金色晃^lb耀，如須彌山，放大光明，而告光目：
『汝母不久，^pb56當生汝家，纔覺飢寒，即當言說。』
「其後家內，婢^lb生一子，未滿三日，而乃言說，稽首悲泣，告於^lb光目：
『生死業緣，果報自受。
吾是汝母，久處暗^lb冥，自別汝來，累墮大地獄。
蒙汝福力，方得受^lb生。
為下賤人，又復短命，壽年十三，更落惡道。
^pb57汝有何計，令吾脫免？』光目聞說，知母無疑，哽^lb咽悲啼，而白婢子：
『既是我母，合知本罪，作何^lb行業，墮於惡道？』
婢子答言：『以殺害毀罵二業^lb受報。
若非蒙福，救拔吾難，以是業故，未合解^lb脫。』
光目問言：『地獄罪報，其事云何？』
婢子答言：^pb58『罪苦之事，不忍稱說，百千歲中，卒白難竟。』
「光^lb目聞已，啼淚號泣，而白空界：『願我之母，永脫^lb地獄。
畢十三歲，更無重罪，及歷惡道。
十方諸^lb佛，慈哀愍我，聽我為母所發廣大誓願：
若得^lb我母永離三塗，及斯下賤，乃至女人之身，永^lb劫不受者，願我自今日後，
對清淨蓮華目如^lb來像前，却後百千萬億劫中，應有世界，所有^lb地獄，及三惡道，
諸罪苦眾生，誓願救拔，令離^lb地獄惡趣、畜生、餓鬼等。
如是罪報等人，盡成^lb佛竟，我然後方成正覺。』
「發誓願已，具聞清淨^pb60蓮華目如來而告之曰：
『光目！汝大慈愍，善能^lb為母發如是大願。
吾觀汝母，十三歲畢，捨此^lb報已，生為梵志，壽年百歲。
過是報後，當生無^lb憂國土，壽命不可計劫。
後成佛果，廣度人天，^lb數如恒河沙。』」
佛告定自在王：「爾時羅漢福度^pb61光目者，即無盡意菩薩是。
光目母者，即解脫^lb菩薩是。
光目女者，即地藏菩薩是。
過去久遠^lb劫中，如是慈愍發恒河沙願，廣度眾生。

「未來^lb世中，若有男子女人，不行善者，行惡者，
乃至不^lb信因果者，邪婬妄語者，兩舌惡口者，
毀謗大^pb62乘者，如是諸業眾生，必墮惡趣。
若遇善知識，^lb勸令一彈指間歸依地藏菩薩，是諸眾生，即^lb得解脫三惡道報。
若能志心歸敬，及瞻禮讚^lb歎，香華衣服，種種珍寶，或復飲食，如是奉事^lb者，
未來百千萬億劫中，常在諸天受勝妙樂。
^pb63若天福盡，下生人間，猶百千劫，常為帝王，能^lb憶宿命因果本末。
定自在王，如是地藏菩薩，^lb有如此不可思議大威神力，廣利眾生，汝等^lb諸菩薩，當記是經，廣宣流布。」
定自在王白佛^lb言：「世尊！願不有慮。
我等千萬億菩薩摩訶薩，^pb64必能承佛威神，廣演是經於閻浮提，利益眾^lb生。」
定自在王菩薩白世尊已，合掌恭敬，作禮^lb而退。

爾時，四方天王，俱從座起，合掌恭敬，白^lb佛言：
「世尊！地藏菩薩於久遠劫來，發如是大^lb願，云何至今，猶度未絕，更發廣大誓言？唯願^pb65世尊，為我等說。」
佛告四天王：「善哉！善哉！吾今^lb為汝，及未來現在天人眾等，廣利益故，說地^lb藏菩薩於娑婆世界，
閻浮提內，生死道中，慈^lb哀救拔，度脫一切罪苦眾生方便之事。」
四天^lb王言：「唯然，世尊！願樂欲聞。」
佛告四天王：「地藏^pb66菩薩久遠劫來，迄至于今，度脫眾生，猶未畢^lb願。
慈愍此世罪苦眾生，復觀未來無量劫中，^lb因蔓不斷，以是之故，又發重願。
如是菩薩，於^lb娑婆世界，閻浮提中，百千萬億方便，而為教^lb化。

「四天王！地藏菩薩若遇殺生者，說宿殃短^pb67命報。
若遇竊盜者，說貧窮苦楚報。
若遇邪婬^lb者，說雀鴿鴛鴦報。
若遇惡口者，說眷屬鬪諍^lb報。
若遇毀謗者，說無舌瘡口報。
若遇瞋恚者，^lb說醜陋癃殘報。
若遇慳悋者，說所求違願報。
^lb若遇飲食無度者，說飢渴咽病報。
若遇畋獵^pb68恣情者，說驚狂喪命報。
若遇悖逆父母者，說^lb天地災殺報。
若遇燒山林木者，說狂迷取死^lb報。
若遇前後父母惡毒者，說返生鞭撻現受^lb報。
若遇網捕生雛者，說骨肉分離報。
若遇毀^lb謗三寶者，說盲聾瘖瘂報。
若遇輕法慢教者，^pb69說永處惡道報。
若遇破用常住者，說億劫輪^lb迴地獄報。
若遇污梵誣僧者，說永在畜生報。
^lb若遇湯火斬斫傷生者，說輪迴遞償報。
若遇^lb破戒犯齋者，說禽獸飢餓報。
若遇非理毀用^lb者，說所求闕絕報。
若遇吾我貢高者，說卑使^pb70下賤報。
若遇兩舌鬪亂者，說無舌百舌報。
若^lb遇邪見者，說邊地受生報。

「如是等閻浮提眾^lb生，身口意業，惡習結果，百千報應，今麁略說。
^lb如是等閻浮提眾生，業感差別，地藏菩薩百^lb千方便，而教化之。
是諸眾生，先受如是等報，^pb71後墮地獄，動經劫數，無有出期。
是故汝等，護^lb人護國，無令是諸眾業，迷惑眾生。」
四天王聞^lb已，涕淚悲歎，合掌而退。
^lb^ck5〔地獄名號品第五〕
^lb爾時，普賢菩薩摩訶薩白地藏菩薩言：「仁者！^pb72願為天龍四眾，及未來現在一切眾生，
說娑^lb婆世界及閻浮提罪苦眾生，所受報處地獄^lb名號，及惡報等事，使未來世末法眾生，知是^lb果報。」
地藏答言：「仁者！我今承佛威神，及大士^lb之力，略說地獄名號，及罪報惡報之事。
仁者，^pb73閻浮提東方有山，號曰鐵圍，其山黑邃，無日^lb月光。
有大地獄，號極無間。
又有地獄，名大阿^lb鼻。
復有地獄，名曰四角。
復有地獄，名曰飛刀。
^lb復有地獄，名曰火箭。
復有地獄，名曰夾山。
復^lb有地獄，名曰通槍。
復有地獄，名曰鐵車。
復有^lb地獄，名曰鐵床。
復有地獄，名曰鐵牛。
復有地^lb獄，名曰鐵衣。
復有地獄，名曰千刃。
復有地獄，^lb名曰鐵驢。
復有地獄，名曰洋銅。
復有地獄，名^lb曰抱柱。
復有地獄，名曰流火。
復有地獄，名曰^lb耕舌。
復有地獄，名為剉首。
復有地獄，名曰燒^lb脚。
復有地獄，名曰啗眼。
復有地獄，名曰鐵丸。
^lb復有地獄，名曰諍論。
復有地獄，名曰鐵鈇。
復^lb有地獄，名曰多瞋。」
地藏白言：「仁者！鐵圍之內，有^lb如是等地獄，其數無限。
更有叫喚地獄、拔舌^lb地獄、糞尿地獄、銅鎖地獄、火象地獄、火狗地^pb76獄、火馬地獄、火牛地獄、
火山地獄、火石地獄、^lb火床地獄、火梁地獄、火鷹地獄、鋸牙地獄、剝^lb皮地獄、飲血地獄、
燒手地獄、燒脚地獄、倒刺^lb地獄、火屋地獄、鐵屋地獄、火狼地獄。
如是等^lb地獄，其中各各復有諸小地獄，或一或二，或^pb77三或四，乃至百千。
其中名號，各各不同。」
地藏^lb菩薩告普賢菩薩言：「仁者！此者皆是南閻浮^lb提行惡眾生，業感如是。
業力甚大，能敵須彌，^lb能深巨海，能障聖道。
是故眾生莫輕小惡，以^lb為無罪，死後有報，纖毫受之。
父子至親，岐路^pb78各別，縱然相逢，無肯代受。
我今承佛威力，略^lb說地獄罪報之事。
唯願仁者，暫聽是言。」
普賢^lb答言：「吾已久知三惡道報，望仁者說，令後世^lb末法一切惡行眾生，聞仁者說，使令歸佛。」
地^lb藏白言：「仁者！地獄罪報，其事如是：或有地獄，^pb79取罪人舌，使牛耕之。
或有地獄，取罪人心，夜^lb叉食之。
或有地獄，鑊湯盛沸，煮罪人身。
或有^lb地獄，赤燒銅柱，使罪人抱。
或有地獄，使諸火^lb燒，趁及罪人。
或有地獄，一向寒氷。
或有地獄，^lb無限糞尿。
或有地獄，純飛𨪏鏫。
或有地獄，多^pb80攢火槍。
或有地獄，唯撞胸背。
或有地獄，但燒^lb手足。
或有地獄，盤繳鐵蛇。
或有地獄，驅逐鐵^lb狗。
或有地獄，盡駕鐵騾。
仁者，如是等報，各各^lb獄中，有百千種業道之器，無非是銅，是鐵，是^lb石，是火。
此四種物，眾業行感。
若廣說地獄罪^pb81報等事，一一獄中，更有百千種苦楚，何況多^lb獄。
我今承佛威神，及仁者問，略說如是。
若廣^lb解說，窮劫不盡。」
^lb^ck6〔如來讚歎品第六〕
^lb爾時，世尊舉身放大光明，遍照百千萬億恒^pb82河沙等諸佛世界，出大音聲，
普告諸佛世界^lb一切諸菩薩摩訶薩，及天龍鬼神、人、非人等：
^lb「聽吾今日稱揚讚歎地藏菩薩摩訶薩，於十^lb方世界，現大不可思議威神慈悲之力，救護^lb一切罪苦之事。
吾滅度後，汝等諸菩薩大士，^pb83及天龍鬼神等，廣作方便，衛護是經，令一切^lb眾生，證涅槃樂。」
說是語已，會中有一菩薩，名^lb曰普廣，合掌恭敬，而白佛言：
「今見世尊讚歎^lb地藏菩薩，有如是不可思議大威神德。
唯願^lb世尊為未來世末法眾生，宣說地藏菩薩利^pb84益人天因果等事，使諸天龍八部，及未來世^lb眾生，頂受佛語。」
爾時，世尊告普廣菩薩及四眾^lb等：「諦聽！諦聽！吾當為汝略說地藏菩薩利^lb益人天福德之事。」
普廣白言：「唯然，世尊！願樂^lb欲聞。」
佛告普廣菩薩：「未來世中，若有善男子、^pb85善女人，聞是地藏菩薩摩訶薩名者，
或合掌^lb者、讚歎者、作禮者、戀慕者，是人超越三十劫^lb罪。

「普廣！若有善男子、善女人，或彩畫形像，或^lb土石膠漆，金、銀、銅、鐵，
作此菩薩，一瞻一禮者，^lb是人百返生於三十三天，永不墮於惡道。
假^pb86如天福盡故，下生人間，猶為國王，不失大利。
^lb若有女人，厭女人身，盡心供養地藏菩薩畫^lb像，及土石膠漆銅鐵等像，
如是日日不退，常^lb以華、香、飲食、衣服、繒綵、幢旛、錢、寶物等供養。
^lb是善女人，盡此一報女身，百千萬劫，更不生^pb87有女人世界，何況復受？
除非慈願力故，要受^lb女身，度脫眾生。
承斯供養地藏力故，及功德^lb力，百千萬劫，不受女身。

「復次，普廣！若有女人，^lb厭是醜陋、多疾病者，但於地藏像前，志心瞻^lb禮，食頃之間，
是人千萬劫中，所受生身，相貌^pb88圓滿。
是醜陋女人，如不厭女身，即百千萬億^lb生中，常為王女，乃及王妃、宰輔大姓、大長者^lb女，端正受生，諸相圓滿。
由志心故，瞻禮地藏菩^lb薩，獲福如是。

「復次，普廣！若有善男子、善女人，能^lb對菩薩像前，作諸伎樂，及歌詠讚歎，香華供^pb89養，
乃至勸於一人多人，如是等輩，現在世中，^lb及未來世，常得百千鬼神日夜衛護，不令惡^lb事輒聞其耳，何況親受諸橫？
「復次，普廣！未來^lb世中，若有惡人，及惡神惡鬼，見有善男子、善^lb女人歸敬供養讚歎瞻禮地藏菩薩形像，
或^pb90妄生譏毀，謗無功德及利益事，或露齒笑，或^lb背面非，或勸人共非，或一人非，或多人非，
乃^lb至一念生譏毀者，如是之人，賢劫千佛滅度，^lb譏毀之報，尚在阿鼻地獄，受極重罪。
過是劫^lb已，方受餓鬼。
又經千劫，復受畜生。
又經千劫，^pb91方得人身。
縱受人身，貧窮下賤，諸根不具，多^lb被惡業，來結其心，不久之間，復墮惡道。
是故，^lb普廣！譏毀他人供養，尚獲此報，何況別生惡^lb見毀滅？
「復次，普廣！若未來世，有男子女人，久^lb處床枕，求生求死，了不可得，或夜夢惡鬼，乃^pb92及家親，
或遊險道，或多魘寐，共鬼神遊，日月^lb歲深，轉復尫瘵，眠中叫苦，慘悽不樂者，
此皆^lb是業道論對，未定輕重，或難捨壽，或不得愈。
^lb男女俗眼，不辨是事。
但當對諸佛菩薩像前，^lb高聲轉讀此經一遍。
或取病人可愛之物，或^pb93衣服寶貝、莊園舍宅，對病人前，高聲唱言：
『我^lb某甲等，為是病人，對經像前，捨諸等物，或供^lb養經像，或造佛菩薩形像，或造塔寺，或然油^lb燈，或施常住。』如是三白病人，遣令聞知。
假令^lb諸識分散，至氣盡者，乃至一日、二日、三日、四^pb94日，至七日已來，但高聲白，高聲讀經。
是人命^lb終之後，宿殃重罪，至于五無間罪，永得解脫。
^lb所受生處，常知宿命。
何況善男子、善女人，自^lb書此經，或教人書，或自塑畫菩薩形像，乃至^lb教人塑畫，所受果報，必獲大利。

「是故，普廣！若^pb95見有人讀誦是經，乃至一念讚歎是經，或恭^lb敬者，
汝須百千方便，勸是等人，勤心莫退，能^lb得未來現在千萬億不可思議功德。

「復次，普^lb廣！若未來世諸眾生等，或夢或寐，見諸鬼神^lb乃及諸形，或悲或啼，或愁或歎，或恐或怖。
此^pb96皆是一生十生，百生千生，過去父母、男女弟^lb妹、夫妻眷屬，在於惡趣，未得出離，
無處希望^lb福力救拔，當告宿世骨肉，使作方便，願離惡^lb道。
普廣！汝以神力，遣是眷屬，令對諸佛菩薩^lb像前，志心自讀此經，或請人讀。
其數三遍，或^pb97七遍。
如是惡道眷屬，經聲畢是遍數，當得解^lb脫。
乃至夢寐之中，永不復見。

「復次，普廣！若未^lb來世有諸下賤等人，或奴或婢，乃至諸不自^lb由之人，
覺知宿業，要懺悔者，志心瞻禮地藏^lb菩薩形像，乃至一七日中，念菩薩名，可滿萬^pb98遍。
如是等人，盡此報後，千萬生中，常生尊貴，^lb更不經三惡道苦。

「復次，普廣！若未來世中，閻^lb浮提內，剎利、婆羅門、長者、居士、一切人等，
及^lb異姓種族，有新產者，或男或女，七日之中，早^lb與讀誦此不思議經典，更為念菩薩名，可滿^pb99萬遍。
是新生子，或男或女，宿有殃報，便得解^lb脫，安樂易養，壽命增長。
若是承福生者，轉增^lb安樂，及與壽命。

「復次，普廣！若未來世眾生，於^lb月一日、八日、十四日、十五日、十八日、二十三、
^lb二十四、二十八、二十九日，乃至三十日，
是諸^pb100日等，諸罪結集，定其輕重。
南閻浮提眾生，舉^lb止動念，無不是業，無不是罪，何況恣情殺害、^lb竊盜、邪婬、妄語，百千罪狀？
能於是十齋日，對^lb佛菩薩諸賢聖像前，讀是經一遍，東西南北，^lb百由旬內，無諸災難。
當此居家，若長若幼，現^pb101在未來百千歲中，永離惡趣。
能於十齋日每^lb轉一遍，現世令此居家無諸橫病，衣食豐溢。

^lb「是故，普廣！當知地藏菩薩有如是等不可說^lb百千萬億大威神力利益之事。
閻浮眾生，於^lb此大士有大因緣。
是諸眾生，聞菩薩名，見菩^pb102薩像，乃至聞是經，三字五字，或一偈一句者，
^lb現在殊妙安樂，未來之世，百千萬生，常得端^lb正，生尊貴家。」
爾時，普廣菩薩聞佛如來稱揚^lb讚歎地藏菩薩已，胡跪合掌，復白佛言：
「世尊！^lb我久知是大士有如此不可思議神力，及大^pb103誓願力。
為未來眾生，遣知利益，故問如來，唯^lb然頂受。
世尊！當何名此經？使我云何流布？」
佛^lb告普廣：「此經有三名：一名地藏本願，亦名地^lb藏本行，亦名地藏本誓力經。
緣此菩薩，久遠^lb劫來，發大重願，利益眾生，是故汝等，依願流^pb104布。」
普廣聞已，合掌恭敬，作禮而退。
^lb地藏菩薩本願經卷上
^lb音釋
^lb
^pb1^folio#ksitigarbha2^bk#ksitigarbha2<heading=地藏經 hidden=1>【地藏菩薩本願經卷下】
^lb^au【唐于闐國三藏沙門實叉難陀譯】
^lb^ck7〔利益存亡品第七〕
^lb爾時，地藏菩薩摩訶薩白佛言：「世尊！我觀是^lb閻浮眾生，舉心動念，無非是罪。
脫獲善利，多^pb2退初心；若遇惡緣，念念增益。
是等輩人，如履^lb泥塗，負於重石，漸困漸重，足步深邃。
若得遇^lb知識，替與減負，或全與負，是知識有大力故，^lb復相扶助，勸令牢脚，若達平地，須省惡路，無^lb再經歷。

「世尊！習惡眾生，從纖毫間，便至無量。
^pb3是諸眾生，有如此習，臨命終時，父母眷屬宜^lb為設福，以資前路。
或懸旛蓋，及然油燈，或轉^lb讀尊經，或供養佛像及諸聖像。
乃至念佛菩^lb薩及辟支佛名字，一名一號，歷臨終人耳根，^lb或聞在本識。
是諸眾生所造惡業，計其感果，^pb4必墮惡趣，緣是眷屬為臨終人修此聖因，如^lb是眾罪，悉皆銷滅。
若能更為身死之後，七七^lb日內，廣造眾善，能使是諸眾生，永離惡趣，得^lb生人天，受勝妙樂，現在眷屬，利益無量。

「是故^lb我今對佛世尊，及天龍八部、人、非人等，勸於^pb5閻浮提眾生：
臨終之日，慎勿殺害，及造惡緣——^lb拜祭鬼神，求諸魍魎。
何以故？爾所殺害，乃至^lb拜祭，無纖毫之力利益亡人，但結罪緣，轉增^lb深重。
假使來世，或現在生，得獲聖分，生人天^lb中，緣是臨終被諸眷屬造是惡因，亦令是命^pb6終人，殃累對辯，晚生善處。
何況臨命終人，在^lb生未曾有少善根，各據本業，自受惡趣，何忍^lb眷屬，更為增業？
譬如有人，從遠地來，絕糧三^lb日，所負擔物，強過百斤。
忽遇隣人，更附少物，^lb以是之故，轉復困重。
世尊！我觀閻浮眾生，但^pb7能於諸佛教中，乃至善事，一毛一渧，一沙一^lb塵，如是利益，悉皆自得。」
說是語時，會中有一^lb長者，名曰大辯——是長者，久證無生，化度十方，^lb現長者身——，
合掌恭敬，問地藏菩薩言：
「大士！是^lb南閻浮提眾生，命終之後，小大眷屬，為修功^pb8德，
乃至設齋，造眾善因，是命終人，得大利益^lb及解脫不？」
地藏答言：「長者！我今為未來現在^lb一切眾生，承佛威力，略說是事。
長者，未來現^lb在諸眾生等，臨命終日，得聞一佛名、一菩薩^lb名、一辟支佛名，不問有罪無罪，悉得解脫。

「若^pb9有男子女人，在生不修善因，多造眾罪，命終^lb之後，眷屬小大為造福利一切聖事，
七分之^lb中，而乃獲一，六分功德，生者自利。
以是之故，^lb未來現在善男女等，聞健自修，分分己獲。
無^lb常大鬼，不期而到，冥冥遊神，未知罪福，七七^pb10日內，如癡如聾。
或在諸司，辯論業果，審定之^lb後，據業受生。
未測之間，千萬愁苦，何況墮於^lb諸惡趣等？
是命終人，未得受生，在七七日內，^lb念念之間，望諸骨肉眷屬，與造福力救拔。
過^lb是日後，隨業受報，若是罪人，動經千百歲中，^pb11無解脫日。
若是五無間罪，墮大地獄，千劫萬^lb劫，永受眾苦。

「復次，長者！如是罪業眾生，命終^lb之後，眷屬骨肉，為修營齋，資助業道。
未齋食^lb竟，及營齋之次，米泔菜葉，不棄於地。
乃至諸^lb食未獻佛僧，勿得先食。
如有違食及不精勤，^pb12是命終人，了不得力。
如精勤護淨，奉獻佛僧，^lb是命終人，七分獲一。
是故，長者！閻浮眾生，若^lb能為其父母，乃至眷屬，
命終之後，設齋供養，^lb志心勤懇，如是之人，存亡獲利。」
說是語時，忉^lb利天宮有千萬億那由他閻浮鬼神，悉發無^pb13量菩提之心。
大辯長者，作禮而退。

^lb^ck8〔閻羅王眾讚歎品第八〕
^lb爾時，鐵圍山內，有無量鬼王，與閻羅天子，俱^lb詣忉利，來到佛所。
所謂惡毒鬼王、多惡鬼王、^lb大諍鬼王、白虎鬼王、血虎鬼王、赤虎鬼王、
散^pb14殃鬼王、飛身鬼王、電光鬼王、狼牙鬼王、千眼^lb鬼王、噉獸鬼王、負石鬼王、
主耗鬼王、主禍鬼^lb王、主食鬼王、主財鬼王、主畜鬼王、主禽鬼王、^lb主獸鬼王、
主魅鬼王、主產鬼王、主命鬼王、主^lb疾鬼王、主險鬼王、三目鬼王、四目鬼王、五目^pb15鬼王、
祁利失王、大祁利失王、祁利叉王、大祁^lb利叉王、阿那吒王、大阿那吒王。
如是等大鬼^lb王，各各與百千諸小鬼王，盡居閻浮提，各有^lb所執，各有所主。
是諸鬼王，與閻羅天子，承佛^lb威神，及地藏菩薩摩訶薩力，俱詣忉利，在一^pb16面立。

爾時，閻羅天子，胡跪合掌，白佛言：
「世尊！^lb我等今者與諸鬼王，承佛威神，及地藏菩薩^lb摩訶薩力，
方得詣此忉利大會，亦是我等獲^lb善利故。
我今有小疑事，敢問世尊，唯願世尊，^lb慈悲宣說。」
佛告閻羅天子：「恣汝所問，吾為汝^pb17說。」
是時，閻羅天子瞻禮世尊，及迴視地藏菩^lb薩，而白佛言：
「世尊！我觀地藏菩薩，在六道中，^lb百千方便，而度罪苦眾生，不辭疲倦。
是大菩^lb薩，有如是不可思議神通之事。
然諸眾生，脫^lb獲罪報，未久之間，又墮惡道。
世尊！是地藏菩^pb18薩既有如是不可思議神力，
云何眾生而不^lb依止善道，永取解脫？唯願世尊，為我解說。」
佛^lb告閻羅天子：「南閻浮提眾生，其性剛強，難調^lb難伏。
是大菩薩，於百千劫，頭頭救拔如是眾^lb生，早令解脫。
是罪報人，乃至墮大惡趣。
菩薩^pb19以方便力，拔出根本業緣，而遣悟宿世之事。
^lb自是閻浮眾生，結惡習重，旋出旋入。
勞斯菩^lb薩，久經劫數，而作度脫。

「譬如有人，迷失本家，^lb誤入險道。
其險道中，多諸夜叉，及虎狼師子、^lb蚖蛇蝮蠍。
如是迷人，在險道中，須臾之間，即^pb20遭諸毒。
有一知識，多解大術，善禁是毒，乃及^lb夜叉諸惡毒等。
忽逢迷人，欲進險道，而語之^lb言：
『咄哉！男子！為何事故，而入此路？有何異術，^lb能制諸毒？』
是迷路人，忽聞是語，方知險道，即^lb便退步，求出此路。
是善知識，提携接手，引出^pb21險道，免諸惡毒，至于好道，令得安樂，而語之^lb言：
『咄哉！迷人！自今已後，勿履是道。
此路入者，^lb卒難得出，復損性命。』是迷路人，亦生感重。
臨^lb別之時，知識又言：『若見親知及諸路人，若男^lb若女，言於此路多諸毒惡，喪失性命。
無令是^pb22眾，自取其死。』
「是故地藏菩薩具大慈悲，救拔^lb罪苦眾生，生天人中，令受妙樂。
是諸罪眾，^lb知業道苦，脫得出離，永不再歷。
如迷路人，誤^lb入險道，遇善知識，引接令出，永不復入。
逢見^lb他人，復勸莫入，自言：『因是迷故，得解脫竟，更^pb23不復入。』
若再履踐，猶尚迷誤，不覺舊曾所落^lb險道，或致失命，如墮惡趣。
地藏菩薩方便力^lb故，使令解脫，生人天中。
旋又再入，若業結重，^lb永處地獄，無解脫時。」
爾時，惡毒鬼王合掌恭^lb敬，白佛言：
「世尊！我等諸鬼王，其數無量，在閻^pb24浮提，或利益人，或損害人，各各不同。
然是業^lb報，使我眷屬，遊行世界，多惡少善。
過人家庭，^lb或城邑聚落，莊園房舍。
或有男子女人，修毛^lb髮善事，乃至懸一旛一蓋，少香少華，
供養佛^lb像及菩薩像，或轉讀尊經，燒香供養一句一^pb25偈。
我等鬼王，敬禮是人，如過去、現在、未來諸^lb佛。
勅諸小鬼，各有大力，及土地分，便令衛護。
^lb不令惡事橫事、惡病橫病，乃至不如意事，近^lb於此舍等處，何況入門？」
佛讚鬼王：「善哉！善哉！^lb汝等及與閻羅，能如是擁護善男女等，吾亦^pb26告梵王帝釋，令衛護汝。」
說是語時，會中有一^lb鬼王，名曰主命，白佛言：
「世尊！我本業緣，主閻^lb浮人命，生時死時，我皆主之。
在我本願，甚欲^lb利益。
自是眾生，不會我意，致令生死，俱不得^lb安。

「何以故？是閻浮提人，初生之時，不問男女，^pb27或欲生時，但作善事，增益舍宅。
自令土地無^lb量歡喜，擁護子母，得大安樂，利益眷屬。
或已^lb生下，慎勿殺害，取諸鮮味，供給產母。
及廣聚^lb眷屬，飲酒食肉，歌樂絃管，能令子母，不得安^lb樂。

「何以故？是產難時，有無數惡鬼，及魍魎精^pb28魅，欲食腥血。
是我早令舍宅土地靈祇，荷護^lb子母，使令安樂，而得利益。
如是之人，見安樂^lb故，便合設福，答諸土地。
翻為殺害，集聚眷屬，^lb以是之故，犯殃自受，子母俱損。

「又閻浮提臨^lb命終人，不問善惡，我欲令是命終之人，不落^pb29惡道，何況自修善根，增我力故。
是閻浮提行^lb善之人，臨命終時，亦有百千惡道鬼神，或變^lb作父母，乃至諸眷屬，引接亡人，令落惡道，何^lb況本造惡者？
「世尊！如是閻浮提男子女人，臨^lb命終時，神識惛昧，不辯善惡，乃至眼耳，更無^pb30見聞。
是諸眷屬，當須設大供養，轉讀尊經，念^lb佛菩薩名號。
如是善緣，能令亡者，離諸惡道，^lb諸魔鬼神，悉皆退散。
世尊！一切眾生臨命終^lb時，若得聞一佛名、一菩薩名，或大乘經典一^lb句一偈，我觀如是輩人，
除五無間殺害之罪，^pb31小小惡業，合墮惡趣者，尋即解脫。」
佛告主命^lb鬼王：「汝大慈故，能發如是大願，於生死中，護^lb諸眾生。
若未來世中，有男子女人，至生死時，^lb汝莫退是願，總令解脫，永得安樂。」
鬼王白佛^lb言：「願不有慮，我畢是形，念念擁護閻浮眾生，^pb32生時死時，俱得安樂。
但願諸眾生，於生死時，^lb信受我語，無不解脫，獲大利益。」
爾時，佛告地^lb藏菩薩：「是大鬼王主命者，已曾經百千生，作大^lb鬼王，於生死中，擁護眾生。
是大士，慈悲願^lb故，現大鬼身，實非鬼也。
却後過一百七十劫，^pb33當得成佛，號曰無相如來。
劫名安樂，世界名^lb淨住。
其佛壽命，不可計劫。
地藏！是大鬼王，其^lb事如是，不可思議，所度天人，亦不可限量。」
^lb^ck9〔稱佛名號品第九〕
^lb爾時，地藏菩薩摩訶薩白佛言：「世尊！我今為^pb34未來眾生，演利益事，於生死中，得大利益。
唯^lb願世尊，聽我說之。」
佛告地藏菩薩：「汝今欲興^lb慈悲，救拔一切罪苦六道眾生，演不思議事，^lb今正是時，唯當速說。
吾即涅槃，使汝早畢是^lb願，吾亦無憂現在未來一切眾生。」
地藏菩薩^pb35白佛言：「世尊！過去無量阿僧祇劫，有佛出世，^lb號無邊身如來。
若有男子女人，聞是佛名，暫^lb生恭敬，即得超越四十劫生死重罪。
何況塑^lb畫形像、供養讚歎？其人獲福，無量無邊。

「又於^lb過去恒河沙劫，有佛出世，號寶性如來。
若有^pb36男子女人，聞是佛名，一彈指頃，發心歸依，是^lb人於無上道，永不退轉。
又於過去，有佛出世，^lb號波頭摩勝如來。
若有男子女人，聞是佛名，^lb歷於耳根，是人當得千返生於六欲天中，何^lb況志心稱念？
「又於過去不可說不可說阿僧^pb37祇劫，有佛出世，號師子吼如來。
若有男子女^lb人，聞是佛名，一念歸依，是人得遇無量諸佛，^lb摩頂授記。
又於過去，有佛出世，號拘留孫佛。
^lb若有男子女人，聞是佛名，志心瞻禮，或復讚^lb歎，是人於賢劫千佛會中，為大梵王，得授上^pb38記。

「又於過去，有佛出世，號毘婆尸。
若有男子^lb女人，聞是佛名，永不墮惡道，常生人天，受勝^lb妙樂。

「又於過去無量無數恒河沙劫，有佛出^lb世，號寶勝如來。
若有男子女人，聞是佛名，畢^lb竟不墮惡道，常在天上，受勝妙樂。

「又於過去，^pb39有佛出世，號寶相如來。
若有男子女人，聞是^lb佛名，生恭敬心，是人不久，得阿羅漢果。

「又於^lb過去，無量阿僧祇劫，有佛出世，號袈裟幢如^lb來。
若有男子女人，聞是佛名者，超一百大劫^lb生死之罪。

「又於過去，有佛出世，號大通山王^pb40如來。
若有男子女人，聞是佛名者，是人得遇^lb恒河沙佛，廣為說法，必成菩提。
又於過去，有^lb淨月佛、山王佛、智勝佛、淨名王佛、智成就佛、^lb無上佛、妙聲佛、滿月佛、月面佛，有如是等不^lb可說佛。

「世尊！現在未來一切眾生，若天若人，^pb41若男若女，但念得一佛名號，功德無量，何況^lb多名？
是眾生等，生時死時，自得大利，終不墮^lb惡道。
若有臨命終人，家中眷屬，乃至一人，為^lb是病人，高聲念一佛名，是命終人，除五無間^lb罪，餘業報等，悉得銷滅。
是五無間罪，雖至極^lb重，動經億劫，了不得出，承斯臨命終時，他人^lb為其稱念佛名，於是罪中亦漸銷滅。
何況眾^lb生，自稱自念，獲福無量，滅無量罪。」
^lb^ck10〔校量布施功德緣品第十〕
^lb爾時，地藏菩薩摩訶薩承佛威神，從座而起，^pb43胡跪合掌，白佛言：
「世尊！我觀業道眾生，校量^lb布施，有輕有重：
有一生受福，有十生受福，有^lb百生千生受大福利者。
是事云何？唯願世尊，^lb為我說之。」
爾時，佛告地藏菩薩：「吾今於忉利^lb天宮，一切眾會，說閻浮提布施，校量功德輕^pb44重。
汝當諦聽，吾為汝說。」
地藏白佛言：「我疑是事，^lb願樂欲聞。」
佛告地藏菩薩：「南閻浮提，有諸國^lb王、宰輔大臣、大長者、大剎利、大婆羅門等，
若^lb遇最下貧窮，乃至癃殘瘖瘂，聾癡無目，如是^lb種種不完具者。
是大國王等，欲布施時，若能^pb45具大慈悲，下心含笑，親手遍布施，或使人施，軟^lb言慰喻。
是國王等，所獲福利，如布施百恒河^lb沙佛功德之利。
何以故？緣是國王等，於是最^lb貧賤輩，及不完具者，發大慈心，是故福利，有^lb如此報：
百千生中，常得七寶具足，何況衣食^pb46受用？
「復次，地藏！若未來世，有諸國王，至婆羅^lb門等，遇佛塔寺，或佛形像，
乃至菩薩、聲聞、辟^lb支佛像，躬自營辦，供養布施。
是國王等，當得^lb三劫為帝釋身，受勝妙樂。
若能以此布施福^lb利，迴向法界，是大國王等，於十劫中，常為大^pb47梵天王。

「復次，地藏！若未來世，有諸國王，至婆^lb羅門等，遇先佛塔廟，或至經像，毀壞破落，乃^lb能發心修補。
是國王等，或自營辦，或勸他人，^lb乃至百千人等，布施結緣。
是國王等，百千生^lb中，常為轉輪王身。
如是他人同布施者，百千^pb48生中，常為小國王身。
更能於塔廟前，發迴向^lb心，如是國王，乃及諸人，盡成佛道，以此果報，^lb無量無邊。

「復次，地藏！未來世中，有諸國王，及^lb婆羅門等，見諸老病，及生產婦女，若一念間，^lb具大慈心，
布施醫藥、飲食、臥具，使令安樂。
如^pb49是福利，最不思議：一百劫中，常為淨居天主；^lb二百劫中，常為六欲天主；
畢竟成佛，永不墮^lb惡道，乃至百千生中，耳不聞苦聲。

「復次，地藏！^lb若未來世中，有諸國王，及婆羅門等，能作如^lb是布施，獲福無量，
更能迴向，不問多少，畢竟^pb50成佛，何況釋梵轉輪之報？是故，地藏！普勸眾^lb生，當如是學。

「復次，地藏！未來世中，若善男子、^lb善女人，於佛法中，種少善根，毛髮沙塵等許，^lb所受福利，不可為喻。
復次，地藏！未來世中，若^lb有善男子、善女人，遇佛形像、菩薩形像、辟支^pb51佛形像、轉輪王形像，布施供養，得無量福，常^lb在人天，受勝妙樂。
若能迴向法界，是人福利，^lb不可為喻。

「復次，地藏！未來世中，若有善男子、^lb善女人，遇大乘經典，或聽聞一偈一句，發殷^lb重心，讚歎恭敬，布施供養。
是人獲大果報，無^pb52量無邊。
若能迴向法界，其福不可為喻。

「復次，^lb地藏！若未來世中，有善男子、善女人，遇佛塔^lb寺、大乘經典新者，布施供養，瞻禮讚歎，恭敬^lb合掌；
若遇故者或毀壞者，修補營理，或獨發^lb心，或勸多人同共發心。
如是等輩，三十生中，^pb53常為諸小國王。
檀越之人，常為輪王，還以善^lb法，教化諸小國王。

「復次，地藏！未來世中，若有^lb善男子、善女人，於佛法中，所種善根，或布施^lb供養，或修補塔寺，或裝理經典，
乃至一毛一^lb塵，一沙一渧。
如是善事，但能迴向法界，是人^pb54功德，百千生中，受上妙樂。
如但迴向自家眷^lb屬，或自身利益，如是之果，即三生受樂，捨一^lb得萬報。
是故，地藏！布施因緣，其事如是。」
^lb^ck11〔地神護法品第十一〕
^lb爾時，堅牢地神白佛言：「世尊！我從昔來，瞻視^pb55頂禮無量菩薩摩訶薩，皆是大不可思議神^lb通智慧，廣度眾生。
是地藏菩薩摩訶薩，於諸^lb菩薩，誓願深重。
世尊！是地藏菩薩，於閻浮提，^lb有大因緣。
如文殊、普賢、觀音、彌勒，亦化百千^lb身形，度於六道，其願尚有畢竟。
是地藏菩薩，^pb56教化六道一切眾生，所發誓願劫數，如千百^lb億恒河沙。

「世尊！我觀未來及現在眾生，於所^lb住處，於南方清潔之地，以土石竹木，作其龕^lb室。
是中能塑畫，乃至金銀銅鐵，作地藏形像，^lb燒香供養，瞻禮讚歎。
是人居處，即得十種利^pb57益。
何等為十？一者，土地豐壤。
二者，家宅永安。
^lb三者，先亡生天。
四者，現存益壽。
五者，所求遂^lb意。
六者，無水火災。
七者，虛耗辟除。
八者，杜絕^lb惡夢。
九者，出入神護。
十者，多遇聖因。

「世尊！未^lb來世中，及現在眾生，若能於所住處方面，作^pb58如是供養，得如是利益。」
復白佛言：「世尊！未來^lb世中，若有善男子、善女人，於所住處，有此經^lb典及菩薩像，
是人更能轉讀經典，供養菩薩。
^lb我常日夜，以本神力，衛護是人，乃至水火盜^lb賊，大橫小橫，一切惡事，悉皆銷滅。」
佛告堅牢^pb59地神：「汝大神力，諸神少及。
何以故？閻浮土地，^lb悉蒙汝護。
乃至草木沙石，稻麻竹葦，穀米寶^lb貝，從地而有，皆因汝力。
又常稱揚地藏菩薩^lb利益之事，汝之功德，及以神通，百千倍於常^lb分地神。
若未來世中，有善男子、善女人，供養^pb60菩薩，及轉讀是經，但依地藏本願經一事修^lb行者，汝以本神力，而擁護之。
勿令一切災害，^lb及不如意事，輒聞於耳，何況令受？非但汝獨^lb護是人故，亦有釋梵眷屬、諸天眷屬，擁護是^lb人。
何故得如是聖賢擁護？皆由瞻禮地藏形^pb61像，及轉讀是本願經故。
自然畢竟出離苦海，^lb證涅槃樂。以是之故，得大擁護。」
^lb^ck12〔見聞利益品第十二〕
^lb爾時，世尊從頂門上，放百千萬億大毫相光——
^lb所謂白毫相光、大白毫相光、瑞毫相光、大瑞^pb62毫相光、玉毫相光、大玉毫相光、紫毫相光、大^lb紫毫相光、
青毫相光、大青毫相光、碧毫相光、^lb大碧毫相光、紅毫相光、大紅毫相光、綠毫相^lb光、大綠毫相光、
金毫相光、大金毫相光、慶雲^lb毫相光、大慶雲毫相光、千輪毫光、大千輪毫^pb63光、寶輪毫光、大寶輪毫光、
日輪毫光、大日輪^lb毫光、月輪毫光、大月輪毫光、宮殿毫光、大宮^lb殿毫光、海雲毫光、大海雲毫光。
於頂門上，放^lb如是等毫相光已，出微妙音，告諸大眾、天龍^lb八部、人、非人等：
「聽吾今日於忉利天宮稱揚^pb64讚歎地藏菩薩於人天中利益等事、不思議^lb事、超聖因事、證十地事、
畢竟不退阿耨多羅^lb三藐三菩提事。」
說是語時，會中有一菩薩摩^lb訶薩，名觀世音，從座而起，胡跪合掌，白佛言：
^lb「世尊！是地藏菩薩摩訶薩，具大慈悲，憐愍罪^pb65苦眾生，於千萬億世界，化千萬億身。
所有功^lb德，及不思議威神之力，我聞世尊與十方無^lb量諸佛，異口同音，讚歎地藏菩薩云：
正使過^lb去現在未來諸佛，說其功德，猶不能盡。
向者，^lb又蒙世尊普告大眾，欲稱揚地藏利益等事。
^pb66唯願世尊，為現在未來一切眾生，稱揚地藏^lb不思議事，令天龍八部，瞻禮獲福。」
佛告觀世^lb音菩薩：「汝於娑婆世界，有大因緣。
若天若龍、^lb若男若女、若神若鬼，乃至六道罪苦眾生，聞^lb汝名者、見汝形者、戀慕汝者、讚歎汝者，
是諸^pb67眾生，於無上道，必不退轉，常生人天，具受妙^lb樂，因果將熟，遇佛授記。
汝今具大慈悲，憐愍^lb眾生，及天龍八部，聽吾宣說地藏菩薩不思^lb議利益之事。
汝當諦聽，吾今說之。」
觀世音言：^lb「唯然，世尊！願樂欲聞。」
佛告觀世音菩薩：「未來^pb68現在諸世界中，有天人受天福盡，有五衰相^lb現，或有墮於惡道之者。
如是天人，若男若女，^lb當現相時，或見地藏菩薩形像，或聞地藏菩^lb薩名，一瞻一禮，
是諸天人，轉增天福，受大快^lb樂，永不墮三惡道報。
何況見聞菩薩，以諸香、^pb69華、衣服、飲食、寶貝、瓔珞，布施供養，所獲功德^lb福利，無量無邊。

「復次，觀世音！若未來現在諸^lb世界中，六道眾生，臨命終時，得聞地藏菩薩^lb名，
一聲歷耳根者，是諸眾生，永不歷三惡道^lb苦。
何況臨命終時，父母眷屬，將是命終人舍^pb70宅、財物、寶貝、衣服，塑畫地藏形像。
或使病人^lb未終之時，眼耳見聞，知道眷屬將舍宅寶貝^lb等，為其自身，塑畫地藏菩薩形像。
是人若是^lb業報合受重病者，承斯功德，尋即除愈，壽命^lb增益。
是人若是業報命盡，應有一切罪障業^pb71障，合墮惡趣者，
承斯功德，命終之後，即生人^lb天，受勝妙樂，一切罪障，悉皆銷滅。

「復次，觀世^lb音菩薩！若未來世，有男子女人，或乳哺時，
或^lb三歲、五歲、十歲已下，亡失父母，乃及亡失兄弟^lb姊妹。
是人年既長大，思憶父母，及諸眷屬，不知^pb72落在何趣？生何世界？生何天中？
是人若能塑^lb畫地藏菩薩形像，乃至聞名，一瞻一禮，一日^lb至七日，莫退初心，聞名見形，瞻禮供養。
是人^lb眷屬，假因業故，墮惡趣者，計當劫數，承斯男^lb女兄弟姊妹塑畫地藏形像、瞻禮功德，尋即^pb73解脫，生人天中；
受勝妙樂者，即承斯功德，轉^lb增聖因，受無量樂。
是人更能三七日中，一心^lb瞻禮地藏形像，念其名字，滿於萬遍。
當得菩^lb薩現無邊身，具告是人眷屬生界；或於夢中，^lb菩薩現大神力，親領是人於諸世界，見諸眷^pb74屬。
更能每日，念菩薩名千遍，至于千日。
是人^lb當得菩薩遣所在土地鬼神，終身衛護，現世^lb衣食豐溢，無諸疾苦，乃至橫事不入其門，何^lb況及身？
是人畢竟得菩薩摩頂授記。

「復次，觀^lb世音菩薩！若未來世，有善男子、善女人，
欲發^pb75廣大慈心，救度一切眾生者，欲修無上菩提^lb者，欲出離三界者。
是諸人等，見地藏形像及^lb聞名者，至心歸依，或以香華衣服、寶貝飲食，^lb供養瞻禮。
是善男女等，所願速成，永無障礙。

^lb「復次，觀世音！若未來世，有善男子、善女人，欲^pb76求現在未來百千萬億等願、百千萬億等事，
^lb但當歸依、瞻禮、供養、讚歎地藏菩薩形像，如^lb是所願所求，悉皆成就。
復願地藏菩薩，具大^lb慈悲，永擁護我，是人於睡夢中，即得菩薩摩^lb頂授記。

「復次，觀世音菩薩！若未來世，善男子、^pb77善女人，於大乘經典，深生珍重，發不思議心，^lb欲讀欲誦。
縱遇明師，教視令熟，旋得旋忘，動^lb經年月，不能讀誦。
是善男子等，有宿業障，未^lb得銷除，故於大乘經典，無讀誦性。
如是之人，^lb聞地藏菩薩名，見地藏菩薩像，具以本心恭^pb78敬陳白，更以香、華、衣服、飲食、一切玩具，供養^lb菩薩。
以淨水一盞，經一日一夜，安菩薩前，然^lb後合掌請服，迴首向南，臨入口時，至心鄭重。
^lb服水既畢，慎五辛、酒肉、邪婬、妄語，及諸殺害，^lb一七日，或三七日。
是善男子、善女人，於睡夢^pb79中，具見地藏菩薩現無邊身，於是人處授灌^lb頂水。
其人夢覺，即獲聰明，應是經典，一歷耳^lb根，即當永記，更不忘失一句一偈。

「復次，觀世^lb音菩薩！若未來世，有諸人等：衣食不足，求者^lb乖願；
或多病疾，或多凶衰；家宅不安，眷屬分^pb80散；或諸橫事，多來忤身；睡夢之間，多有驚怖。
^lb如是人等，聞地藏名，見地藏形，至心恭敬，念^lb滿萬遍。
是諸不如意事，漸漸消滅，即得安樂，^lb衣食豐溢，乃至於睡夢中，悉皆安樂。

「復次，觀^lb世音菩薩！若未來世，有善男子、善女人，或因^pb81治生，或因公私，或因生死，或因急事，
入山林^lb中，過渡河海，乃及大水，或經險道。
是人先當^lb念地藏菩薩名萬遍，所過土地，鬼神衛護，行^lb住坐臥，永保安樂。
乃至逢於虎狼師子、一切^lb毒害，不能損之。」
佛告觀世音菩薩：「是地藏菩^pb82薩，於閻浮提，有大因緣。
若說於諸眾生見聞^lb利益等事，百千劫中，說不能盡。
是故，觀世音！^lb汝以神力，流布是經，令娑婆世界眾生，百千^lb萬劫，永受安樂。」
爾時，世尊而說偈言：
^lb^gatha「吾觀地藏威神力，恒河沙劫說難盡，
^pb83^gatha見聞瞻禮一念間，利益人天無量事。
^lb^gatha若男若女若龍神，報盡應當墮惡道，
^lb^gatha至心歸依大士身，壽命轉增除罪障。
^lb^gatha少失父母恩愛者，未知魂神在何趣？
^lb^gatha兄弟姊妹及諸親，生長以來皆不識。
^pb84^gatha或塑或畫大士身，悲戀瞻禮不暫捨，
^lb^gatha三七日中念其名。菩薩當現無邊體，
^lb^gatha示其眷屬所生界，縱墮惡趣尋出離。
^lb^gatha若能不退是初心，即獲摩頂受聖記。
^lb^gatha欲修無上菩提者，乃至出離三界苦，
^pb85^gatha是人既發大悲心，先當瞻禮大士像，
^lb^gatha一切諸願速成就，永無業障能遮止。
^lb^gatha有人發心念經典，欲度群迷超彼岸，
^lb^gatha雖立是願不思議，旋讀旋忘多廢失。
^lb^gatha斯人有業障惑故，於大乘經不能記。
^pb86^gatha供養地藏以香華，衣服飲食諸玩具，
^lb^gatha以淨水安大士前，一日一夜求服之，
^lb^gatha發殷重心慎五辛，酒肉邪淫及妄語，
^lb^gatha三七日內勿殺害，至心思念大士名。
^lb^gatha即於夢中見無邊，覺來便得利根耳，
^pb87^gatha應是經教歷耳聞，千萬生中永不忘。
^lb^gatha以是大士不思議，能使斯人獲此慧。
^lb^gatha貧窮眾生及疾病，家宅凶衰眷屬離，
^lb^gatha睡夢之中悉不安，求者乖違無稱遂。
^lb^gatha至心瞻禮地藏像，一切惡事皆消滅，
^pb88^gatha至於夢中盡得安，衣食豐饒神鬼護。
^lb^gatha欲入山林及渡海，毒惡禽獸及惡人，
^lb^gatha惡神惡鬼并惡風，一切諸難諸苦惱。
^lb^gatha但當瞻禮及供養，地藏菩薩大士像，
^lb^gatha如是山林大海中，應是諸惡皆消滅。
^pb89^gatha觀音至心聽吾說，地藏無盡不思議，
^lb^gatha百千萬劫說不周，廣宣大士如是力。
^lb^gatha地藏名字人若聞，乃至見像瞻禮者，
^lb^gatha香華衣服飲食奉，供養百千受妙樂，
^lb^gatha若能以此迴法界，畢竟成佛超生死。
^pb90^gatha是故觀音汝當知，普告恒沙諸國土。」
^lb^ck13〔囑累人天品第十三〕
^lb爾時，世尊舉金色臂，又摩地藏菩薩摩訶薩^lb頂，而作是言：
「地藏！地藏！汝之神力，不可思議；^lb汝之慈悲，不可思議；汝之智慧，不可思議；汝^lb之辯才，不可思議。
正使十方諸佛，讚歎宣說^lb汝之不思議事，千萬劫中，不能得盡。
地藏！地藏！^lb記吾今日在忉利天中，於百千萬億不可說不^lb可說一切諸佛菩薩、天龍八部大會之中，
再以^lb人天諸眾生等，未出三界，在火宅中者，付囑^pb92於汝。
無令是諸眾生，墮惡趣中一日一夜，何^lb況更落五無間及阿鼻地獄，動經千萬億劫，^lb無有出期？
「地藏！是南閻浮提眾生，志性無定，^lb習惡者多，縱發善心，須臾即退，若遇惡緣，念^lb念增長。
以是之故，吾分是形，百千億化度，隨^pb93其根性而度脫之。
地藏！吾今殷勤以天人眾，^lb付囑於汝。
未來之世，若有天人，及善男子、善^lb女人，於佛法中，種少善根，一毛一塵，一沙一^lb渧。
汝以道力，擁護是人，漸修無上，勿令退失。
^lb復次，地藏！未來世中，若天若人，隨業報應，落^pb94在惡趣。
臨墮趣中，或至門首，是諸眾生，若能^lb念得一佛名、一菩薩名、一句一偈大乘經典。
^lb是諸眾生，汝以神力，方便救拔。
於是人所，現^lb無邊身，為碎地獄，遣令生天，受勝妙樂。」
爾時，^lb世尊而說偈言：
^lb^gatha「現在未來天人眾，  	吾今殷勤付囑汝，
^lb^gatha以大神通方便度，  	勿令墮在諸惡趣。」
^lb爾時，地藏菩薩摩訶薩胡跪合掌，白佛言：
「世^lb尊！唯願世尊，不以為慮。
未來世中，若有善男^lb子、善女人，於佛法中，一念恭敬，
我亦百千方^pb96便，度脫是人，於生死中，速得解脫。
何況聞諸^lb善事，念念修行？自然於無上道，永不退轉。」
說^lb是語時，會中有一菩薩，名虛空藏，白佛言：
「世^lb尊！我自至忉利，聞於如來讚歎地藏菩薩威^lb神勢力，不可思議。
未來世中，若有善男子、善^pb97女人，乃及一切天龍，聞此經典，及地藏名字，^lb或瞻禮形像，得幾種福利？
唯願世尊，為未來^lb現在一切眾等，略而說之。」
佛告虛空藏菩薩：^lb「諦聽！諦聽！吾當為汝分別說之。
若未來世，有^lb善男子、善女人，見地藏形像，及聞此經，乃至^pb98讀誦，
香華飲食、衣服珍寶，布施供養，讚歎瞻^lb禮，得二十八種利益：
一者天龍護念，二者善^lb果日增，三者集聖上因，四者菩提不退，五者^lb衣食豐足，
六者疾疫不臨，七者離水火災，八^lb者無盜賊厄，九者人見欽敬，十者神鬼助持，
^pb99十一者女轉男身，十二者為王臣女，十三者^lb端正相好，十四者多生天上，十五者或為帝^lb王，
十六者宿智命通，十七者有求皆從，十八^lb者眷屬歡樂，十九者諸橫銷滅，二十者業道^lb永除，
二十一者去處盡通，二十二者夜夢安^pb100樂，二十三者先亡離苦，二十四者宿福受生，^lb二十五者諸聖讚歎，
二十六者聰明利根，二^lb十七者饒慈愍心，二十八者畢竟成佛。

「復次，^lb虛空藏菩薩！若現在未來，天龍鬼神，聞地藏^lb名，禮地藏形，或聞地藏本願事行，讚歎瞻禮，^pb101得七種利益：
一者速超聖地，二者惡業銷滅，^lb三者諸佛護臨，四者菩提不退，五者增長本^lb力，六者宿命皆通，七者畢竟成佛。」
爾時，十方^lb一切諸來不可說不可說諸佛如來，及大菩^lb薩、天龍八部，聞釋迦牟尼佛，
稱揚讚歎地藏^pb102菩薩，大威神力，不可思議，歎未曾有。
是時忉^lb利天，雨無量香華，天衣珠瓔，供養釋迦牟尼^lb佛，及地藏菩薩已。
一切眾會，俱復瞻禮，合掌^lb而退。
^lb地藏菩薩本願經卷下^pb103
 ^pb1^folio#lastword^bk#lastword<heading=佛遺教經>【佛垂般涅槃略說教誡經】(亦名遺教經)^lb^au【．．．姚秦龜茲國三藏．鳩摩羅什奉　詔譯】
^ck1【序】
^lb釋迦牟尼佛初轉法輪，度阿若憍陳如，最後^lb說法度須跋陀羅，所應度者皆已度訖，於娑^lb羅雙樹間將入涅槃。
是時中夜寂然無聲，為^pb2諸弟子略說法要：
^ck2【珍敬淨戒】
^lb「汝等比丘，於我滅後，當尊重珍敬波羅提木^lb叉，如闇遇明、貧人得寶。
當知此則是汝大師，^lb若我住世無異此也。
持淨戒者，不得販賣貿^lb易、安置田宅、畜養人民奴婢畜生，一切種殖^pb3及諸財寶，皆當遠離如避火坑。
不得斬伐草^lb木、墾土掘地，合和湯藥、占相吉凶、仰觀星宿^lb推步盈虛、曆數算計，皆所不應。
節身時食清^lb淨自活，不得參預世事通致使命，呪術仙藥、^lb結好貴人親厚媟嫚，皆不應作。
當自端心正^pb4念求度，不得苞藏瑕疵、顯異惑眾。
於四供養^lb知量知足，趣得供事不應稸積。
此則略說持^lb戒之相。
戒是正順解脫之本，故名波羅提木^lb叉。
依因此戒，得生諸禪定及滅苦智慧。
是故^lb比丘，當持淨戒勿令毀犯。
若人能持淨戒，是^pb5則能有善法；若無淨戒，諸善功德皆不得生。
^lb是以當知，戒為第一安隱功德之所住處。
^ck3【勿縱五根】
^lb「汝等比丘，已能住戒當制五根，勿令放逸入^lb於五欲，譬如牧牛之人執杖視之，不令縱逸^lb犯人苗稼。
若縱五根，非唯五欲將無崖畔不^pb6可制也，亦如惡馬不以轡制，將當牽人墜於^lb坑陷。
如被劫害苦止一世，五根賊禍殃及累^lb世，為害甚重，不可不慎。
是故智者制而不隨，^lb持之如賊不令縱逸；假令縱之，皆亦不久見^lb其磨滅。
此五根者，心為其主。
是故汝等當好^pb7制心，心之可畏甚於毒蛇、惡獸、怨賊，大火越^lb逸，未足喻也。
動轉輕躁，但觀於蜜不見深坑，^lb譬如狂象無鈎、猿猴得樹，騰躍跳躑，難可禁^lb制，當急挫之無令放逸。
縱此心者喪人善事，^lb制之一處無事不辦。
是故比丘，當勤精進折^pb8伏其心。
^lb^ck4【飲食如藥】
「汝等比丘，受諸飲食當如服藥，於好於惡勿^lb生增減，趣得支身以除飢渴。
如蜂採花，但取^lb其味不損色香；
比丘亦爾，受人供養取自除^lb惱，無得多求壞其善心。
譬如智者籌量牛力^pb9所堪多少，不令過分以竭其力。
^lb^ck5【醒寤慚恥】
「汝等比丘，晝則勤心修習善法，無令失時，初^lb夜後夜亦勿有廢，中夜誦經以自消息，無以^lb睡眠因緣令一生空過無所得也。
當念無常^lb之火燒諸世間，早求自度勿睡眠也。
諸煩惱^pb10賊常伺殺人，甚於怨家，安可睡眠不自驚寤？
^lb煩惱毒蛇睡在汝心，譬如黑蚖在汝室睡，當^lb以持戒之鉤早摒除之。
睡蛇既出乃可安眠，^lb不出而眠是無慚人也。
慚恥之服，於諸莊嚴^lb最為第一，慚如鐵鉤，能制人非法。
是故比丘，^pb11常當慚恥，無得暫替；若離慚恥則失諸功德。
^lb有愧之人則有善法；若無愧者，與諸禽獸無^lb相異也。
^lb^ck6【忍辱戒瞋】
「汝等比丘，若有人來節節支解，當自攝心無^lb令瞋恨，亦當護口勿出惡言；若縱恚心，則自^pb12妨道、失功德利。
忍之為德，持戒苦行所不能^lb及。
能行忍者，乃可名為有力大人；若其不能^lb歡喜忍受惡罵之毒如飲甘露者，不名入道^lb智慧人也。
所以者何？瞋恚之害能破諸善法、^lb壞好名聞，今世後世人不憙見。
當知瞋心甚^pb13於猛火，常當防護無令得入，劫功德賊無過^lb瞋恚。
白衣受欲非行道人，無法自制，瞋猶可^lb恕；出家行道無欲之人，而懷瞋恚，甚不可也。
^lb譬如清冷雲中霹靂起火，非所應也。
^ck7【戒憍直心】
^lb「汝等比丘，當自摩頭，已捨飾好著壞色衣，執^pb14持應器以乞自活，自見如是，若起憍慢當疾^lb滅之。
謂長憍慢尚非世俗白衣所宜，何況出^lb家入道之人為解脫故，自降其心而行乞耶？
^lb「汝等比丘，諂曲之心與道相違，是故宜應質^lb直其心。
當知諂曲但為欺誑，入道之人則無^pb15是處。
是故汝等宜應端心，以質直為本。
^lb^ck8【少欲少惱】
「汝等比丘，當知多欲之人多求利故，苦惱亦^lb多；少欲之人無求無欲，則無此患。
直爾少欲^lb尚應修習，何況少欲能生諸善功德？少欲之人^lb則無諂曲以求人意，亦復不為諸根所牽。
行^pb16少欲者，心則坦然無所憂畏，觸事有餘常無^lb不足，有少欲者則有涅槃。
是名少欲。
^lb^ck9【安樂知足】
「汝等比丘，若欲脫諸苦惱，當觀知足，知足之^lb法即是富樂安隱之處。
知足之人，雖臥地上^lb猶為安樂；不知足者，雖處天堂亦不稱意。
不^pb17知足者雖富而貧，知足之人雖貧而富。
不知^lb足者常為五欲所牽，為知足者之所憐愍。
是^lb名知足。
^lb^ck10【獨處遠離】
「汝等比丘，若求寂靜無為安樂，當離憒閙、獨^lb處閑居，靜處之人帝釋諸天所共敬重。
是故^pb18當捨己眾他眾，空閑獨處思滅苦本。
若樂眾^lb者則受眾惱，譬如大樹眾鳥集之，則有枯折^lb之患。
世間縛著沒於眾苦，譬如老象溺泥不^lb能自出。
是名遠離。
^lb^ck11【當勤精進】
「汝等比丘，若勤精進則事無難者，是故汝等^pb19當勤精進，譬如小水常流則能穿石。
若行者^lb之心數數懈廢，譬如鑽火未熱而息，雖欲得^lb火，火難可得。
是名精進。
^lb^ck12【攝念無畏】
「汝等比丘，求善知識、求善護助而不忘念；^lb若不忘念者，諸煩惱賊則不能入。
是故汝^pb20等常當攝念在心，若失念者則失諸功德。
若^lb念力堅強，雖入五欲賊中不為所害，譬如著^lb鎧入陣則無所畏。
是名不忘念。
^lb^ck13【定知生滅】
「汝等比丘，若攝心者心則在定，心在定故能^lb知世間生滅法相。
是故汝等常當精勤修集^pb21諸定，若得定者心則不亂，譬如惜水之家善^lb治堤塘；
行者亦爾，為智慧水故，善修禪定令不^lb漏失。
是名為定。
^lb^ck14【增益智慧】
「汝等比丘，若有智慧則無貪著，常自省察不^lb令有失，是則於我法中能得解脫；
若不爾者，^pb22既非道人又非白衣，無所名也。
實智慧者，則^lb是度老病死海堅牢船也，亦是無明黑闇大^lb明燈也，一切病苦之良藥也，伐煩惱樹者之利^lb斧也。
是故汝等當以聞、思、修慧而自增益；若^lb人有智慧之照，雖無天眼而是明見人也。
是^pb23為智慧。
^ck15【捨離戲論】
^lb「汝等比丘，若種種戲論其心則亂，雖復出家^lb猶未得脫。
是故比丘，當急捨離亂心戲論；若^lb汝欲得寂滅樂者，唯當善滅戲論之患。
是名^lb不戲論。
^pb24^ck16【良醫善導】
「汝等比丘，於諸功德常當一心，捨諸放逸如^lb離怨賊。
大悲世尊所欲利益皆以究竟，汝等^lb但當勤而行之。
若在山間、若空澤中、若在樹^lb下、閑處靜室，念所受法勿令忘失，常當自勉^lb精進修之，無為空死後致憂悔。
我如良醫，知^pb25病說藥，服與不服，非醫咎也。
又如善導，導人^lb善道，聞之不行，非導過也。
汝等若於苦等四^lb諦有所疑者，可疾問之，無得懷疑不求決也。」
^lb爾時世尊如是三唱，人無問者。
所以者何？眾^lb無疑故。
^ck17【四諦真實】
爾時阿㝹樓馱觀察眾心而白佛言：「世^pb26尊！月可令熱，日可令冷，佛說四諦不可令異。
^lb佛說苦諦真實是苦，不可令樂；集真是因，更無異^lb因；苦若滅者即是因滅，因滅故果滅。
滅苦之^lb道實是真道，更無餘道。
世尊！是諸比丘於四^lb諦中決定無疑。
於此眾中所作未辦者，見^pb27佛滅度當有悲感，若有初入法者，聞佛所說^lb即皆得度，譬如夜見電光即得見道；
若所作^lb已辦、已度苦海者，但作是念：『世尊滅度，一何^lb疾哉！』」
阿㝹樓馱雖說是語，眾中皆悉了達四^lb聖諦義。
世尊欲令此諸大眾皆得堅固，以大^pb28悲心復為眾說：
^lb^ck18【久住無益】
「汝等比丘，勿懷憂惱。
若我住世一劫會亦當^lb滅，會而不離終不可得。
自利利人法皆具足，^lb若我久住更無所益。
應可度者，若天上人間^lb皆悉已度，其未度者，皆亦已作得度因緣。
自^pb29今已後，我諸弟子展轉行之，則是如來法身^lb常在而不滅也。
是故當知，世皆無常，會必有^lb離，勿懷憂也。
世相如是，當勤精進早求解脫，^lb以智慧明滅諸癡闇。
世實危脆無牢強者，我^lb今得滅如除惡病。
此是應捨罪惡之物，假名^pb30為身，沒在生老病死大海，何有智者得除滅^lb之，如殺怨賊而不歡喜？
^ck19【行法當滅】
「汝等比丘，常當一心^lb勤求出道，一切世間動不動法，皆是敗壞不^lb安之相。
汝等且止，勿得復語，時將欲過，我欲^lb滅度，是我最後之所教誨。」
^pb31
^pb1^folio#pph^bk#pph<heading=廣本心經>【佛說聖佛母般若波羅蜜多經】^ck0【經題】^lb^au【宋西天三藏朝奉大夫試光祿卿傳法大師 施護奉詔譯】
^ck1【序分】^ck2【正宗分】^lb如是我聞：
一時，世尊在王舍城鷲峯山中，
與^lb大苾芻眾千二百五十人俱，并諸菩薩摩訶^lb薩眾而共圍繞。
爾時，世尊即入甚深光明宣^pb2說正法三摩地。
時，觀自在菩薩摩訶薩在佛^lb會中，而此菩薩摩訶薩已能修行甚深般若^lb波羅蜜多，
觀見五蘊自性皆空。
爾時，尊者舍^lb利子承佛威神，前白觀自在菩薩摩訶薩言：
^lb「若善男子、善女人，於此甚深般若波羅蜜多^pb3法門，樂欲修學者，當云何學？」
時，觀自在菩薩^lb摩訶薩告尊者舍利子言：
「汝今諦聽，為汝宣^lb說。
若善男子、善女人，樂欲修學此甚深般若^lb波羅蜜多法門者，當觀五蘊自性皆空。
何名^lb五蘊自性空耶？
所謂即色是空，即空是色；
色^pb4無異於空，空無異於色。

受、想、行、識，亦復如是。
^lb「舍利子！此一切法如是空相，無所生無所滅，^lb無垢染無清淨，無增長無損減。
舍利子！是故，^lb空中無色，無受、想、行、識；
無眼、耳、鼻、舌、身、意；
無^lb色、聲、香、味、觸、法；
無眼界無眼識界，乃至無意^pb5界無意識界；
無無明無無明盡，
乃至無老死^lb亦無老死盡；
無苦、集、滅、道；無智，無所得，亦無^lb無得。
「舍利子！由是無得故，菩薩摩訶薩依般^lb若波羅蜜多相應行故，心無所著亦無罣礙；
^lb以無著無礙故，無有恐怖，遠離一切顛倒妄想，究^pb6竟圓寂。
所有三世諸佛依此般若波羅^lb蜜多故，得阿耨多羅三藐三菩提。
「是故，應知^lb般若波羅蜜多是廣大明、是無上明、是無等^lb等明，
而能息除一切苦惱，是即真實無虛妄^lb法，諸修學者當如是學。
^ck3【咒】我今宣說般若波羅^pb7蜜多大明曰：
^lb「怛𭔞(寧也)他(一)　唵(引)　誐帝(引)　誐帝(二)　播(引)囉^lb誐帝(三)　播(引)囉僧誐帝(四)　冐提　莎(引)賀(五)
^ck4【流通分】^lb「舍利子！諸菩薩摩訶薩，若能誦是般若波羅^lb蜜多明句，是即修學甚深般若波羅蜜多。」
爾^pb8時，世尊從三摩地安詳而起，讚觀自在菩薩^lb摩訶薩言：
「善哉，善哉！善男子！如汝所說，如是，^lb如是！
般若波羅蜜多當如是學，是即真實最^lb上究竟，
一切如來亦皆隨喜。」
佛說此經已，
觀^lb自在菩薩摩訶薩并諸苾芻，
乃至世間天、人、^pb9阿修羅、乾闥婆等一切大眾，聞佛所說，皆大^lb歡喜，信受奉行。
^lb^lb^lb佛說聖佛母般若波羅蜜多經
^pb10音釋^lb^lb^lb^lb
^pb1^folio#pphs^bk#pphs<heading=心經>【般若波羅蜜多心經】^ck0【經題】^lb^au^gatha【．．．唐三藏法師．玄奘．奉．詔譯】
^ck1【序分】^ck2【正宗分】^lb觀自在菩薩行深般若波羅蜜多時，
照見五^lb蘊皆空，度一切苦厄。

「舍利子！色不異空，空不^lb異色，
色即是空，空即是色；

受、想、行、識，亦復如^pb2是。
「舍利子！是諸法空相，不生不滅，不垢不淨，^lb不增不減。

是故，空中無色，無受、想、行、識；
無眼、^lb耳、鼻、舌、身、意；
無色、聲、香、味、觸、法；
無眼界，乃至^lb無意識界；
無無明亦無無明盡，
乃至無老死^lb亦無老死盡；
無苦、集、滅、道；
無智，亦無得。
「以無^pb3所得故，菩提薩埵依般若波羅蜜多故，心無^lb罣礙；
無罣礙故，無有恐怖，遠離顛倒夢想，究^lb竟涅槃。
三世諸佛依般若波羅蜜多故，得阿^lb耨多羅三藐三菩提。
「故知般若波羅蜜多是^lb大神咒、是大明咒、是無上咒、是無等等咒，
能^pb4除一切苦，真實不虛，
故說般若波羅蜜多咒。」
^ck3【咒】^lb即說咒曰：
^lb^gatha「揭帝．揭帝．般羅揭帝．般羅僧揭帝^lb菩提．僧莎訶」
^ck4【流通分】^lb般若波羅蜜多心經
^pb5
^pb1^folio#pphs_kumarajiva^bk#pphs_kumarajiva<heading=羅什 hidden=1>【摩訶般若波羅蜜大明呪經】^ck0【經題】^lb^au【．．．後秦三藏．鳩摩羅什．譯】
^ck1【序分】^ck2【正宗分】^lb觀世音菩薩行深般若波羅蜜時，
照見五^lb陰空，度一切苦厄。
「舍利弗！色空故無惱壞相，受^lb空故無受相，想空故無知相，行空故無作^pb2相，識空故無覺相。
何以故？舍利弗！非色異空，^lb非空異色。
色即是空，空即是色。

受、想、行、識亦^lb復如是。
「舍利弗！是諸法空相，不生不滅，不垢^lb不淨，不增不減。
是空法，非過去、非未來、非現^lb在。
是故空中無色，無受、想、行、識，
無眼、耳、鼻、舌、^pb3身、意，
無色、聲、香、味、觸、法，
無眼界乃至無意識^lb界，
無無明亦無無明盡，
乃至無老死無老死^lb盡，
無苦、集、滅、道，
無智亦無得。
「以無所得故，菩^lb薩依般若波羅蜜故，心無罣礙。
無罣礙故，無^lb有恐怖，離一切顛倒夢想苦惱，究竟涅槃。
三^pb4世諸佛依般若波羅蜜故，得阿耨多羅三藐^lb三菩提。
「故知般若波羅蜜是大明呪、無上明^lb呪、無等等明呪，
能除一切苦，真實不虛。
^ck3【咒】故說^lb般若波羅蜜呪。」
即說呪曰：
^lb^gatha「竭帝竭帝．波羅竭帝．波羅僧竭帝．^pb5^gatha菩提．僧莎呵」
^ck4【流通分】^lb^lb^lb^lb摩訶般若波羅蜜大明呪經
^pb6
^pb1^folio#pumen^bk#pumen<heading=普門品>【妙法蓮華經觀世音菩薩普門品經】^ck0【經題】^lb^gatha^au【．．．姚秦三藏法師鳩摩羅什】譯長行
^lb^gatha．．．隋北天竺沙門闍那崛多譯重頌
^lb^ck1【序分】
爾時，無盡意菩薩即從座起，偏袒右肩，合掌^lb向佛而作是言：
「世尊！觀世音菩薩以何因緣^pb2名觀世音？」
^lb^ck2【水難】
佛告無盡意菩薩：
「善男子！若有無量百千萬^lb億眾生受諸苦惱，聞是觀世音菩薩，一心稱^lb名，觀世音菩薩即時觀其音聲，皆得解脫。
^lb若有持是觀世音菩薩名者，設入大火，火不^pb3能燒，由是菩薩威神力故。
若為大水所漂，稱^lb其名號，即得淺處。
若有百千萬億眾生，為求^lb金、銀、琉璃、車𤦲、馬瑙、珊瑚、虎珀、真珠等寶，入^lb於大海。
假使黑風吹其船舫，飄墮羅剎鬼國，^lb其中若有，乃至一人，稱觀世音菩薩名者，是^pb4諸人等皆得解脫羅剎之難。
以是因緣，名觀^lb世音。
^ck3【陸難】
若復有人臨當被害，稱觀世音菩薩名^lb者，彼所執刀杖尋段段壞，而得解脫。
若三千^lb大千國土滿中夜叉、羅剎欲來惱人，聞其稱^lb觀世音菩薩名者，是諸惡鬼尚不能以惡眼^pb5視之，況復加害。
設復有人，若有罪、若無罪，杻^lb械、枷鎖檢繫其身，稱觀世音菩薩名者，皆悉^lb斷壞，即得解脫。
若三千大千國土滿中怨賊，^lb有一商主將諸商人，齎持重寶經過嶮路。
其^lb中一人作是唱言：
『諸善男子！勿得恐怖！汝等^pb6應當一心稱觀世音菩薩名號。是菩薩能以^lb無畏施於眾生。
汝等若稱名者，於此怨賊當^lb得解脫。』
眾商人聞，俱發聲言：『南無觀世音菩^lb薩。』
稱其名故，即得解脫。
^ck4【離欲】
「無盡意！觀世音菩薩^lb摩訶薩威神之力，巍巍如是。
^pb7若有眾生多於婬欲，常念恭敬觀世音菩薩，^lb便得離欲。
若多瞋恚，常念恭敬觀世音菩薩，^lb便得離瞋。
若多愚癡，常念恭敬觀世音菩薩，^lb便得離癡。
^ck5【求生男女】
「無盡意！觀世音菩薩有如是等大^lb威神力，多所饒益。是故眾生常應心念。
^pb8若有女人，設欲求男，禮拜供養觀世音菩薩，^lb便生福德智慧之男；
設欲求女，便生端正有^lb相之女。宿殖德本，眾人愛敬。
「無盡意！觀世音^lb菩薩有如是力。若有眾生恭敬禮拜觀世音^lb菩薩，福不唐捐。
是故眾生皆應受持觀世音^lb菩薩名號。
^ck6【無邊福德】
「無盡意！若有人受持六十二億恒^lb河沙菩薩名字，
復盡形供養飲食、衣服、臥具、^lb醫藥。
於汝意云何？是善男子、善女人，功德多^lb不？」
無盡意言：「甚多，世尊！」
佛言：「若復有人受持^lb觀世音菩薩名號，乃至一時禮拜、供養。
是二^pb10人福，正等無異，於百千萬億劫不可窮盡。
無^lb盡意！受持觀世音菩薩名號，得如是無量無^lb邊福德之利。」
^ck7【現身說法】
^lb無盡意菩薩白佛言：「世尊！觀世音菩薩云何^lb遊此娑婆世界？
云何而為眾生說法？方便之^pb11力，其事云何？」
^lb佛告無盡意菩薩：
「善男子！若有國土眾生應^lb以佛身得度者，觀世音菩薩即現佛身而為^lb說法；
應以辟支佛身得度者，即現辟支佛身^lb而為說法；
應以聲聞身得度者，即現聲聞身^lb而為說法；
應以梵王身得度者，即現梵王身^lb而為說法；
應以帝釋身得度者，即現帝釋身^lb而為說法；
應以自在天身得度者，即現自在^lb天身而為說法；
應以大自在天身得度者，即^lb現大自在天身而為說法；
應以天大將軍身^lb得度者，即現天大將軍身而為說法；
應以毘^lb沙門身得度者，即現毘沙門身而為說法；
應^lb以小王身得度者，即現小王身而為說法；
應^lb以長者身得度者，即現長者身而為說法；
應^lb以居士身得度者，即現居士身而為說法；
應^pb14以宰官身得度者，即現宰官身而為說法；
應^lb以婆羅門身得度者，即現婆羅門身而為說^lb法；
應以比丘、比丘尼、優婆塞、優婆夷身得度^lb者，即現比丘、比丘尼、優婆塞、優婆夷身而為^lb說法；
應以長者、居士、宰官、婆羅門婦女身得度^pb15者，即現婦女身而為說法；
應以童男、童女^lb身得度者，即現童男、童女身而為說法；
應以^lb天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩^lb睺羅伽、人非人等身得度者，即皆現之而為^lb說法；
應以執金剛身得度者，即現執金剛身^pb16而為說法。
「無盡意！是觀世音菩薩成就如是^lb功德，以種種形，遊諸國土，度脫眾生。
^lb是故汝等應當一心供養觀世音菩薩。
是觀^lb世音菩薩摩訶薩於怖畏急難之中能施無^lb畏，是故此娑婆世界皆號之為施無畏者。」
^ck8【珍寶供養】
無^pb17盡意菩薩白佛言：
「世尊！我今當供養觀世音^lb菩薩。」
即解頸眾寶珠、瓔珞，價直百千兩金，而^lb以與之，作是言：
「仁者！受此法施珍寶瓔珞。」
時^lb觀世音菩薩不肯受之。
無盡意復白觀世音^lb菩薩言：
「仁者！愍我等故，受此瓔珞。」
爾時佛告^pb18觀世音菩薩：
「當愍此無盡意菩薩及四眾，天、^lb龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺^lb羅伽、人非人等故，受是瓔珞。」
即時觀世音菩^lb薩愍諸四眾，及於天、龍、人非人等，
受其瓔珞，^lb分作二分，一分奉釋迦牟尼佛，一分奉多寶^pb19佛塔。
「無盡意！觀世音菩薩有如是自在神力，^lb遊於娑婆世界。」
^ck9【偈】
爾時無盡意菩薩以偈問曰：
^lb^gatha「世尊妙相具．我今重問彼，
佛子何因緣．^lb^gatha名為觀世音？
具足妙相尊．偈答無盡意：
^lb^gatha『汝聽觀音行．善應諸方所，
弘誓深如海．^pb20^gatha歷劫不思議，
侍多千億佛．發大清淨願。
^lb^gatha我為汝略說．聞名及見身，
心念不空過．^lb^gatha能滅諸有苦。
假使興害意．推落大火坑，
^lb^gatha念彼觀音力．火坑變成池。
或漂流巨海．^lb^gatha龍魚諸鬼難，
念彼觀音力．波浪不能沒。
^pb21^gatha或在須彌峯．為人所推墮，
念彼觀音力．^lb^gatha如日虛空住。
或被惡人逐．墮落金剛山，
^lb^gatha念彼觀音力．不能損一毛。
或值怨賊繞．^lb各執刀加害，
念彼觀音力．咸即起慈心。
^lb^gatha或遭王難苦．臨刑欲壽終，
念彼觀音力．^pb22^gatha刀尋段段壞。
或囚禁枷鎖．手足被杻械，
^lb^gatha念彼觀音力．釋然得解脫。
呪詛諸毒藥．^lb^gatha所欲害身者，
念彼觀音力．還著於本人。
^lb^gatha或遇惡羅剎．毒龍諸鬼等，
念彼觀音力．^lb^gatha時悉不敢害。
若惡獸圍遶．利牙爪可怖，
^pb23^gatha念彼觀音力．疾走無邊方。
蚖蛇及蝮蠍．^lb^gatha氣毒煙火燃，
念彼觀音力．尋聲自迴去。
^lb^gatha雲雷鼓掣電．降雹澍大雨，
念彼觀音力．^lb^gatha應時得消散。
眾生被困厄．無量苦逼身，
^lb^gatha觀音妙智力．能救世間苦。
具足神通力．^pb24^gatha廣修智方便，
十方諸國土．無剎不現身。
^lb^gatha種種諸惡趣．地獄鬼畜生，
生老病死苦．^lb^gatha以漸悉令滅。
真觀清淨觀．廣大智慧觀，
^lb^gatha悲觀及慈觀．常願常瞻仰。
無垢清淨光．^lb^gatha慧日破諸闇，
能伏災風火．普明照世間。
^pb25^gatha悲體戒雷震．慈意妙大雲，
澍甘露法雨．^lb^gatha滅除煩惱焰。
諍訟經官處．怖畏軍陣中，
^lb^gatha念彼觀音力．眾怨悉退散。
妙音觀世音．^lb^gatha梵音海潮音，
勝彼世間音．是故須常念，
^lb^gatha念念勿生疑．觀世音淨聖，
於苦惱死厄．^pb26^gatha能為作依怙，
具一切功德．慈眼視眾生，
^lb^gatha福聚海無量．是故應頂禮。』」
^lb^ck10【流通分】
爾時持地菩薩即從座起，前白佛言：
「世尊！若^lb有眾生聞是觀世音菩薩品自在之業、普門^lb示現神通力者，當知是人功德不少。」
佛說是^pb27普門品時，眾中八萬四千眾生，皆發無等等^lb阿耨多羅三藐三菩提心。
^lb^lb^lb妙法蓮華經觀世音菩薩普門品經^pb28
^pb1^ak#sdpdrk^folio#sdpdrk1^bk#sdpdrk1<heading=法華經>【妙法蓮華經】卷第一^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck1〔序品第一〕
^lb^cb#01c19如是我聞：
一時，佛住王舍城耆闍崛山中，與^lb大比丘眾萬二千人俱，皆是阿羅漢，諸漏已^lb盡，無復煩惱，逮得己利，盡諸有結，心得自在。
^pb2其名曰：阿若憍陳如、摩訶迦葉、優樓頻螺迦^lb葉、伽耶迦葉、那提迦葉舍利弗、大目揵連、摩^lb訶迦旃延、阿㝹樓馱、劫賓那、憍梵波提、離婆^lb多、畢陵伽婆蹉、薄拘羅、摩訶拘絺羅、難陀、孫^lb陀羅難陀、富樓那彌多羅尼子、須菩提、阿難、^lb羅睺羅。如是眾所知識大阿羅漢等。
復有學、^pb3無學二千人。摩訶波闍波提比丘尼，與眷屬^lb六千人俱。
羅睺羅母耶輸陀羅比丘尼，亦與^lb眷屬俱。
菩薩摩訶薩八萬人，皆於阿耨多羅^lb三藐三菩提不退轉；皆得陀羅尼；樂說辯才，^lb轉不退轉法輪；供養無量百千諸佛，於諸佛^lb所植眾德本，常為諸佛之所稱歎；以慈修身，^pb4善入佛慧；通達大智，到於彼岸；名稱普聞無^lb量世界，能度無數百千眾生。
其名曰：文殊師^lb利菩薩、觀世音菩薩、得大勢菩薩、常精進菩^lb薩、不休息菩薩、寶掌菩薩、藥王菩薩、勇施菩^lb薩、寶月菩薩、月光菩薩、滿月菩薩、大力菩薩、^lb無量力菩薩、越三界菩薩、跋陀婆羅菩薩、彌^pb5勒菩薩、寶積菩薩、導師菩薩，如是等菩薩摩^lb訶薩八萬人俱。
^cb#02a15爾時釋提桓因，與其眷屬二^lb萬天子俱。
復有名月天子、普香天子、寶光天^lb子、四大天王，與其眷屬萬天子俱。
自在天子、大^lb自在天子，與其眷屬三萬天子俱。
娑婆世^lb界主梵天王——尸棄大梵、光明大梵等，與其眷^pb6屬萬二千天子俱。
有八龍王——難陀龍王、跋難^lb陀龍王、娑伽羅龍王、和脩吉龍王、德叉迦龍^lb王、阿那婆達多龍王、摩那斯龍王、優鉢羅龍^lb王等，各與若干百千眷屬俱。
有四緊那羅王——^lb法緊那羅王、妙法緊那羅王、大法緊那羅王、^lb持法緊那羅王，各與若干百千眷屬俱。
有四^pb7乾闥婆王——樂乾闥婆王、樂音乾闥婆王、美乾^lb闥婆王、美音乾闥婆王，各與若干百千眷屬^lb俱。
有四阿修羅王——婆稚阿修羅王、佉羅騫馱^lb阿修羅王、毘摩質多羅阿修羅王、羅睺阿修^lb羅王，各與若干百千眷屬俱。
有四迦樓羅王——^lb大威德迦樓羅王、大身迦樓羅王、大滿迦樓^pb8羅王、如意迦樓羅王，各與若干百千眷屬俱。
^lb韋提希子阿闍世王，與若干百千眷屬俱。各^lb禮佛足，退坐一面。
^cb#02b07爾時世尊，四眾圍遶，供養、^lb恭敬、尊重、讚歎。
為諸菩薩說大乘經，名無量^lb義，教菩薩法，佛所護念。
佛說此經已，結加趺^lb坐，入於無量義處三昧，身心不動。
是時天雨曼陀羅華、摩訶^pb9曼陀羅華、曼殊沙華、摩訶曼^lb殊沙華，而散佛上、及諸大眾。普佛世界，六種^lb震動。
爾時會中，比丘、比丘尼、優婆塞、優婆夷、^lb天龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩^lb睺羅伽、人非人，及諸小王、轉輪聖王，是諸大^lb眾，得未曾有，歡喜合掌，一心觀佛。
^cb#02b16爾時佛放^pb10眉間白毫相光，照東方萬八千世界，靡不周^lb遍，下至阿鼻地獄，上至阿迦尼吒天。
於此世^lb界，盡見彼土六趣眾生，又見彼土現在諸佛，^lb及聞諸佛所說經法。
并見彼諸比丘、比丘尼、^lb優婆塞、優婆夷，諸修行得道者。
復見諸菩薩^lb摩訶薩，種種因緣、種種信解、種種相貌，行菩^pb11薩道。復見諸佛般涅槃者。復見諸佛般涅槃^lb後，以佛舍利起七寶塔。
^cb#02b24爾時彌勒菩薩作是^lb念：「今者世尊現神變相，以何因緣而有此瑞？^lb今佛世尊入于三昧，是不可思議、現希有事。
^lb當以問誰？誰能答者？」復作此念：「是文殊師利，^lb法王之子，已曾親近供養過去無量諸佛，必^pb12應見此希有之相。我今當問。」
^cb#02b29爾時比丘、比丘^lb尼、優婆塞、優婆夷，及諸天、龍、鬼神等，咸作此^lb念：「是佛光明神通之相，今當問誰？」
^cb#02c03爾時彌勒^lb菩薩，欲自決疑，又觀四眾比丘、比丘尼、優婆^lb塞、優婆夷，及諸天，龍、鬼神等眾會之心，而問^lb文殊師利言：「以何因緣而有此瑞神通之相，^pb13放大光明，照于東方萬八千土，悉見彼佛國^lb界莊嚴？」於是彌勒菩薩欲重宣此義，以偈問^lb曰：
^lb^gatha「文殊師利！　　導師何故，　　眉間白毫，
　大光普照。　　^lb雨曼陀羅、　　曼殊沙華，
　栴檀香風，　　悅可眾心？　　^lb以是因緣，
　地皆嚴淨，　　而此世界，　　六種震動。
　^pb14時四部眾，　　咸皆歡喜，　　身意快然，
　得未曾有。　　^lb眉間光明，　　照于東方，
　萬八千土，　　皆如金色，　　^lb從阿鼻獄，
　上至有頂。　　諸世界中，　　六道眾生，
　^lb生死所趣，　　善惡業緣，　　受報好醜，
　於此悉見。　　^lb又覩諸佛、　　聖主師子、
　演說經典，　　微妙第一。　　^lb其聲清淨，
　出柔軟音，　　教諸菩薩，　　無數億萬，
　^lb梵音深妙，　　令人樂聞。　　各於世界，
　講說正法，　　^lb種種因緣。　　以無量喻，
　照明佛法，　　開悟眾生。　　^lb若人遭苦，
　厭老病死，　　為說涅槃，　　盡諸苦際。
　^lb若人有福，　　曾供養佛，　　志求勝法，
　為說緣覺。　　^lb若有佛子、　　修種種行，
　求無上慧，　　為說淨道。　　^lb文殊師利！
　我住於此，　　見聞若斯，　　及千億事，
　^pb16如是眾多，　　今當略說。　　我見彼土，
　恒沙菩薩，　　^lb種種因緣，　　而求佛道。
　或有行施，　　金銀珊瑚、　　^lb真珠摩尼、
　車璩馬腦、　　金剛諸珍，　　奴婢車乘、
　^lb寶飾輦輿，　　歡喜布施。　　迴向佛道，
　願得是乘，　　^lb三界第一，　　諸佛所歎。
　或有菩薩，　　駟馬寶車、　　^lb欄楯華蓋、
　軒飾布施。　　復見菩薩，　　身肉手足，
　^pb17及妻子施，　　求無上道。　　又見菩薩，
　頭目身體，　　^lb欣樂施與，　　求佛智慧。
　文殊師利！　　我見諸王，　　^lb往詣佛所，
　問無上道，　　便捨樂土、　　宮殿臣妾，
　^lb剃除鬚髮，　　而被法服。　　或見菩薩，
　而作比丘，　　^lb獨處閑靜，　　樂誦經典。
　又見菩薩，　　勇猛精進，　　^lb入於深山，
　思惟佛道。　　又見離欲，　　常處空閑，
　^pb18深修禪定，　　得五神通。　　又見菩薩，
　安禪合掌，　　^lb以千萬偈、　　讚諸法王。
　復見菩薩，　　智深志固，　　^lb能問諸佛，
　聞悉受持。　　又見佛子，　　定慧具足，
　^lb以無量喻，　　為眾講法。　　欣樂說法，
　化諸菩薩，　　^lb破魔兵眾，　　而擊法鼓。
　又見菩薩，　　寂然宴默，　　^lb天龍恭敬，
　不以為喜。　　又見菩薩，　　處林放光，
　^pb19濟地獄苦，　　令入佛道。　　又見佛子，
　未甞睡眠，　　^lb經行林中，　　懃求佛道。
　又見具戒，　　威儀無缺，　　^lb淨如寶珠，
　以求佛道。　　又見佛子，　　住忍辱力，
　^lb增上慢人，　　惡罵捶打，　　皆悉能忍，
　以求佛道。　　^lb又見菩薩，　　離諸戲笑，
　及癡眷屬，　　親近智者，　　^lb一心除亂，
　攝念山林，　　億千萬歲，　　以求佛道。
　^pb20或見菩薩，　　餚饍飲食、　　百種湯藥，
　施佛及僧。　　^lb名衣上服，　　價直千萬，
　或無價衣，　　施佛及僧。　　^lb千萬億種，
　栴檀寶舍、　　眾妙臥具，　　施佛及僧。
　^lb清淨園林，　　華菓茂盛，　　流泉浴池，
　施佛及僧。　　^lb如是等施，　　種種微妙，
　歡喜無厭，　　求無上道。　　^lb或有菩薩，
　說寂滅法，　　種種教詔，　　無數眾生。
　^pb21或見菩薩，　　觀諸法性，　　無有二相，
　猶如虛空。　　^lb又見佛子，　　心無所著，
　以此妙慧、　　求無上道。　　^lb文殊師利！
　又有菩薩，　　佛滅度後，　　供養舍利。
　^lb又見佛子，　　造諸塔廟，　　無數恒沙，
　嚴飾國界，　　^lb寶塔高妙，　　五千由旬，
　縱廣正等，　　二千由旬。　　^lb一一塔廟，
　各千幢幡，　　珠交露幔，　　寶鈴和鳴。
　^pb22諸天龍神、　　人及非人，　　香華伎樂，
　常以供養。　　^lb文殊師利！　　諸佛子等，
　為供舍利，　　嚴飾塔廟，　　^lb國界自然，
　殊特妙好，　　如天樹王，　　其華開敷。
　^lb佛放一光，　　我及眾會，　　見此國界，
　種種殊妙。　　^lb諸佛神力、　　智慧希有，
　放一淨光，　　照無量國。　　^lb我等見此，
　得未曾有。　　佛子文殊！　　願決眾疑。
　^pb23四眾欣仰，　　瞻仁及我。　　世尊何故，
　放斯光明？　　^lb佛子時答，　　決疑令喜。
　何所饒益，　　演斯光明？　　^lb佛坐道場，
　所得妙法，　　為欲說此？　　為當授記？
　^lb示諸佛土，　　眾寶嚴淨，　　及見諸佛，
　此非小緣。　　^lb文殊當知，　　四眾龍神，
　瞻察仁者，　　為說何等。」
^lb^cb#03c11爾時文殊師利語彌勒菩薩摩訶薩及諸大^pb24士、善男子等：「如我惟忖，今佛世尊欲說大法，^lb雨大法雨，吹大法螺，擊大法鼓，演大法義。
諸^lb善男子！我於過去諸佛，曾見此瑞，放斯光已，^lb即說大法。
是故當知，今佛現光，亦復如是，欲^lb令眾生，咸得聞知一切世間難信之法，故現^lb斯瑞。
^cb#03c17「諸善男子！如過去無量無邊不可思議^pb25阿僧祇劫，爾時有佛，號日月燈明如來、應供、^lb正遍知、明行足、善逝世間解、無上士、調御丈^lb夫、天人師、佛、世尊，演說正法，初善中善後善，^lb其義深遠，其語巧妙，純一無雜，具足清白梵^lb行之相。
為求聲聞者說應四諦法，度生老病^lb死，究竟涅槃；為求辟支佛者說應十二因緣^pb26法；為諸菩薩說應六波羅蜜，令得阿耨多羅^lb三藐三菩提，成一切種智。
^cb#03c26「次復有佛亦名日^lb月燈明，次復有佛亦名日月燈明，如是二萬^lb佛，皆同一字，號日月燈明，又同一姓，姓頗羅^lb墮。
彌勒當知，初佛後佛，皆同一字，名日月燈^lb明，十號具足。
所可說法，初中後善。其最後佛，^pb27未出家時有八王子：一名有意，二名善意，三^lb名無量意，四名寶意，五名增意，六名除疑意，七^lb名嚮意，八名法意。
是八王子，威德自在，各^lb領四天下。是諸王子，聞父出家，得阿耨多羅^lb三藐三菩提，悉捨王位亦隨出家，發大乘意，^lb常修梵行，皆為法師，已於千萬佛所、殖諸善^pb28本。
^cb#04a08「是時日月燈明佛說大乘經，名無量義，教^lb菩薩法，佛所護念。
說是經已，即於大眾中結^lb跏趺坐，入於無量義處三昧，身心不動。
是時、^lb天雨曼陀羅華，摩訶曼陀羅華，曼殊沙華，摩^lb訶曼殊沙華，而散佛上、及諸大眾。普佛世界，^lb六種震動。
爾時會中，比丘、比丘尼、優婆塞、優^pb29婆夷，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那^lb羅、摩睺羅伽、人非人，及諸小王、轉輪聖王等，^lb是諸大眾，得未曾有，歡喜合掌，一心觀佛。
^cb#04a18「爾^lb時如來放眉間白毫相光，照東方萬八千佛^lb土，靡不周遍，如今所見是諸佛土。
彌勒當知，^lb爾時會中，有二十億菩薩樂欲聽法。
是諸菩^pb30薩，見此光明、普照佛土，得未曾有，欲知此光^lb所為因緣。
時有菩薩，名曰妙光，有八百弟子。^lb是時日月燈明佛從三昧起，因妙光菩薩、說^lb大乘經，名妙法蓮華，教菩薩法，佛所護念，六^lb十小劫不起于座。
時會聽者亦坐一處，六十^lb小劫身心不動，聽佛所說，謂如食頃。
是時眾^pb31中，無有一人若身若心而生懈惓。
^cb#04a28「日月燈明^lb佛於六十小劫說是經已，即於梵、魔、沙門、婆^lb羅門、及天、人、阿修羅眾中，而宣此言：『如來於^lb今日中夜，當入無餘涅槃。』
時有菩薩，名曰德^lb藏，日月燈明佛即授其記。告諸比丘：『是德藏^lb菩薩，次當作佛，號曰淨身多陀阿伽度、阿羅^pb32訶、三藐三佛陀。』佛授記已，便於中夜、入無餘^lb涅槃。
佛滅度後，妙光菩薩持妙法蓮華經，滿^lb八十小劫為人演說。
日月燈明佛八子皆師^lb妙光，妙光教化令其堅固阿耨多羅三藐三^lb菩提。
是諸王子、供養無量百千萬億佛已，皆^lb成佛道，其最後成佛者，名曰燃燈。
八百弟子^pb33中，有一人號曰求名，貪著利養，雖復讀誦眾^lb經，而不通利，多所忘失，故號求名。
是人亦以^lb種諸善根因緣故，得值無量百千萬億諸佛，^lb供養、恭敬，尊重、讚歎。
彌勒當知，爾時妙光菩^lb薩豈異人乎？我身是也；求名菩薩，汝身是也。
^lb今見此瑞，與本無異，是故惟忖：『今日如來當^pb34說大乘經，名妙法蓮華，教菩薩法，佛所護念。』」
^lb^cb#04b18爾時文殊師利於大眾中，欲重宣此義，而說^lb偈言：
^lb^gatha「我念過去世，　　無量無數劫，
　有佛人中尊，　　^lb號日月燈明。
　世尊演說法，　　度無量眾生，
　^lb無數億菩薩，　　令入佛智慧。
　佛未出家時，　　^pb35所生八王子，
　見大聖出家，　　亦隨修梵行。
　^lb時佛說大乘，　　經名無量義，
　於諸大眾中，　　^lb而為廣分別。
　佛說此經已，　　即於法座上，
　^lb跏趺坐三昧，　　名無量義處。
　天雨曼陀華，　　^lb天鼓自然鳴，
　諸天龍鬼神，　　供養人中尊。
　^pb36一切諸佛土，　　即時大震動，
　佛放眉間光，　　^lb現諸希有事。
　此光照東方，　　萬八千佛土，
　^lb示一切眾生，　　生死業報處。
　有見諸佛土，　　^lb以眾寶莊嚴，
　琉璃頗梨色，　　斯由佛光照。
　^lb及見諸天人、　　龍神夜叉眾、
　乾闥緊那羅，　　^lb各供養其佛。
　又見諸如來，　　自然成佛道，
　^lb身色如金山，　　端嚴甚微妙。
　如淨琉璃中，　　^pb37內現真金像，
　世尊在大眾，　　敷演深法義。
　^lb一一諸佛土，　　聲聞眾無數，
　因佛光所照，　　^lb悉見彼大眾。
　或有諸比丘，　　在於山林中，
　^lb精進持淨戒，　　猶如護明珠。
　又見諸菩薩，　　^lb行施忍辱等，
　其數如恒沙，　　斯由佛光照。
　^lb又見諸菩薩，　　深入諸禪定，
　身心寂不動，　　^pb38以求無上道。
　又見諸菩薩，　　知法寂滅相，
　^lb各於其國土，　　說法求佛道。
　爾時四部眾，　　^lb見日月燈佛，
　現大神通力，　　其心皆歡喜，
　^lb各各自相問：　　『是事何因緣？』
　天人所奉尊，　　^lb適從三昧起，
　讚妙光菩薩：　　『汝為世間眼，
　^lb一切所歸信，　　能奉持法藏，
　如我所說法，　　^pb39唯汝能證知。』
　世尊既讚歎，　　令妙光歡喜，
　^lb說是法華經，　　滿六十小劫，
　不起於此座。　　^lb所說上妙法，
　是妙光法師，　　悉皆能受持。
　^lb佛說是法華，　　令眾歡喜已，
　尋即於是日，　　^lb告於天人眾：
『諸法實相義，　　已為汝等說，
　^lb我今於中夜，　　當入於涅槃。
　汝一心精進，　　^pb40當離於放逸，
　諸佛甚難值，　　億劫時一遇。』
　^lb世尊諸子等，　　聞佛入涅槃，
　各各懷悲惱，　　^lb佛滅一何速。
　聖主法之王，　　安慰無量眾：
^lb『我若滅度時，　　汝等勿憂怖，
　是德藏菩薩，　　^lb於無漏實相，
　心已得通達。　　其次當作佛，
　^lb號曰為淨身，　　亦度無量眾。』
　佛此夜滅度，　　^pb41如薪盡火滅，
　分布諸舍利，　　而起無量塔。
　^lb比丘比丘尼，　　其數如恒沙，
　倍復加精進，　　^lb以求無上道。
　是妙光法師，　　奉持佛法藏，
　^lb八十小劫中，　　廣宣法華經。
　是諸八王子，　　^lb妙光所開化，
　堅固無上道，　　當見無數佛。
　^lb供養諸佛已，　　隨順行大道，
　相繼得成佛，　　^pb42轉次而授記。
　最後天中天，　　號曰燃燈佛，
　^lb諸仙之導師，　　度脫無量眾。
　是妙光法師，　　^lb時有一弟子，
　心常懷懈怠，　　貪著於名利，
　^lb求名利無厭，　　多遊族姓家，
　棄捨所習誦，　　^lb廢忘不通利。
　以是因緣故，　　號之為求名。
　^lb亦行眾善業，　　得見無數佛，
　供養於諸佛，　　^pb43隨順行大道，
　具六波羅蜜，　　今見釋師子。
　^lb其後當作佛，　　號名曰彌勒，
　廣度諸眾生，　　^lb其數無有量。
　彼佛滅度後，　　懈怠者汝是；
　^lb妙光法師者，　　今則我身是。
　我見燈明佛，　　^lb本光瑞如此，
　以是知今佛，　　欲說法華經。
　^lb今相如本瑞，　　是諸佛方便，
　今佛放光明，　　^pb44助發實相義。
　諸人今當知，　　合掌一心待，
　^lb佛當雨法雨，　　充足求道者。
　諸求三乘人，　　^lb若有疑悔者，
　佛當為除斷，　　令盡無有餘。」
^lb^ck2〔方便品第二〕
^lb^cb#05b25爾時，世尊從三昧安詳而起，告舍利弗：「諸佛^lb智慧甚深無量，其智慧門難解難入，一切聲^pb45聞、辟支佛所不能知。
所以者何？佛曾親近百^lb千萬億無數諸佛，盡行諸佛無量道法，勇猛^lb精進名稱普聞，成就甚深未曾有法，隨宜所^lb說意趣難解。
舍利弗！吾從成佛已來，種種因^lb緣，種種譬喻，廣演言教無數方便，引導眾生^lb令離諸著。
所以者何？如來方便知見波羅蜜^pb46皆已具足。舍利弗！如來知見，廣大深遠，無量^lb無礙，力、無所畏、禪定、解脫三昧，深入無際，成^lb就一切未曾有法。
舍利弗！如來能種種分別，^lb巧說諸法，言辭柔軟，悅可眾心。
舍利弗！取要^lb言之，無量無邊未曾有法，佛悉成就。
^cb#05c09「止，舍利^lb弗！不須復說。
所以者何？佛所成就第一希有^pb47難解之法。唯佛與佛乃能究盡諸法實相，所^lb謂諸法如是相，如是性，如是體，如是力，如是^lb作，如是因，如是緣，如是果，如是報，如是本末^lb究竟等。」
^cb#05c14爾時世尊欲重宣此義，而說偈言：
^lb「世雄不可量，　　諸天及世人，
　一切眾生類，　　^lb無能知佛者。
　佛力無所畏、　　解脫諸三昧，
　^pb48及佛諸餘法，　　無能測量者。
　本從無數佛，　　^lb具足行諸道，
　甚深微妙法，　　難見難可了。
　^lb於無量億劫，　　行此諸道已，
　道場得成果，　　^lb我已悉知見。
　如是大果報，　　種種性相義，
　^lb我及十方佛，　　乃能知是事。
　是法不可示，　　^lb言辭相寂滅，
　諸餘眾生類，　　無有能得解，
　^pb49除諸菩薩眾、　　信力堅固者。
　諸佛弟子眾，　　^lb曾供養諸佛，
　一切漏已盡，　　住是最後身，
　^lb如是諸人等，　　其力所不堪。
　假使滿世間，　　^lb皆如舍利弗，
　盡思共度量，　　不能測佛智。
　^lb正使滿十方，　　皆如舍利弗，
　及餘諸弟子，　　^lb亦滿十方剎，
　盡思共度量，　　亦復不能知。
　^pb50辟支佛利智，　　無漏最後身，
　亦滿十方界，　　^lb其數如竹林，
　斯等共一心，　　於億無量劫，
　^lb欲思佛實智，　　莫能知少分。
　新發意菩薩，　　^lb供養無數佛，
　了達諸義趣，　　又能善說法，
　^lb如稻麻竹葦，　　充滿十方剎，
　一心以妙智，　　^lb於恒河沙劫，
　咸皆共思量，　　不能知佛智。
　^pb51不退諸菩薩，　　其數如恒沙，
　一心共思求，　　^lb亦復不能知。
　又告舍利弗：　　『無漏不思議，
　^lb甚深微妙法，　　我今已具得，
　唯我知是相，　　^lb十方佛亦然。
　舍利弗當知，　　諸佛語無異，
　^lb於佛所說法，　　當生大信力，
　世尊法久後，　　^lb要當說真實。』
　告諸聲聞眾，　　及求緣覺乘：
^pb52『我令脫苦縛，　　逮得涅槃者。』
　佛以方便力，　　^lb示以三乘教，
　眾生處處著，　　引之令得出。」
^lb^cb#06a28爾時大眾中，有諸聲聞漏盡阿羅漢，阿若憍^lb陳如等千二百人，及發聲聞、辟支佛心比丘、^lb比丘尼、優婆塞、優婆夷，各作是念：「今者、世尊^lb何故慇懃稱歎方便而作是言：『佛所得法甚^pb53深難解，有所言說意趣難知，一切聲聞、辟支^lb佛所不能及。』佛說一解脫義，我等亦得此法^lb到於涅槃，而今不知是義所趣。」
^cb#06b07爾時舍利弗^lb知四眾心疑，自亦未了，而白佛言：「世尊！何因^lb何緣慇懃稱歎諸佛第一方便、甚深微妙、難^lb解之法？我自昔來，未曾從佛聞如是說；今者^pb54四眾咸皆有疑。唯願世尊敷演斯事。世尊何^lb故慇懃稱歎甚深微妙難解之法？」
^cb#06b12爾時舍利^lb弗欲重宣此義，而說偈言：
^lb^gatha「慧日大聖尊，　　久乃說是法，
　自說得如是，　　^lb力無畏三昧、
　禪定解脫等，　　不可思議法。
　^lb道場所得法，　　無能發問者；
　我意難可測，　　^pb55亦無能問者。
　無問而自說，　　稱歎所行道，
　^lb智慧甚微妙，　　諸佛之所得。
　無漏諸羅漢，　　^lb及求涅槃者，
　今皆墮疑網，　　佛何故說是？
　^lb其求緣覺者，　　比丘比丘尼，
　諸天龍鬼神，　　^lb及乾闥婆等，
　相視懷猶豫，　　瞻仰兩足尊，
　^lb是事為云何，　　願佛為解說。
　於諸聲聞眾，　　^pb56佛說我第一。
　我今自於智，　　疑惑不能了，
　^lb為是究竟法？　　為是所行道？
　佛口所生子，　　^lb合掌瞻仰待，
　願出微妙音，　　時為如實說。
　^lb諸天龍神等，　　其數如恒沙，
　求佛諸菩薩，　　^lb大數有八萬，
　又諸萬億國，　　轉輪聖王至，
　^lb合掌以敬心，　　欲聞具足道。」
^pb57^cb#06c07爾時佛告舍利弗：「止，止！不須復說。
若說是事，^lb一切世間諸天及人皆當驚疑。」
^cb#06c08舍利弗重白^lb佛言：「世尊，唯願說之，唯願說之！所以者何？是^lb會無數百千萬億阿僧祇眾生，曾見諸佛，諸^lb根猛利，智慧明了，聞佛所說，則能敬信。」
^cb#06c12爾時^lb舍利弗欲重宣此義，而說偈言：
^pb58「法王無上尊，　　唯說願勿慮。
　是會無量眾，　　^lb有能敬信者。」
^lb^cb#06c16佛復止舍利弗：「若說是事，一切世間天、人、阿^lb修羅皆當驚疑，增上慢比丘將墜於大坑。」
^cb#06c18爾^lb時世尊重說偈言：
^lb^gatha「止止不須說，　　我法妙難思。
　諸增上慢者，　　^pb59聞必不敬信。」
^lb^cb#06c21爾時舍利弗重白佛言：「世尊！唯願說之，唯願^lb說之！今此會中，如我等比百千萬億，世世已^lb曾從佛受化。
如此人等，必能敬信，長夜安隱，^lb多所饒益。」
^cb#06c24爾時舍利弗欲重宣此義，而說偈^lb言：
^pb60「無上兩足尊，　　願說第一法，
　我為佛長子，　　^lb唯垂分別說。
　是會無量眾，　　能敬信此法，
　^lb佛已曾世世，　　教化如是等，
　皆一心合掌，　　^lb欲聽受佛語。
　我等千二百，　　及餘求佛者，
　^lb願為此眾故，　　唯垂分別說。
　是等聞此法，　　^lb則生大歡喜。」
^pb61^cb#07a05爾時世尊告舍利弗：「汝已慇懃三請，豈得不^lb說。
汝今諦聽，善思念之，吾當為汝分別解說。」^lb說此語時，會中有比丘、比丘尼、優婆塞、優婆^lb夷五千人等，即從座起，禮佛而退。
所以者何？^lb此輩罪根深重及增上慢，未得謂得、未證謂^lb證，有如此失，是以不住。世尊默然而不制止。
^pb62^cb#07a12爾時佛告舍利弗：「我今此眾，無復枝葉，純有^lb真實。
舍利弗！如是增上慢人，退亦佳矣。汝今^lb善聽，當為汝說。」
^cb#07a14舍利弗言：「唯然，世尊！願樂欲^lb聞。」
^cb#07a15佛告舍利弗：「如是妙法，諸佛如來時乃說^lb之，如優曇鉢華，時一現耳。
舍利弗！汝等當信^lb佛之所說，言不虛妄。舍利弗！諸佛隨宜說法，^pb63意趣難解。
所以者何？我以無數方便，種種因^lb緣、譬喻言辭，演說諸法。
是法非思量分別之^lb所能解，唯有諸佛乃能知之。
所以者何？諸佛^lb世尊唯以一大事因緣故出現於世。
舍利弗！^lb云何名諸佛世尊唯以一大事因緣故出現^lb於世？
諸佛世尊，欲令眾生開佛知見，使得清^pb64淨故，出現於世；欲示眾生佛之知見故，出現^lb於世；欲令眾生悟佛知見故，出現於世；欲令^lb眾生入佛知見道故，出現於世。
舍利弗！是為^lb諸佛以一大事因緣故出現於世。」
^cb#07a29佛告舍利^lb弗：「諸佛如來但教化菩薩，諸有所作，常為一^lb事，唯以佛之知見示悟眾生。
舍利弗！如來但^pb65以一佛乘故，為眾生說法，無有餘乘，若二、若^lb三。
舍利弗！一切十方諸佛，法亦如是。
^cb#07b04「舍利弗！^lb過去諸佛，以無量無數方便，種種因緣、譬喻^lb言辭，而為眾生演說諸法，是法皆為一佛乘^lb故。
是諸眾生，從諸佛聞法，究竟皆得一切種^lb智。
^cb#07b07「舍利弗！未來諸佛當出於世，亦以無量無^pb66數方便，種種因緣、譬喻言辭，而為眾生演說^lb諸法，是法皆為一佛乘故。
是諸眾生，從佛聞^lb法，究竟皆得一切種智。
^cb#07b11「舍利弗！現在十方無^lb量百千萬億佛土中，諸佛世尊多所饒益安^lb樂眾生，是諸佛亦以無量無數方便，種種因^lb緣、譬喻言辭，而為眾生演說諸法，是法皆為^pb67一佛乘故。
是諸眾生，從佛聞法，究竟皆得一^lb切種智。
^cb#07b16「舍利弗！是諸佛但教化菩薩，欲以佛^lb之知見示眾生故，欲以佛之知見悟眾生故，^lb欲令眾生入佛之知見故。
^cb#07b18「舍利弗！我今亦復^lb如是，知諸眾生有種種欲，深心所著，隨其本^lb性，以種種因緣、譬喻言辭，方便力而為說法。
^pb68舍利弗！如此皆為得一佛乘、一切種智故。
^cb#07b22「舍^lb利弗！十方世界中，尚無二乘，何況有三。
舍利^lb弗！諸佛出於五濁惡世，所謂劫濁、煩惱濁、眾^lb生濁、見濁、命濁。
如是，舍利弗！劫濁亂時，眾生^lb垢重，慳貪嫉妬，成就諸不善根故，諸佛以方^lb便力，於一佛乘分別說三。
舍利弗！若我弟子，^pb69自謂阿羅漢、辟支佛者，不聞不知諸佛如來^lb但教化菩薩事，此非佛弟子，非阿羅漢，非辟^lb支佛。
^cb#07b29「又，舍利弗！是諸比丘、比丘尼，自謂已得^lb阿羅漢，是最後身，究竟涅槃，便不復志求阿^lb耨多羅三藐三菩提，當知此輩皆是增上慢^lb人。
所以者何。若有比丘、實得阿羅漢，若不信^pb70此法，無有是處。除佛滅度後，現前無佛。
所以^lb者何？佛滅度後，如是等經受持讀誦解義者，^lb是人難得。若遇餘佛，於此法中便得決了。舍^lb利弗！汝等當一心信解受持佛語。諸佛如來^lb言無虛妄，無有餘乘，唯一佛乘。」
^cb#07c09爾時世尊欲^lb重宣此義，而說偈言：
^pb71^gatha「比丘比丘尼，　　有懷增上慢，
　優婆塞我慢，　　^lb優婆夷不信，
　如是四眾等，　　其數有五千，
　^lb不自見其過，　　於戒有缺漏，
　護惜其瑕疵。　　^lb是小智已出，
　眾中之糟糠，　　佛威德故去，
　^lb斯人尠福德，　　不堪受是法。
　此眾無枝葉，　　^lb唯有諸真實。
　舍利弗善聽！　　諸佛所得法，
　^pb72無量方便力，　　而為眾生說。
　眾生心所念，　　^lb種種所行道，
　若干諸欲性，　　先世善惡業。
　^lb佛悉知是已，　　以諸緣譬喻、
　言辭方便力，　　^lb令一切歡喜。
　或說修多羅、　　伽陀及本事、
　^lb本生未曾有，　　亦說於因緣、
　譬喻并祇夜、　　^lb優波提舍經。
　鈍根樂小法，　　貪著於生死，
　^pb73於諸無量佛，　　不行深妙道，
　眾苦所惱亂，　　^lb為是說涅槃。
　我設是方便，　　令得入佛慧，
　^lb未曾說汝等，　　當得成佛道。
　所以未曾說，　　^lb說時未至故，
　今正是其時，　　決定說大乘。
　^lb我此九部法，　　隨順眾生說，
　入大乘為本，　　^lb以故說是經。
　有佛子心淨，　　柔軟亦利根，
　^pb74無量諸佛所，　　而行深妙道。
　為此諸佛子，　　^lb說是大乘經，
　我記如是人，　　來世成佛道，
　^lb以深心念佛，　　修持淨戒故。
　此等聞得佛，　　^lb大喜充遍身，
　佛知彼心行，　　故為說大乘。
　^lb聲聞若菩薩，　　聞我所說法，
　乃至於一偈，　　^lb皆成佛無疑。
　十方佛土中，　　唯有一乘法，
　^pb75無二亦無三。　　除佛方便說。
　但以假名字，　　^lb引導於眾生，
　說佛智慧故，　　諸佛出於世。
　^lb唯此一事實，　　餘二則非真，
　終不以小乘，　　^lb濟度於眾生。
　佛自住大乘，　　如其所得法，
　^lb定慧力莊嚴，　　以此度眾生。
　自證無上道，　　^lb大乘平等法，
　若以小乘化，　　乃至於一人，
　^pb76我則墮慳貪，　　此事為不可。
　若人信歸佛，　　^lb如來不欺誑，
　亦無貪嫉意，　　斷諸法中惡。
　^lb故佛於十方，　　而獨無所畏。
　我以相嚴身，　　^lb光明照世間，
　無量眾所尊，　　為說實相印。
　^lb舍利弗當知，　　我本立誓願，
　欲令一切眾，　　^lb如我等無異。
　如我昔所願，　　今者已滿足，
　^pb77化一切眾生，　　皆令入佛道。
　若我遇眾生，　　^lb盡教以佛道，
　無智者錯亂，　　迷惑不受教。
　^lb我知此眾生，　　未曾修善本，
　堅著於五欲，　　^lb癡愛故生惱。
　以諸欲因緣，　　墜墮三惡道，
　^lb輪迴六趣中，　　備受諸苦毒，
　受胎之微形，　　^lb世世常增長。
　薄德少福人，　　眾苦所逼迫，
　^pb78入邪見稠林，　　若有若無等。
　依止此諸見，　　^lb具足六十二，
　深著虛妄法，　　堅受不可捨，
　^lb我慢自矜高，　　諂曲心不實，
　於千萬億劫，　　^lb不聞佛名字，
　亦不聞正法，　　如是人難度。
　^lb是故舍利弗！　　我為設方便，
　說諸盡苦道，　　^lb示之以涅槃。
　我雖說涅槃，　　是亦非真滅，
　^pb79諸法從本來，　　常自寂滅相。
　佛子行道已，　　^lb來世得作佛，
　我有方便力，　　開示三乘法。
　^lb一切諸世尊，　　皆說一乘道，
　今此諸大眾，　　^lb皆應除疑惑，
　諸佛語無異，　　唯一無二乘。
　^lb過去無數劫，　　無量滅度佛，
　百千萬億種，　　^lb其數不可量。
　如是諸世尊，　　種種緣譬喻，
　^pb80無數方便力，　　演說諸法相。
　是諸世尊等，　　^lb皆說一乘法，
　化無量眾生，　　令入於佛道。
　^lb又諸大聖主，　　知一切世間，
　天人群生類，　　^lb深心之所欲，
　更以異方便，　　助顯第一義。
　^lb若有眾生類，　　值諸過去佛，
　若聞法布施，　　^lb或持戒忍辱、
　精進禪智等，　　種種修福慧。
　^pb81如是諸人等，　　皆已成佛道。
　諸佛滅度已，　　^lb若人善軟心，
　如是諸眾生，　　皆已成佛道。
　^lb諸佛滅度已，　　供養舍利者，
　起萬億種塔，　　^lb金銀及玻璃、
　硨磲與碼碯、　　玫瑰瑠璃珠，
　^lb清淨廣嚴飾，　　莊校於諸塔。
　或有起石廟，　　^lb栴檀及沈水，
　木櫁并餘材，　　塼瓦泥土等。
　^pb82若於曠野中，　　積土成佛廟，
　乃至童子戲，　　^lb聚沙為佛塔，
　如是諸人等，　　皆已成佛道。
　^lb若人為佛故，　　建立諸形像，
　刻雕成眾相，　　^lb皆已成佛道。
　或以七寶成，　　鍮石赤白銅、
　^lb白鑞及鉛錫，　　鐵木及與泥，
　或以膠漆布，　　^lb嚴飾作佛像，
　如是諸人等，　　皆已成佛道。
　^pb83彩畫作佛像，　　百福莊嚴相，
　自作若使人，　　^lb皆已成佛道。
　乃至童子戲，　　若草木及筆，
　^lb或以指爪甲，　　而畫作佛像，
　如是諸人等，　　^lb漸漸積功德，
　具足大悲心，　　皆已成佛道。
　^lb但化諸菩薩，　　度脫無量眾。
　若人於塔廟、　　^lb寶像及畫像，
　以華香幡蓋，　　敬心而供養。
　^pb84若使人作樂，　　擊鼓吹角貝，
　簫笛琴箜篌、　　^lb琵琶鐃銅鈸，
　如是眾妙音，　　盡持以供養。
　^lb或以歡喜心，　　歌唄頌佛德，
　乃至一小音，　　^lb皆已成佛道。
　若人散亂心，　　乃至以一華，
　^lb供養於畫像，　　漸見無數佛。
　或有人禮拜，　　^lb或復但合掌，
　乃至舉一手，　　或復小低頭，
　^pb85以此供養像，　　漸見無量佛。
　自成無上道，　　^lb廣度無數眾，
　入無餘涅槃，　　如薪盡火滅。
　^lb若人散亂心，　　入於塔廟中，
　一稱南無佛，　　^lb皆已成佛道。
　於諸過去佛，　　在世或滅度，
　^lb若有聞是法，　　皆已成佛道。
　未來諸世尊，　　^lb其數無有量，
　是諸如來等，　　亦方便說法。
　^pb86一切諸如來，　　以無量方便，
　度脫諸眾生，　　^lb入佛無漏智，
　若有聞法者，　　無一不成佛。
　^lb諸佛本誓願，　　我所行佛道，
　普欲令眾生，　　^lb亦同得此道。
　未來世諸佛，　　雖說百千億，
　^lb無數諸法門，　　其實為一乘。
　諸佛兩足尊，　　^lb知法常無性，
　佛種從緣起，　　是故說一乘。
　^pb87是法住法位，　　世間相常住，
　於道場知已，　　^lb導師方便說。
　天人所供養，　　現在十方佛，
　^lb其數如恒沙，　　出現於世間，
　安隱眾生故，　　^lb亦說如是法。
　知第一寂滅，　　以方便力故，
　^lb雖示種種道，　　其實為佛乘。
　知眾生諸行，　　^lb深心之所念，
　過去所習業，　　欲性精進力，
　^pb88及諸根利鈍，　　以種種因緣、
　譬喻亦言辭，　　^lb隨應方便說。
　今我亦如是，　　安隱眾生故，
　^lb以種種法門，　　宣示於佛道。
　我以智慧力，　　^lb知眾生性欲，
　方便說諸法，　　皆令得歡喜。
　^lb舍利弗當知！　　我以佛眼觀，
　見六道眾生，　　^lb貧窮無福慧，
　入生死嶮道，　　相續苦不斷，
　^pb89深著於五欲，　　如犛牛愛尾，
　以貪愛自蔽，　　^lb盲瞑無所見。
　不求大勢佛，　　及與斷苦法，
　^lb深入諸邪見，　　以苦欲捨苦，
　為是眾生故，　　^lb而起大悲心。
　我始坐道場，　　觀樹亦經行，
　^lb於三七日中，　　思惟如是事，
　我所得智慧，　　^lb微妙最第一。
　眾生諸根鈍，　　著樂癡所盲，
　^pb90如斯之等類，　　云何而可度？
　爾時諸梵王，　　^lb及諸天帝釋、
　護世四天王，　　及大自在天，
　^lb并餘諸天眾，　　眷屬百千萬，
　恭敬合掌禮，　　^lb請我轉法輪。
　我即自思惟：　　『若但讚佛乘，
　^lb眾生沒在苦，　　不能信是法；
　破法不信故，　　^lb墜於三惡道。
　我寧不說法，　　疾入於涅槃。
　^pb91尋念過去佛，　　所行方便力，
　我今所得道，　　^lb亦應說三乘。』
　作是思惟時，　　十方佛皆現，
　^lb梵音慰喻我：　　『善哉釋迦文！
　第一之導師，　　^lb得是無上法，
　隨諸一切佛，　　而用方便力。
　^lb我等亦皆得，　　最妙第一法，
　為諸眾生類、　　^lb分別說三乘。
　少智樂小法，　　不自信作佛，
　^pb92是故以方便，　　分別說諸果。
　雖復說三乘，　　^lb但為教菩薩。』
　舍利弗當知！　　我聞聖師子，
　^lb深淨微妙音，　　喜稱南無佛。
　復作如是念：　　^lb『我出濁惡世，
　如諸佛所說，　　我亦隨順行。』
　^lb思惟是事已，　　即趣波羅柰。
　諸法寂滅相，　　^lb不可以言宣，
　以方便力故，　　為五比丘說。
　^pb93是名轉法輪，　　便有涅槃音，
　及以阿羅漢，　　^lb法僧差別名。
　從久遠劫來，　　讚示涅槃法，
　^lb生死苦永盡，　　我常如是說。
　舍利弗當知！　　^lb我見佛子等，
　志求佛道者，　　無量千萬億，
　^lb咸以恭敬心，　　皆來至佛所，
　曾從諸佛聞，　　^lb方便所說法。
　我即作是念：　　『如來所以出，
　^pb94為說佛慧故，　　今正是其時。』
　舍利弗當知！　　^lb鈍根小智人、
　著相憍慢者，　　不能信是法。
　^lb今我喜無畏，　　於諸菩薩中，
　正直捨方便，　　^lb但說無上道。
　菩薩聞是法，　　疑網皆已除，
　^lb千二百羅漢，　　悉亦當作佛。
　如三世諸佛，　　^lb說法之儀式，
　我今亦如是，　　說無分別法。
　^pb95諸佛興出世，　　懸遠值遇難，
　正使出于世，　　^lb說是法復難。
　無量無數劫，　　聞是法亦難，
　^lb能聽是法者，　　斯人亦復難。
　譬如優曇花，　　^lb一切皆愛樂，
　天人所希有，　　時時乃一出。
　^lb聞法歡喜讚，　　乃至發一言，
　則為已供養，　　^lb一切三世佛，
　是人甚希有，　　過於優曇花。
　^pb96汝等勿有疑，　　我為諸法王，
　普告諸大眾，　　^lb但以一乘道，
　教化諸菩薩，　　無聲聞弟子。
　^lb汝等舍利弗，　　聲聞及菩薩，
　當知是妙法，　　^lb諸佛之祕要。
　以五濁惡世，　　但樂著諸欲，
　^lb如是等眾生，　　終不求佛道。
　當來世惡人，　　^lb聞佛說一乘，
　迷惑不信受，　　破法墮惡道。
　^pb97有慚愧清淨，　　志求佛道者，
　當為如是等，　　^lb廣讚一乘道。
　舍利弗當知！　　諸佛法如是，
　^lb以萬億方便，　　隨宜而說法，
　其不習學者，　　^lb不能曉了此。
　汝等既已知，　　諸佛世之師，
　^lb隨宜方便事，　　無復諸疑惑，
　心生大歡喜，　　^lb自知當作佛。」
^pb98妙法蓮華經卷第一
^lb音釋
^pb1^folio#sdpdrk2^bk#sdpdrk2<hidden=1>【妙法蓮華經卷第二】^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck3〔譬喻品第三〕
^lb^cb#10b29爾時舍利弗踊躍歡喜，即起合掌，瞻仰尊顏^lb而白佛言：「今從世尊聞此法音，心懷勇躍，得^lb未曾有。
所以者何？我昔從佛聞如是法，見諸^pb2菩薩授記作佛，而我等不豫斯事，甚自感傷，^lb失於如來無量知見。
世尊！我常獨處山林樹^lb下，若坐若行，每作是念：『我等同入法性，云何^lb如來以小乘法而見濟度？是我等咎，非世尊^lb也。
所以者何？若我等待說所因成就阿耨多^lb羅三藐三菩提者，必以大乘而得度脫。
然我^pb3等不解方便隨宜所說，初聞佛法，遇便信受、^lb思惟、取證。』世尊！我從昔來，終日竟夜每自剋^lb責，而今從佛聞所未聞未曾有法，斷諸疑悔，^lb身意泰然，快得安隱。
今日乃知真是佛子，從^lb佛口生，從法化生，得佛法分。」
^cb#10c14爾時舍利弗欲^lb重宣此義，而說偈言：
^pb4^gatha「我聞是法音，　　得所未曾有，
　心懷大歡喜，　　^lb疑網皆已除。
　昔來蒙佛教，　　不失於大乘，
　^lb佛音甚希有，　　能除眾生惱，
　我已得漏盡，　　^lb聞亦除憂惱。
　我處於山谷，　　或在林樹下，
　^lb若坐若經行，　　常思惟是事，
　嗚呼深自責，　　^lb云何而自欺？
　我等亦佛子，　　同入無漏法，
　^pb5不能於未來，　　演說無上道。
　金色三十二，　　^lb十力諸解脫，
　同共一法中，　　而不得此事；
　^lb八十種妙好，　　十八不共法，
　如是等功德，　　^lb而我皆已失。
　我獨經行時，　　見佛在大眾，
　^lb名聞滿十方，　　廣饒益眾生。
　自惟失此利，　　^lb我為自欺誑。
　我常於日夜，　　每思惟是事，
　^pb6欲以問世尊，　　為失為不失？
　我常見世尊，　　^lb稱讚諸菩薩，
　以是於日夜，　　籌量如此事。
　^lb今聞佛音聲，　　隨宜而說法，
　無漏難思議，　　^lb令眾至道場。
　我本著邪見，　　為諸梵志師，
　^lb世尊知我心，　　拔邪說涅槃。
　我悉除邪見，　　^lb於空法得證，
　爾時心自謂，　　得至於滅度；
　^pb7而今乃自覺，　　非是實滅度。
　若得作佛時，　　^lb具三十二相，
　天人夜叉眾，　　龍神等恭敬，
　^lb是時乃可謂，　　永盡滅無餘。
　佛於大眾中，　　^lb說我當作佛，
　聞如是法音，　　疑悔悉已除。
　^lb初聞佛所說，　　心中大驚疑，
　將非魔作佛，　　^lb惱亂我心耶？
　佛以種種緣、　　譬喻巧言說，
　^pb8其心安如海，　　我聞疑網斷。
　佛說過去世，　　^lb無量滅度佛，
　安住方便中，　　亦皆說是法。
　^lb現在未來佛，　　其數無有量，
　亦以諸方便，　　^lb演說如是法。
　如今者世尊，　　從生及出家、
　^lb得道轉法輪，　　亦以方便說。
　世尊說實道，　　^lb波旬無此事，
　以是我定知，　　非是魔作佛。
　^pb9我墮疑網故，　　謂是魔所為，
　聞佛柔軟音，　　^lb深遠甚微妙，
　演暢清淨法。　　我心大歡喜，
　^lb疑悔永已盡，　　安住實智中。
　我定當作佛，　　^lb為天人所敬，
　轉無上法輪，　　教化諸菩薩。」
^lb^cb#11b09爾時佛告舍利弗：「吾今於天、人、沙門、婆羅門、^lb等大眾中說，我昔曾於二萬億佛所，為無上^pb10道故，常教化汝，汝亦長夜隨我受學。我以方^lb便引導汝故，生我法中。舍利弗！我昔教汝志^lb願佛道，汝今悉忘，而便自謂已得滅度。
我今^lb還欲令汝憶念本願所行道故，為諸聲聞說^lb是大乘經，名妙法蓮華，教菩薩法、佛所護念。
^lb^cb#11b16「舍利弗！汝於未來世，過無量無邊不可思議^pb11劫，供養若干千萬億佛，奉持正法，具足菩薩^lb所行之道，當得作佛，號曰華光如來、應供、正^lb遍知、明行足、善逝世間解、無上士、調御丈夫、^lb天人師、佛、世尊。
國名離垢，其土平正，清淨嚴^lb飾，安隱豐樂，天人熾盛。
琉璃為地，有八交道，^lb黃金為繩以界其側。其傍各有七寶行樹，常^pb12有華果。華光如來亦以三乘教化眾生。
^cb#11b24「舍利^lb弗！彼佛出時，雖非惡世，以本願故，說三乘法。^lb其劫名大寶莊嚴。何故名曰大寶莊嚴？其國^lb中以菩薩為大寶故。彼諸菩薩，無量無邊，不^lb可思議，算數譬喻所不能及，非佛智力無能^lb知者。若欲行時，寶華承足。此諸菩薩，非初發^pb13意，皆久殖德本，於無量百千萬億佛所淨修^lb梵行，恒為諸佛之所稱歎。
常修佛慧，具大神^lb通，善知一切諸法之門，質直無偽，志念堅固。^lb如是菩薩，充滿其國。
^cb#11c04「舍利弗！華光佛壽十二^lb小劫，除為王子未作佛時。其國人民，壽八小^lb劫。華光如來過十二小劫，授堅滿菩薩阿耨^pb14多羅三藐三菩提記。
告諸比丘：『是堅滿菩薩^lb次當作佛，號曰華足安行、多陀阿伽度、阿羅^lb訶、三藐三佛陀，其佛國土，亦復如是。』
^cb#11c10「舍利弗！^lb是華光佛滅度之後，正法住世三十二小劫，^lb像法住世亦三十二小劫。」
^cb#11c12爾時世尊欲重宣^lb此義，而說偈言：
^pb15^gatha「舍利弗來世，　　成佛普智尊，
　號名曰華光，　　^lb當度無量眾。
　供養無數佛，　　具足菩薩行，
　^lb十力等功德，　　證於無上道。
　過無量劫已，　　^lb劫名大寶嚴，
　世界名離垢，　　清淨無瑕穢。
　^lb以琉璃為地，　　金繩界其道，
　七寶雜色樹，　　^lb常有華菓實。
　彼國諸菩薩，　　志念常堅固，
　^pb16神通波羅蜜，　　皆已悉具足。
　於無數佛所，　　^lb善學菩薩道，
　如是等大士，　　華光佛所化。
　^lb佛為王子時，　　棄國捨世榮，
　於最末後身，　　^lb出家成佛道。
　華光佛住世，　　壽十二小劫，
　^lb其國人民眾，　　壽命八小劫。
　佛滅度之後，　　^lb正法住於世，
　三十二小劫，　　廣度諸眾生。
　^pb17正法滅盡已，　　像法三十二，
　舍利廣流布，　　^lb天人普供養。
　華光佛所為，　　其事皆如是，
　^lb其兩足聖尊，　　最勝無倫匹。
　彼即是汝身，　　^lb宜應自欣慶。」
^lb^cb#12a07爾時四部眾，比丘、比丘尼、優婆塞、優婆夷，天、^lb龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺^pb18羅伽等大眾，見舍利弗於佛前受阿耨多羅^lb三藐三菩提記，心大歡喜，踊躍無量，各各脫^lb身所著上衣、以供養佛。
釋提桓因、梵天王等，^lb與無數天子，亦以天妙衣、天^lb曼陀羅華、摩訶曼陀羅華等，供養於佛——所散天衣，住虛空中，^lb而自迴轉；諸天伎樂百千萬種，於虛空中一^pb19時俱作，雨眾天華——而作是言：「佛昔於波羅㮈^lb初轉法輪，今乃復轉無上最大法輪。」
^cb#12a17爾時諸^lb天子欲重宣此義，而說偈言：
^lb^gatha「昔於波羅㮈，　　轉四諦法輪，
　分別說諸法，　　^lb五眾之生滅。
　今復轉最妙，　　無上大法輪，
　^lb是法甚深奧，　　少有能信者。
　我等從昔來，　　^pb20數聞世尊說，
　未曾聞如是，　　深妙之上法。
　^lb世尊說是法，　　我等皆隨喜。
　大智舍利弗，　　^lb今得受尊記，
　我等亦如是，　　必當得作佛。
　^lb於一切世間，　　最尊無有上，
　佛道叵思議，　　^lb方便隨宜說。
　我所有福業，　　今世若過世，
　^lb及見佛功德，　　盡迴向佛道。」
^pb21^cb#12b02爾時舍利弗白佛言：「世尊！我今無復疑悔，親^lb於佛前得受阿耨多羅三藐三菩提記。
是諸^lb千二百心自在者，昔住學地，佛常教化言：『我^lb法能離生老病死，究竟涅槃。』是學無學人，亦^lb各自以離我見及有無見等謂得涅槃；而今^lb於世尊前聞所未聞，皆墮疑惑。
善哉，世尊！願^pb22為四眾說其因緣，令離疑悔。」
^cb#12b08爾時佛告舍利^lb弗：「我先不言：『諸佛世尊以種種因緣、譬喻言^lb辭方便說法，皆為阿耨多羅三藐三菩提耶？』^lb是諸所說，皆為化菩薩故。
然，舍利弗！今當復^lb以譬喻更明此義，諸有智者以譬喻得解。
^cb#12b13「舍^lb利弗！若國邑聚落，有大長者，其年衰邁，財富^pb23無量，多有田宅及諸僮僕。
其家廣大，唯有一^lb門，多諸人眾，一百、二百乃至五百人，止住其^lb中。
堂閣朽故，牆壁隤落，柱根腐敗，梁棟傾危，^lb周匝俱時歘然火起，焚燒舍宅。
長者諸子，若^lb十、二十，或至三十，在此宅中。
長者見是大火^lb從四面起，即大驚怖，而作是念：『我雖能於此^pb24所燒之門安隱得出，而諸子等，於火宅內樂^lb著嬉戲，不覺不知、不驚不怖，火來逼身，苦痛^lb切己，心不厭患，無求出意。』
^cb#12b23「舍利弗！是長者作^lb是思惟：『我身手有力，當以衣裓、若以机案，從^lb舍出之。』復更思惟：『是舍唯有一門，而復狹小。^lb諸子幼稚，未有所識，戀著戲處，或當墮落，為^pb25火所燒。
我當為說怖畏之事，此舍已燒，宜時^lb疾出，無令為火之所燒害。』
作是念已，如所思^lb惟，具告諸子，汝等速出。父雖憐愍、善言誘喻，^lb而諸子等樂著嬉戲，不肯信受，不驚不畏，了^lb無出心；亦復不知何者是火？何者為舍？云何^lb為失？但東西走戲，視父而已。
^cb#12c04「爾時長者即作^pb26是念：『此舍已為大火所燒，我及諸子若不時^lb出，必為所焚。
我今當設方便，令諸子等得免^lb斯害。』
父知諸子先心各有所好種種珍玩奇^lb異之物，情必樂著，而告之言：『汝等所可玩好，^lb希有難得，汝若不取，後必憂悔。
如此種種羊^lb車、鹿車、牛車，今在門外，可以遊戲。
汝等於此^pb27火宅、宜速出來，隨汝所欲，皆當與汝。』
爾時諸^lb子聞父所說珍玩之物，適其願故，心各勇銳，^lb互相推排，競共馳走，爭出火宅。
是時長者見^lb諸子等安隱得出，皆於四衢道中露地而坐，^lb無復障礙，其心泰然，歡喜踊躍。
時諸子等各^lb白父言：『父先所許玩好之具，羊車、鹿車、牛車，^pb28願時賜與。』
^cb#12c18「舍利弗！爾時長者各賜諸子等一^lb大車，其車高廣，眾寶莊校，周匝欄楯，四面懸^lb鈴；又於其上張設幰蓋，亦以珍奇雜寶而嚴^lb飾之，寶繩絞絡，垂諸華纓，重敷綩綖，安置丹^lb枕。
駕以白牛，膚色充潔，形體姝好，有大筋力，^lb行步平正，其疾如風；又多僕從而侍衛之。
所^pb29以者何？是大長者財富無量，種種諸藏悉皆^lb充溢，而作是念：『我財物無極，不應以下劣小^lb車與諸子等。今此幼童，皆是吾子，愛無偏黨。^lb我有如是七寶大車，其數無量，應當等心各^lb各與之，不宜差別。
所以者何？以我此物，周給^lb一國猶尚不匱，何況諸子！』是時諸子各乘大^pb30車，得未曾有，非本所望。
^cb#13a02「舍利弗！於汝意云何，^lb是長者等與諸子珍寶大車，寧有虛妄不？」
^cb#13a03舍^lb利弗言：「不也，世尊！是長者但令諸子得免火^lb難，全其軀命，非為虛妄。
何以故？若全身命，便^lb為已得玩好之具，況復方便於彼火宅而拔^lb濟之。
世尊！若是長者，乃至不與最小一車，猶^pb31不虛妄。
何以故？是長者先作是意：『我以方便^lb令子得出。』以是因緣，無虛妄也。何況長者自^lb知財富無量，欲饒益諸子，等與大車。」
^cb#13a10佛告舍^lb利弗：「善哉，善哉！如汝所言。
舍利弗！如來亦復^lb如是，則為一切世間之父。於諸怖畏、衰惱、憂^lb患、無明闇蔽，永盡無餘，而悉成就無量知見、^pb32力、無所畏，有大神力及智慧力，具足方便、智^lb慧波羅蜜，大慈大悲，常無懈惓，恒求善事，利^lb益一切，而生三界朽故火宅，為度眾生生老^lb病死、憂悲、苦惱、愚癡、闇蔽、三毒之火，教化令^lb得阿耨多羅三藐三菩提。
見諸眾生為生老^lb病死、憂悲苦惱之所燒煮，亦以五欲財利故，^pb33受種種苦；又以貪著追求故，現受眾苦，後受^lb地獄、畜生、餓鬼之苦；若生天上，及在人間，貧^lb窮困苦、愛別離苦、怨憎會苦，如是等種種諸^lb苦。
眾生沒在其中，歡喜遊戲，不覺不知、不驚^lb不怖，亦不生厭，不求解脫。
於此三界火宅東^lb西馳走，雖遭大苦，不以為患。
^cb#13a26「舍利弗！佛見此^pb34已，便作是念：『我為眾生之父，應拔其苦難，與^lb無量無邊佛智慧樂，令其遊戲。』
^cb#13a29「舍利弗！如來^lb復作是念：『若我但以神力及智慧力，捨於方^lb便，為諸眾生讚如來知見、力無所畏者，眾生^lb不能以是得度。
所以者何？是諸眾生，未免生^lb老病死、憂悲苦惱，而為三界火宅所燒；何由^pb35能解佛之智慧？』
^cb#13b04「舍利弗！如彼長者，雖復身手^lb有力而不用之，但以慇懃方便勉濟諸子火^lb宅之難，然後各與珍寶大車。
如來亦復如是，^lb雖有力、無所畏而不用之，但以智慧方便，於^lb三界火宅拔濟眾生，為說三乘——聲聞、辟支佛、^lb佛乘，而作是言：『汝等莫得樂住三界火宅，勿^pb36貪麁弊色聲香味觸也。若貪著生愛，則為所^lb燒。
汝速出三界，當得三乘——聲聞、辟支佛、佛乘。^lb我今為汝保任此事，終不虛也。汝等但當勤^lb修精進。』如來以是方便誘進眾生，復作是言：^lb『汝等當知此三乘法，皆是聖所稱歎，自在無^lb繫，無所依求。
乘是三乘，以無漏根、力、覺、道、禪^pb37定、解脫、三昧等而自娛樂，便得無量安隱快^lb樂。』
^cb#13b18「舍利弗！若有眾生，內有智性，從佛世尊聞^lb法信受，慇懃精進，欲速出三界，自求涅槃，是^lb名聲聞乘，如彼諸子為求羊車出於火宅；若^lb有眾生，從佛世尊聞法信受，慇懃精進，求自^lb然慧，樂獨善寂，深知諸法因緣，是名辟支佛^pb38乘，如彼諸子為求鹿車出於火宅；
若有眾生，^lb從佛世尊聞法信受，勤修精進，求一切智、佛^lb智、自然智、無師智，如來知見、力、無所畏，愍念、^lb安樂無量眾生，利益天人，度脫一切，是名大^lb乘，菩薩求此乘故，名為摩訶薩，如彼諸子為^lb求牛車、出於火宅。
^cb#13b29「舍利弗！如彼長者，見諸子^pb39等安隱得出火宅，到無畏處，自惟財富無量，^lb等以大車而賜諸子。
如來亦復如是，為一切^lb眾生之父，若見無量億千眾生，以佛教門出^lb三界苦，怖畏險道，得涅槃樂。
^cb#13c05「如來爾時便作^lb是念：『我有無量無邊智慧、力、無畏等諸佛法^lb藏，是諸眾生皆是我子，等與大乘，不令有人^pb40獨得滅度，皆以如來滅度而滅度之。』是諸眾^lb生脫三界者，悉與諸佛禪定、解脫等娛樂之^lb具，皆是一相、一種，聖所稱歎，能生淨妙第一^lb之樂。
^cb#13c10「舍利弗！如彼長者，初以三車誘引諸子，^lb然後但與大車，寶物莊嚴，安隱第一；然彼長^lb者無虛妄之咎。
如來亦復如是，無有虛妄，初^pb41說三乘引導眾生，然後但以大乘而度脫之。
^lb何以故？如來有無量智慧、力、無所畏諸法之^lb藏，能與一切眾生大乘之法，但不盡能受。
^cb#13c16「舍^lb利弗！以是因緣，當知諸佛方便力故，於一佛^lb乘分別說三。」
^cb#13c18佛欲重宣此義，而說偈言：
^lb^gatha「譬如長者，　　有一大宅，　　其宅久故，
　而復頓弊，　　^pb42堂舍高危，　　柱根摧朽，
　梁棟傾斜，　　基陛隤毀，　　^lb牆壁圮坼，
　泥塗褫落，　　覆苫亂墜，　　椽梠差脫，
　^lb周障屈曲，　　雜穢充遍。　　有五百人，
　止住其中。　　^lb鵄梟雕鷲、　　烏鵲鳩鴿、
　蚖蛇蝮蠍、　　蜈蚣蚰蜒、　　^lb守宮百足、
　狖貍鼷鼠，　　諸惡蟲輩，　　交橫馳走。
　^lb屎尿臭處，　　不淨流溢，　　蜣蜋諸蟲，
　而集其上。　　^pb43狐狼野干，　　咀嚼踐蹋，
　䶩齧死屍、　　骨肉狼藉。　　^lb由是群狗，
　競來搏撮，　　飢羸慞惶，　　處處求食。
　^lb鬪諍𪙁掣，　　嘊喍㘁吠，　　其舍恐怖，
　變狀如是。　　^lb處處皆有，　　魑魅魍魎、
　夜叉惡鬼，　　食噉人肉。　　^lb毒蟲之屬，
　諸惡禽獸，　　孚乳產生，　　各自藏護。
　^lb夜叉競來，　　爭取食之，　　食之既飽，
　惡心轉熾，　　^pb44鬪諍之聲，　　甚可怖畏。
　鳩槃荼鬼，　　蹲踞土埵，　　^lb或時離地，
　一尺二尺，　　往返遊行，　　縱逸嬉戲，
　^lb捉狗兩足，　　撲令失聲，　　以腳加頸，
　怖狗自樂。　　^lb復有諸鬼，　　其身長大，
　裸形黑瘦，　　常住其中，　　^lb發大惡聲，
　叫呼求食。　　復有諸鬼，　　其咽如針。
　^lb復有諸鬼，　　首如牛頭，　　或食人肉，
　或復噉狗，　　^pb45頭髮蓬亂，　　殘害凶險，
　飢渴所逼，　　叫喚馳走。　　^lb夜叉餓鬼，
　諸惡鳥獸，　　飢急四向，　　窺看窓牖。
　^lb如是諸難，　　恐畏無量。　　是朽故宅，
　屬于一人。　　^lb其人近出，　　未久之間，
　於後舍宅，　　欻然火起，　　^lb四面一時，
　其炎俱熾。　　棟梁椽柱，　　爆聲震裂，
　^lb摧折墮落，　　牆壁崩倒。　　諸鬼神等，
　揚聲大叫。　　^pb46雕鷲諸鳥、　　鳩槃荼等，
　周章惶怖，　　不能自出。　　^lb惡獸毒蟲，
　藏竄孔穴。　　毘舍闍鬼，　　亦住其中，
　^lb薄福德故，　　為火所逼，　　共相殘害，
　飲血噉肉。　　^lb野干之屬，　　竝已前死，
　諸大惡獸，　　競來食噉，　　^lb臭烟熢㶿，
　四面充塞。　　蜈蚣蚰蜒、　　毒蛇之類，
　^lb為火所燒，　　爭走出穴，　　鳩槃荼鬼、
　隨取而食。　　^pb47又諸餓鬼，　　頭上火燃，
　飢渴熱惱，　　周章悶走。　　^lb其宅如是，
　甚可怖畏，　　毒害火災，　　眾難非一。
　^lb是時宅主，　　在門外立，　　聞有人言：
『汝諸子等，　　^lb先因遊戲，　　來入此宅，
　稚小無知，　　歡娛樂著。』　　^lb長者聞已，
　驚入火宅，　　方宜救濟，　　令無燒害。
　^lb告喻諸子，　　說眾患難，　　惡鬼毒蟲，
　災火蔓延，　　^pb48眾苦次第，　　相續不絕。
　毒蛇蚖蝮，　　及諸夜叉、　　^lb鳩槃茶鬼，
　野干狐狗、　　雕鷲鵄梟，　　百足之屬，
　^lb飢渴惱急，　　甚可怖畏。　　此苦難處，
　況復大火。　　^lb諸子無知，　　雖聞父誨，
　猶故樂著，　　嬉戲不已。　　^lb是時長者，
　而作是念：　　『諸子如此，　　益我愁惱。
　^lb今此舍宅，　　無一可樂，　　而諸子等，
　耽湎嬉戲，　　^pb49不受我教，　　將為火害。』
　即便思惟，　　設諸方便，　　^lb告諸子等：
『我有種種，　　珍玩之具，　　妙寶好車，
　^lb羊車鹿車、　　大牛之車，　　今在門外。
　汝等出來，　　^lb吾為汝等，　　造作此車，
　隨意所樂，　　可以遊戲。』　　^lb諸子聞說，
　如此諸車，　　即時奔競，　　馳走而出，
　^lb到於空地，　　離諸苦難。　　長者見子，
　得出火宅，　　^pb50住於四衢。　　坐師子座，
　而自慶言：　　『我今快樂！　　^lb此諸子等，
　生育甚難，　　愚小無知，　　而入險宅。
　^lb多諸毒蟲，　　魑魅可畏，　　大火猛炎，
　四面俱起。　　^lb而此諸子，　　貪樂嬉戲。
　我已救之，　　令得脫難。　　^lb是故諸人，
　我今快樂。』　　爾時諸子，　　知父安坐，
　^lb皆詣父所，　　而白父言：　　『願賜我等，
　三種寶車。　　^pb51如前所許：　　「諸子出來，
　當以三車，　　隨汝所欲。」　　^lb今正是時，
　唯垂給與。』　　長者大富，　　庫藏眾多，
　^lb金銀琉璃、　　車璩馬腦，　　以眾寶物，
　造諸大車。　　^lb莊校嚴飾，　　周匝欄楯，
　四面懸鈴，　　金繩交絡。　　^lb真珠羅網，
　張施其上，　　金華諸瓔，　　處處垂下，
　^lb眾綵雜飾，　　周匝圍繞，　　柔軟繒纊，
　以為茵蓐。　　^pb52上妙細㲲，　　價直千億，
　鮮白淨潔，　　以覆其上。　　^lb有大白牛，
　肥壯多力，　　形體姝好，　　以駕寶車。
　^lb多諸儐從，　　而侍衛之。　　以是妙車，
　等賜諸子。　　^lb諸子是時，　　歡喜踊躍，
　乘是寶車，　　遊於四方，　　^lb嬉戲快樂，
　自在無礙。　　告舍利弗：　　『我亦如是，
　^lb眾聖中尊，　　世間之父。　　一切眾生，
　皆是吾子，　　^pb53深著世樂，　　無有慧心。
　三界無安，　　猶如火宅，　　^lb眾苦充滿，
　甚可怖畏。　　常有生老、　　病死憂患，
　^lb如是等火，　　熾然不息。　　如來已離，
　三界火宅，　　^lb寂然閑居，　　安處林野。
　今此三界，　　皆是我有，　　^lb其中眾生，
　悉是吾子。　　而今此處，　　多諸患難，
　^lb唯我一人，　　能為救護。　　雖復教詔，
　而不信受，　　^pb54於諸欲染，　　貪著深故。
　以是方便，　　為說三乘，　　^lb令諸眾生，
　知三界苦，　　開示演說，　　出世間道。
　^lb是諸子等，　　若心決定，　　具足三明，
　及六神通，　　^lb有得緣覺、　　不退菩薩。
　汝舍利弗！　　我為眾生，　　^lb以此譬喻，
　說一佛乘。　　汝等若能，　　信受是語，
　^lb一切皆當，　　得成佛道。　　是乘微妙、
　清淨第一，　　^pb55於諸世間，　　為無有上，
　佛所悅可。　　一切眾生，　　^lb所應稱讚、
　供養禮拜。　　無量億千，　　諸力解脫、
　^lb禪定智慧，　　及佛餘法，　　得如是乘。
　令諸子等，　　^lb日夜劫數，　　常得遊戲，
　與諸菩薩，　　及聲聞眾，　　^lb乘此寶乘，
　直至道場。　　以是因緣，　　十方諦求，
　^lb更無餘乘，　　除佛方便。』　　告舍利弗：
『汝諸人等，　　^pb56皆是吾子，　　我則是父。
　汝等累劫，　　眾苦所燒，　　^lb我皆濟拔，
　令出三界。　　我雖先說：　　「汝等滅度。」
　^lb但盡生死，　　而實不滅；　　今所應作，
　唯佛智慧。　　^lb若有菩薩，　　於是眾中，
　能一心聽，　　諸佛實法。　　^lb諸佛世尊，
　雖以方便；　　所化眾生，　　皆是菩薩。
　^lb若人小智，　　深著愛欲，　　為此等故，
　說於苦諦。　　^pb57眾生心喜，　　得未曾有，
　佛說苦諦，　　真實無異。　　^lb若有眾生，
　不知苦本，　　深著苦因，　　不能暫捨。
　^lb為是等故，　　方便說道。　　諸苦所因，
　貪欲為本，　　^lb若滅貪欲，　　無所依止，
　滅盡諸苦，　　名第三諦。　　^lb為滅諦故，
　修行於道，　　離諸苦縛，　　名得解脫。
　^lb是人於何，　　而得解脫？　　但離虛妄，
　名為解脫；　　^pb58其實未得，　　一切解脫。
　佛說是人，　　未實滅度。　　^lb斯人未得，
　無上道故，　　我意不欲，　　令至滅度。
　^lb我為法王，　　於法自在，　　安隱眾生，
　故現於世。　　^lb汝舍利弗！　　我此法印，
　為欲利益，　　世間故說，　　^lb在所遊方，
　勿妄宣傳。　　若有聞者，　　隨喜頂受，
　^lb當知是人，　　阿鞞跋致。　　若有信受，
　此經法者，　　^pb59是人已曾，　　見過去佛，
　恭敬供養，　　亦聞是法。　　^lb若人有能，
　信汝所說，　　則為見我，　　亦見於汝，
　^lb及比丘僧，　　并諸菩薩。　　斯法華經，
　為深智說，　　^lb淺識聞之，　　迷惑不解。
　一切聲聞，　　及辟支佛，　　^lb於此經中，
　力所不及。　　汝舍利弗！　　尚於此經，
　^lb以信得入；　　況餘聲聞。　　其餘聲聞，
　信佛語故，　　^pb60隨順此經，　　非己智分。
　又舍利弗！　　憍慢懈怠、　　^lb計我見者，
　莫說此經。　　凡夫淺識，　　深著五欲，
　^lb聞不能解，　　亦勿為說。　　若人不信，
　毀謗此經，　　^lb則斷一切，　　世間佛種。
　或復顰蹙，　　而懷疑惑，　　^lb汝當聽說，
　此人罪報。　　若佛在世，　　若滅度後，
　^lb其有誹謗，　　如斯經典，　　見有讀誦、
　書持經者，　　^pb61輕賤憎嫉，　　而懷結恨。
　此人罪報，　　汝今復聽。　　^lb其人命終，
　入阿鼻獄，　　具足一劫，　　劫盡更生。
　^lb如是展轉，　　至無數劫，　　從地獄出，
　當墮畜生。　　^lb若狗野干，　　其形𩑔瘦，
　黧黮疥癩，　　人所觸嬈。　　^lb又復為人，
　之所惡賤，　　常困飢渴，　　骨肉枯竭，
　^lb生受楚毒，　　死被瓦石。　　斷佛種故，
　受斯罪報。　　^pb62若作馲駝，　　或生驢中，
　身常負重，　　加諸杖捶，　　^lb但念水草，
　餘無所知。　　謗斯經故，　　獲罪如是。
　^lb有作野干，　　來入聚落，　　身體疥癩，
　又無一目。　　^lb為諸童子，　　之所打擲，
　受諸苦痛，　　或時致死。　　^lb於此死已，
　更受蟒身。　　其形長大，　　五百由旬，
　^pb63聾騃無足，　　宛轉腹行，　　為諸小蟲，
　之所唼食，　　^lb晝夜受苦，　　無有休息。
　謗斯經故，　　獲罪如是。　　^lb若得為人，
　諸根闇鈍，　　矬陋攣躄，　　盲聾背傴。
　^lb有所言說，　　人不信受，　　口氣常臭，
　鬼魅所著。　　^lb貧窮下賤，　　為人所使，
　多病痟瘦，　　無所依怙。　　^lb雖親附人，
　人不在意，　　若有所得，　　尋復忘失。
　^lb若修醫道，　　順方治病，　　更增他疾，
　或復致死。　　^pb64若自有病，　　無人救療，
　設服良藥，　　而復增劇。　　^lb若他反逆、
　抄劫竊盜，　　如是等罪，　　橫羅其殃。
　^lb如斯罪人，　　永不見佛，　　眾聖之王，
　說法教化。　　^lb如斯罪人，　　常生難處，
　狂聾心亂，　　永不聞法。　　^lb於無數劫、
　如恒河沙，　　生輒聾瘂，　　諸根不具。
　^lb常處地獄，　　如遊園觀，　　在餘惡道，
　如己舍宅，　　^pb65駝驢猪狗，　　是其行處。
　謗斯經故，　　獲罪如是。　　^lb若得為人，
　聾盲瘖瘂、　　貧窮諸衰，　　以自莊嚴。
　^lb水腫乾痟、　　疥癩癰疽、　　如是等病，
　以為衣服。　　^lb身常臭處，　　垢穢不淨，
　深著我見，　　增益瞋恚，　　^lb婬欲熾盛，
　不擇禽獸。　　謗斯經故，　　獲罪如是。』
　^lb告舍利弗：　　『謗斯經者，　　若說其罪，
　窮劫不盡。　　^pb66以是因緣，　　我故語汝：
「無智人中，　　莫說此經。」　　^lb若有利根，
　智慧明了，　　多聞強識，　　求佛道者，
　^lb如是之人，　　乃可為說。　　若人曾見，
　億百千佛，　　^lb殖諸善本，　　深心堅固，
　如是之人，　　乃可為說。　　^lb若人精進，
　常修慈心，　　不惜身命，　　乃可為說。
　^lb若人恭敬，　　無有異心，　　離諸凡愚，
　獨處山澤，　　^pb67如是之人，　　乃可為說。
　又舍利弗！　　若見有人，　　^lb捨惡知識，
　親近善友，　　如是之人，　　乃可為說。
　^lb若見佛子，　　持戒清潔，　　如淨明珠，
　求大乘經，　　^lb如是之人，　　乃可為說。
　若人無瞋，　　質直柔軟，　　^lb常愍一切，
　恭敬諸佛，　　如是之人，　　乃可為說。
　^lb復有佛子，　　於大眾中，　　以清淨心，
　種種因緣、　　^pb68譬喻言辭，　　說法無礙，
　如是之人，　　乃可為說。　　^lb若有比丘，
　為一切智，　　四方求法，　　合掌頂受，
　^lb但樂受持，　　大乘經典，　　乃至不受，
　餘經一偈，　　^lb如是之人，　　乃可為說。
　如人至心，　　求佛舍利，　　^lb如是求經，
　得已頂受，　　其人不復，　　志求餘經，
　^lb亦未曾念，　　外道典籍，　　如是之人，
　乃可為說。』　　^pb69告舍利弗：　　『我說是相，
　求佛道者，　　窮劫不盡。』　　^lb如是等人，
　則能信解，　　汝當為說，　　妙法華經。」
^lb^ck4〔信解品第四〕
^lb^cb#16b08爾時慧命須菩提、摩訶迦旃延、摩訶迦葉、摩^lb訶目犍連，從佛所聞未曾有法，世尊授舍利^lb弗阿耨多羅三藐三菩提記，發希有心，歡喜^pb70踊躍，即從座起，整衣服偏袒右肩，右膝著地，^lb一心合掌，曲躬恭敬，瞻仰尊顏而白佛言：
「我^lb等居僧之首，年竝朽邁，自謂已得涅槃，無所^lb堪任，不復進求阿耨多羅三藐三菩提。
世尊^lb往昔說法既久，我時在座，身體疲懈，但念空、^lb無相、無作，於菩薩法——遊戲神通、淨佛國土、成^pb71就眾生——心不喜樂。
所以者何？世尊令我等出^lb於三界，得涅槃證。又今我等年已朽邁，於佛^lb教化菩薩阿耨多羅三藐三菩提，不生一念^lb好樂之心。
我等今於佛前，聞授聲聞阿耨多^lb羅三藐三菩提記，心甚歡喜，得未曾有。
不謂^lb於今，忽然得聞希有之法，深自慶幸，獲大善^pb72利，無量珍寶、不求自得。
^cb#16b25「世尊！我等今者樂說^lb譬喻以明斯義。
譬若有人，年既幼稚，捨父逃^lb逝，久住他國，或十、二十，至五十歲，年既長大，^lb加復窮困，馳騁四方以求衣食。
漸漸遊行，遇^lb向本國。其父先來，求子不得，中止一城。其家^lb大富，財寶無量——金、銀、琉璃、珊瑚、虎珀、頗梨珠^pb73等，其諸倉庫，悉皆盈溢；多有僮僕、臣佐、吏民；^lb象馬車乘，牛羊無數——出入息利，乃遍他國，商^lb估賈客亦甚眾多。
時貧窮子遊諸聚落，經^lb歷國邑，遂到其父所止之城。
父每念子，與子離^lb別五十餘年，而未曾向人說如此事，但自思^lb惟，心懷悔恨，自念老朽，多有財物，金銀珍寶，^pb74倉庫盈溢；無有子息，一旦終沒，財物散失，無^lb所委付。
是以慇懃每憶其子，復作是念：『我若^lb得子，委付財物，坦然快樂，無復憂慮。』
^cb#16c11「世尊！爾^lb時窮子傭賃展轉遇到父舍，住立門側。
遙見^lb其父、踞師子床，寶机承足，諸婆羅門、剎利、居^lb士皆恭敬圍繞，以真珠瓔珞，價直千萬，莊嚴^pb75其身；吏民、僮僕，手執白拂，侍立左右。
覆以寶^lb帳，垂諸華幡，香水灑地，散眾名華，羅列寶物，^lb出內取與，有如是等種種嚴飾，威德特尊。
窮^lb子見父有大力勢，即懷恐怖，悔來至此。竊作^lb是念：『此或是王，或是王等，非我傭力得物之^lb處。
不如往至貧里，肆力有地，衣食易得。若久^pb76住此，或見逼迫，強使我作。』作是念已，疾走而^lb去。
^cb#16c22「時富長者於師子座，見子便識，心大歡喜，^lb即作是念：『我財物庫藏，今有所付。
我常思念^lb此子，無由見之，而忽自來，甚適我願。我雖年^lb朽，猶故貪惜。』即遣傍人，急追將還。
爾時使者，^lb疾走往捉。窮子驚愕，稱怨大喚：『我不相犯，何^pb77為見捉？』使者執之愈急，強牽將還。
于時窮子，^lb自念無罪，而被囚執，此必定死；轉更惶怖，悶^lb絕躄地。
父遙見之，而語使言：『不須此人，勿強^lb將來。
以冷水灑面，令得醒悟，莫復與語。』所以^lb者何？父知其子志意下劣，自知豪貴為子所^lb難，審知是子而以方便，不語他人云是我子。
^pb78使者語之：『我今放汝，隨意所趣。』窮子歡喜，得^lb未曾有，從地而起，往至貧里、以求衣食。
^cb#17a07「爾時^lb長者將欲誘引其子而設方便，密遣二人，形^lb色憔悴無威德者：『汝可詣彼，徐語窮子：「此有^lb作處，倍與汝直。」窮子若許，將來使作。若言：「欲^lb何所作？」便可語之：「雇汝除糞。我等二人亦共^pb79汝作。」』時二使人即求窮子，既已得之，具陳上^lb事。
^cb#17a12「爾時窮子先取其價，尋與除糞。其父見子，^lb愍而怪之。又以他日，於窓牖中遙見子身，羸^lb瘦憔悴，糞土塵坌，污穢不淨。
即脫瓔珞、細軟^lb上服、嚴飾之具，更著麁弊垢膩之衣，塵土坌^lb身，右手執持除糞之器，狀有所畏。
語諸作人：^pb80『汝等勤作，勿得懈息。』以方便故，得近其子。
後^lb復告言：『咄，男子！汝常此作，勿復餘去，當加汝^lb價。
諸有所須瓫器米麵鹽醋之屬，莫自疑難，^lb亦有老弊使人須者相給，好自安意。我如汝^lb父，勿復憂慮。
所以者何？我年老大，而汝少壯，^lb汝常作時，無有欺怠瞋恨怨言，都不見汝有^pb81此諸惡，如餘作人。自今已後，如所生子。』即時^lb長者、更與作字，名之為兒。
爾時窮子雖欣此^lb遇，猶故自謂客作賤人。由是之故，於二十年^lb中常令除糞。過是已後，心相體信，入出無難，^lb然其所止猶在本處。
^cb#17a29「世尊，爾時長者有疾，自^lb知將死不久。
語窮子言：『我今多有金銀珍寶，^pb82倉庫盈溢，其中多少、所應取與，汝悉知之。我^lb心如是，當體此意。
所以者何？今我與汝，便為^lb不異，宜加用心，無令漏失。』
爾時窮子，即受教^lb勅，領知眾物，金銀珍寶及諸庫藏，而無悕取^lb一餐之意。
然其所止故在本處，下劣之心亦^lb未能捨。
復經少時，父知子意漸已通泰，成就^pb83大志，自鄙先心。
臨欲終時，而命其子并會親^lb族、國王、大臣、剎利、居士，皆悉已集，即自宣言：^lb『諸君當知！此是我子，我之所生。
於某城中、捨^lb吾逃走，伶俜辛苦五十餘年，其本字某。
我名^lb某甲，昔在本城懷憂推覓，忽於此間遇會得^lb之。此實我子，我實其父。今我所有一切財物，^pb84皆是子有，先所出內，是子所知。』
^cb#17b15「世尊！是時窮^lb子聞父此言，即大歡喜，得未曾有，而作是念：^lb『我本無心有所希求，今此寶藏自然而至。』
^cb#17b18「世^lb尊！大富長者則是如來，我等皆似佛子，如來^lb常說我等為子。
世尊！我等以三苦故，於生死^lb中受諸熱惱，迷惑無知，樂著小法。
今日世尊^pb85令我等思惟，蠲除諸法戲論之糞，我等於中^lb勤加精進，得至涅槃一日之價。
既得此已，心^lb大歡喜，自以為足，而便自謂：『於佛法中勤精^lb進故，所得弘多。』然世尊先知我等，心著弊欲，^lb樂於小法，便見縱捨，不為分別：『汝等當有如^lb來知見寶藏之分。』
世尊以方便力，說如來智^pb86慧。我等從佛，得涅槃一日之價，以為大得；於^lb此大乘，無有志求。
我等又因如來智慧，為諸^lb菩薩開示演說，而自於此無有志願。
所以者^lb何？佛知我等心樂小法，以方便力、隨我等說；^lb而我等不知真是佛子。
今我等方知世尊，於^lb佛智慧無所悋惜。
所以者何？我等昔來真是^pb87佛子，而但樂小法，若我等有樂大之心，佛則^lb為我說大乘法。
於此經中唯說一乘，而昔於^lb菩薩前，毀呰聲聞樂小法者，然佛實以大乘^lb教化。是故我等，說本無心有所悕求。今法王^lb大寶自然而至，如佛子所應得者皆已得之。」
^lb爾時摩訶迦葉欲重宣此義，而說偈言：
^pb88^gatha「我等今日，　　聞佛音教，　　歡喜踊躍，
　得未曾有。　　^lb佛說聲聞，　　當得作佛，
　無上寶聚，　　不求自得。　　^lb譬如童子，
　幼稚無識，　　捨父逃逝，　　遠到他土，
　^lb周流諸國，　　五十餘年。　　其父憂念，
　四方推求，　　^lb求之既疲，　　頓止一城，
　造立舍宅，　　五欲自娛。　　^lb其家巨富，
　多諸金銀、　　車璩馬腦、　　真珠琉璃；
　^pb89象馬牛羊、　　輦輿車乘；　　田業僮僕、
　人民眾多。　　^lb出入息利，　　乃遍他國，
　商估賈人、　　無處不有。　　^lb千萬億眾，
　圍繞恭敬，　　常為王者，　　之所愛念，
　^lb群臣豪族，　　皆共宗重。　　以諸緣故，
　往來者眾，　　^lb豪富如是，　　有大力勢。
　而年朽邁，　　益憂念子，　　^lb夙夜惟念，
　死時將至。　　癡子捨我，　　五十餘年，
　^pb90庫藏諸物，　　當如之何？　　爾時窮子，
　求索衣食，　　^lb從邑至邑、　　從國至國。
　或有所得，　　或無所得，　　^lb飢餓羸瘦，
　體生瘡癬。　　漸次經歷，　　到父住城，
　^lb傭賃展轉，　　遂至父舍。　　爾時長者，
　於其門內，　　^lb施大寶帳，　　處師子座；
　眷屬圍遶，　　諸人侍衛，　　^lb或有計算，
　金銀寶物，　　出內財產，　　注記券疏。
　^pb91窮子見父　　豪貴尊嚴，　　謂是國王，
　若是王等。　　^lb驚怖自怪，　　何故至此。
　覆自念言：　　『我若久住，　　^lb或見逼迫，
　強驅使作。』　　思惟是已，　　馳走而去，
　^lb借問貧里，　　欲往傭作。　　長者是時，
　在師子座，　　^lb遙見其子，　　默而識之。
　即勅使者，　　追捉將來。　　^lb窮子驚喚，
　迷悶躄地：　　『是人執我，　　必當見殺，
　^pb92何用衣食，　　使我至此？』　　長者知子，
　愚癡狹劣，　　^lb不信我言，　　不信是父。
　即以方便，　　更遣餘人，　　^lb眇目矬陋，
　無威德者：　　『汝可語之，　　云當相雇，
　^lb除諸糞穢，　　倍與汝價。』　　窮子聞之，
　歡喜隨來，　　^lb為除糞穢，　　淨諸房舍。
　長者於牖，　　常見其子，　　^lb念子愚劣，
　樂為鄙事。　　於是長者，　　著弊垢衣，
　^pb93執除糞器，　　往到子所，　　方便附近，
　語令勤作：
^lb『既益汝價，　　并塗足油，　　飲食充足，
　薦席厚煖。』　　^lb如是苦言：　　『汝當勤作。』
　又以軟語：　　『若如我子。』　　^lb長者有智，
　漸令入出，　　經二十年，　　執作家事。
　^lb示其金銀、　　真珠頗梨；　　諸物出入，
　皆使令知。　　^lb猶處門外，　　止宿草庵，
　自念貧事：　　『我無此物。』　　^pb94父知子心，
　漸已廣大，　　欲與財物。　　即聚親族、
　^lb國王大臣、　　剎利居士。　　於此大眾，
　說是我子，　　^lb捨我他行，　　經五十歲。
　自見子來，　　已二十年。　　^lb昔於某城，
　而失是子，　　周行求索，　　遂來至此。
　^lb凡我所有，　　舍宅人民，　　悉以付之，
　恣其所用。　　^lb子念昔貧，　　志意下劣，
　今於父所，　　大獲珍寶，　　^pb95并及舍宅、
　一切財物。　　甚大歡喜，　　得未曾有。
　^lb佛亦如是，　　知我樂小，　　未曾說言：
『汝等作佛。』　　^lb而說我等，　　得諸無漏，
　成就小乘，　　聲聞弟子。　　^lb佛勅我等，
　說最上道，　　修習此者，　　當得成佛。
　^lb我承佛教，　　為大菩薩，　　以諸因緣、
　種種譬喻、　　^lb若干言辭，　　說無上道。
　諸佛子等、　　從我聞法，　　^pb96日夜思惟，
　精勤修習。　　是時諸佛，　　即授其記：
^lb『汝於來世，　　當得作佛。』　　一切諸佛，
　祕藏之法，　　^lb但為菩薩，　　演其實事，
　而不為我，　　說斯真要。　　^lb如彼窮子、
　得近其父，　　雖知諸物，　　心不希取。
　^lb我等雖說，　　佛法寶藏，　　自無志願，
　亦復如是。　　^lb我等內滅，　　自謂為足，
　唯了此事，　　更無餘事。　　^pb97我等若聞，
　淨佛國土，　　教化眾生，　　都無欣樂。
　^lb所以者何？　　一切諸法，　　皆悉空寂，
　無生無滅，　　^lb無大無小，　　無漏無為。
　如是思惟，　　不生喜樂。　　^lb我等長夜，
　於佛智慧，　　無貪無著，　　無復志願；
　^lb而自於法，　　謂是究竟。　　我等長夜，
　修習空法，　　^lb得脫三界，　　苦惱之患，
　住最後身、　　有餘涅槃。　　^pb98佛所教化，
　得道不虛，　　則為已得，　　報佛之恩。
　^lb我等雖為，　　諸佛子等，　　說菩薩法，
　以求佛道；　　^lb而於是法，　　永無願樂。
　導師見捨，　　觀我心故，　　^lb初不勸進，
　說有實利。　　如富長者，　　知子志劣，
　^lb以方便力，　　柔伏其心，　　然後乃付，
　一切財物。
　^lb佛亦如是，　　現希有事，　　知樂小者，
　以方便力，　　^pb99調伏其心，　　乃教大智。
　我等今日，　　得未曾有，　　^lb非先所望，
　而今自得，　　如彼窮子，　　得無量寶。
　^lb世尊我今，　　得道得果，　　於無漏法，
　得清淨眼。　　^lb我等長夜，　　持佛淨戒，
　始於今日，　　得其果報，　　^lb法王法中，
　久修梵行，　　今得無漏，　　無上大果。
　^lb我等今者，　　真是聲聞，　　以佛道聲，
　令一切聞。　　^pb100我等今者，　　真阿羅漢，
　於諸世間，　　天人魔梵，　　^lb普於其中，
　應受供養。　　世尊大恩，　　以希有事，
　^lb憐愍教化，　　利益我等，　　無量億劫，
　誰能報者。　　^lb手足供給，　　頭頂禮敬，
　一切供養，　　皆不能報。　　^lb若以頂戴，
　兩肩荷負，　　於恒沙劫，　　盡心恭敬；
　^lb又以美饍、　　無量寶衣，　　及諸臥具、
　種種湯藥，　　^pb101牛頭栴檀，　　及諸珍寶，
　以起塔廟，　　寶衣布地。　　^lb如斯等事，
　以用供養，　　於恒沙劫，　　亦不能報。
　^lb諸佛希有，　　無量無邊，　　不可思議，
　大神通力，　　^lb無漏無為，　　諸法之王。
　能為下劣，　　忍于斯事，　　^lb取相凡夫，
　隨宜為說。　　諸佛於法，　　得最自在，
　^lb知諸眾生，　　種種欲樂，　　及其志力。
　隨所堪任，　　^pb102以無量喻，　　而為說法。
　隨諸眾生，　　宿世善根，　　^lb又知成熟、
　未成熟者，　　種種籌量，　　分別知已，
　^lb於一乘道、　　隨宜說三。」
^lb^lb妙法蓮華經卷第二
^pb1^folio#sdpdrk3^bk#sdpdrk3<hidden=1>【妙法蓮華經卷第三】^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck5〔藥草喻品第五〕
^lb^cb#19a19爾時世尊告摩訶迦葉及諸大弟子：「善哉，善^lb哉！迦葉善說如來真實功德。
誠如所言，如來^lb復有無量無邊阿僧祇功德，汝等若於無量^pb2億劫說不能盡。
迦葉！當知如來是諸法之王，^lb若有所說皆不虛也。
於一切法，以智方便而^lb演說之，其所說法，皆悉到於一切智地。
如來^lb觀知一切諸法之所歸趣，亦知一切眾生深^lb心所行，通達無礙；又於諸法究盡明了，示諸^lb眾生一切智慧。
^cb#19a27「迦葉！譬如三千大千世界，山^pb3川谿谷土地所生卉木叢林及諸藥草，種類^lb若干，名色各異。
密雲彌布，遍覆三千大千世^lb界，一時等澍，其澤普洽。
卉木叢林及諸藥草，^lb小根小莖、小枝小葉，中根中莖、中枝中葉，大^lb根大莖、大枝大葉，諸樹大小，隨上中下各有^lb所受。
一雲所雨，稱其種性而得生長華菓敷^pb4實。雖一地所生，一雨所潤，而諸草木，各有差^lb別。
^cb#19b06「迦葉！當知如來亦復如是，出現於世，如大^lb雲起，以大音聲、普遍世界天、人、阿修羅，如彼^lb大雲遍覆三千大千國土。
於大眾中、而唱是^lb言：『我是如來、應供、正遍知、明行足、善逝、世間^lb解、無上士、調御丈夫、天人師、佛、世尊，未度者^pb5令度，未解者令解，未安者令安，未涅槃者令^lb得涅槃，今世後世，如實知之。
我是一切知者、^lb一切見者、知道者、開道者、說道者，汝等天、人、^lb阿修羅眾，皆應到此，為聽法故。』
爾時無數千^lb萬億種眾生，來至佛所而聽法。如來于時，觀^lb是眾生諸根利鈍、精進懈怠，隨其所堪而為^pb6說法，種種無量，皆令歡喜，快得善利。
是諸眾^lb生聞是法已，現世安隱，後生善處，以道受樂，^lb亦得聞法。
既聞法已，離諸障礙，於諸法中，任^lb力所能，漸得入道。
如彼大雲，雨於一切卉木^lb叢林及諸藥草，如其種性，具足蒙潤，各得生^lb長。
^cb#19b23「如來說法，一相一味——所謂：解脫相、離相、滅^pb7相，究竟至於一切種智。
其有眾生聞如來法，^lb若持讀誦，如說修行，所得功德，不自覺知。
所^lb以者何？唯有如來知此眾生種相體性，念何^lb事、思何事、修何事，云何念、云何思、云何修，以^lb何法念、以何法思、以何法修，以何法得何法。
^lb眾生住於種種之地，唯有如來如實見之，明^pb8了無礙。
如彼卉木叢林諸藥草等，而不自知^lb上中下性。如來知是一相一味之法——所謂：解^lb脫相、離相、滅相——究竟涅槃常寂滅相，終歸於^lb空。
佛知是已，觀眾生心欲而將護之，是故不^lb即為說一切種智。
^cb#19c06「汝等，迦葉！甚為希有，能知^lb如來隨宜說法，能信能受。
所以者何？諸佛世^pb9尊隨宜說法，難解難知。」
^cb#19c08爾時世尊欲重宣此^lb義，而說偈言：
^lb^gatha「破有法王，　　出現世間，　　隨眾生欲，
　種種說法。　　^lb如來尊重，　　智慧深遠，
　久默斯要，　　不務速說。　　^lb有智若聞，
　則能信解；　　無智疑悔，　　則為永失。
　^lb是故迦葉！　　隨力為說，　　以種種緣，
　令得正見。　　^pb10迦葉當知！　　譬如大雲，
　起於世間，　　遍覆一切；　　^lb慧雲含潤，
　電光晃曜，　　雷聲遠震，　　令眾悅豫。
　^lb日光掩蔽，　　地上清涼，　　靉靆垂布、
　如可承攬。　　^lb其雨普等，　　四方俱下，
　流澍無量，　　率土充洽。　　^lb山川險谷、
　幽邃所生，　　卉木藥草，　　大小諸樹，
　^lb百穀苗稼，　　甘蔗蒲萄，　　雨之所潤，
　無不豐足，　　^pb11乾地普洽，　　藥木竝茂。
　其雲所出，　　一味之水，　　^lb草木叢林，
　隨分受潤。　　一切諸樹，　　上中下等，
　^lb稱其大小，　　各得生長，　　根莖枝葉，
　華菓光色，　　^lb一雨所及，　　皆得鮮澤。
　如其體相，　　性分大小，　　^lb所潤是一，
　而各滋茂。　　佛亦如是，　　出現於世，
　^lb譬如大雲，　　普覆一切。　　既出于世，
　為諸眾生，　　^pb12分別演說，　　諸法之實。
　大聖世尊，　　於諸天人、　　^lb一切眾中，
　而宣是言：　　『我為如來，　　兩足之尊，
　^lb出于世間，　　猶如大雲，　　充潤一切。
　枯槁眾生，　　^lb皆令離苦，　　得安隱樂——
　世間之樂，　　及涅槃樂。　　^lb諸天人眾，
　一心善聽，　　皆應到此，　　覲無上尊。』
　^lb我為世尊，　　無能及者，　　安隱眾生，
　故現於世。　　^pb13為大眾說，　　甘露淨法，
　其法一味，　　解脫涅槃。　　^lb以一妙音、
　演暢斯義，　　常為大乘，　　而作因緣。
　^lb我觀一切，　　普皆平等，　　無有彼此，
　愛憎之心。　　^lb我無貪著，　　亦無限礙，
　恒為一切，　　平等說法。　　^lb如為一人，
　眾多亦然，　　常演說法，　　曾無他事。
　^lb去來坐立，　　終不疲厭，　　充足世間，
　如雨普潤。　　^pb14貴賤上下，　　持戒毀戒，
　威儀具足，　　及不具足，　　^lb正見邪見，
　利根鈍根，　　等雨法雨，　　而無懈倦。
　^lb一切眾生，　　聞我法者，　　隨力所受，
　住於諸地。　　^lb或處人天，　　轉輪聖王，
　釋梵諸王，　　是小藥草。　　^lb知無漏法，
　能得涅槃，　　起六神通，　　及得三明，
　^lb獨處山林，　　常行禪定，　　得緣覺證，
　是中藥草。　　^pb15求世尊處，　　我當作佛，
　行精進定，　　是上藥草。　　^lb又諸佛子，
　專心佛道，　　常行慈悲，　　自知作佛，
　^lb決定無疑，　　是名小樹。　　安住神通，
　轉不退輪，　　^lb度無量億、　　百千眾生，
　如是菩薩，　　名為大樹。　　^lb佛平等說，
　如一味雨；　　隨眾生性，　　所受不同，
　^lb如彼草木，　　所稟各異。　　佛以此喻，
　方便開示，　　^pb16種種言辭，　　演說一法，
　於佛智慧，　　如海一渧。　　^lb我雨法雨，
　充滿世間，　　一味之法，　　隨力修行。
　^lb如彼叢林，　　藥草諸樹，　　隨其大小，
　漸增茂好。　　^lb諸佛之法，　　常以一味，
　令諸世間，　　普得具足，　　^lb漸次修行，
　皆得道果。　　聲聞緣覺，　　處於山林，
　^lb住最後身，　　聞法得果，　　是名藥草，
　各得增長。　　^pb17若諸菩薩，　　智慧堅固，
　了達三界，　　求最上乘，　　^lb是名小樹，
　而得增長。　　復有住禪，　　得神通力，
　^lb聞諸法空，　　心大歡喜，　　放無數光，
　度諸眾生，　　^lb是名大樹，　　而得增長。
　如是迦葉！　　佛所說法，　　^lb譬如大雲，
　以一味雨，　　潤於人華，　　各得成實。
　^lb迦葉當知！　　以諸因緣、　　種種譬喻，
　開示佛道，　　^pb18是我方便，　　諸佛亦然。
　今為汝等，　　說最實事：　　^lb『諸聲聞眾，
　皆非滅度。　　汝等所行，　　是菩薩道，
　^lb漸漸修學，　　悉當成佛。』」
^lb^ck6〔授記品第六〕
^lb^cb#20b26爾時世尊說是偈已，告諸大眾，唱如是言：「我^lb此弟子摩訶迦葉，於未來世，當得奉覲三百^pb19萬億諸佛世尊，供養恭敬，尊重讚歎，廣宣諸^lb佛無量大法。
於最後身，得成為佛，名曰光明^lb如來、應供、正遍知、明行足、善逝、世間解、無上^lb士、調御丈夫、天人師、佛、世尊。
國名光德，劫名^lb大莊嚴。佛壽十二小劫，正法住世二十小劫，^lb像法亦住二十小劫。
國界嚴飾，無諸穢惡、瓦^pb20礫荊棘、便利不淨。其土平正，無有高下、坑坎^lb堆阜。琉璃為地，寶樹行列，黃金為繩，以界道^lb側，散諸寶華，周遍清淨。
其國菩薩無量千億，^lb諸聲聞眾亦復無數，無有魔事，雖有魔及魔^lb民，皆護佛法。」
^cb#20c09爾時世尊欲重宣此義，而說偈^lb言：
^pb21「告諸比丘：　　『我以佛眼，　　見是迦葉，
　於未來世，　　^lb過無數劫，　　當得作佛。
　而於來世，　　供養奉覲，　　^lb三百萬億，
　諸佛世尊。　　為佛智慧，　　淨修梵行。
　^lb供養最上，　　二足尊已，　　修習一切，
　無上之慧。　　^lb於最後身，　　得成為佛。
　其土清淨，　　琉璃為地，　　^lb多諸寶樹，
　行列道側，　　金繩界道，　　見者歡喜。
　^pb22常出好香，　　散眾名華，　　種種奇妙，
　以為莊嚴。　　^lb其地平正，　　無有丘坑。
　諸菩薩眾，　　不可稱計，　　^lb其心調柔，
　逮大神通，　　奉持諸佛，　　大乘經典。
　^lb諸聲聞眾，　　無漏後身，　　法王之子，
　亦不可計，　　^lb乃以天眼，　　不能數知。
　其佛當壽，　　十二小劫；　　^lb正法住世，
　二十小劫；　　像法亦住，　　二十小劫。
　^pb23光明世尊，　　其事如是。』」
^lb^cb#20c28爾時大目犍連、須菩提、摩訶迦栴延等，皆悉^lb悚慄，一心合掌，瞻仰尊顏，目不暫捨，即共同^lb聲而說偈言：
^lb^gatha「大雄猛世尊，　　諸釋之法王，
　哀愍我等故，　　^lb而賜佛音聲。
　若知我深心，　　見為授記者，
　^pb24如以甘露灑，　　除熱得清涼。
　如從饑國來，　　^lb忽遇大王饍，
　心猶懷疑懼，　　未敢即便食；
　^lb若復得王教，　　然後乃敢食。
　我等亦如是，　　^lb每惟小乘過，
　不知當云何，　　得佛無上慧。
　^lb雖聞佛音聲，　　言我等作佛，
　心尚懷憂懼，　　^lb如未敢便食；
　若蒙佛授記，　　爾乃快安樂。
　^pb25大雄猛世尊，　　常欲安世間，
　願賜我等記，　　^lb如飢須教食。」
^lb^cb#21a16爾時世尊知諸大弟子心之所念，告諸比丘：^lb「是須菩提，於當來世，奉覲三百萬億那由他^lb佛，供養恭敬，尊重讚歎，常修梵行，具菩薩道。
^lb於最後身、得成為佛，號曰名相如來、應供、正^pb26遍知、明行足、善逝、世間解、無上士、調御丈夫、^lb天人師、佛、世尊。劫名有寶。
國名寶生。其土平^lb正，頗梨為地，寶樹莊嚴，無諸丘坑、沙礫、荊棘、^lb便利之穢，寶華覆地，周遍清淨。其土人民，皆^lb處寶臺、珍妙樓閣。聲聞弟子，無量無邊，算數^lb譬喻所不能知。諸菩薩眾，無數千萬億那由^pb27他。佛壽十二小劫，正法住世二十小劫，像法^lb亦住二十小劫。
其佛常處虛空為眾說法，度^lb脫無量菩薩及聲聞眾。」
爾時世尊欲重宣此^lb義，而說偈言：
^lb^gatha「諸比丘眾，　　今告汝等，　　皆當一心，
　聽我所說：　　^lb我大弟子，　　須菩提者，
　當得作佛，　　號曰名相。　　^pb28當供無數，
　萬億諸佛，　　隨佛所行，　　漸具大道。
　^lb最後身得，　　三十二相，　　端正姝妙，
　猶如寶山。　　^lb其佛國土，　　嚴淨第一，
　眾生見者，　　無不愛樂，　　^lb佛於其中，
　度無量眾。　　其佛法中，　　多諸菩薩，`)