jsonp(4,{"name":"dc","start":5604},`　其佛當壽，　　十二小劫，　　^lb正法住世，
　二十小劫，　　像法亦住，　　二十小劫。」
^lb^cb#21b17爾時世尊復告諸比丘眾：「我今語汝，是大迦^lb旃延，於當來世，以諸供具，供養奉事八千億^pb30佛，恭敬尊重。
諸佛滅後，各起塔廟，高千由旬，^lb縱廣正等五百由旬，皆以金、銀、琉璃、車璩，馬瑙、^lb真珠、玫瑰、七寶合成，眾華、瓔珞、塗香、末香、燒^lb香、繒蓋、幢幡，供養塔廟。
過是已後，當復供養^lb二萬億佛，亦復如是。
供養是諸佛已，具菩薩^lb道，當得作佛。號曰閻浮那提金光如來、應供、^pb31正遍知、明行足、善逝、世間解、無上士、調御丈^lb夫、天人師、佛、世尊。
其土平正，頗梨為地，寶樹^lb莊嚴，黃金為繩以界道側，妙華覆地，周遍清^lb淨，見者歡喜。
無四惡道——地獄、餓鬼、畜生、阿修^lb羅道，多有天、人、諸聲聞眾及諸菩薩，無量萬^lb億莊嚴其國。
佛壽十二^pb32小劫，正法住世二十小劫，像法亦住二十小劫。」
^cb#21c03爾時世尊欲重宣^lb此義，而說偈言：
^lb^gatha「諸比丘眾、　　皆一心聽，　　如我所說，
　真實無異。　　^lb是迦栴延，　　當以種種，
　妙好供具，　　供養諸佛。　　^lb諸佛滅後，
　起七寶塔，　　亦以華香，　　供養舍利。
　^lb其最後身，　　得佛智慧，　　成等正覺。
　國土清淨，　　^pb33度脫無量，　　萬億眾生，
　皆為十方，　　之所供養。　　^lb佛之光明，
　無能勝者。　　其佛號曰，　　閻浮金光。
　^lb菩薩聲聞，　　斷一切有，　　無量無數，
　莊嚴其國。」
^lb^cb#21c15爾時世尊復告大眾：「我今語汝，是大目犍連，^lb當以種種供具供養八千諸佛，恭敬尊重。
諸^lb佛滅後，各起塔廟，高千由旬，縱廣正等五百^pb34由旬，以金、銀、琉璃、車璩、馬瑙、真珠、玫瑰、七寶^lb合成，眾華、瓔珞、塗香、末香、燒香、繒蓋、幢幡，以^lb用供養。
過是已後，當復供養二百萬億諸佛，^lb亦復如是。
當得成佛，號曰多摩羅跋栴檀香^lb如來、應供、正遍知、明行足、善逝、世間解、無上^lb士、調御丈夫、天人師、佛、世尊。劫名喜滿，國名^pb35意樂。
其土平正，頗梨為地，寶樹莊嚴，散真珠^lb華，周遍清淨，見者歡喜。
多諸天、人、菩薩、聲聞，^lb其數無量。佛壽二十四小劫，正法住世四十^lb小劫，像法亦住四十小劫。」
^cb#21c28爾時世尊欲重宣^lb此義，而說偈言：
^lb^gatha「我此弟子、　　大目犍連，　　捨是身已，
　得見八千，　　^pb36二百萬億，　　諸佛世尊。
　為佛道故，　　供養恭敬，　　^lb於諸佛所，
　常修梵行，　　於無量劫，　　奉持佛法。
　^lb諸佛滅後，　　起七寶塔，　　長表金剎，
　華香伎樂，　　^lb而以供養，　　諸佛塔廟。
　漸漸具足，　　菩薩道已，　　^lb於意樂國，
　而得作佛。　　號多摩羅，　　栴檀之香。
　^lb其佛壽命，　　二十四劫，　　常為天人，
　演說佛道。　　^pb37聲聞無量，　　如恒河沙，
　三明六通，　　有大威德。　　^lb菩薩無數，
　志固精進，　　於佛智慧，　　皆不退轉。
　^lb佛滅度後，　　正法當住，　　四十小劫，
　像法亦爾。　　^lb我諸弟子，　　威德具足，
　其數五百，　　皆當授記。　　^lb於未來世、
　咸得成佛。　　我及汝等，　　宿世因緣，
　^lb吾今當說，　　汝等善聽。」◎
^pb38^ck7〔化城喻品第七〕
^lb^cb#22a19佛告諸比丘：「乃往過去無量無邊不可思議^lb阿僧祇劫，爾時有佛，名大通智勝如來、應供、^lb正遍知、明行足、善逝、世間解、無上士、調御丈^lb夫、天人師、佛、世尊。其國名好成，劫名大相。
諸^lb比丘！彼佛滅度已來，甚大久遠，譬如三千大^pb39千世界所有地種，假使有人磨以為墨，過於^lb東方千國土乃下一點，大如微塵，又過千國^lb土復下一點，如是展轉盡地種墨。
於汝等意^lb云何？是諸國土，若算師，若算師弟子，能得邊^lb際，知其數不？」
^cb#22a28「不也，世尊！」
「諸比丘！是人所經國^lb土，若點不點，盡末為塵，一塵一劫；彼佛滅度^pb40已來，復過是數無量無邊百千萬億阿僧祇^lb劫。
我以如來知見力故，觀彼久遠，猶若今日。」
^lb^cb#22b03爾時世尊欲重宣此義，而說偈言：
^lb^gatha「我念過去世，　　無量無邊劫，
　有佛兩足尊，　　^lb名大通智勝。
　如人以力磨，　　三千大千土，
　^lb盡此諸地種，　　皆悉以為墨。
　過於千國土，　　^pb41乃下一塵點，
　如是展轉點，　　盡此諸塵墨。
　^lb如是諸國土，　　點與不點等，
　復盡末為塵，　　^lb一塵為一劫。
　此諸微塵數，　　其劫復過是，
　^lb彼佛滅度來，　　如是無量劫。
　如來無礙智，　　^lb知彼佛滅度，
　及聲聞菩薩，　　如見今滅度。
　^lb諸比丘當知！　　佛智淨微妙，
　無漏無所礙，　　^pb42通達無量劫。」
^lb^cb#22b19佛告諸比丘：「大通智勝佛壽五百四十萬億^lb那由他劫。
其佛本坐道場，破魔軍已，垂得阿^lb耨多羅三藐三菩提，而諸佛法不現在前。
如^lb是一小劫乃至十小劫，結加趺坐，身心不動，^lb而諸佛法猶不在前。
爾時忉利諸天，先為彼^pb43佛於菩提樹下敷師子座，高一由旬，佛於此^lb座當得阿耨多羅三藐三菩提。
適坐此座，時^lb諸梵天王雨眾天華，面百由旬，香風時來，吹^lb去萎華，更雨新者。
如是不絕，滿十小劫，供養^lb於佛，乃至滅度常雨此華。
四王諸天為供養^lb佛，常擊天鼓，其餘諸天作天伎樂，滿十小劫，^pb44至于滅度亦復如是。
^cb#22c02「諸比丘！大通智勝佛過^lb十小劫，諸佛之法乃現在前，成阿耨多羅三^lb藐三菩提。
其佛未出家時，有十六子，其第一^lb者名曰智積。
諸子各有種種珍異玩好之具，^lb聞父得成阿耨多羅三藐三菩提，皆捨所珍，^lb往詣佛所。諸母涕泣而隨送之。其祖轉輪聖^pb45王，與一百大臣及餘百千萬億人民，皆共圍^lb繞，隨至道場。
咸欲親近大通智勝如來，供養^lb恭敬，尊重讚歎。
到已，頭面禮足，繞佛畢已，一^lb心合掌，瞻仰世尊，以偈頌曰：
^lb^gatha「『大威德世尊，　　為度眾生故，
　　於無量億劫，　　^lb爾乃得成佛，
　　諸願已具足，　　善哉吉無上。
　　^pb46世尊甚希有，　　一坐十小劫，
　　身體及手足，　　^lb靜然安不動。
　　其心常惔怕，　　未曾有散亂，
　　^lb究竟永寂滅，　　安住無漏法。
　　今者見世尊，　　^lb安隱成佛道，
　　我等得善利，　　稱慶大歡喜。
　　^lb眾生常苦惱，　　盲瞑無導師，
　　不識苦盡道，　　^lb不知求解脫。
　　長夜增惡趣，　　減損諸天眾，
　　^pb47從冥入於冥，　　永不聞佛名。
　　今佛得最上、　　^lb安隱無漏道，
　　我等及天人，　　為得最大利，
　　^lb是故咸稽首、　　歸命無上尊。』
^lb^cb#22c28「爾時十六王子偈讚佛已，勸請世尊轉於法^lb輪，咸作是言：『世尊說法，多所安隱、憐愍、饒益^lb諸天人民。』重說偈言：
^pb48^gatha「『世雄無等倫，　　百福自莊嚴，
　　得無上智慧，　　^lb願為世間說。
　　度脫於我等、　　及諸眾生類，
　　^lb為分別顯示，　　令得是智慧。
　　若我等得佛，　　^lb眾生亦復然。
　　世尊知眾生，　　深心之所念，
　　^lb亦知所行道，　　又知智慧力，
　　欲樂及修福，　　^lb宿命所行業。
　　世尊悉知已，　　當轉無上輪。』」
^pb49^cb#23a11佛告諸比丘：「大通智勝佛得阿耨多羅三藐^lb三菩提時，十方各五百萬億諸佛世界六種^lb震動，其國中間幽冥之處，日月威光所不能^lb照，而皆大明。
其中眾生，各得相見，咸作是言：^lb『此中云何忽生眾生，又其國界、諸天宮殿、乃^lb至梵宮，六種震動；大光普照，遍滿世界，勝諸^pb50天光。』
^cb#23a17「爾時東方五百萬億諸國土中，梵天宮^lb殿光明照曜，倍於常明。
諸梵天王各作是念：^lb『今者宮殿光明，昔所未有。
以何因緣而現此^lb相？』是時諸梵天王，即各相詣，共議此事。
時彼^lb眾中，有一大梵天王，名救一切，為諸梵眾而^lb說偈言：
^pb51^gatha「『我等諸宮殿，　　光明昔未有，
　　此是何因緣，　　^lb宜各共求之。
　　為大德天生，　　為佛出世間，
　　^lb而此大光明，　　遍照於十方。』
^lb^cb#23a27「爾時五百萬億國土諸梵天王，與宮殿俱，各^lb以衣裓，盛諸天華，共詣西方推尋是相。
見大^lb通智勝如來處于道場菩提樹下，坐師子座，^pb52諸天、龍王、乾闥婆、緊那羅、摩睺羅伽、人非人^lb等，恭敬圍繞，及見十六王子請佛轉法輪。
即^lb時諸梵天王頭面禮佛，繞百千匝，即以天華^lb而散佛上——其所散華如須彌山；并以供養佛^lb菩提樹——其菩提樹高十由旬。
華供養已，各以^lb宮殿奉上彼佛，而作是言：『唯見哀愍，饒益我^pb53等。所獻宮殿，願垂納受。』時諸梵天王，即於佛^lb前，一心同聲以偈頌曰：
^lb^gatha「『世尊甚希有，　　難可得值遇，
　　具無量功德，　　^lb能救護一切。
　　天人之大師，　　哀愍於世間，
　　^lb十方諸眾生，　　普皆蒙饒益。
　　我等所從來，　　^lb五百萬億國，
　　捨深禪定樂，　　為供養佛故。
　　^pb54我等先世福，　　宮殿甚嚴飾，
　　今以奉世尊，　　^lb唯願哀納受。』
^lb^cb#23b17「爾時諸梵天王偈讚佛已，各作是言：『唯願世^lb尊轉於法輪，度脫眾生，開涅槃道。』時諸梵天^lb王，一心同聲而說偈言：
^lb^gatha「『世雄兩足尊，　　唯願演說法，
　　以大慈悲力，　　^pb55度苦惱眾生。』
^lb^cb#23b22「爾時大通智勝如來，默然許之。
「又，諸比丘！東^lb南方五百萬億國土諸大梵王，各自見宮殿^lb光明照曜，昔所未有。
歡喜踊躍，生希有心，即^lb各相詣，共議此事。時彼眾中有一大梵天王，^lb名曰大悲，為諸梵眾而說偈言：
^pb56^gatha「『是事何因緣，　　而現如此相？
　　我等諸宮殿，　　^lb光明昔未有。
　　為大德天生？　　為佛出世間？
　　^lb未曾見此相，　　當共一心求。
　　過千萬億土，　　^lb尋光共推之，
　　多是佛出世，　　度脫苦眾生。』
^lb^cb#23c04「爾時五百萬億諸梵天王與宮殿俱，各以衣^lb裓盛諸天華，共詣西北方推尋是相。
見大通^pb57智勝如來，處于道場菩提樹下，坐師子座，諸^lb天、龍王、乾闥婆、緊那羅、摩睺羅伽、人非人等，^lb恭敬圍繞，及見十六王子請佛轉法輪。
時諸^lb梵天王頭面禮佛，繞百千匝，即以天華而散^lb佛上——所散之華如須彌山，并以供養佛菩提^lb樹。
華供養已，各以宮殿奉上彼佛，而作是言：^pb58『唯見哀愍，饒益我等。所獻宮殿，願垂納受。』
爾^lb時諸梵天王即於佛前，一心同聲以偈頌曰：
^lb^gatha「『聖主天中王，　　迦陵頻伽聲，
　　哀愍眾生者，　　^lb我等今敬禮。
　　世尊甚希有，　　久遠乃一現，
　　^lb一百八十劫，　　空過無有佛。
　　三惡道充滿，　　^lb諸天眾減少，
　　今佛出於世，　　為眾生作眼。
　　^pb59世間所歸趣，　　救護於一切，
　　為眾生之父，　　^lb哀愍饒益者。
　　我等宿福慶，　　今得值世尊。』
^lb^cb#23c24「爾時諸梵天王偈讚佛已，各作是言：『唯願世^lb尊哀愍一切，轉於法輪，度脫眾生。』時諸梵天^lb王，一心同聲而說偈言：
^lb^gatha「『大聖轉法輪，　　顯示諸法相，
　　度苦惱眾生，　　^pb60令得大歡喜。
　　眾生聞此法，　　得道若生天，
　　^lb諸惡道減少，　　忍善者增益。』
^lb^cb#24a02「爾時大通智勝如來默然許之。
「又，諸比丘！南^lb方五百萬億國土諸大梵王，各自見宮殿光^lb明照曜，昔所未有。
歡喜踊躍，生希有心，即各^lb相詣，共議此事：『以何因緣，我等宮殿有此光^pb61曜？』時彼眾中有一大梵天王，名曰妙法，為諸^lb梵眾而說偈言：
　　^lb^gatha「『我等諸宮殿，　　光明甚威曜，
　　此非無因緣，　　^lb是相宜求之。
　　過於百千劫，　　未曾見是相，
　　^lb為大德天生？　　為佛出世間？』
^lb^cb#24a12「爾時五百萬億諸梵天王與宮殿俱，各以衣^pb62裓盛諸天華，共詣北方推尋是相。
見大通智^lb勝如來，處于道場菩提樹下，坐師子座，諸天、^lb龍王、乾闥婆、緊那羅、摩睺羅伽、人非人等，恭^lb敬圍繞，及見十六王子請佛轉法輪。
時諸梵^lb天王頭面禮佛，繞百千匝，即以天華而散佛^lb上——所散之華如須彌山，并以供養佛菩提樹。
^pb63華供養已，各以宮殿奉上彼佛，而作是言：『唯^lb見哀愍，饒益我等。所獻宮殿，願垂納受。』
爾時^lb諸梵天王，即於佛前，一心同聲以偈頌曰：
^lb^gatha「『世尊甚難見，　　破諸煩惱者，
　　過百三十劫，　　^lb今乃得一見。
　　諸飢渴眾生，　　以法雨充滿，
　　^lb昔所未曾見，　　無量智慧者，
　　如優曇鉢花，　　^pb64今日乃值遇。
　　我等諸宮殿，　　蒙光故嚴飾，
　　^lb世尊大慈悲，　　唯願垂納受。』
^lb^cb#24b01「爾時諸梵天王偈讚佛已，各作是言：『唯願世^lb尊轉於法輪，令一切世間諸天、魔、梵、沙門、婆^lb羅門，皆獲安隱而得度脫。』時諸梵天王，一心^lb同聲以偈頌曰：
^pb65^gatha「『唯願天人尊，　　轉無上法輪，
　　擊于大法鼓，　　^lb而吹大法螺，
　　普雨大法雨，　　度無量眾生。
　　^lb我等咸歸請，　　當演深遠音。』
^lb^cb#24b09「爾時大通智勝如來默然許之。西南方乃至^lb下方，亦復如是。
^cb#24b10「爾時上方五百萬億國土諸^lb大梵王，皆悉自覩所止宮殿光明威曜，昔所^pb66未有。
歡喜踊躍，生希有心，即各相詣，共議此^lb事：『以何因緣，我等宮殿，有斯光明？』時彼眾中^lb有一大梵天王，名曰尸棄，為諸梵眾而說偈^lb言：
^lb^gatha「『今以何因緣，　　我等諸宮殿，
　　威德光明曜，　　^lb嚴飾未曾有。
　　如是之妙相，　　昔所未聞見，
　　^pb67為大德天生？　　為佛出世間？』
^lb^cb#24b20「爾時五百萬億諸梵天王與宮殿俱，各以衣^lb裓盛諸天華，共詣下方推尋是相。
見大通智^lb勝如來，處于道場菩提樹下，坐師子座，諸天、^lb龍王、乾闥婆、緊那羅、摩睺羅伽、人非人等，恭^lb敬圍繞，及見十六王子請佛轉法輪。
時諸梵^pb68天王頭面禮佛，繞百千匝，即以天華而散佛^lb上——所散之花如須彌山，并以供養佛菩提樹。
^lb花供養已，各以宮殿奉上彼佛，而作是言：『唯^lb見哀愍，饒益我等。所獻宮殿，願垂納受。』時諸^lb梵天王，即於佛前，一心同聲以偈頌曰：
^lb^gatha「『善哉見諸佛，　　救世之聖尊，
　　能於三界獄，　　^pb69勉出諸眾生。
　　普智天人尊，　　哀愍群萌類，
　　^lb能開甘露門，　　廣度於一切。
　　於昔無量劫，　　^lb空過無有佛，
　　世尊未出時，　　十方常暗冥，
　　^lb三惡道增長，　　阿修羅亦盛，
　　諸天眾轉減，　　^lb死多墮惡道。
　　不從佛聞法，　　常行不善事，
　　^lb色力及智慧，　　斯等皆減少。
　　罪業因緣故，　　^pb70失樂及樂想，
　　住於邪見法，　　不識善儀則，
　　^lb不蒙佛所化，　　常墮於惡道。
　　佛為世間眼，　　^lb久遠時乃出，
　　哀愍諸眾生，　　故現於世間。
　　^lb超出成正覺，　　我等甚欣慶，
　　及餘一切眾，　　^lb喜歎未曾有。
　　我等諸宮殿，　　蒙光故嚴飾，
　　^lb今以奉世尊，　　唯垂哀納受。
　　願以此功德，　　^pb71普及於一切，
　　我等與眾生，　　皆共成佛道。』
^lb^cb#24c23「爾時五百萬億諸梵天王偈讚佛已，各白佛^lb言：『唯願世尊轉於法輪，多所安隱，多所度脫。』^lb時諸梵天王而說偈言：
^lb^gatha「『世尊轉法輪，　　擊甘露法鼓，
　　度苦惱眾生，　　^lb開示涅槃道。
　　唯願受我請，　　以大微妙音，
　　^pb72哀愍而敷演，　　無量劫習法。』
^lb^cb#25a01「爾時大通智勝如來，受十方諸梵天王及十^lb六王子請，即時三轉十二行法輪——若沙門、婆^lb羅門，若天、魔、梵及餘世間所不能轉——謂是苦，^lb是苦集，是苦滅，是苦滅道；
及廣說十二因緣^lb法——無明緣行，行緣識，識緣名色，名色緣^pb73六入，六入緣觸，觸緣受，受緣愛，愛緣取，取緣有，有^lb緣生，生緣老死憂悲苦惱。
無明滅則行滅，行^lb滅則識滅，識滅則名色滅，名色滅則^lb六入滅，六入滅則觸滅，觸滅則受滅，受滅則愛滅，愛^lb滅則取滅，取滅則有滅，有滅則生滅，生滅則^lb老死憂悲苦惱滅。
^cb#25a12「佛於天人大眾之中說是^pb74法時，六百萬億那由他人，以不受一切法故，^lb而於諸漏心得解脫，皆得深妙禪定，三明、六^lb通，具八解脫。
第二、第三、第四說法時，千萬億^lb恒河沙那由他等眾生，亦以不受一切法故，^lb而於諸漏心得解脫。
從是已後，諸聲聞眾無^lb量無邊不可稱數。
^cb#25a18「爾時十六王子——皆以童子^pb75出家而為沙彌，諸根通利，智慧明了，已曾供^lb養百千萬億諸佛，淨修梵行，求阿耨多羅三^lb藐三菩提——俱白佛言：『世尊！是諸無量千萬億大^lb德聲聞，皆已成就。
世尊亦當為我等說阿^lb耨多羅三藐三菩提法，我等聞已，皆共修學。
^lb世尊！我等志願如來知見，深心所念，佛自證^pb76知。』
爾時轉輪聖王所將眾中八萬億人，見十^lb六王子出家，亦求出家。王即聽許。
^cb#25a27「爾時彼佛，^lb受沙彌請，過二萬劫已，乃於四眾之中說是^lb大乘經，名『妙法蓮華』，教菩薩法，佛所護念。
說^lb是經已，十六沙彌為阿耨多羅三藐三菩提^lb故，皆共受持，諷誦通利。
說是經時，十六菩薩^pb77沙彌皆悉信受；聲聞眾中，亦有信解；其餘眾^lb生千萬億種，皆生疑惑。佛說是經，於八千劫^lb未曾休廢。
說此經已，即入靜室，住於禪定八^lb萬四千劫。是時十六菩薩沙彌，知佛入室寂^lb然禪定，各昇法座，亦於八萬四千劫，為四部^lb眾，廣說分別妙法華經。
一一皆度六百萬億^pb78那由他恒河沙等眾生，示教利喜，令發阿耨^lb多羅三藐三菩提心。
^cb#25b10「大通智勝佛過八萬四^lb千劫已，從三昧起，往詣法座安詳而坐，普告^lb大眾：『是十六菩薩沙彌，甚為希有，諸根通利，^lb智慧明了，已曾供養無量千萬億數諸佛。
於^lb諸佛所，常修梵行，受持佛智，開示眾生，令入^pb79其中。汝等皆當數數親近而供養之。
所以者^lb何？若聲聞、辟支佛及諸菩薩，能信是十六菩^lb薩所說經法，受持不毀者，是人皆當得阿耨^lb多羅三藐三菩提、如來之慧。』」
^cb#25b18佛告諸比丘：「是^lb十六菩薩，常樂說是妙法蓮華經，一一菩薩^lb所化六百萬億那由他恒河沙等眾生，世世^pb80所生與菩薩俱，從其聞法，悉皆信解，以此因^lb緣，得值四百萬億諸佛世尊，于今不盡。
^cb#25b23「諸比丘！^lb我今語汝：『彼佛弟子十六沙彌，今皆得阿耨^lb多羅三藐三菩提，於十方國土現在說法，有^lb無量百千萬億菩薩、聲聞，以為眷屬。
其二沙^lb彌，東方作佛，一名阿閦，在歡喜國，二名須彌^pb81頂；東南方二佛，一名師子音，二名師子相；
南^lb方二佛，一名虛空住，二名常滅；
西南方二佛，^lb一名帝相，二名梵相；西方二佛，一名阿彌陀，^lb二名度一切世間苦惱；
西北方二佛，一名多^lb摩羅跋栴檀香神通，二名須彌相；
北方二佛，^lb一名雲自在，二名雲自在王；
東北方佛，名壞^pb82一切世間怖畏，第十六我釋迦牟尼佛於娑^lb婆國土成阿耨多羅三藐三菩提。』
^cb#25c07「諸比丘！我^lb等為沙彌時，各各教化無量百千萬億恒河^lb沙等眾生，從我聞法，為阿耨多羅三藐三菩^lb提。
此諸眾生，于今有住聲聞地者，我常教化^lb阿耨多羅三藐三菩提。是諸人等，應以是法^pb83漸入佛道。
所以者何？如來智慧，難信難解。
爾^lb時所化無量恒河沙等眾生者，汝等諸比丘，^lb及我滅度後未來世中聲聞弟子是也。
我滅^lb度後，復有弟子不聞是經，不知不覺菩薩所^lb行，自於所得功德生滅度想，當入涅槃。我於^lb餘國作佛，更有異名。是人雖生滅度之想入^pb84於涅槃，而於彼土求佛智慧，得聞是經，唯以^lb佛乘而得滅度，更無餘乘，除諸如來方便說^lb法。
^cb#25c20「諸比丘！若如來自知涅槃時到，眾又清淨、^lb信解堅固、了達空法、深入禪定，便集諸菩薩^lb及聲聞眾，為說是經。
世間無有二乘而得滅^lb度，唯一佛乘得滅度耳。比丘當知！如來方便，^pb85深入眾生之性，知其志樂小法，深著五欲，為^lb是等故說於涅槃。是人若聞，則便信受。
^cb#25c26「譬如^lb五百由旬險難惡道，曠絕無人、怖畏之處。若^lb有多眾，欲過此道至珍寶處。
有一導師，聰慧^lb明達，善知險道通塞之相，將導眾人欲過此^lb難。
所將人眾中路懈退，白導師言：『我等疲極，^pb86而復怖畏，不能復進；前路猶遠，今欲退還。』導^lb師多諸方便而作是念：『此等可愍，云何捨大^lb珍寶而欲退還？』
作是念已，以方便力，於險道^lb中過三百由旬，化作一城，告眾人言：『汝等勿^lb怖，莫得退還。
今此大城，可於中止，隨意所作。^lb若入是城，快得安隱。若能前至寶所，亦可得^pb87去。』
是時疲極之眾，心大歡喜，歎未曾有：『我等^lb今者免斯惡道，快得安隱。』於是眾人前入化^lb城，生已度想、生安隱想。
爾時導師，知此人眾^lb既得止息，無復疲惓。
即滅化城，語眾人言：『汝^lb等去來，寶處在近。向者大城，我所化作，為止^lb息耳。』
^cb#26a13「諸比丘！如來亦復如是，今為汝等作大^pb88導師，知諸生死煩惱惡道險難長遠，應去應^lb度。
若眾生但聞一佛乘者，則不欲見佛，不欲^lb親近，便作是念：『佛道長遠，久受懃苦乃可得^lb成。』佛知是心怯弱下劣，以方便力，而於中道^lb為止息故，說二涅槃。
若眾生住於二地，如來^lb爾時即便為說：『汝等所作未辦，汝所住地，近^pb89於佛慧，當觀察籌量所得涅槃非真實也。
但^lb是如來方便之力，於一佛乘分別說三。』如彼^lb導師，為止息故，化作大城。既知息已，而告之^lb言：『寶處在近，此城非實，我化作耳。』」
爾時世尊^lb欲重宣此義，而說偈言：
^lb^gatha「大通智勝佛，　　十劫坐道場，
　佛法不現前，　　^pb90不得成佛道。
　諸天神龍王、　　阿修羅眾等，
　^lb常雨於天華，　　以供養彼佛。
　諸天擊天鼓，　　^lb并作眾伎樂，
　香風吹萎華，　　更雨新好者。
　^lb過十小劫已，　　乃得成佛道，
　諸天及世人，　　^lb心皆懷踊躍。
　彼佛十六子，　　皆與其眷屬，
　^lb千萬億圍繞，　　俱行至佛所，
　頭面禮佛足，　　^pb91而請轉法輪：
『聖師子法雨，　　充我及一切。』
　^lb世尊甚難值，　　久遠時一現，
　為覺悟群生，　　^lb震動於一切。
　東方諸世界，　　五百萬億國，
　^lb梵宮殿光曜，　　昔所未曾有。
　諸梵見此相，　　^lb尋來至佛所，
　散花以供養，　　并奉上宮殿，
　^lb請佛轉法輪，　　以偈而讚歎。
　佛知時未至，　　^pb92受請默然坐。
　三方及四維、　　上下亦復爾，
　^lb散花奉宮殿，　　請佛轉法輪：
『世尊甚難值，　　^lb願以大慈悲，
　廣開甘露門，　　轉無上法輪。』
　^lb無量慧世尊，　　受彼眾人請，
　為宣種種法：　　^lb『四諦十二緣，
　無明至老死，　　皆從生緣有。
　^lb如是眾過患，　　汝等應當知。』
　宣暢是法時，　　^pb93六百萬億姟，
　得盡諸苦際，　　皆成阿羅漢。
　^lb第二說法時，　　千萬恒沙眾，
　於諸法不受，　　^lb亦得阿羅漢。
　從是後得道，　　其數無有量，
　^lb萬億劫算數，　　不能得其邊。
　時十六王子，　　^lb出家作沙彌，
　皆共請彼佛，　　演說大乘法：
^lb『我等及營從，　　皆當成佛道，
　願得如世尊，　　^pb94慧眼第一淨。』
　佛知童子心，　　宿世之所行，
　^lb以無量因緣、　　種種諸譬喻，
　說六波羅蜜，　　^lb及諸神通事。
　分別真實法，　　菩薩所行道，
　^lb說是法華經，　　如恒河沙偈。
　彼佛說經已，　　^lb靜室入禪定，
　一心一處坐，　　八萬四千劫。
　^lb是諸沙彌等，　　知佛禪未出，
　為無量億眾，　　^pb95說佛無上慧。
　各各坐法座，　　說是大乘經，
　^lb於佛宴寂後，　　宣揚助法化。
　一一沙彌等，　　^lb所度諸眾生，
　有六百萬億，　　恒河沙等眾。
　^lb彼佛滅度後，　　是諸聞法者，
　在在諸佛土，　　^lb常與師俱生。
　是十六沙彌，　　具足行佛道，
　^lb今現在十方，　　各得成正覺。
　爾時聞法者，　　^pb96各在諸佛所，
　其有住聲聞，　　漸教以佛道。
　^lb我在十六數，　　曾亦為汝說，
　是故以方便，　　^lb引汝趣佛慧。
　以是本因緣，　　今說法華經，
　^lb令汝入佛道，　　慎勿懷驚懼。
　譬如險惡道，　　^lb逈絕多毒獸，
　又復無水草，　　人所怖畏處。
　^lb無數千萬眾，　　欲過此險道，
　其路甚曠遠，　　^pb97經五百由旬。
　時有一導師，　　強識有智慧，
　^lb明了心決定，　　在險濟眾難。
　眾人皆疲惓，　　^lb而白導師言：
『我等今頓乏，　　於此欲退還。』
　^lb導師作是念：　　『此輩甚可愍，
　如何欲退還，　　^lb而失大珍寶？』
　尋時思方便，　　當設神通力，
　^lb化作大城郭，　　莊嚴諸舍宅，
　周匝有園林，　　^pb98渠流及浴池，
　重門高樓閣，　　男女皆充滿。
　^lb即作是化已，　　慰眾言勿懼：
『汝等入此城，　　^lb各可隨所樂。』
　諸人既入城，　　心皆大歡喜，
　^lb皆生安隱想，　　自謂已得度。
　導師知息已，　　^lb集眾而告言：
『汝等當前進，　　此是化城耳。
　^lb我見汝疲極，　　中路欲退還，
　故以方便力，　　^pb99權化作此城。
　汝等勤精進，　　當共至寶所。』
　^lb我亦復如是，　　為一切導師。
　見諸求道者，　　^lb中路而懈廢，
　不能度生死，　　煩惱諸險道。
　^lb故以方便力，　　為息說涅槃。
　言：『汝等苦滅，　　^lb所作皆已辦。』
　既知到涅槃，　　皆得阿羅漢，
　^lb爾乃集大眾，　　為說真實法。
　諸佛方便力，　　^pb100分別說三乘，
　唯有一佛乘，　　息處故說二。
　^lb今為汝說實，　　汝所得非滅，
　為佛一切智，　　^lb當發大精進。
　汝證一切智，　　十力等佛法，
　^lb具三十二相，　　乃是真實滅。
　諸佛之導師，　　^lb為息說涅槃，
　既知是息已，　　引入於佛慧。」
^lb妙法蓮華經卷第三^pb101
^pb1^folio#sdpdrk4<lines=6>妙法蓮華經卷第四^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck8〔五百弟子受記品第八〕
^lb^cb#27b17爾時富樓那彌多羅尼子，從佛聞是智慧方^lb便隨宜說法，又聞授諸大弟子阿耨多羅三^lb藐三菩提記，復聞宿世因緣之事，復聞諸佛^pb2有大自在神通之力，得未曾有，心淨踊躍。
即^lb從座起，到於佛前，頭面禮足，却住一面，瞻仰^lb尊顏目不暫捨，而作是念：「世尊甚奇特，所為^lb希有！隨順世間若干種性，以方便知見而為^lb說法，拔出眾生處處貪著。
我等於佛功德，言^lb不能宣，唯佛世尊能知我等深心本願。」
^cb#27b26爾時^pb3佛告諸比丘：「汝等見是富樓那彌多羅尼子^lb不？我常稱其於說法人中最為第一，亦常歎^lb其種種功德，精勤護持助宣我法，能於四眾^lb示教利喜，具足解釋佛之正法，而大饒益同^lb梵行者。
自捨如來，無能盡其言論之辯。汝等^lb勿謂富樓那但能護持助宣我法，亦於過去^pb4九十億諸佛所，護持助宣佛之正法，於彼說^lb法人中亦最第一。
又於諸佛所說空法，明了^lb通達，得四無礙智，常能審諦清淨說法，無有^lb疑惑，具足菩薩神通之力。
隨其壽命，常修梵^lb行，彼佛世人咸皆謂之實是聲聞；而富樓那^lb以斯方便，饒益無量百千眾生，又化無量阿^pb5僧祇人，令立阿耨多羅三藐三菩提。
為淨佛^lb土故，常作佛事，教化眾生。
^cb#27c11「諸比丘！富樓那亦^lb於七佛說法人中而得第一，今於我所說法^lb人中亦為第一，於賢劫中當來諸佛，說法人^lb中亦復第一，而皆護持助宣佛法。
亦於未來，^lb護持助宣無量無邊諸佛之法，教化饒益無^pb6量眾生，令立阿耨多羅三藐三菩提。
為淨佛^lb土故，常勤精進教化眾生，漸漸具足菩薩之^lb道。
過無量阿僧祇劫，當於此土，得阿耨多羅^lb三藐三菩提，號曰法明如來、應供、正遍知、明^lb行足、善逝、世間解、無上士、調御丈夫、天人師、^lb佛、世尊。
其佛以恒河沙等三千大千世界為^pb7一佛土，七寶為地，地平如掌，無有山陵谿澗^lb溝壑，七寶臺觀充滿其中，諸天宮殿近處虛^lb空，人天交接，兩得相見。
無諸惡道，亦無女人，^lb一切眾生，皆以化生，無有婬欲。
得大神通，身^lb出光明，飛行自在，志念堅固，精進智慧，普皆^lb金色，三十二相而自莊嚴。
其國眾生，常以二^pb8食：一者、法喜食，二者、禪悅食。
有無量阿僧祇^lb千萬億那由他諸菩薩眾，得大神通、四無礙^lb智，善能教化眾生之類。
其聲聞眾，算數校計^lb所不能知，皆得具足六通、三明及八解脫。
其^lb佛國土有如是等無量功德莊嚴成就。劫名^lb寶明，國名善淨。其佛壽命無量阿僧祇劫，法^pb9住甚久。佛滅度後，起七寶塔遍滿其國。」
^cb#28a07爾時^lb世尊欲重宣此義，而說偈言：
^lb^gatha「諸比丘諦聽！　　佛子所行道，
　善學方便故，　　^lb不可得思議。
　知眾樂小法，　　而畏於大智，
　^lb是故諸菩薩，　　作聲聞緣覺，
　以無數方便，　　^lb化諸眾生類。
　自說是聲聞，　　去佛道甚遠，
　^pb10度脫無量眾，　　皆悉得成就，
　雖小欲懈怠，　　^lb漸當令作佛。
　內祕菩薩行，　　外現是聲聞，
　^lb少欲厭生死，　　實自淨佛土。
　示眾有三毒，　　^lb又現邪見相，
　我弟子如是，　　方便度眾生。
　^lb若我具足說，　　種種現化事，
　眾生聞是者，　　^lb心則懷疑惑。
　今此富樓那，　　於昔千億佛，
　^pb11勤修所行道，　　宣護諸佛法。
　為求無上慧，　　^lb而於諸佛所，
　現居弟子上，　　多聞有智慧。
　^lb所說無所畏，　　能令眾歡喜，
　未曾有疲惓，　　^lb而以助佛事。
　已度大神通，　　具四無礙智，
　^lb知諸根利鈍，　　常說清淨法。
　演暢如是義，　　^lb教諸千億眾，
　令住大乘法，　　而自淨佛土。
　^pb12未來亦供養，　　無量無數佛，
　護助宣正法，　　^lb亦自淨佛土。
　常以諸方便，　　說法無所畏，
　^lb度不可計眾，　　成就一切智。
　供養諸如來，　　^lb護持法寶藏，
　其後得成佛，　　號名曰法明。
　^lb其國名善淨，　　七寶所合成，
　劫名為寶明。　　^lb菩薩眾甚多，
　其數無量億，　　皆度大神通，
　^pb13威德力具足，　　充滿其國土。
　聲聞亦無數，　　^lb三明八解脫，
　得四無礙智，　　以是等為僧。
　^lb其國諸眾生，　　婬欲皆已斷，
　純一變化生，　　^lb具相莊嚴身。
　法喜禪悅食，　　更無餘食想。
　^lb無有諸女人，　　亦無諸惡道。
　富樓那比丘，　　^lb功德悉成滿，
　當得斯淨土，　　賢聖眾甚多。
　^pb14如是無量事，　　我今但略說。」
^lb^cb#28b23爾時千二百阿羅漢，心自在者，作是念：「我等^lb歡喜，得未曾有。
若世尊各見授記，如餘大弟^lb子者，不亦快乎！」
^cb#28b25佛知此等心之所念，告摩訶^lb迦葉：「是千二百阿羅漢，我今當現前次第與^lb授阿耨多羅三藐三菩提記。
於此眾中，我大^pb15弟子憍陳如比丘，當供養六萬二千億佛，然^lb後得成為佛，號曰普明如來、應供、正遍知、明^lb行足、善逝、世間解、無上士、調御丈夫、天人師、^lb佛、世尊。
其五百阿羅漢：優樓頻螺迦葉、伽耶^lb迦葉、那提迦葉、迦留陀夷、優陀夷、阿㝹樓馱、^lb離婆多、劫賓那、薄拘羅、周陀、莎伽陀等，皆當^pb16得阿耨多羅三藐三菩提，盡同一號，名曰普^lb明。」
^cb#28c06爾時世尊欲重宣此義，而說偈言：
^lb^gatha「憍陳如比丘，　　當見無量佛，
　過阿僧祇劫，　　^lb乃成等正覺。
　常放大光明，　　具足諸神通，
　^lb名聞遍十方，　　一切之所敬，
　常說無上道，　　^lb故號為普明。
　其國土清淨，　　菩薩皆勇猛，
　^pb17咸昇妙樓閣，　　遊諸十方國，
　以無上供具，　　^lb奉獻於諸佛。
　作是供養已，　　心懷大歡喜，
　^lb須臾還本國，　　有如是神力。
　佛壽六萬劫，　　^lb正法住倍壽，
　像法復倍是，　　法滅天人憂。
　^lb其五百比丘，　　次第當作佛，
　同號曰普明，　　^lb轉次而授記。
　我滅度之後，　　某甲當作佛，
　^pb18其所化世間，　　亦如我今日。
　國土之嚴淨，　　^lb及諸神通力，
　菩薩聲聞眾，　　正法及像法，
　^lb壽命劫多少，　　皆如上所說。
　迦葉汝已知，　　^lb五百自在者，
　餘諸聲聞眾，　　亦當復如是。
　^lb其不在此會，　　汝當為宣說。」
^lb^cb#29a01爾時五百阿羅漢於佛前得受記已，歡喜踊^pb19躍，即從座起，到於佛前，頭面禮足，悔過自責：^lb「世尊！我等常作是念，自謂已得究竟滅度，今^lb乃知之，如無智者。
所以者何？我等應得如來^lb智慧，而便自以小智為足。
^cb#29a05「世尊！譬如有人至^lb親友家，醉酒而臥。
是時親友官事當行，以無^lb價寶珠繫其衣裏，與之而去。其人醉臥，都不^pb20覺知。起已遊行，到於他國。為衣食故，勤力求^lb索，甚大艱難；若少有所得，便以為足。
於後親^lb友會遇見之，而作是言：『咄哉，丈夫！何為衣食^lb乃至如是。
我昔欲令汝得安樂、五欲自恣，於^lb某年日月，以無價寶珠繫汝衣裏。今故現在，^lb而汝不知。勤苦憂惱，以求自活，甚為癡也。汝^pb21今可以此寶貿易所須，常可如意，無所乏短。』
^lb^cb#29a16「佛亦如是，為菩薩時，教化我等，令發一切智^lb心。而尋廢忘，不知不覺。既得阿羅漢道，自謂^lb滅度，資生艱難，得少為足。一切智願，猶在不^lb失。今者世尊覺悟我等，作如是言：『諸比丘！汝^lb等所得，非究竟滅。
我久令汝等種佛善根，以^pb22方便故，示涅槃相，而汝謂為實得滅度。』
^cb#29a22「世尊！^lb我今乃知實是菩薩，得受阿耨多羅三藐三^lb菩提記。以是因緣，甚大歡喜，得未曾有。」
^cb#29a24爾時^lb阿若憍陳如等，欲重宣此義，而說偈言：
^lb^gatha「我等聞無上，　　安隱授記聲，
　歡喜未曾有，　　^lb禮無量智佛。
　今於世尊前，　　自悔諸過咎，
　^pb23於無量佛寶，　　得少涅槃分，
　如無智愚人，　　^lb便自以為足。
　譬如貧窮人，　　往至親友家，
　^lb其家甚大富，　　具設諸餚饍，
　以無價寶珠，　　^lb繫著內衣裏，
　默與而捨去，　　時臥不覺知。
　^lb是人既已起，　　遊行詣他國，
　求衣食自濟，　　^lb資生甚艱難，
　得少便為足，　　更不願好者。
　^pb24不覺內衣裏，　　有無價寶珠。
　與珠之親友，　　^lb後見此貧人，
　苦切責之已，　　示以所繫珠。
　^lb貧人見此珠，　　其心大歡喜，
　富有諸財物，　　^lb五欲而自恣。
　我等亦如是，　　世尊於長夜，
　^lb常愍見教化，　　令種無上願。
　我等無智故，　　^lb不覺亦不知，
　得少涅槃分，　　自足不求餘。
　^pb25今佛覺悟我，　　言非實滅度，
　得佛無上慧，　　^lb爾乃為真滅。
　我今從佛聞，　　授記莊嚴事，
　^lb及轉次受決，　　身心遍歡喜。」
^lb^ck9〔授學無學人記品第九〕
^lb^cb#29b23爾時阿難、羅睺羅而作是念：「我等每自思惟：^lb『設得受記，不亦快乎。』」即從座起，到於佛前，頭^pb26面禮足，俱白佛言：「世尊！我等於此亦應有分，^lb唯有如來，我等所歸。
又我等為一切世間天、^lb人、阿修羅所見知識——阿難常為侍者，護持法^lb藏；羅睺羅是佛之子——若佛見授阿耨多羅三^lb藐三菩提記者，我願既滿，眾望亦足。」
爾時，學、^lb無學聲聞弟子二千人，皆從座起，偏袒右肩，^pb27到於佛前，一心合掌，瞻仰世尊，如阿難、羅睺^lb羅所願，住立一面。
^cb#29c03爾時佛告阿難：「汝於來世^lb當得作佛，號山海慧自在通王如來、應供、正^lb遍知、明行足、善逝、世間解、無上士、調御丈夫、^lb天人師、佛、世尊。
當供養六十二億諸佛，護持^lb法藏，然後得阿耨多羅三藐三菩提。
教化二^pb28十千萬億恒河沙諸菩薩等，令成阿耨多羅^lb三藐三菩提。
國名常立勝幡，其土清淨，琉璃^lb為地。劫名妙音遍滿。其佛壽命，無量千萬億^lb阿僧祇劫，若人於千萬億無量阿僧祇劫中^lb算數校計，不能得知。
正法住世倍於壽命，像^lb法住世復倍正法。阿難！是山海慧自在通王^pb29佛，為十方無量千萬億恒河沙等諸佛如來^lb所共讚歎，稱其功德。」
^cb#29c16爾時世尊欲重宣此義，^lb而說偈言：
^lb^gatha「我今僧中說，　　阿難持法者，
　當供養諸佛，　　^lb然後成正覺，
　號曰：山海慧　　自在通王佛。
　^lb其國土清淨，　　名常立勝幡，
　教化諸菩薩，　　^pb30其數如恒沙。
　佛有大威德，　　名聞滿十方。
　^lb壽命無有量，　　以愍眾生故，
　正法倍壽命，　　^lb像法復倍是。
　如恒河沙等、　　無數諸眾生，
　^lb於此佛法中，　　種佛道因緣。」
^lb^cb#29c28爾時會中新發意菩薩八千人，咸作是念：「我^lb等尚不聞諸大菩薩得如是記，有何因緣而^pb31諸聲聞得如是決？」
^cb#30a01爾時世尊知諸菩薩心之^lb所念，而告之曰：「諸善男子！我與阿難等，於空^lb王佛所，同時發阿耨多羅三藐三菩提心。
阿^lb難常樂多聞，我常勤精進，是故我已得成阿^lb耨多羅三藐三菩提，而阿難護持我法，亦護^lb將來諸佛法藏，教化成就諸菩薩眾，其本願^pb32如是，故獲斯記。」
^cb#30a07阿難面於佛前，自聞授記及^lb國土莊嚴，所願具足，心大歡喜，得未曾有。
即^lb時憶念過去無量千萬億諸佛法藏，通達無^lb礙，如今所聞，亦識本願。
^cb#30a11爾時阿難而說偈言：
^lb^gatha「世尊甚希有，　　令我念過去，
　無量諸佛法，　　^lb如今日所聞。
　我今無復疑，　　安住於佛道，
　^pb33方便為侍者，　　護持諸佛法。」
^lb^cb#30a16爾時佛告羅睺羅：「汝於來世當得作佛，號蹈^lb七寶華如來、應供、正遍知、明行足、善逝、世間^lb解、無上士、調御丈夫、天人師、佛、世尊。
當供養^lb十世界微塵等數諸佛如來，常為諸佛而作^lb長子，猶如今也。
是蹈七寶華佛，國土莊嚴，壽^pb34命劫數，所化弟子，正法、像法，亦如山海慧自^lb在通王如來無異，亦為此佛而作長子。
過是^lb已後，當得阿耨多羅三藐三菩提。」
^cb#30a24爾時世尊^lb欲重宣此義，而說偈言：
^lb^gatha「我為太子時，　　羅睺為長子，
　我今成佛道，　　^lb受法為法子。
　於未來世中，　　見無量億佛，
　^pb35皆為其長子，　　一心求佛道。
　羅睺羅密行，　　^lb唯我能知之，
　現為我長子，　　以示諸眾生。
　^lb無量億千萬，　　功德不可數，
　安住於佛法，　　^lb以求無上道。」
^lb^cb#30b04爾時世尊見學、無學二千人，其意柔軟，寂然^lb清淨，一心觀佛。
佛告阿難：「汝見是學、無學二^pb36千人不？」
^cb#30b06「唯然，已見。」
「阿難！是諸人等，當供養五^lb十世界微塵數諸佛如來，恭敬尊重，護持法^lb藏。
末後同時於十方國各得成佛，皆同一號，^lb名曰寶相如來、應供、正遍知、明行足、善逝、世^lb間解、無上士、調御丈夫、天人師、佛、世尊。壽命^lb一劫。國土莊嚴，聲聞、菩薩，正法、像法、皆悉同^pb37等。」
^cb#30b12爾時世尊欲重宣此義，而說偈言：
^lb^gatha「是二千聲聞，　　今於我前住，
　悉皆與授記，　　^lb未來當成佛。
　所供養諸佛，　　如上說塵數，
　^lb護持其法藏，　　後當成正覺。
　各於十方國，　　^lb悉同一名號，
　俱時坐道場，　　以證無上慧，
　^lb皆名為寶相。　　國土及弟子，
　正法與像法，　　^pb38悉等無有異。
　咸以諸神通，　　度十方眾生，
　^lb名聞普周遍，　　漸入於涅槃。」
^lb^cb#30b24爾時學、無學二千人，聞佛授記，歡喜踊躍、而^lb說偈言：
^lb^gatha「世尊慧燈明，　　我聞授記音，
　心歡喜充滿，　　^lb如甘露見灌。」
^pb39^ck10〔法師品第十〕
^lb^cb#30b29爾時世尊因藥王菩薩，告八萬大士：「藥王！汝^lb見是大眾中，無量諸天、龍王、夜叉、乾闥婆、阿^lb修羅、迦樓羅、緊那羅、摩睺羅伽、人與非人，及^lb比丘、比丘尼、優婆塞、優婆夷，求聲聞者、求辟^lb支佛者、求佛道者，如是等類，咸於佛前，聞妙^pb40法華經一偈一句，乃至一念隨喜者，我皆與^lb授記，當得阿耨多羅三藐三菩提。」
^cb#30c07佛告藥王：^lb「又如來滅度之後，若有人聞妙法華經，乃至^lb一偈一句，一念隨喜者，我亦與授阿耨多羅^lb三藐三菩提記。
若復有人，受持、讀誦、解說、書^lb寫妙法華經，乃至一偈，於此經卷敬視如佛，^pb41種種供養——華、香、瓔珞、末香、塗香、燒香，繒蓋、幢^lb幡、衣服、伎樂，乃至合掌恭敬。
藥王！當知是諸^lb人等，已曾供養十萬億佛，於諸佛所成就大^lb願，愍眾生故，生此人間。
^cb#30c15「藥王！若有人問：『何等^lb眾生，於未來世當得作佛？』應示：『是諸人等，於^lb未來世必得作佛。』
何以故？若善男子、善女人，^pb42於法華經，乃至一句，受持、讀誦、解說、書寫，種^lb種供養經卷——華、香、瓔珞、末香、塗香、燒香、繒蓋、^lb幢幡、衣服、伎樂，合掌恭敬；
是人，一切世間所^lb應瞻奉，應以如來供養而供養之。
當知此人^lb是大菩薩，成就阿耨多羅三藐三菩提，哀愍^lb眾生，願生此間，廣演分別妙法華經。何況盡^pb43能受持、種種供養者？
^cb#30c24「藥王！當知是人，自捨清^lb淨業報，於我滅度後，愍眾生故，生於惡世，廣^lb演此經。
若是善男子、善女人，我滅度後，能竊^lb為一人說法華經，乃至一句；當知是人則如^lb來使，如來所遣，行如來事。何況於大眾中廣^lb為人說？
^cb#30c29「藥王！若有惡人，以不善心，於一劫中^pb44現於佛前，常毀罵佛，其罪尚輕；若人以一惡^lb言，毀呰在家、出家讀誦法華經者，其罪甚重。
^lb^cb#31a03「藥王！其有讀誦法華經者，當知是人以佛莊^lb嚴而自莊嚴，則為如來肩所荷擔。
其所至方，^lb應隨向禮，一心合掌，恭敬供養，尊重讚歎，華、^lb香、瓔珞，末香、塗香、燒香，繒蓋、幢幡，衣服、餚饌，^pb45作諸伎樂，人中上供，而供養之，應持天寶而^lb以散之，天上寶聚應以奉獻。
所以者何？是人^lb歡喜說法，須臾聞之，即得究竟阿耨多羅^lb三藐三菩提故。」
^cb#31a11爾時世尊欲重宣此義，而說偈^lb言：
^lb^gatha「若欲住佛道，　　成就自然智，
　常當勤供養，　　^pb46受持法華者。
　其有欲疾得，　　一切種智慧，
　^lb當受持是經，　　并供養持者。
　若有能受持，　　^lb妙法華經者，
　當知佛所使，　　愍念諸眾生。
　^lb諸有能受持，　　妙法華經者，
　捨於清淨土，　　^lb愍眾故生此。
　當知如是人，　　自在所欲生，
　^lb能於此惡世，　　廣說無上法。
　應以天華香，　　^pb47及天寶衣服，
　天上妙寶聚，　　供養說法者。
　^lb吾滅後惡世，　　能持是經者，
　當合掌禮敬，　　^lb如供養世尊。
　上饌眾甘美，　　及種種衣服，
　^lb供養是佛子，　　冀得須臾聞。
　若能於後世，　　^lb受持是經者，
　我遣在人中，　　行於如來事。
　^lb若於一劫中，　　常懷不善心，
　作色而罵佛，　　^pb48獲無量重罪。
　其有讀誦持，　　是法華經者，
　^lb須臾加惡言，　　其罪復過彼。
　有人求佛道，　　^lb而於一劫中，
　合掌在我前，　　以無數偈讚。
　^lb由是讚佛故，　　得無量功德，
　歎美持經者，　　^lb其福復過彼。
　於八十億劫，　　以最妙色聲，
　^lb及與香味觸，　　供養持經者。
　如是供養已，　　^pb49若得須臾聞，
　則應自欣慶，　　我今獲大利。
　^lb藥王今告汝，　　我所說諸經，
　而於此經中，　　^lb法華最第一。」
^lb^cb#31b16爾時佛復告藥王菩薩摩訶薩：「我所說經典^lb無量千萬億，已說、今說、當說，而於其中，此法^lb華經最為難信難解。
^cb#31b18「藥王！此經是諸佛祕要^pb50之藏，不可分布妄授與人；諸佛世尊之所守^lb護，從昔已來，未曾顯說。
而此經者，如來現在，^lb猶多怨嫉，況滅度後？
^cb#31b21「藥王！當知如來滅後，其^lb能書、持、讀、誦、供養、為他人說者，如來則為以^lb衣覆之，又為他方現在諸佛之所護念。
是人^lb有大信力，及志願力、諸善根力。當知是人與^pb51如來共宿，則為如來手摩其頭。
^cb#31b26「藥王！在在處^lb處，若說、若讀、若誦、若書，若經卷所住處，皆應^lb起七寶塔，極令高廣嚴飾，不須復安舍利。
所^lb以者何？此中已有如來全身。此塔，應以一切^lb華、香、瓔珞，繒蓋、幢幡，伎樂、歌頌，供養恭敬，尊^lb重讚歎。
若有人得見此塔，禮拜、供養，當知是^pb52等皆近阿耨多羅三藐三菩提。
^cb#31c03「藥王！多有人^lb在家、出家行菩薩道，若不能得見聞、讀誦、書^lb持、供養是法華經者，當知是人未善行菩薩^lb道；若有得聞是經典者，乃能善行菩薩之道。
^lb其有眾生求佛道者，若見、若聞是法華經，聞^lb已信解受持者，當知是人得近阿耨多羅三^pb53藐三菩提。
^cb#31c09「藥王！譬如有人渴乏須水，於彼高^lb原穿鑿求之，猶見乾土，知水尚遠；施功不已，^lb轉見濕土，遂漸至泥，其心決定、知水必近。
菩^lb薩亦復如是，若未聞、未解、未能修習是法華^lb經，當知是人去阿耨多羅三藐三菩提尚遠；^lb若得聞解、思惟、修習，必知得近阿耨多羅三^pb54藐三菩提。
所以者何？一切菩薩阿耨多羅三^lb藐三菩提，皆屬此經——此經開方便門，示真實^lb相。
是法華經藏，深固幽遠，無人能到，今佛教^lb化成就菩薩而為開示。
^cb#31c19「藥王！若有菩薩聞是^lb法華經，驚疑、怖畏，當知是為新發意菩薩；若^lb聲聞人聞是經，驚疑、怖畏，當知是為增上慢^pb55者。
^cb#31c21「藥王！若有善男子、善女人，如來滅後，欲為^lb四眾說是法華經者，云何應說？是善男子、善^lb女人，入如來室，著如來衣，坐如來座，爾乃應^lb為四眾廣說斯經。
如來室者，一切眾生中大^lb慈悲心是；如來衣者，柔和忍辱心是；如來座^lb者，一切法空是。
安住是中，然後以不懈怠心，^pb56為諸菩薩及四眾廣說是法華經。
^cb#31c28「藥王！我於^lb餘國，遣化人為其集聽法眾，亦遣化比丘、比^lb丘尼、優婆塞、優婆夷聽其說法，是諸化人，聞^lb法信受，隨順不逆。
若說法者在空閑處，我時^lb廣遣天、龍、鬼神、乾闥婆、阿修羅等，聽其說法。
^lb我雖在異國，時時令說法者得見我身。若於^pb57此經忘失句逗，我還為說，令得具足。」
^cb#32a06爾時世^lb尊欲重宣此義，而說偈言：
^lb^gatha「欲捨諸懈怠，　　應當聽此經，
　是經難得聞，　　^lb信受者亦難。
　如人渴須水，　　穿鑿於高原，
　^lb猶見乾燥土，　　知去水尚遠；
　漸見濕土泥，　　^lb決定知近水。
　藥王汝當知！　　如是諸人等，
　^pb58不聞法華經，　　去佛智甚遠，
　若聞是深經，　　^lb決了聲聞法。
　是諸經之王，　　聞已諦思惟，
　^lb當知此人等，　　近於佛智慧。
　若人說此經，　　^lb應入如來室，
　著於如來衣，　　而坐如來座，
　^lb處眾無所畏，　　廣為分別說。
　大慈悲為室，　　^lb柔和忍辱衣，
　諸法空為座，　　處此為說法。
　^pb59若說此經時，　　有人惡口罵，
　加刀杖瓦石，　　^lb念佛故應忍。
　我千萬億土，　　現淨堅固身，
　^lb於無量億劫，　　為眾生說法。
　若我滅度後，　　^lb能說此經者，
　我遣化四眾，　　比丘比丘尼，
　^lb及清信士女，　　供養於法師，
　引導諸眾生，　　^lb集之令聽法。
　若人欲加惡，　　刀杖及瓦石，
　^pb60則遣變化人，　　為之作衛護。
　若說法之人，　　^lb獨在空閑處，
　寂寞無人聲，　　讀誦此經典，
　^lb我爾時為現，　　清淨光明身。
　若忘失章句，　　^lb為說令通利。
　若人具是德，　　或為四眾說，
　^lb空處讀誦經，　　皆得見我身。
　若人在空閑，　　^lb我遣天龍王，
　夜叉鬼神等，　　為作聽法眾。
　^pb61是人樂說法，　　分別無罣礙，
　諸佛護念故，　　^lb能令大眾喜。
　若親近法師，　　速得菩薩道，
　^lb隨順是師學，　　得見恒沙佛。」
^lb^ck11〔寶塔品第十一〕
^lb^cb#32b17爾時佛前有七寶塔，高五百由旬，縱廣二百^lb五十由旬，從地踊出，住在空中，種種寶物而^pb62莊校之。
五千欄楯，龕室千萬，無數幢幡以為^lb嚴飾，垂寶瓔珞寶鈴萬億而懸其上。
四面皆^lb出多摩羅跋栴檀之香，充遍世界。其諸幡蓋，^lb以金、銀、琉璃、車璩、馬腦、真珠、玫瑰、七寶合成，^lb高至四天王宮。
三十三天雨天曼陀羅華，供^lb養寶塔。餘諸天、龍、夜叉、乾闥婆、阿修羅、迦樓^pb63羅、緊那羅、摩睺羅伽、人非人等，千萬億眾，以^lb一切華、香、瓔珞、幡蓋、伎樂，供養寶塔，恭敬、尊^lb重、讚歎。
爾時寶塔中出大音聲歎言：「善哉，善^lb哉！釋迦牟尼世尊！能以平等大慧，教菩薩法，^lb佛所護念，妙法華經，為大眾說。
如是，如是！釋^lb迦牟尼世尊！如所說者，皆是真實。」
^cb#32c02爾時四眾，^pb64見大寶塔住在空中，又聞塔中所出音聲，皆^lb得法喜，怪未曾有，從座而起，恭敬合掌，却住^lb一面。
爾時有菩薩摩訶薩，名大樂說，知一切^lb世間天、人、阿修羅、等心之所疑，而白佛言：「世^lb尊！以何因緣，有此寶塔從地踊出，又於其中^lb發是音聲？」
^cb#32c07爾時佛告大樂說菩薩：「此寶塔中^pb65有如來全身，乃往過去東方無量千萬億阿^lb僧祇世界，國名寶淨，彼中有佛，號曰多寶。
其^lb佛行菩薩道時，作大誓願：『若我成佛、滅度之^lb後，於十方國土有說法華經處，我之塔廟，為^lb聽是經故，踊現其前，為作證明，讚言善哉。』
^cb#32c14「彼^lb佛成道已，臨滅度時，於天人大眾中告諸比^pb66丘：『我滅度後，欲供養我全身者，應起一大塔。』^lb其佛以神通願力，十方世界，在在處處，若有^lb說法華經者，彼之寶塔皆踊出其前，全身在^lb於塔中，讚言：『善哉，善哉！』
^cb#32c18「大樂說！今多寶如來^lb塔，聞說法華經故，從地踊出，讚言：『善哉，善哉！』」
^lb^cb#32c20是時大樂說菩薩，以如來神力故，白佛言：「世^pb67尊！我等願欲見此佛身。」
^cb#32c22佛告大樂說菩薩摩^lb訶薩：「是多寶佛，有深重願：『若我寶塔，為聽法^lb華經故，出於諸佛前時，其有欲以我身示四^lb眾者，彼佛分身諸佛——在於十方世界說法，盡^lb還集一處，然後我身乃出現耳。』
^cb#32c26「大樂說！我分^lb身諸佛——在於十方世界說法者，今應當集。」
^cb#32c27大^pb68樂說白佛言：「世尊！我等亦願欲見世尊分身^lb諸佛，禮拜供養。」
^cb#32c29爾時佛放白毫一光，即見東^lb方五百萬億那由他恒河沙等國土諸佛，彼^lb諸國土，皆以頗梨為地，寶樹、寶衣以為莊嚴，^lb無數千萬億菩薩充滿其中，遍張寶幔，寶網^lb羅上。
彼國諸佛，以大妙音而說諸法，及見無^pb69量千萬億菩薩，遍滿諸國，為眾說法。
南西北^lb方、四維上下，白毫相光所照之處，亦復如是。
^lb爾時十方諸佛，各告眾菩薩言：「善男子！我今^lb應往娑婆世界，釋迦牟尼佛所，并供養多寶^lb如來寶塔。」
^cb#33a09時娑婆世界即變清淨，琉璃為地，^lb寶樹莊嚴，黃金為繩以界八道，無諸聚落、村^pb70營、城邑、大海、江河、山川、林藪。
燒大寶香，曼陀^lb羅華遍布其地，以寶網幔，羅覆其上，懸諸寶^lb鈴。唯留此會眾，移諸天人置於他土。
^cb#33a14是時，諸^lb佛各將一大菩薩以為侍者，至娑婆世界，各^lb到寶樹下。
一一寶樹高五百由旬，枝、葉、華、菓^lb次第莊嚴，諸寶樹下皆有師子之座，高五由^pb71旬，亦以大寶而校飾之。
爾時諸佛，各於此座^lb結加趺坐。如是展轉遍滿三千大千世界，而^lb於釋迦牟尼佛一方所分之身猶故未盡。
^cb#33a20時^lb釋迦牟尼佛，欲容受所分身諸佛故，八方各^lb更變二百萬億那由他國，皆令清淨，無有地^lb獄、餓鬼、畜生及阿修羅，又移諸天、人置於他^pb72土。
所化之國，亦以琉璃為地，寶樹莊嚴，樹高^lb五百由旬，枝、葉、華、菓次第嚴飾，樹下皆有寶^lb師子座，高五由旬，種種諸寶以為莊校。
亦無^lb大海、江河，及目真隣陀山、摩訶目真隣陀山、^lb鐵圍山、大鐵圍山、須彌山等諸山王，通為一^lb佛國土。
寶地平正，寶交露幔遍覆其上；懸諸^pb73幡蓋，燒大寶香，諸天寶華遍布其地。
^cb#33b02釋迦牟^lb尼佛為諸佛當來坐故，復於八方各更變二^lb百萬億那由他國，皆令清淨，無有地獄、餓鬼、^lb畜生及阿修羅，又移諸天、人置於他土。
所化^lb之國，亦以琉璃為地，寶樹莊嚴，樹高五百由^lb旬，枝、葉、華、菓次第莊嚴，樹下皆有寶師子座，^pb74高五由旬，亦以大寶而校飾之。
亦無大海、江^lb河，及目真隣陀山、摩訶目真隣陀山、鐵圍山、^lb大鐵圍山、須彌山等諸山王，通為一佛國土。
^lb寶地平正，寶交露幔、遍覆其上；懸諸幡蓋，燒^lb大寶香，諸天寶華遍布其地。
^cb#33b12爾時東方釋迦^lb牟尼佛所分之身，百千萬億那由他恒河沙等^pb75國土中諸佛，各各說法，來集於此；如是次第^lb十方諸佛皆悉來集，坐於八方。
爾時一一方，^lb四百萬億那由他國土諸佛如來遍滿其中。
^lb是時，諸佛各在寶樹下，坐師子座，皆遣侍者^lb問訊釋迦牟尼佛，各齎寶華滿掬而告之言：^lb「善男子！汝往詣耆闍崛山釋迦牟尼佛所，如^pb76我辭曰：『少病、少惱，氣力安樂，及菩薩、聲聞眾^lb悉安隱不？』以此寶華散佛供養，而作是言：『彼^lb某甲佛，與欲開此寶塔。』」諸佛遣使，亦復如是。
^lb^cb#33b23爾時釋迦牟尼佛，見所分身佛悉已來集，各^lb各坐於師子之座，皆聞諸佛與欲同開寶塔。^lb即從座起，住虛空中。一切四眾，起立合掌，一^pb77心觀佛。於是釋迦牟尼佛，以右指開七寶塔^lb戶，出大音聲，如却關鑰開大城門。
即時一切^lb眾會，皆見多寶如來於寶塔中坐師子座，全^lb身不散，如入禪定。
又聞其言：「善哉，善哉！釋迦^lb牟尼佛！快說是法華經，我為聽是經故而來^lb至此。」
爾時四眾等、見過去無量千萬億劫滅^pb78度佛說如是言，歎未曾有，以天寶華聚，散多^lb寶佛及釋迦牟尼佛上。
^cb#33c05爾時多寶佛，於寶塔^lb中分半座與釋迦牟尼佛，而作是言：「釋迦牟^lb尼佛！可就此座。」即時釋迦牟尼佛入其塔中，^lb坐其半座，結加趺坐。
爾時，大眾見二如來在^lb七寶塔中師子座上、結加趺坐，各作是念：「佛^pb79座高遠，唯願如來以神通力，令我等輩俱處^lb虛空。」即時釋迦牟尼佛、以神通力，接諸大眾^lb皆在虛空，以大音聲普告四眾：「誰能於此娑^lb婆國土廣說妙法華經，今正是時。
如來不久^lb當入涅槃，佛欲以此妙法華經付囑有在。」
^cb#33c15爾^lb時世尊欲重宣此義，而說偈言：
^pb80^gatha「聖主世尊，　　雖久滅度，　　在寶塔中，
　尚為法來。　　^lb諸人云何　　不勤為法？
　此佛滅度，　　無央數劫，　　^lb處處聽法，
　以難遇故。　　彼佛本願，　　我滅度後，
　^lb在在所往，　　常為聽法。　　又我分身，
　無量諸佛，　　^lb如恒沙等，　　來欲聽法。
　及見滅度，　　多寶如來，　　^lb各捨妙土，
　及弟子眾、　　天人龍神、　　諸供養事，
　^pb81令法久住，　　故來至此。　　為坐諸佛，
　以神通力，　　^lb移無量眾，　　令國清淨。
　諸佛各各，　　詣寶樹下，　　^lb如清淨池，
　蓮華莊嚴。　　其寶樹下，　　諸師子座，
　^lb佛坐其上，　　光明嚴飾，　　如夜闇中，
　燃大炬火。　　^lb身出妙香，　　遍十方國，
　眾生蒙薰，　　喜不自勝。　　^lb譬如大風，
　吹小樹枝。　　以是方便，　　令法久住。
　^pb82告諸大眾：　　『我滅度後，　　誰能護持、
　讀說斯經？　　^lb今於佛前，　　自說誓言。
　其多寶佛，　　雖久滅度，　　^lb以大誓願，
　而師子吼。　　多寶如來，　　及與我身，
　^lb所集化佛，　　當知此意。　　諸佛子等，
　誰能護法，　　^lb當發大願，　　令得久住。
　其有能護，　　此經法者，　　^lb則為供養，
　我及多寶。　　此多寶佛，　　處於寶塔，
　^pb83常遊十方。　　為是經故，　　亦復供養，
　諸來化佛，　　^lb莊嚴光飾、　　諸世界者。
　若說此經，　　則為見我、　　^lb多寶如來，
　及諸化佛。　　諸善男子！　　各諦思惟，
　^lb此為難事，　　宜發大願。　　諸餘經典，
　數如恒沙，　　^lb雖說此等，　　未足為難。
　若接須彌，　　擲置他方，　　^lb無數佛土，
　亦未為難。　　若以足指，　　動大千界，
　^pb84遠擲他國，　　亦未為難。　　若立有頂，
　為眾演說，　　^lb無量餘經，　　亦未為難。
　若佛滅後，　　於惡世中，　　^lb能說此經，
　是則為難。　　假使有人，　　手把虛空，
　^lb而以遊行，　　亦未為難。　　於我滅後，
　若自書持，　　^lb若使人書，　　是則為難。
　若以大地，　　置足甲上，　　^lb昇於梵天，
　亦未為難。　　佛滅度後，　　於惡世中，
　^pb85暫讀此經，　　是則為難。　　假使劫燒，
　擔負乾草，　　^lb入中不燒，　　亦未為難。
　我滅度後，　　若持此經、　　^lb為一人說，
　是則為難。　　若持八萬，　　四千法藏，
　^lb十二部經，　　為人演說，　　令諸聽者，
　得六神通，　　^lb雖能如是，　　亦未為難。
　於我滅後，　　聽受此經，　　^lb問其義趣，
　是則為難。　　若人說法，　　令千萬億，
　^pb86無量無數，　　恒沙眾生，　　得阿羅漢，
　具六神通，　　^lb雖有是益，　　亦未為難。
　於我滅後，　　若能奉持，　　^lb如斯經典，
　是則為難。　　我為佛道，　　於無量土，
　^lb從始至今，　　廣說諸經，　　而於其中，
　此經第一。　　^lb若有能持，　　則持佛身。
　諸善男子！　　於我滅後，　　^lb誰能受持、
　讀誦此經，　　今於佛前、　　自說誓言。
　^pb87此經難持，　　若暫持者，　　我則歡喜，
　諸佛亦然。　　^lb如是之人，　　諸佛所歎。
　是則勇猛，　　是則精進，　　^lb是名持戒，
　行頭陀者，　　則為疾得，　　無上佛道。
　^lb能於來世，　　讀持此經，　　是真佛子，
　住淳善地。　　^lb佛滅度後，　　能解其義，
　是諸天人，　　世間之眼。　　^lb於恐畏世，
　能須臾說，　　一切天人，　　皆應供養。』」◎
^pb88^ck12〔提婆達多品第十二〕
^lb^cb#34b24爾時佛告諸菩薩及天人四眾：「吾於過去無^lb量劫中，求法華經，無有懈惓。
於多劫中常作^lb國王，發願求於無上菩提，心不退轉。
為欲滿^lb足六波羅蜜，勤行布施，心無悋惜，象、馬、七珍、^lb國、城、妻、子，奴婢、僕從，頭、目、髓、腦，身、肉、手、足，不^pb89惜軀命。
時世人民壽命無量，為於法故，捐捨^lb國位，委政太子，擊鼓宣令四方求法：『誰能為^lb我說大乘者，吾當終身供給走使。』時有仙人^lb來白王言：『我有大乘，名妙法華經。若不違我，^lb當為宣說。』王聞仙言，歡喜踊躍，即隨仙人，供^lb給所須——採菓、汲水、拾薪、設食，乃至以身而為^pb90床座——身心無惓，于時奉事。
經於千歲，為於法^lb故，精勤給侍，令無所乏。」
^cb#34c08爾時世尊欲重宣此^lb義，而說偈言：
^lb^gatha「我念過去劫，　　為求大法故，
　雖作世國王，　　^lb不貪五欲樂。
　搥鍾告四方，　　誰有大法者，
　^lb若為我解說，　　身當為奴僕。
　時有阿私仙，　　^pb91來白於大王：
『我有微妙法，　　世間所希有。
　^lb若能修行者，　　吾當為汝說。』
　時王聞仙言，　　^lb心生大喜悅，
　即便隨仙人，　　供給於所須，
　^lb採薪及菓蓏，　　隨時恭敬與，
　情存妙法故，　　^lb身心無懈惓。
　普為諸眾生，　　勤求於大法，
　^lb亦不為己身，　　及以五欲樂。
　故為大國王，　　^pb92勤求獲此法，
　遂致得成佛，　　今故為汝說。」
^lb^cb#34c25佛告諸比丘：「爾時王者，則我身是；時仙人者，^lb今提婆達多是。
由提婆達多善知識故，令我^lb具足六波羅蜜，慈悲喜捨，三十二相，八十種^lb好，紫磨金色，十力、四無所畏、四攝法、十八不^lb共神通道力，成等正覺，廣度眾生，皆因提婆^pb93達多善知識故。」
^cb#35a01告諸四眾：「提婆達多却後過^lb無量劫，當得成佛，號曰天王如來、應供、正遍^lb知、明行足、善逝、世間解、無上士、調御丈夫、天^lb人師、佛、世尊。世界名天道。時天王佛住世二^lb十中劫，廣為眾生說於妙法，恒河沙眾生得^lb阿羅漢果，無量眾生發緣覺心，恒河沙眾生^pb94發無上道心，得無生忍，至不退轉。
時天王佛^lb般涅槃後，正法住世二十中劫。全身舍利起^lb七寶塔，高六十由旬，縱廣四十由旬，諸天人^lb民，悉以雜華、末香、燒香、塗香，衣服、瓔珞、幢幡、^lb寶蓋，伎樂、歌頌，禮拜供養七寶妙塔。
無量眾^lb生得阿羅漢果，無量眾生悟辟支佛，不可思^pb95議眾生發菩提心，至不退轉。」
^cb#35a14佛告諸比丘：「未^lb來世中，若有善男子、善女人，聞妙法華經提^lb婆達多品，淨心信敬不生疑惑者，不墮地獄、^lb餓鬼、畜生，生十方佛前，所生之處，常聞此經。
^lb若生人天中，受勝妙樂，若在佛前，蓮華化生。」
^lb^cb#35a18於時下方多寶世尊所從菩薩，名曰智積，白^pb96多寶佛：「當還本土。」釋迦牟尼佛告智積曰：「善^lb男子！且待須臾。
此有菩薩，名文殊師利，可與^lb相見，論說妙法，可還本土。」
^cb#35a22爾時文殊師利，坐^lb千葉蓮華，大如車輪——俱來菩薩亦坐寶蓮華——^lb從於大海娑竭羅龍宮自然踊出，住虛空中，^lb詣靈鷲山，從蓮華下，至於佛所，頭面敬禮二^pb97世尊足。
修敬已畢，往智積所，共相慰問，却坐^lb一面。
^cb#35a27智積菩薩問文殊師利：「仁往龍宮，所化^lb眾生，其數幾何？」
^cb#35a28文殊師利言：「其數無量，不可^lb稱計，非口所宣，非心所測，且待須臾，自當證^lb知。」所言未竟，無數菩薩坐寶蓮華，從海踊出，^lb詣靈鷲山，住在虛空。
此諸菩薩，皆是文殊師^pb98利之所化度，具菩薩行，皆共論說六波羅蜜。
^lb本聲聞人，在虛空中說聲聞行，今皆修行大^lb乘空義。
文殊師利謂智積曰：「於海教化，其事^lb如是。」
^cb#35b06爾時智積菩薩，以偈讚曰：
^lb^gatha「大智德勇健，　　化度無量眾，
　今此諸大會，　　^lb及我皆已見。
　演暢實相義，　　開闡一乘法，
　^pb99廣導諸眾生，　　令速成菩提。」
^lb^cb#35b12文殊師利言：「我於海中，唯常宣說妙法華經。」
^lb^cb#35b13智積問文殊師利言：「此經甚深微妙，諸經中^lb寶，世所希有。
頗有眾生，勤加精進，修行此經，^lb速得佛不？」
^cb#35b15文殊師利言：「有娑竭羅龍王女，年^lb始八歲，智慧利根，善知眾生諸根行業，得陀^pb100羅尼，諸佛所說甚深祕藏，悉能受持。
深入禪^lb定，了達諸法，於剎那頃發菩提心，得不退轉，^lb辯才無礙。
慈念眾生、猶如赤子，功德具足，心^lb念口演，微妙廣大，慈悲仁讓，志意和雅，能至^lb菩提。」
^cb#35b21智積菩薩言：「我見釋迦如來，於無量劫^lb難行苦行，積功累德，求菩提道，未曾止息。
觀^pb101三千大千世界，乃至無有如芥子許非是菩^lb薩捨身命處，為眾生故，然後乃得成菩提道。^lb不信此女於須臾頃、便成正覺。」
^cb#35b26言論未訖，時^lb龍王女忽現於前，頭面禮敬，却住一面，以偈^lb讚曰：
^lb^gatha「深達罪福相，　　遍照於十方，
　微妙淨法身，　　^pb102具相三十二，
　以八十種好，　　用莊嚴法身。
　^lb天人所戴仰，　　龍神咸恭敬，
　一切眾生類，　　^lb無不宗奉者。
　又聞成菩提，　　唯佛當證知，
　^lb我闡大乘教，　　度脫苦眾生。」
^lb^cb#35c06時舍利弗語龍女言：「汝謂不久得無上道，是^lb事難信。
所以者何？女身垢穢，非是法器，云何^pb103能得無上菩提。
佛道懸曠，經無量劫勤苦積^lb行，具修諸度，然後乃成。
又女人身猶有五障：^lb一者、不得作梵天王，二者、帝釋，三者、魔王，四^lb者、轉輪聖王，五者、佛身。云何女身速得成佛？」
^lb^cb#35c12爾時龍女有一寶珠，價直三千大千世界，持^lb以上佛。佛即受之。龍女謂智積菩薩、尊者舍^pb104利弗言：「我獻寶珠，世尊納受，是事疾不？」
^cb#35c15答言：^lb「甚疾。」
女言：「以汝神力，觀我成佛，復速於此。」
^cb#35c16當^lb時眾會，皆見龍女忽然之間變成男子，具菩^lb薩行，即往南方無垢世界，坐寶蓮華，成等正^lb覺，三十二相、八十種好，普為十方一切眾生^lb演說妙法。
^cb#35c19爾時娑婆世界，菩薩、聲聞、天龍八^pb105部、人與非人，皆遙見彼龍女成佛，普為時會^lb人天說法，心大歡喜，悉遙敬禮。
無量眾生，聞^lb法解悟，得不退轉；無量眾生，得受道記。
無垢^lb世界，六反震動；娑婆世界，三千眾生住不退^lb地，三千眾生發菩提心而得受記。
智積菩薩^lb及舍利弗，一切眾會，默然信受。
^pb106^ck13〔勸持品第十三〕
^lb^cb#35c28爾時藥王菩薩摩訶薩及大樂說菩薩摩訶^lb薩，與二萬菩薩眷屬俱，皆於佛前作是誓言：^lb「唯願世尊不以為慮。
我等於佛滅後，當奉持、^lb讀誦、說此經典。後惡世眾生，善根轉少，多增^lb上慢，貪利供養，增不善根，遠離解脫。
雖難可^pb107教化，我等當起大忍力，讀誦此經，持說、書寫、^lb種種供養，不惜身命。」
^cb#36a05爾時眾中五百阿羅漢^lb得受記者、白佛言：「世尊！我等亦自誓願，於異^lb國土、廣說此經。」
^cb#36a07復有學、無學八千人、得受記^lb者，從座而起，合掌向佛作是誓言：「世尊！我等^lb亦當於他國土廣說此經。
所以者何？是娑婆^pb108國中，人多弊惡，懷增上慢，功德淺薄、瞋濁諂^lb曲，心不實故。」
^cb#36a12爾時佛姨母摩訶波闍波提比^lb丘尼，與學、無學比丘尼六千人俱，從座而起，^lb一心合掌，瞻仰尊顏，目不暫捨。
於時世尊告^lb憍曇彌：「何故憂色而視如來，汝心將無謂我^lb不說汝名，授阿耨多羅三藐三菩提記耶？憍^pb109曇彌！我先總說一切聲聞皆已授記，今汝欲^lb知記者，將來之世，當於六萬八千億諸佛法^lb中為大法師，及六千學、無學比丘尼俱為法^lb師。
汝如是漸漸具菩薩道，當得作佛，號一切^lb眾生喜見如來、應供、正遍知、明行足、善逝、世^lb間解、無上士、調御丈夫、天人師、佛、世尊。
憍曇^pb110彌！是一切眾生喜見佛及六千菩薩，轉次授^lb記得阿耨多羅三藐三菩提。」
^cb#36a24爾時羅睺羅母^lb耶輸陀羅比丘尼作是念：「世尊於授記中，獨^lb不說我名。」
^cb#36a26佛告耶輸陀羅：「汝於來世百千萬^lb億諸佛法中修菩薩行，為大法師，漸具佛道。
^lb於善國中當得作佛，號具足千萬光相如來、^pb111應供、正遍知、明行足、善逝、世間解、無上士、調^lb御丈夫、天人師、佛、世尊。佛壽無量阿僧祇劫。」
^lb^cb#36b02爾時摩訶波闍波提比丘尼及耶輸陀羅比^lb丘尼，并其眷屬，皆大歡喜，得未曾有，即於佛^lb前而說偈言：
^lb^gatha「世尊導師，　　安隱天人，　　我等聞記，
　心安具足。」
^pb112^cb#36b07諸比丘尼說是偈已，白佛言：「世尊！我等亦能^lb於他方國土廣宣此經。」
^cb#36b08爾時世尊視八十萬億^lb那由他諸菩薩摩訶薩。
是諸菩薩——皆是阿惟^lb越致，轉不退法輪，得諸陀羅尼——即從座起，至^lb於佛前，一心合掌，而作是念：「若世尊告勅我^lb等持說此經者，當如佛教，廣宣斯法。」復作是^pb113念：「佛今默然，不見告勅，我當云何？」
時諸菩薩^lb敬順佛意，并欲自滿本願，便於佛前，作師子^lb吼而發誓言：「世尊！我等於如來滅後，周旋往^lb返十方世界，能令眾生書寫此經，受持、讀誦，^lb解說其義，如法修行，正憶念，皆是佛之威力。^lb唯願世尊，在於他方遙見守護。」
^cb#36b19即時諸菩薩^pb114俱同發聲、而說偈言：
^lb^gatha「唯願不為慮，　　於佛滅度後，
　恐怖惡世中，　　^lb我等當廣說。
　有諸無智人，　　惡口罵詈等，
　^lb及加刀杖者，　　我等皆當忍。
　惡世中比丘，　　^lb邪智心諂曲，
　未得謂為得，　　我慢心充滿。
　^lb或有阿練若，　　納衣在空閑，
　自謂行真道，　　^pb115輕賤人間者。
　貪著利養故，　　與白衣說法，
　^lb為世所恭敬，　　如六通羅漢。
　是人懷惡心，　　^lb常念世俗事，
　假名阿練若，　　好出我等過，
　^lb而作如是言：　　『此諸比丘等，
　為貪利養故，　　^lb說外道論議；
　自作此經典，　　誑惑世間人，
　^lb為求名聞故，　　分別於是經。』
　常在大眾中，　　^pb116欲毀我等故，
　向國王大臣，　　婆羅門居士，
　^lb及餘比丘眾，　　誹謗說我惡，
　謂是邪見人，　　^lb說外道論議。
　我等敬佛故，　　悉忍是諸惡。
　^lb為斯所輕言，　　汝等皆是佛，
　如此輕慢言，　　^lb皆當忍受之。
　濁劫惡世中，　　多有諸恐怖，
　^lb惡鬼入其身，　　罵詈毀辱我。
　我等敬信佛，　　^pb117當著忍辱鎧，
　為說是經故，　　忍此諸難事。
　^lb我不愛身命，　　但惜無上道，
　我等於來世，　　^lb護持佛所囑，
　世尊自當知。　　濁世惡比丘，
　^lb不知佛方便，　　隨宜所說法，
　惡口而顰蹙，　　^lb數數見擯出，
　遠離於塔寺。　　如是等眾惡，
　^lb念佛告勅故，　　皆當忍是事。
　諸聚落城邑，　　^pb118其有求法者，
　我皆到其所，　　說佛所囑法。
　^lb我是世尊使，　　處眾無所畏，
　我當善說法，　　^lb願佛安隱住。
　我於世尊前，　　諸來十方佛，
　^lb發如是誓言，　　佛自知我心。」
^lb妙法蓮華經卷第四^pb119
^pb1^folio#sdpdrk5<lines=6>妙法蓮華經卷第五^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck14〔安樂行品第十四〕
^lb^cb#37a10爾時文殊師利法王子菩薩摩訶薩白佛言：^lb「世尊！是諸菩薩，甚為難有，敬順佛故，發大誓^lb願，於後惡世，護持讀說是法華經。
世尊！菩薩^pb2摩訶薩於後惡世，云何能說是經？」
^cb#37a14佛告文殊^lb師利：「若菩薩摩訶薩，於後惡世欲說是經，當^lb安住四法。
一者、安住菩薩行處及親近處，能為^lb眾生演說是經。
^cb#37a16「文殊師利！云何名菩薩摩訶^lb薩行處？若菩薩摩訶薩住忍辱地，柔和善順^lb而不卒暴，心亦不驚；又復於法無所行，而觀^pb3諸法如實相，亦不行不分別，是名菩薩摩訶^lb薩行處。
云何名菩薩摩訶薩親近處？菩薩摩^lb訶薩不親近國王、王子、大臣、官長，不親近諸^lb外道梵志、尼揵子等，及造世俗文筆、讚詠外^lb書，及路伽耶陀、逆路伽耶陀者；亦不親近諸^lb有兇戲、相扠相撲，及那羅等種種變現之戲；
^pb4又不親近旃陀羅，及畜猪羊鷄狗，畋獵漁捕^lb諸惡律儀。
如是人等，或時來者，則為說法，無^lb所希望。又不親近求聲聞比丘、比丘尼、優婆^lb塞、優婆夷，亦不問訊。
若於房中，若經行處，若^lb在講堂中，不共住止。或時來者，隨宜說法，^lb無所希求。
^cb#37b02「文殊師利！又菩薩摩訶薩不應於女^pb5人身，取能生欲想相而為說法，亦不樂見。
若^lb入他家，不與小女、處女、寡女等共語。亦復不^lb近五種不男之人以為親厚，不獨入他家，若^lb有因緣須獨入時，但一心念佛。
若為女人說^lb法，不露齒笑，不現胸臆，乃至為法猶不親厚，^lb況復餘事。
不樂畜年少弟子、沙彌、小兒，亦不^pb6樂與同師。常好坐禪，在於閑處，修攝其心。文^lb殊師利！是名初親近處。」
^cb#37b12「復次，菩薩摩訶薩觀^lb一切法空，如實相，不顛倒、不動、不退、不轉，如^lb虛空，無所有性。
一切語言道斷，不生、不出、不^lb起，無名、無相，實無所有，無量、無邊，無礙、無障，^lb但以因緣有，從顛倒生故說。
常樂觀如是法^pb7相，是名菩薩摩訶薩第二親近處。」
^cb#37b17爾時世尊^lb欲重宣此義，而說偈言：
^lb^gatha「若有菩薩，　　於後惡世，　　無怖畏心，
　欲說是經，　　^lb應入行處，　　及親近處。
　常離國王，　　及國王子、　　^lb大臣官長，
　兇險戲者，　　及旃陀羅、　　外道梵志。
　^lb亦不親近，　　增上慢人，　　貪著小乘、
　三藏學者，　　^pb8破戒比丘，　　名字羅漢，
　及比丘尼，　　好戲笑者，　　^lb深著五欲，
　求現滅度，　　諸優婆夷，　　皆勿親近。
　^lb若是人等，　　以好心來，　　到菩薩所，
　為聞佛道。　　^lb菩薩則以，　　無所畏心，
　不懷悕望，　　而為說法。　　^lb寡女處女，
　及諸不男，　　皆勿親近，　　以為親厚。
　^lb亦莫親近，　　屠兒魁膾，　　畋獵漁捕，
　為利殺害，　　^pb9販肉自活，　　衒賣女色，
　如是之人，　　皆勿親近。　　^lb兇險相撲，
　種種嬉戲，　　諸婬女等，　　盡勿親近。
　^lb莫獨屏處，　　為女說法，　　若說法時，
　無得戲笑。　　^lb入里乞食，　　將一比丘，
　若無比丘，　　一心念佛。　　^lb是則名為，
　行處近處，　　以此二處，　　能安樂說。
　^lb又復不行，　　上中下法，　　有為無為，
　實不實法，　　^pb10亦不分別，　　是男是女。
　不得諸法，　　不知不見，　　^lb是則名為，
　菩薩行處。　　一切諸法，　　空無所有，
　^lb無有常住，　　亦無起滅，　　是名智者，
　所親近處。　　^lb顛倒分別，　　諸法有無，
　是實非實，　　是生非生。　　^lb在於閑處，
　修攝其心，　　安住不動，　　如須彌山。
　^lb觀一切法，　　皆無所有，　　猶如虛空，
　無有堅固。　　^pb11不生不出，　　不動不退，
　常住一相，　　是名近處。　　^lb若有比丘，
　於我滅後，　　入是行處、　　及親近處，
　^lb說斯經時，　　無有怯弱。　　菩薩有時，
　入於靜室，　　^lb以正憶念，　　隨義觀法。
　從禪定起，　　為諸國王、　　^lb王子臣民、
　婆羅門等，　　開化演暢，　　說斯經典，
　^lb其心安隱，　　無有怯弱。　　文殊師利！
　是名菩薩，　　^pb12安住初法，　　能於後世，
　說法華經。
^lb^cb#37c29「又，文殊師利！如來滅後，於末法中欲說是經，^lb應住安樂行。
若口宣說、若讀經時，不樂說人^lb及經典過。亦不輕慢諸餘法師，不說他人好^lb惡、長短。於聲聞人，亦不稱名說其過惡，亦不^lb稱名讚歎其美，又亦不生怨嫌之心。
善修如^pb13是安樂心故，諸有聽者不逆其意，有所難問，^lb不以小乘法答，但以大乘而為解說，令得一^lb切種智。」
^cb#38a07爾時世尊欲重宣此義，而說偈言：
^lb^gatha「菩薩常樂，　　安隱說法，　　於清淨地，
　而施床座。　　^lb以油塗身，　　澡浴塵穢，
　著新淨衣，　　內外俱淨，　　^lb安處法座，
　隨問為說。　　若有比丘，　　及比丘尼，
　^pb14諸優婆塞，　　及優婆夷，　　國王王子、
　群臣士民，　　^lb以微妙義，　　和顏為說。
　若有難問，　　隨義而答，　　^lb因緣譬喻，
　敷演分別。　　以是方便，　　皆使發心，
　^lb漸漸增益，　　入於佛道。　　除嬾惰意，
　及懈怠想，　　^lb離諸憂惱，　　慈心說法。
　晝夜常說，　　無上道教，　　^lb以諸因緣、
　無量譬喻，　　開示眾生，　　咸令歡喜。
　^pb15衣服臥具，　　飲食醫藥，　　而於其中，
　無所悕望。　　^lb但一心念，　　說法因緣，
　願成佛道，　　令眾亦爾。　　^lb是則大利，
　安樂供養。　　我滅度後，　　若有比丘，
　^lb能演說斯，　　妙法華經。　　心無嫉恚，
　諸惱障礙，　　^lb亦無憂愁，　　及罵詈者，
　又無怖畏　　加刀杖等，　　^lb亦無擯出，
　安住忍故。　　智者如是，　　善修其心，
　^pb16能住安樂，　　如我上說。　　其人功德，
　千萬億劫，　　^lb算數譬喻，　　說不能盡。
^lb^cb#38b02「又，文殊師利！菩薩摩訶薩，於後末世法欲滅^lb時，受持、讀誦斯經典者，無懷嫉妬謟誑之心，^lb亦勿輕罵學佛道者，求其長短。
若比丘、比丘^lb尼、優婆塞、優婆夷，求聲聞者、求辟支佛者、求^pb17菩薩道者，無得惱之，令其疑悔，語其人言：『汝^lb等去道甚遠，終不能得一切種智。
所以者何？^lb汝是放逸之人，於道懈怠故。』又亦不應戲論^lb諸法，有所諍競。當於一切眾生起大悲想，於^lb諸如來起慈父想，於諸菩薩起大師想，於十^lb方諸大菩薩，常應深心恭敬禮拜。
於一切眾^pb18生，平等說法，以順法故，不多不少，乃至深愛^lb法者，亦不為多說。」
^cb#38b15「文殊師利！是菩薩摩訶薩，^lb於後末世法欲滅時，有成就是第三安樂行^lb者，說是法時，無能惱亂，得好同學共讀誦是^lb經，亦得大眾而來聽受，聽已能持，持已能誦，^lb誦已能說，說已能書、若使人書，供養經卷，恭^pb19敬、尊重、讚歎。」
^cb#38b20爾時世尊欲重宣此義，而說偈^lb言：
^lb^gatha「若欲說是經，　　當捨嫉恚慢、
　謟誑邪偽心，　　^lb常修質直行。
　不輕蔑於人，　　亦不戲論法，
　^lb不令他疑悔，　　云汝不得佛。
　是佛子說法，　　^lb常柔和能忍，
　慈悲於一切，　　不生懈怠心。
　^pb20十方大菩薩，　　愍眾故行道，
　應生恭敬心，　　^lb是則我大師。
　於諸佛世尊，　　生無上父想，
　^lb破於憍慢心，　　說法無障礙。
　第三法如是，　　^lb智者應守護，
　一心安樂行，　　無量眾所敬。
^lb^cb#38c04「又，文殊師利！菩薩摩訶薩，於後末世法欲滅^lb時，有持是法華經者，於在家、出家人中生大^pb21慈心，於非菩薩人中生大悲心，應作是念：『如^lb是之人，則為大失。
如來方便隨宜說法，不聞^lb不知不覺、不問不信不解，其人雖不問不信^lb不解是經，我得阿耨多羅三藐三菩提時，隨^lb在何地，以神通力、智慧力引之，令得住是法^lb中。』
文殊師利！是菩薩摩訶薩，於如來滅後、有^pb22成就此第四法者，說是法時，無有過失，常為比丘、^lb比丘尼、優婆塞、優婆夷、國王、王子、大臣、^lb人民、婆羅門、居士等，供養恭敬、尊重讚歎。虛^lb空諸天，為聽法故亦常隨侍。若在聚落、城邑、^lb空閑林中，有人來欲難問者，諸天晝夜常為^lb法故而衛護之，能令聽者皆得歡喜。
所以者^pb23何？此經是一切過去、未來、現在諸佛神力所^lb護故。
文殊師利！是法華經，於無量國中，乃至^lb名字不可得聞，何況得見受持讀誦？」
^cb#38c22「文殊師^lb利！譬如強力轉輪聖王，欲以威勢降伏諸國，^lb而諸小王不順其命，時轉輪王起種種兵而^lb往討罰。
王見兵眾戰有功者，即大歡喜，隨功^pb24賞賜，或與田宅、聚落、城邑；或與衣服、嚴身之^lb具；或與種種珍寶：金、銀、琉璃、車璩、馬腦、珊瑚、^lb琥珀，象馬車乘，奴婢人民。唯髻中明珠，不以^lb與之。
所以者何？獨王頂上有此一珠，若以與^lb之，王諸眷屬必大驚怪。
^cb#39a01「文殊師利！如來亦復^lb如是，以禪定智慧力得法國土，王於三界，而^pb25諸魔王不肯順伏。
如來賢聖諸將與之共戰，^lb其有功者，心亦歡喜，於四眾中為說諸經，令^lb其心悅，賜以禪定、解脫、無漏根力、諸法之財，^lb又復賜與涅槃之城，言得滅度，引導其心，令^lb皆歡喜，而不為說是法華經。
^cb#39a07「文殊師利！如轉^lb輪王，見諸兵眾有大功者，心甚歡喜，以此難^pb26信之珠，久在髻中不妄與人，而今與之。
如來^lb亦復如是，於三界中為大法王，以法教化一^lb切眾生。
見賢聖軍，與五陰魔、煩惱魔、死魔共^lb戰，有大功勳，滅三毒，出三界，破魔網，爾時如^lb來亦大歡喜。
此法華經，能令眾生至一切智，^lb一切世間多怨難信，先所未說而今說之。
文^pb27殊師利！此法華經，是諸如來第一之說，於諸^lb說中最為甚深，末後賜與，如彼強力之王久^lb護明珠，今乃與之。
文殊師利！此法華經，諸佛^lb如來祕密之藏，於諸經中最在其上，長夜守^lb護不妄宣說，始於今日乃與汝等而敷演之。」
^lb^cb#39a20爾時世尊欲重宣此義，而說偈言：
^pb28^gatha「常行忍辱，　　哀愍一切，　　乃能演說，
　佛所讚經。　　^lb後末世時，　　持此經者，
　於家出家，　　及非菩薩，　　^lb應生慈悲，
　斯等不聞，　　不信是經，　　則為大失。
　^lb我得佛道，　　以諸方便，　　為說此法，
　令住其中。　　^lb譬如強力，　　轉輪之王，
　兵戰有功，　　賞賜諸物，　　^lb象馬車乘，
　嚴身之具，　　及諸田宅，　　聚落城邑，
　^pb29或與衣服，　　種種珍寶，　　奴婢財物，
　歡喜賜與。　　^lb如有勇健，　　能為難事，
　王解髻中，　　明珠賜之。　　^lb如來亦爾，
　為諸法王，　　忍辱大力，　　智慧寶藏，
　^lb以大慈悲，　　如法化世。　　見一切人、
　受諸苦惱，　　^lb欲求解脫，　　與諸魔戰。
　為是眾生，　　說種種法，　　^lb以大方便，
　說此諸經。　　既知眾生，　　得其力已，
　^pb30末後乃為，　　說是法華。　　如王解髻，
　明珠與之。　　^lb此經為尊，　　眾經中上，
　我常守護，　　不妄開示，　　^lb今正是時，
　為汝等說。　　我滅度後，　　求佛道者，
　^lb欲得安隱，　　演說斯經，　　應當親近，
　如是四法。　　^lb讀是經者，　　常無憂惱，
　又無病痛，　　顏色鮮白，　　^lb不生貧窮、
　卑賤醜陋。　　眾生樂見，　　如慕賢聖，
　^pb31天諸童子，　　以為給使。　　刀杖不加，
　毒不能害，　　^lb若人惡罵，　　口則閉塞。
　遊行無畏，　　如師子王，　　^lb智慧光明，
　如日之照。　　若於夢中，　　但見妙事。
　^lb見諸如來，　　坐師子座，　　諸比丘眾、
　圍繞說法。　　^lb又見龍神、　　阿修羅等，
　數如恒沙，　　恭敬合掌，　　^lb自見其身，
　而為說法。　　又見諸佛，　　身相金色，
　^pb32放無量光，　　照於一切，　　以梵音聲，
　演說諸法。　　^lb佛為四眾，　　說無上法，
　見身處中，　　合掌讚佛，　　^lb聞法歡喜，
　而為供養，　　得陀羅尼，　　證不退智。
　^lb佛知其心，　　深入佛道，　　即為授記，
　成最正覺：　　^lb『汝善男子！　　當於來世，
　得無量智，　　佛之大道。　　^lb國土嚴淨，
　廣大無比。』　　亦有四眾，　　合掌聽法。
　^pb33又見自身，　　在山林中，　　修習善法，
　證諸實相，　　^lb深入禪定，　　見十方佛。
　^lb^gatha諸佛身金色，　　百福相莊嚴，
　聞法為人說，　　^lb常有是好夢。
　又夢作國王，　　捨宮殿眷屬，
　^lb及上妙五欲，　　行詣於道場。
　在菩提樹下，　　^lb而處師子座，
　求道過七日，　　得諸佛之智。
　^pb34成無上道已，　　起而轉法輪，
　為四眾說法，　　^lb經千萬億劫，
　說無漏妙法，　　度無量眾生。
　^lb後當入涅槃，　　如烟盡燈滅。
　若後惡世中，　　^lb說是第一法，
　是人得大利，　　如上諸功德。」
^lb^ck15〔從地踊出品第十五〕
^lb^cb#39c19爾時他方國土諸來菩薩摩訶薩，過八恒河^pb35沙數，於大眾中起立，合掌作禮而白佛言：「世尊！^lb若聽我等，於佛滅後，在此娑婆世界，懃加精^lb進，護持、讀誦、書寫、供養是經典者，當於此土^lb而廣說之。」
^cb#39c23爾時佛告諸菩薩摩訶薩眾：「止，善^lb男子！不須汝等護持此經。
所以者何？我娑婆^lb世界自有六萬恒河沙等菩薩摩訶薩，一一^pb36菩薩各有六萬恒河沙眷屬，是諸人等，能於^lb我滅後，護持、讀誦、廣說此經。」
^cb#39c28佛說是時，娑婆^lb世界三千大千國土地皆震裂，而於其中，有^lb無量千萬億菩薩摩訶薩同時踊出。
是諸菩^lb薩，身皆金色，三十二相，無量光明，先盡在此^lb娑婆世界之下、此界虛空中住。
是諸菩薩，聞^pb37釋迦牟尼佛所說音聲，從下發來。
一一菩薩^lb皆是大眾唱導之首，各將六萬恒河沙眷屬；
^lb況將五萬、四萬、三萬、二萬、一萬恒河沙等眷^lb屬者；
況復乃至一恒河沙、半恒河沙、四分之^lb一、乃至千萬億那由他分之一；
況復千萬億^lb那由他眷屬；
況復億萬眷屬；
況復千萬、百萬、^pb38乃至一萬；
況復一千、一百、乃至一十；
況復將^lb五、四、三、二、一弟子者；況復單己，樂遠離行。
如^lb是等比，無量無邊，算數譬喻所不能知。
^cb#40a12是諸^lb菩薩從地出已，各詣虛空七寶妙塔多寶如^lb來、釋迦牟尼佛所。
到已，向二世尊頭面禮足，^lb及至諸寶樹下師子座上佛所，亦皆作禮，右^pb39繞三匝，合掌恭敬，以諸菩薩種種讚法而以^lb讚歎，住在一面，欣樂瞻仰於二世尊。
是諸菩^lb薩摩訶薩，從初踊出，以諸菩薩種種讚法而^lb讚於佛，如是時間，經五十小劫。
是時釋迦牟^lb尼佛默然而坐，及諸四眾亦皆默然五十小^lb劫；佛神力故，令諸大眾謂如半日。
^cb#40a21爾時四眾，^pb40亦以佛神力故，見諸菩薩遍滿無量百千萬^lb億國土虛空。
是菩薩眾中有四導師：一名上^lb行，二名無邊行，三名淨行，四名安立行。
是四^lb菩薩，於其眾中最為上首唱導之師，在大眾^lb前，各共合掌，觀釋迦牟尼佛而問訊言：「世尊！^lb少病、少惱，安樂行不？所應度者，受教易不？不^pb41令世尊生疲勞耶？」
^cb#40a28爾時四大菩薩而說偈言：
^lb^gatha「世尊安樂，　　少病少惱，　　教化眾生，
　得無疲惓。　　^lb又諸眾生，　　受化易不？
　不令世尊，　　生疲勞耶？」
^lb^cb#40b04爾時世尊，於菩薩大眾中而作是言：「如是，如^lb是！諸善男子！如來安樂，少病、少惱；諸眾生等，^lb易可化度，無有疲勞。
所以者何？是諸眾生，世^pb42世已來常受我化，亦於過去諸佛供養尊重，^lb種諸善根。
此諸眾生，始見我身，聞我所說，即^lb皆信受入如來慧；除先修習學小乘者。
如是^lb之人，我今亦令得聞是經，入於佛慧。」
^cb#40b11爾時諸^lb大菩薩而說偈言：
^lb^gatha「善哉善哉！　　大雄世尊！　　諸眾生等，
　易可化度。　　^pb43能問諸佛，　　甚深智慧，
　聞已信行，　　我等隨喜。」
^lb^cb#40b15於時世尊讚歎上首諸大菩薩：「善哉，善哉！善^lb男子！汝等能於如來發隨喜心。」
^cb#40b16爾時彌勒菩^lb薩及八千恒河沙諸菩薩眾，皆作是念：「我等^lb從昔已來，不見不聞如是大菩薩摩訶薩眾，^lb從地踊出，住世尊前，合掌、供養，問訊如來。」
^cb#40b20時^pb44彌勒菩薩摩訶薩，知八千恒河沙諸菩薩等^lb心之所念，并欲自決所疑，合掌向佛，以偈問^lb曰：
^lb^gatha「無量千萬億，　　大眾諸菩薩，
　昔所未曾見，　　^lb願兩足尊說，
　是從何所來，　　以何因緣集？
　^lb巨身大神通，　　智慧叵思議，
　其志念堅固，　　^pb45有大忍辱力，
　眾生所樂見，　　為從何所來？
　^lb一一諸菩薩，　　所將諸眷屬，
　其數無有量，　　^lb如恒河沙等。
　或有大菩薩，　　將六萬恒沙，
　^lb如是諸大眾，　　一心求佛道。
　是諸大師等，　　^lb六萬恒河沙，
　俱來供養佛，　　及護持是經。
　^lb將五萬恒沙，　　其數過於是。
　四萬及三萬、　　^pb46二萬至一萬，
　一千一百等，　　乃至一恒沙、
　^lb半及三四分，　　億萬分之一，
　千萬那由他，　　^lb萬億諸弟子，
　乃至於半億，　　其數復過上。
　^lb百萬至一萬，　　一千及一百，
　五十與一十，　　^lb乃至三二一，
　單己無眷屬，　　樂於獨處者，
　^lb俱來至佛所，　　其數轉過上。
　如是諸大眾，　　^pb47若人行籌數，
　過於恒沙劫，　　猶不能盡知。
　^lb是諸大威德，　　精進菩薩眾，
　誰為其說法，　　^lb教化而成就？
　從誰初發心？　　稱揚何佛法？
　^lb受持行誰經？　　修習何佛道？
　如是諸菩薩，　　^lb神通大智力，
　四方地震裂，　　皆從中踊出。
　^lb世尊我昔來，　　未曾見是事，
　願說其所從，　　^pb48國土之名號。
　我常遊諸國，　　未曾見是眾，
　^lb我於此眾中，　　乃不識一人，
　忽然從地出，　　^lb願說其因緣。
　今此之大會，　　無量百千億，
　^lb是諸菩薩等，　　皆欲知此事。
　是諸菩薩眾，　　^lb本末之因緣，
　無量德世尊，　　唯願決眾疑。」
^lb^cb#41a04爾時釋迦牟尼分身諸佛，從無量千萬億他^pb49方國土來者，在於八方諸寶樹下，師子座上，^lb結跏趺坐。
其佛侍者，各各見是菩薩大眾，於^lb三千大千世界四方，從地踊出，住於虛空。
各^lb白其佛言：「世尊！此諸無量無邊阿僧祇菩薩^lb大眾，從何所來？」
^cb#41a09爾時諸佛各告侍者：「諸善男^lb子！且待須臾，有菩薩摩訶薩，名曰彌勒——釋迦^pb50牟尼佛之所授記，次後作佛——以問斯事，佛今答^lb之，汝等自當因是得聞。」
^cb#41a14爾時釋迦牟尼佛^lb告彌勒菩薩：「善哉，善哉！阿逸多！乃能問佛如^lb是大事。
汝等當共一心，被精進鎧，發堅固意，^lb如來今欲顯發宣示諸佛智慧、諸佛自在神^lb通之力、諸佛師子奮迅之力、諸佛威猛大勢^pb51之力。」
^cb#41a18爾時世尊欲重宣此義，而說偈言：
^lb^gatha「當精進一心，　　我欲說此事，
　勿得有疑悔，　　^lb佛智叵思議。
　汝今出信力，　　住於忍善中，
　^lb昔所未聞法，　　今皆當得聞。
　我今安慰汝，　　^lb勿得懷疑懼，
　佛無不實語，　　智慧不可量。
　^lb所得第一法，　　甚深叵分別，
　如是今當說，　　^pb52汝等一心聽。」
^lb^cb#41a28爾時世尊說此偈已，告彌勒菩薩：「我今於此^lb大眾，宣告汝等。
阿逸多！是諸大菩薩摩訶薩，^lb無量無數阿僧祇，從地踊出，汝等昔所未見^lb者，我於是娑婆世界得阿耨多羅三藐三菩^lb提已，教化示導是諸菩薩，調伏其心，令發道^pb53意。
此諸菩薩，皆於是娑婆世界之下、此界虛^lb空中住；於諸經典，讀誦通利，思惟分別，正憶^lb念。
阿逸多！是諸善男子等，不樂在眾多有所^lb說；常樂靜處，懃行精進未曾休息；亦不依止^lb人天而住。
常樂深智，無有障礙，亦常樂於諸^lb佛之法，一心精進，求無上慧。」
^cb#41b10爾時世尊欲重^pb54宣此義，而說偈言：
^lb^gatha「阿逸汝當知！　　是諸大菩薩，
　從無數劫來，　　^lb修習佛智慧，
　悉是我所化，　　令發大道心。
　^lb此等是我子，　　依止是世界，
　常行頭陀事，　　^lb志樂於靜處，
　捨大眾憒閙，　　不樂多所說。
　^lb如是諸子等，　　學習我道法，
　晝夜常精進，　　^pb55為求佛道故，
　在娑婆世界，　　下方空中住。
　^lb志念力堅固，　　常懃求智慧，
　說種種妙法，　　^lb其心無所畏。
　我於伽耶城，　　菩提樹下坐，
　^lb得成最正覺，　　轉無上法輪。
　爾乃教化之，　　^lb令初發道心，
　今皆住不退，　　悉當得成佛。
　^lb我今說實語，　　汝等一心信，
　我從久遠來，　　^pb56教化是等眾。」
^lb^cb#41b29爾時，彌勒菩薩摩訶薩及無數諸菩薩等，心^lb生疑惑，怪未曾有，而作是念：「云何世尊於少^lb時間、教化如是無量無邊阿僧祇諸大菩薩，^lb令住阿耨多羅三藐三菩提？」即白佛言：「世尊！^lb如來為太子時，出於釋宮，去伽耶城不遠，坐^pb57於道場，得成阿耨多羅三藐三菩提。從是已^lb來，始過四十餘年。世尊！云何於此少時，大作^lb佛事，以佛勢力、以佛功德，教化如是無量大^lb菩薩眾，當成阿耨多羅三藐三菩提？
^cb#41c09「世尊！此^lb大菩薩眾，假使有人於千萬億劫數不能盡，^lb不得其邊。
斯等久遠已來，於無量無邊諸佛^pb58所，殖諸善根，成就菩薩道，常修梵行。世尊！如^lb此之事，世所難信。
譬如有人，色美髮黑，年二^lb十五，指百歲人，言：『是我子。』其百歲人，亦指年^lb少，言：『是我父，生育我等。』是事難信。佛亦如是，^lb得道已來，其實未久，而此大眾諸菩薩等，已^lb於無量千萬億劫，為佛道故，懃行精進，善入^pb59出住無量百千萬億三昧，得大神通，久修梵^lb行，善能次第習諸善法，巧於問答，人中之寶，^lb一切世間甚為希有。
今日世尊方云：『得佛道^lb時，初令發心，教化示導，令向阿耨多羅三藐^lb三菩提。』
世尊得佛未久，乃能作此大功德事。^lb我等雖復信佛隨宜所說，佛所出言未曾虛^pb60妄，佛所知者皆悉通達。
然諸新發意菩薩，於^lb佛滅後，若聞是語，或不信受，而起破法罪業^lb因緣。
唯然，世尊！願為解說，除我等疑，及未來^lb世諸善男子聞此事已，亦不生疑。」
^cb#41c28爾時彌勒^lb菩薩欲重宣此義，而說偈言：
^lb^gatha「佛昔從釋種，　　出家近伽耶，
　坐於菩提樹，　　^pb61爾來尚未久。
　此諸佛子等，　　其數不可量，
　^lb久已行佛道，　　住於神通力，
　善學菩薩道，　　^lb不染世間法，
　如蓮華在水，　　從地而踊出。
　^lb皆起恭敬心，　　住於世尊前。
　是事難思議，　　^lb云何而可信？
　佛得道甚近，　　所成就甚多，
　^lb願為除眾疑，　　如實分別說。
　譬如少壯人，　　^pb62年始二十五，
　示人百歲子，　　髮白而面皺，
　^lb是等我所生；　　子亦說是父。
　父少而子老，　　^lb舉世所不信。
　世尊亦如是，　　得道來甚近。
　^lb是諸菩薩等，　　志固無怯弱，
　從無量劫來，　　^lb而行菩薩道，
　巧於難問答，　　其心無所畏，
　^lb忍辱心決定，　　端正有威德，
　十方佛所讚。　　^pb63善能分別說，
　不樂在人眾，　　常好在禪定，
　^lb為求佛道故，　　於下空中住。
　我等從佛聞，　　^lb於此事無疑，
　願佛為未來，　　演說令開解。
　^lb若有於此經，　　生疑不信者，
　即當墮惡道。　　^lb願今為解說，
　是無量菩薩，　　云何於少時，
　^lb教化令發心，　　而住不退地？」
^pb64^ck16〔如來壽量品第十六〕
^lb^cb#42b01爾時，佛告諸菩薩及一切大眾：「諸善男子！汝^lb等當信解如來誠諦之語。」復告大眾：「汝等當^lb信解如來誠諦之語。」又復告諸大眾：「汝等當^lb信解如來誠諦之語。」
^cb#42b04是時菩薩大眾，彌勒為^lb首，合掌白佛言：「世尊！唯願說之，我等當信受^pb65佛語。」如是三白已，復言：「唯願說之，我等當信^lb受佛語。」
^cb#42b07爾時世尊知諸菩薩三請不止，而告^lb之言：「汝等諦聽，如來祕密神通之力。
一切世^lb間天、人及阿修羅，皆謂：『今釋迦牟尼佛，出釋^lb氏宮，去伽耶城不遠，坐於道場，得阿耨多羅^lb三藐三菩提。』
然，善男子！我實成佛已來無量^pb66無邊百千萬億那由他劫。
譬如五百千萬億^lb那由他阿僧祇三千大千世界，假使有人末^lb為微塵，過於東方五百千萬億那由他阿僧^lb祇國乃下一塵，如是東行，盡是微塵。
諸善男^lb子！於意云何？是諸世界，可得思惟校計知其^lb數不？」
^cb#42b18彌勒菩薩等俱白佛言：「世尊！是諸世界，^pb67無量無邊，非算數所知，亦非心力所及；一切^lb聲聞、辟支佛，以無漏智，不能思惟知其限數；^lb我等住阿惟越致地，於是事中亦所不達。世^lb尊！如是諸世界，無量無邊。」
^cb#42b22爾時佛告大菩薩^lb眾：「諸善男子！今當分明宣語汝等。
是諸世界，^lb若著微塵及不著者盡以為塵，一塵一劫，我^pb68成佛已來，復過於此百千萬億那由他阿僧^lb祇劫。
自從是來，我常在此娑婆世界說法教^lb化，亦於餘處百千萬億那由他阿僧祇國導^lb利眾生。
^cb#42b28「諸善男子！於是中間，我說燃燈佛等，^lb又復言其入於涅槃，如是皆以方便分別。
^cb#42c01「諸^lb善男子！若有眾生來至我所，我以佛眼，觀其^pb69信等諸根利鈍，隨所應度，處處自說，名字不^lb同、年紀大小，亦復現言當入涅槃，又以種種^lb方便說微妙法，能令眾生發歡喜心。
^cb#42c05「諸善男^lb子！如來見諸眾生樂於小法、德薄垢重者，為^lb是人說：『我少出家，得阿耨多羅三藐三菩提。』^lb然我實成佛已來久遠若斯，但以方便，教化^pb70眾生，令入佛道，作如是說。
^cb#42c09「諸善男子！如來所^lb演經典，皆為度脫眾生，或說己身、或說他身，^lb或示己身、或示他身，或示己事、或示他事，諸^lb所言說，皆實不虛。
所以者何？如來如實知見^lb三界之相，無有生死、若退若出，亦無在世及^lb滅度者，非實非虛，非如非異，不如^pb71三界見於三界，如斯之事，如來明見，無有錯謬。
以諸眾^lb生有種種性、種種欲、種種行、種種憶想分別^lb故，欲令生諸善根，以若干因緣、譬喻、言辭種^lb種說法，所作佛事，未曾暫廢。
如是，我成佛已^lb來，甚大久遠，壽命無量阿僧祇劫，常住不滅。
^lb^cb#42c22「諸善男子！我本行菩薩道所成壽命，今猶未^pb72盡，復倍上數。
然今非實滅度，而便唱言：『當取^lb滅度。』如來以是方便，教化眾生。
所以者何？若^lb佛久住於世，薄德之人，不種善根，貧窮下賤，^lb貪著五欲，入於憶想妄見網中。
若見如來常^lb在不滅，便起憍恣而懷厭怠，不能生難遭之^lb想、恭敬之心。
是故如來以方便說：『比丘當知！^pb73諸佛出世，難可值遇。』所以者何？諸薄德人，過^lb無量百千萬億劫，或有見佛，或不見者，以此^lb事故，我作是言：『諸比丘！如來難可得見。』斯眾^lb生等聞如是語，必當生於難遭之想，心懷戀^lb慕，渴仰於佛，便種善根。是故如來雖不實滅，^lb而言滅度。
^cb#43a07「又，善男子！諸佛如來，法皆如是，為^pb74度眾生，皆實不虛。
譬如良醫，智慧聰達，明練^lb方藥，善治眾病。其人多諸子息——若十、二十乃^lb至百數，以有事緣，遠至餘國。
諸子於後，飲他^lb毒藥，藥發悶亂，宛轉于地。是時其父還來歸^lb家，諸子飲毒，或失本心、或不失者，遙見其父，^lb皆大歡喜，拜跪問訊：『善安隱歸。
我等愚癡，誤^pb75服毒藥，願見救療，更賜壽命。』
父見子等苦惱^lb如是，依諸經方，求好藥草，色香美味皆悉具^lb足，擣篩和合與子令服，而作是言：『此大良藥，^lb色香美味皆悉具足，汝等可服，速除苦惱，無^lb復眾患。』其諸子中不失心者，見此良藥、色香^lb俱好，即便服之，病盡除愈。
餘失心者，見其父^pb76來，雖亦歡喜問訊，求索治病，然與其藥而不^lb肯服。
所以者何？毒氣深入，失本心故，於此好^lb色香藥而謂不美。
父作是念：『此子可愍，為毒^lb所中，心皆顛倒。
雖見我喜，求索救療；如是好^lb藥而不肯服。我今當設方便，令服此藥。』
即作^lb是言：『汝等當知！我今衰老，死時已至，是好良^pb77藥，今留在此，汝可取服，勿憂不差。』作是教已，^lb復至他國，遣使還告：『汝父已死。』
是時諸子聞^lb父背喪，心大憂惱而作是念：『若父在者，慈愍^lb我等，能見救護，今者捨我遠喪他國。』自惟孤^lb露，無復恃怙，常懷悲感，心遂醒悟，乃知此藥^lb色味香美，即取服之，毒病皆愈。
其父聞子悉^pb78已得差，尋便來歸，咸使見之。
^cb#43b06「諸善男子！於意^lb云何？頗有人能說此良醫虛妄罪不？」
^cb#43b07「不也，世^lb尊！」
佛言：「我亦如是，成佛已來、無量無邊百千^lb萬億那由他阿僧祇劫，為眾生故，以方便力、^lb言當滅度，亦無有能如法說我虛妄過者。」
^cb#43b10爾^lb時世尊欲重宣此義，而說偈言：
^pb79^gatha「自我得佛來，　　所經諸劫數，
　無量百千萬，　　^lb億載阿僧祇，
　常說法教化，　　無數億眾生，
　^lb令入於佛道。　　爾來無量劫，
　為度眾生故，　　^lb方便現涅槃，
　而實不滅度，　　常住此說法。
　^lb我常住於此，　　以諸神通力，
　令顛倒眾生，　　^lb雖近而不見。
　眾見我滅度，　　廣供養舍利，
　^pb80咸皆懷戀慕，　　而生渴仰心。
　眾生既信伏，　　^lb質直意柔軟，
　一心欲見佛，　　不自惜身命。
　^lb時我及眾僧，　　俱出靈鷲山，
　我時語眾生：　　^lb『常在此不滅，
　以方便力故，　　現有滅不滅。』
　^lb餘國有眾生，　　恭敬信樂者，
　我復於彼中，　　^lb為說無上法。
　汝等不聞此，　　但謂我滅度。
　^pb81我見諸眾生，　　沒在於苦惱，
　故不為現身，　　^lb令其生渴仰，
　因其心戀慕，　　乃出為說法。
　^lb神通力如是，　　於阿僧祇劫，
　常在靈鷲山，　　^lb及餘諸住處。
　眾生見劫盡，　　大火所燒時，
　^lb我此土安隱，　　天人常充滿。
　園林諸堂閣，　　^lb種種寶莊嚴，
　寶樹多花菓，　　眾生所遊樂。
　^pb82諸天擊天鼓，　　常作眾伎樂，
　雨曼陀羅花，　　^lb散佛及大眾。
　我淨土不毀，　　而眾見燒盡，
　^lb憂怖諸苦惱，　　如是悉充滿。
　是諸罪眾生，　　^lb以惡業因緣，
　過阿僧祇劫，　　不聞三寶名。
　^lb諸有修功德，　　柔和質直者，
　則皆見我身，　　^lb在此而說法。
　或時為此眾，　　說佛壽無量，
　^pb83久乃見佛者，　　為說佛難值。
　我智力如是，　　^lb慧光照無量，
　壽命無數劫，　　久修業所得。
　^lb汝等有智者，　　勿於此生疑，
　當斷令永盡，　　^lb佛語實不虛。
　如醫善方便，　　為治狂子故，
　^lb實在而言死，　　無能說虛妄。
　我亦為世父，　　^lb救諸苦患者，
　為凡夫顛倒，　　實在而言滅。
　^pb84以常見我故，　　而生憍恣心，
　放逸著五欲，　　^lb墮於惡道中。
　我常知眾生，　　行道不行道，
　^lb隨所應可度，　　為說種種法。
　每自作是意，　　^lb以何令眾生，
　得入無上慧，　　速成就佛身。」
^lb^ck17〔別功德品第十七〕
^lb^cb#44a06爾時大會，聞佛說壽命劫數長遠如是，無量^pb85無邊阿僧祇眾生得大饒益。
於時世尊告彌^lb勒菩薩摩訶薩：「阿逸多！我說是如來壽命長^lb遠時，六百八十萬億那由他恒河沙眾生，得^lb無生法忍；
復有千倍菩薩摩訶薩，得聞持陀^lb羅尼門；
復有一世界微塵數菩薩摩訶薩，得^lb樂說無礙辯才；
復有一世界微塵數菩薩摩^pb86訶薩，得百千萬億無量旋陀羅尼；
復有三千^lb大千世界微塵數菩薩摩訶薩，能轉不退法^lb輪；
復有二千中國土微塵數菩薩摩訶薩，能^lb轉清淨法輪；
復有小千國土微塵數菩薩摩^lb訶薩，八生當得阿耨多羅三藐三菩提；
復有^lb四四天下微塵數菩薩摩訶薩，四生當得阿^pb87耨多羅三藐三菩提；
復有三四天下微塵數^lb菩薩摩訶薩，三生當得阿耨多羅三藐三菩^lb提；
復有二四天下微塵數菩薩摩訶薩，二生^lb當得阿耨多羅三藐三菩提；
復有一四天下^lb微塵數菩薩摩訶薩，一生當得阿耨多羅三^lb藐三菩提；
復有八世界微塵數眾生，皆發阿^pb88耨多羅三藐三菩提心。」
^cb#44a25佛說是諸菩薩摩訶^lb薩得大法利時，於虛空中，雨曼陀羅華、摩訶^lb曼陀羅華，以散無量百千萬億眾寶樹下、師子^lb座上諸佛，并散七寶塔中師子座上釋迦牟^lb尼佛及久滅度多寶如來，亦散一切諸大菩^lb薩及四部眾。
又雨細末栴檀、沈水香等。於虛^pb89空中，天鼓自鳴，妙聲深遠。又雨千種天衣，垂^lb諸瓔珞、真珠瓔珞、摩尼珠瓔珞、如意珠瓔珞，^lb遍於九方。
眾寶香爐燒無價香，自然周至，供^lb養大會。
一一佛上，有諸菩薩，執持幡蓋，次第^lb而上，至于梵天。
是諸菩薩，以妙音聲，歌無量^lb頌，讚歎諸佛。
^cb#44b08爾時彌勒菩薩從座而起，偏袒^pb90右肩，合掌向佛，而說偈言：
^lb^gatha「佛說希有法，　　昔所未曾聞，
　世尊有大力，　　^lb壽命不可量。
　無數諸佛子，　　聞世尊分別，
　^lb說得法利者，　　歡喜充遍身。
　或住不退地，　　^lb或得陀羅尼，
　或無礙樂說，　　萬億旋總持。
　^lb或有大千界，　　微塵數菩薩，
　各各皆能轉，　　^pb91不退之法輪。
　復有中千界，　　微塵數菩薩，
　^lb各各皆能轉，　　清淨之法輪。
　復有小千界，　　^lb微塵數菩薩，
　餘各八生在，　　當得成佛道。
　^lb復有四三二，　　如此四天下，
　微塵諸菩薩，　　^lb隨數生成佛。
　或一四天下，　　微塵數菩薩，
　^lb餘有一生在，　　當成一切智。
　如是等眾生，　　^pb92聞佛壽長遠，
　得無量無漏，　　清淨之果報。
　^lb復有八世界，　　微塵數眾生，
　聞佛說壽命，　　^lb皆發無上心。
　世尊說無量，　　不可思議法，
　^lb多有所饒益，　　如虛空無邊。
　雨天曼陀羅、　　^lb摩訶曼陀羅，
　釋梵如恒沙，　　無數佛土來。
　^lb雨栴檀沈水，　　繽紛而亂墜，
　如鳥飛空下，　　^pb93供散於諸佛。
　天鼓虛空中，　　自然出妙聲，
　^lb天衣千萬種，　　旋轉而來下。
　眾寶妙香爐，　　^lb燒無價之香，
　自然悉周遍、　　供養諸世尊。
　^lb其大菩薩眾，　　執七寶幡蓋，
　高妙萬億種，　　^lb次第至梵天。
　一一諸佛前，　　寶幢懸勝幡，
　^lb亦以千萬偈、　　歌詠諸如來。
　如是種種事，　　^pb94昔所未曾有，
　聞佛壽無量，　　一切皆歡喜。
　^lb佛名聞十方，　　廣饒益眾生，
　一切具善根，　　^lb以助無上心。」
^lb^cb#44c19爾時佛告彌勒菩薩摩訶薩：「阿逸多！其有眾^lb生，聞佛壽命長遠如是，乃至能生一念信解，^lb所得功德，無有限量。
若有善男子、善女人，為^pb95阿耨多羅三藐三菩提故，於八十萬億那由^lb他劫，行五波羅蜜——檀波羅蜜、尸羅波羅蜜、羼^lb提波羅蜜、毘梨耶波羅蜜、禪波羅蜜——除般若^lb波羅蜜，以是功德比前功德，百分、千分、百千^lb萬億分、不及其一，乃至算數譬喻所不能知。
^lb若善男子、善女人，有如是功德，於阿耨多羅^pb96三藐三菩提退者，無有是處。」
^cb#44c29爾時世尊欲重^lb宣此義，而說偈言：
^lb^gatha「若人求佛慧，　　於八十萬億，
　那由他劫數，　　^lb行五波羅蜜。
　於是諸劫中，　　布施供養佛，
　^lb及緣覺弟子，　　并諸菩薩眾。
　珍異之飲食、　　^lb上服與臥具，
　栴檀立精舍，　　以園林莊嚴。
　^pb97如是等布施，　　種種皆微妙，
　盡此諸劫數，　　^lb以迴向佛道。
　若復持禁戒，　　清淨無缺漏，
　^lb求於無上道，　　諸佛之所歎。
　若復行忍辱，　　^lb住於調柔地，
　設眾惡來加，　　其心不傾動。
　^lb諸有得法者，　　懷於增上慢，
　為此所輕惱，　　^lb如是亦能忍。
　若復懃精進，　　志念常堅固，
　^pb98於無量億劫，　　一心不懈息。
　又於無數劫，　　^lb住於空閑處，
　若坐若經行，　　除睡常攝心。
　^lb以是因緣故，　　能生諸禪定，
　八十億萬劫、　　^lb安住心不亂。
　持此一心福，　　願求無上道，
　^lb我得一切智，　　盡諸禪定際。
　是人於百千，　　^lb萬億劫數中，
　行此諸功德，　　如上之所說。
　^pb99有善男女等，　　聞我說壽命，
　乃至一念信，　　^lb其福過於彼。
　若人悉無有，　　一切諸疑悔，
　^lb深心須臾信，　　其福為如此。
　其有諸菩薩，　　^lb無量劫行道，
　聞我說壽命，　　是則能信受。
　^lb如是諸人等，　　頂受此經典，
　願我於未來，　　^lb長壽度眾生。
　如今日世尊、　　諸釋中之王，
　^pb100道場師子吼，　　說法無所畏。
　我等未來世，　　^lb一切所尊敬，
　坐於道場時，　　說壽亦如是。
　^lb若有深心者，　　清淨而質直，
　多聞能總持，　　^lb隨義解佛語，
　如是諸人等，　　於此無有疑。
^lb^cb#45b11「又，阿逸多！若有聞佛壽命長遠，解其言趣，是^lb人所得功德無有限量，能起如來無上之慧。
^pb101何況廣聞是經、若教人聞，若自持、若教人持，^lb若自書、若教人書，若以華、香、瓔珞、幢幡、繒蓋、^lb香油、酥燈，供養經卷，是人功德無量無邊，能^lb生一切種智。
^cb#45b16「阿逸多！若善男子、善女人，聞我^lb說壽命長遠，深心信解，則為見佛常在耆闍^lb崛山，共大菩薩、諸聲聞眾圍繞說法。
又見此^pb102娑婆世界，其地琉璃，坦然平正，閻浮檀金以^lb界八道，寶樹行列，諸臺樓觀皆悉寶成，其菩^lb薩眾咸處其中。
若有能如是觀者，當知是為^lb深信解相。
^cb#45b22「又復如來滅後，若聞是經而不毀^lb訾，起隨喜心，當知已為深信解相，何況讀誦、^lb受持之者，斯人則為頂戴如來。
^cb#45b25「阿逸多！是善^pb103男子、善女人，不須為我復起塔寺，及作僧坊、^lb以四事供養眾僧。
所以者何？是善男子、善女^lb人，受持讀誦是經典者，為已起塔、造立僧坊、^lb供養眾僧。
則為以佛舍利起七寶塔，高廣漸^lb小至于梵天，懸諸幡蓋及眾寶鈴，華、香、瓔珞，^lb末香、塗香、燒香，眾鼓、伎樂，簫、笛、箜篌，種種舞^pb104戲，以妙音聲歌唄讚頌，則為於無量千萬億^lb劫作是供養已。
^cb#45c05「阿逸多！若我滅後，聞是經典，^lb有能受持，若自書、若教人書，則為起立僧坊，^lb以赤栴檀作諸殿堂三十有二，高八多羅樹，^lb高廣嚴好，百千比丘於其中止，園林、浴池、經^lb行、禪窟，衣服、飲食、床褥、湯藥，一切樂具充滿^pb105其中。
如是僧坊、堂閣，若干百千萬億，其數無^lb量，以此現前供養於我及比丘僧。
是故我說：^lb『如來滅後，若有受持、讀誦、為他人說，若自書、^lb若教人書，供養經卷，不須復起塔寺，及造僧^lb坊、供養眾僧。』況復有人能持是經，兼行布施、^lb持戒、忍辱、精進、一心、智慧，其德最勝，無量無^pb106邊。
譬如虛空，東西南北、四維上下無量無邊；
^lb是人功德，亦復如是無量無邊，疾至一切種^lb智。
若人讀誦受持是經，為他人說，若自書、若^lb教人書，復能起塔，及造僧坊、供養讚歎聲聞^lb眾僧，亦以百千萬億讚歎之法讚歎菩薩功^lb德，又為他人，種種因緣隨義解說此法華經，^pb107復能清淨持戒，與柔和者而共同止，忍辱無^lb瞋，志念堅固，常貴坐禪得諸深定，精進勇猛^lb攝諸善法，利根智慧善答問難。
^cb#45c26「阿逸多！若我^lb滅後，諸善男子、善女人，受持讀誦是經典者，^lb復有如是諸善功德，當知是人已趣道場，近^lb阿耨多羅三藐三菩提，坐道樹下。
^cb#45c29「阿逸多！是^pb108善男子、善女人，若坐、若立、若行處，此中便應^lb起塔，一切天人皆應供養如佛之塔。」
^cb#46a02爾時世^lb尊欲重宣此義，而說偈言：
^lb^gatha「若我滅度後，　　能奉持此經，
　斯人福無量，　　^lb如上之所說，
　是則為具足，　　一切諸供養。
　^lb以舍利起塔，　　七寶而莊嚴，
　表剎甚高廣，　　^pb109漸小至梵天，
　寶鈴千萬億，　　風動出妙音。
　^lb又於無量劫，　　而供養此塔，
　華香諸瓔珞，　　^lb天衣眾伎樂，
　燃香油酥燈，　　周匝常照明。
　^lb惡世法末時，　　能持是經者，
　則為已如上，　　^lb具足諸供養。
　若能持此經，　　則如佛現在，
　^lb以牛頭栴檀，　　起僧坊供養。
　堂有三十二，　　^pb110高八多羅樹，
　上饌妙衣服，　　床臥皆具足，
　^lb百千眾住處，　　園林諸浴池，
　經行及禪窟，　　^lb種種皆嚴好。
　若有信解心，　　受持讀誦書，
　^lb若復教人書，　　及供養經卷，
　散華香末香，　　^lb以須曼瞻蔔、
　阿提目多伽，　　薰油常燃之。
　^lb如是供養者，　　得無量功德，
　如虛空無邊，　　^pb111其福亦如是。
　況復持此經，　　兼布施持戒，
　^lb忍辱樂禪定，　　不瞋不惡口，
　恭敬於塔廟，　　^lb謙下諸比丘，
　遠離自高心，　　常思惟智慧，
　^lb有問難不瞋，　　隨順為解說，
　若能行是行，　　^lb功德不可量。
　若見此法師，　　成就如是德，
　^lb應以天華散，　　天衣覆其身，
　頭面接足禮，　　^pb112生心如佛想。
　又應作是念：　　『不久詣道樹，
　^lb得無漏無為，　　廣利諸人天。』
　其所住止處，　　^lb經行若坐臥，
　乃至說一偈，　　是中應起塔，
　^lb莊嚴令妙好，　　種種以供養。
　佛子住此地，　　^lb則是佛受用，
　常在於其中，　　經行及坐臥。」
^lb妙法蓮華經卷第五^pb113
^pb1^folio#sdpdrk6<lines=6>妙法蓮華經卷第六^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck18〔隨喜功德品第十八〕
^lb^cb#46b22爾時，彌勒菩薩摩訶薩白佛言：「世尊！若有善^lb男子、善女人，聞是法華經隨喜者，得幾所福？」
^lb^cb#46b24而說偈言：
^pb2^gatha「世尊滅度後，　　其有聞是經，
　若能隨喜者，　　^lb為得幾所福？」
^lb^cb#46b27爾時，佛告彌勒菩薩摩訶薩：「阿逸多！如來滅^lb後，若比丘、比丘尼、優婆塞、優婆夷，及餘智者^lb若長若幼，聞是經隨喜已，從法會出，至於餘^lb處，若在僧坊，若空閑地，若城邑、巷陌、聚落、田^pb3里，如其所聞，為父母、宗親、善友、知識，隨力演^lb說。
是諸人等，聞已隨喜，復行轉教；餘人聞已，^lb亦隨喜轉教。如是展轉，至第五十。
^cb#46c04「阿逸多！其^lb第五十善男子、善女人，隨喜功德，我今說之，^lb汝當善聽。
若四百萬億阿僧祇世界，六趣四^lb生眾生——卵生、胎生、濕生、化生，若有形、無形，有^pb4想、無想，非有想、非無想，無足、二足、四足、多足，^lb如是等在眾生數者——有人求福，隨其所欲娛^lb樂之具，皆給與之。
一一眾生，與滿閻浮提金、^lb銀、琉璃、車璩馬腦、珊瑚、虎珀，諸妙珍寶，及象、^lb馬車乘，七寶所成宮殿樓閣等。
是大施主，如^lb是布施滿八十年已，而作是念：『我已施眾生^pb5娛樂之具，隨意所欲，然此眾生，皆已衰老年^lb過八十，髮白面皺，將死不久，我當以佛法而^lb訓導之。』
即集此眾生，宣布法化，示教利喜，一^lb時皆得須陀洹道、斯陀含道、阿那含道、阿羅^lb漢道，盡諸有漏，於深禪定皆得自在，具八解^lb脫。
於汝意云何，是大施主所得功德寧為多^pb6不？」
^cb#46c20彌勒白佛言：「世尊！是人功德甚多，無量無^lb邊。
若是施主，但施眾生一切樂具，功德無量；^lb何況令得阿羅漢果。」
^cb#46c23佛告彌勒：「我今分明語^lb汝，是人以一切樂具，施於四百萬億阿僧祇^lb世界六趣眾生，又令得阿羅漢果，所得功德，^lb不如是第五十人，聞法華經一偈隨喜功德，^pb7百分、千分、百千萬億分、不及其一，乃至算數^lb譬喻所不能知。
^cb#46c28「阿逸多！如是第五十人展轉^lb聞法華經隨喜功德，尚無量無邊阿僧祇，何^lb況最初於會中聞而隨喜者，其福復勝，無量^lb無邊阿僧祇，不可得比。
^cb#47a02「又，阿逸多！若人為是^lb經故，往詣僧坊，若坐、若立須臾聽受，緣是功^pb8德，轉身所生，得好上妙象、馬車乘、珍寶輦輿，^lb及乘天宮。
若復有人於講法處坐，更有人來，^lb勸令坐聽，若分座令坐，是人功德，轉身得帝^lb釋坐處，若梵王坐處，若轉輪聖王所坐之處。
^lb^cb#47a08「阿逸多！若復有人，語餘人言：『有經，名法華，可^lb共往聽。』即受其教，乃至須臾間聞，是人功德，^pb9轉身得與陀羅尼菩薩共生一處，利根智慧，^lb百千萬世終不瘖瘂，口氣不臭，舌常無病，口^lb亦無病，齒不垢黑、不黃、不踈，亦不缺落，不差、^lb不曲，脣不下垂亦不褰縮、不麁澁、不瘡胗，亦^lb不缺壞，亦不喎斜，不厚、不大，亦不黧黑，無諸^lb可惡。
鼻不匾㔸，亦不曲戾，面色不黑，亦不狹^pb10長，亦不窊曲，無有一切不可喜相。
脣舌牙齒^lb悉皆嚴好，鼻修高直，面貌圓滿，眉高而長，額^lb廣平正，人相具足，世世所生，見佛聞法、信受^lb教誨。
^cb#47a20「阿逸多！汝且觀是，勸於一人令往聽法，^lb功德如此，何況一心聽說、讀誦，而於大眾為^lb人分別、如說修行？」
^cb#47a23爾時世尊欲重宣此義，而^pb11說偈言：
^lb^gatha「若人於法會，　　得聞是經典，
　乃至於一偈，　　^lb隨喜為他說，
　如是展轉教，　　至于第五十，
　^lb最後人獲福，　　今當分別之。
　如有大施主，　　^lb供給無量眾，
　具滿八十歲，　　隨意之所欲。
　^lb見彼衰老相，　　髮白而面皺，
　齒踈形枯竭，　　^pb12念其死不久，
　我今應當教，　　令得於道果。
　^lb即為方便說，　　涅槃真實法，
　世皆不牢固，　　^lb如水沫泡焰，
　汝等咸應當，　　疾生厭離心。
　^lb諸人聞是法，　　皆得阿羅漢，
　具足六神通，　　^lb三明八解脫。
　最後第五十，　　聞一偈隨喜，
　^lb是人福勝彼，　　不可為譬喻。
　如是展轉聞，　　^pb13其福尚無量，
　何況於法會，　　初聞隨喜者。
　^lb若有勸一人，　　將引聽法華，
　言此經深妙，　　^lb千萬劫難遇，
　即受教往聽，　　乃至須臾聞，
　^lb斯人之福報，　　今當分別說。
　世世無口患，　　^lb齒不踈黃黑，
　脣不厚褰缺，　　無有可惡相，
　^lb舌不乾黑短，　　鼻高修且直，
　額廣而平正，　　^pb14面目悉端嚴，
　為人所喜見，　　口氣無臭穢，
　^lb優鉢華之香、　　常從其口出。
　若故詣僧坊，　　^lb欲聽法華經，
　須臾聞歡喜，　　今當說其福。
　^lb後生天人中，　　得妙象馬車，
　珍寶之輦輿，　　^lb及乘天宮殿。
　若於講法處，　　勸人坐聽經，
　^lb是福因緣得，　　釋梵轉輪座。
　何況一心聽，　　^pb15解說其義趣，
　如說而修行，　　其福不可量。」
^lb^ck19〔法師功德品第十九〕
^lb^cb#47c03爾時佛告常精進菩薩摩訶薩：「若善男子、善^lb女人，受持是法華經，若讀、若誦、若解說、若書^lb寫，是人當得八百眼功德、千二百耳功德、八^lb百鼻功德、千二百舌功德、八百身功德、千二^pb16百意功德，以是功德、莊嚴六根，皆令清淨。
是^lb善男子、善女人，父母所生清淨肉眼，見於三^lb千大千世界內外所有山林河海，下至阿鼻^lb地獄，上至有頂，亦見其中一切眾生，及業因^lb緣、果報生處，悉見悉知。」
^cb#47c11爾時世尊欲重宣此^lb義，而說偈言：
^pb17^gatha「若於大眾中，　　以無所畏心、
　說是法華經，　　^lb汝聽其功德。
　是人得八百、　　功德殊勝眼，
　^lb以是莊嚴故，　　其目甚清淨。
　父母所生眼，　　^lb悉見三千界，
　內外彌樓山，　　須彌及鐵圍，
　^lb并諸餘山林、　　大海江河水，
　下至阿鼻獄，　　^lb上至有頂處，
　其中諸眾生，　　一切皆悉見。
　^pb18雖未得天眼，　　肉眼力如是。
^lb^cb#47c23「復次，常精進！若善男子、善女人，受持此經，若^lb讀、若誦、若解說、若書寫，得千二百耳功德。
以^lb是清淨耳，聞三千大千世界，下至阿鼻地獄，^lb上至有頂，其中內外種種語言音聲——
象聲、馬^lb聲、牛聲、車聲，啼哭聲、愁歎聲，螺聲、鼓聲、鐘聲、^pb19鈴聲，笑聲、語聲，男聲、女聲、童子聲、童女聲，法^lb聲、非法聲，苦聲、樂聲，凡夫聲、聖人聲，喜聲、不^lb喜聲，天聲、龍聲、夜叉聲、乾闥婆聲、阿修羅聲、^lb迦樓羅聲、緊那羅聲、摩睺羅伽聲，火聲、水聲、^lb風聲，地獄聲、畜生聲、餓鬼聲，比丘聲、比丘尼^lb聲，聲聞聲、辟支佛聲，菩薩聲、佛聲——
以要言之，^pb20三千大千世界中一切內外所有諸聲，雖未^lb得天耳，以父母所生清淨常耳，皆悉聞知，如^lb是分別種種音聲而不壞耳根。」
^cb#48a08爾時世尊欲^lb重宣此義，而說偈言：
^lb^gatha「父母所生耳，　　清淨無濁穢，
　以此常耳聞，　　^lb三千世界聲。
　象馬車牛聲，　　鍾鈴螺鼓聲，
　^pb21琴瑟箜篌聲，　　簫笛之音聲，
　清淨好歌聲，　　^lb聽之而不著，
　無數種人聲，　　聞悉能解了。
　^lb又聞諸天聲，　　微妙之歌音，
　及聞男女聲，　　^lb童子童女聲。
　山川嶮谷中，　　迦陵頻伽聲，
　^lb命命等諸鳥，　　悉聞其音聲。
　地獄眾苦痛，　　^lb種種楚毒聲，
　餓鬼飢渴逼，　　求索飲食聲，
　^pb22諸阿修羅等，　　居在大海邊，
　自共語言時，　　^lb出于大音聲。
　如是說法者，　　安住於此間，
　^lb遙聞是眾聲，　　而不壞耳根。
　十方世界中，　　^lb禽獸鳴相呼，
　其說法之人，　　於此悉聞之。
　^lb其諸梵天上，　　光音及遍淨，
　乃至有頂天，　　^lb言語之音聲，
　法師住於此，　　悉皆得聞之。
　^pb23一切比丘眾，　　及諸比丘尼，
　若讀誦經典，　　^lb若為他人說，
　法師住於此，　　悉皆得聞之。
　^lb復有諸菩薩，　　讀誦於經法，
　若為他人說，　　^lb撰集解其義，
　如是諸音聲，　　悉皆得聞之。
　^lb諸佛大聖尊，　　教化眾生者，
　於諸大會中，　　^lb演說微妙法，
　持此法華者，　　悉皆得聞之。
　^pb24三千大千界，　　內外諸音聲，
　下至阿鼻獄，　　^lb上至有頂天，
　皆聞其音聲，　　而不壞耳根，
　^lb其耳聰利故，　　悉能分別知。
　持是法花者，　　^lb雖未得天耳，
　但用所生耳，　　功德已如是。
^lb^cb#48b16「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦、若解說、若書寫，成就八百鼻功德。
以^pb25是清淨鼻根，聞於三千大千世界上下內外^lb種種諸香——
須曼那華香、闍提華香、末利華香、^lb瞻蔔華香、波羅羅華香，赤蓮華香、青蓮華香、^lb白蓮華香，華樹香、菓樹香，栴檀香、沈水香、多^lb摩羅跋香、多伽羅香，及千萬種和香，若末、若^lb丸、若塗香——
持是經者，於此間住，悉能分別。又^pb26復別知眾生之香——
象香、馬香、牛羊等香，男香、^lb女香、童子香、童女香，及草木叢林香——
若近、若^lb遠、所有諸香，悉皆得聞，分別不錯。
持是經者，^lb雖住於此，亦聞天上諸天之香——波利質多羅、^lb拘鞞陀羅樹香，及曼陀羅華香、摩訶曼陀羅^lb華香、曼殊沙華香、摩訶曼殊沙華香、栴檀、沈^pb27水、種種末香，諸雜華香——如是等天香和合所^lb出之香，無不聞知。
又聞諸天身香——釋提桓因^lb在勝殿上，五欲娛樂嬉戲時香；若在妙法堂^lb上，為忉利諸天說法時香；若於諸園遊戲時^lb香；及餘天等男女身香，皆悉遙聞。
如是展轉^lb乃至梵世，上至有頂諸天身香，亦皆聞之，并^pb28聞諸天所燒之香。
及聲聞香、辟支佛香、菩薩^lb香、諸佛身香，亦皆遙聞，知其所在。
雖聞此香，^lb然於鼻根不壞不錯，若欲分別為他人說，憶^lb念不謬。」
^cb#48c11爾時世尊欲重宣此義，而說偈言：
^lb^gatha「是人鼻清淨，　　於此世界中，
　若香若臭物，　　^lb種種悉聞知。
　須曼那闍提、　　多摩羅栴檀、
　^pb29沈水及桂香，　　種種華菓香，
　及知眾生香，　　^lb男子女人香，
　說法者遠住，　　聞香知所在。
　^lb大勢轉輪王，　　小轉輪及子，
　群臣諸宮人，　　^lb聞香知所在。
　身所著珍寶，　　及地中寶藏，
　^lb轉輪王寶女，　　聞香知所在。
　諸人嚴身具，　　^lb衣服及瓔珞，
　種種所塗香，　　聞香知其身。
　^pb30諸天若行坐，　　遊戲及神變，
　持是法華者，　　^lb聞香悉能知。
　諸樹華菓實，　　及酥油香氣，
　^lb持經者住此，　　悉知其所在。
　諸山深嶮處，　　^lb栴檀樹花敷，
　眾生在中者，　　聞香皆能知。
　^lb鐵圍山大海，　　地中諸眾生，
　持經者聞香，　　^lb悉知其所在。
　阿修羅男女，　　及其諸眷屬，
　^pb31鬪諍遊戲時，　　聞香皆能知。
　曠野險隘處，　　^lb師子象虎狼，
　野牛水牛等，　　聞香知所在。
　^lb若有懷妊者，　　未辯其男女，
　無根及非人，　　^lb聞香悉能知。
　以聞香力故，　　知其初懷妊，
　^lb成就不成就，　　安樂產福子。
　以聞香力故，　　^lb知男女所念，
　染欲癡恚心，　　亦知修善者。
　^pb32地中眾伏藏，　　金銀諸珍寶，
　銅器之所盛，　　^lb聞香悉能知。
　種種諸瓔珞，　　無能識其價，
　^lb聞香知貴賤，　　出處及所在。
　天上諸華等，　　^lb曼陀曼殊沙、
　波利質多樹，　　聞香悉能知。
　^lb天上諸宮殿，　　上中下差別，
　眾寶花莊嚴，　　^lb聞香悉能知。
　天園林勝殿，　　諸觀妙法堂，
　^pb33在中而娛樂，　　聞香悉能知。
　諸天若聽法，　　^lb或受五欲時，
　來往行坐臥，　　聞香悉能知。
　^lb天女所著衣，　　好華香莊嚴，
　周旋遊戲時，　　^lb聞香悉能知。
　如是展轉上，　　乃至於梵世，
　^lb入禪出禪者，　　聞香悉能知。
　光音遍淨天，　　^lb乃至于有頂，
　初生及退沒，　　聞香悉能知。
　^pb34諸比丘眾等，　　於法常精進，
　若坐若經行，　　^lb及讀誦經法，
　或在林樹下，　　專精而坐禪，
　^lb持經者聞香，　　悉知其所在。
　菩薩志堅固，　　^lb坐禪若讀誦，
　或為人說法，　　聞香悉能知。
　^lb在在方世尊，　　一切所恭敬，
　愍眾而說法，　　^lb聞香悉能知。
　眾生在佛前，　　聞經皆歡喜，
　^pb35如法而修行，　　聞香悉能知。
　雖未得菩薩，　　^lb無漏法生鼻，
　而是持經者，　　先得此鼻相。」
^lb^cb#49b15「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦、若解說、若書寫，得千二百舌功德。
若^lb好、若醜，若美、不美，及諸苦澁物，在其舌根，皆^lb變成上味，如天甘露，無不美者。
若以舌根於^pb36大眾中有所演說，出深妙聲，能入其心，皆令^lb歡喜快樂。
又諸天子、天女，釋梵諸天，聞是深^lb妙音聲，有所演說言論次第，皆悉來聽。
及諸^lb龍、龍女，夜叉、夜叉女，乾闥婆、乾闥婆女，阿修^lb羅、阿修羅女，迦樓羅、迦樓羅女，緊那羅、緊那^lb羅女，摩睺羅伽、摩睺羅伽女，為聽法故，皆來^pb37親近恭敬供養。
及比丘、比丘尼，優婆塞、優婆^lb夷，國王、王子、群臣、眷屬，小轉輪王、大轉輪王、^lb七寶千子內外眷屬，乘其宮殿，俱來聽法，以^lb是菩薩善說法故。
婆羅門、居士、國內人民、盡^lb其形壽，隨侍供養。
又諸聲聞、辟支佛、菩薩、諸^lb佛，常樂見之。是人所在方面，諸佛皆向其處^pb38說法，悉能受持一切佛法，又能出於深妙法^lb音。」
^cb#49c03爾時世尊欲重宣此義，而說偈言：
^lb^gatha「是人舌根淨，　　終不受惡味，
　其有所食噉，　　^lb悉皆成甘露。
　以深淨妙聲，　　於大眾說法，
　^lb以諸因緣喻，　　引導眾生心，
　聞者皆歡喜，　　^lb設諸上供養。
　諸天龍夜叉，　　及阿修羅等，
　^pb39皆以恭敬心，　　而共來聽法，
　是說法之人，　　^lb若欲以妙音，
　遍滿三千界，　　隨意即能至。
　^lb大小轉輪王，　　及千子眷屬，
　合掌恭敬心，　　^lb常來聽受法。
　諸天龍夜叉、　　羅剎毘舍闍，
　^lb亦以歡喜心，　　常樂來供養。
　梵天王魔王，　　^lb自在大自在，
　如是諸天眾，　　常來至其所。
　^pb40諸佛及弟子，　　聞其說法音，
　常念而守護，　　^lb或時為現身。
^lb^cb#49c22「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦，若解說、若書寫，得八百身功德。得清^lb淨身、如淨琉璃，眾生憙見。其身淨故，三千大^lb千世界眾生，生時、死時，上下、好醜，生善處、惡^pb41處，悉於中現。
及鐵圍山、大鐵圍山、彌樓山、摩^lb訶彌樓山等諸山，及其中眾生，悉於中現。
下^lb至阿鼻地獄，上至有頂，所有及眾生，悉於中^lb現。
若聲聞、辟支佛、菩薩、諸佛、說法，皆於身中^lb現其色像。」
^cb#50a01爾時世尊欲重宣此義，而說偈言：
^lb^gatha「若持法花者，　　其身甚清淨，
　如彼淨琉璃，　　^pb42眾生皆憙見。
　又如淨明鏡，　　悉見諸色像，
　^lb菩薩於淨身，　　皆見世所有，
　唯獨自明了，　　^lb餘人所不見。
　三千世界中，　　一切諸群萌，
　^lb天人阿修羅、　　地獄鬼畜生，
　如是諸色像，　　^lb皆於身中現。
　諸天等宮殿，　　乃至於有頂，
　^lb鐵圍及彌樓、　　摩訶彌樓山，
　諸大海水等，　　^pb43皆於身中現。
　諸佛及聲聞，　　佛子菩薩等，
　^lb若獨若在眾，　　說法悉皆現。
　雖未得無漏，　　^lb法性之妙身，
　以清淨常體，　　一切於中現。
^lb^cb#50a18「復次，常精進！若善男子、善女人，如來滅後、受^lb持是經，若讀、若誦、若解說、若書寫，得千二百^lb意功德。
以是清淨意根，乃至聞一偈一句，通^pb44達無量無邊之義，解是義已，能演說一句一^lb偈至於一月、四月乃至一歲，諸所說法，隨其^lb義趣，皆與實相不相違背。
若說俗間經書、治^lb世語言、資生業等，皆順正法。
三千大千世界^lb六趣眾生，心之所行、心所動作、心所戲論，皆^lb悉知之。
雖未得無漏智慧，而其意根、清淨如^pb45此。是人有所思惟、籌量、言說，皆是佛法，無不^lb真實，亦是先佛經中所說。」
^cb#50a29爾時世尊欲重宣^lb此義，而說偈言：
^lb^gatha「是人意清淨，　　明利無穢濁，
　以此妙意根，　　^lb知上中下法，
　乃至聞一偈，　　通達無量義，
　^lb次第如法說，　　月四月至歲。
　是世界內外，　　^pb46一切諸眾生，
　若天龍及人、　　夜叉鬼神等，
　^lb其在六趣中，　　所念若干種，
　持法花之報，　　^lb一時皆悉知。
　十方無數佛，　　百福莊嚴相，
　^lb為眾生說法，　　悉聞能受持。
　思惟無量義，　　^lb說法亦無量，
　終始不忘錯，　　以持法華故。
　^lb悉知諸法相，　　隨義識次第，
　達名字語言，　　^pb47如所知演說。
　此人有所說，　　皆是先佛法，
　^lb以演此法故，　　於眾無所畏。
　持法花經者，　　^lb意根淨若斯，
　雖未得無漏，　　先有如是相。
　^lb是人持此經，　　安住希有地，
　為一切眾生，　　^lb歡喜而愛敬。
　能以千萬種，　　善巧之語言，
　^lb分別而說法，　　持法花經故。」
^pb48^ck20〔常不輕菩薩品第二十〕
^lb^cb#50b24爾時，佛告得大勢菩薩摩訶薩：「汝今當知！若^lb比丘、比丘尼、優婆塞、優婆夷持法花經者，若^lb有惡口、罵詈、誹謗，獲大罪報，如前所說；其所^lb得功德，如向所說，眼、耳、鼻、舌、身、意清淨。
^cb#50b28「得大^lb勢！乃往古昔，過無量無邊不可思議阿僧祇^pb49劫，有佛名威音王如來、應供、正遍知、明行足、^lb善逝、世間解、無上士、調御丈夫、天人師、佛、世^lb尊。劫名離衰，國名大成。其威音王佛，於彼世^lb中，為天、人、阿修羅說法，為求聲聞者，說應四^lb諦法，度生老病死，究竟涅槃；為求辟支佛者，^lb說應十二因緣法；為諸菩薩，因阿耨多羅三^pb50藐三菩提，說應六波羅蜜法，究竟佛慧。
^cb#50c07「得大^lb勢！是威音王佛，壽四十萬億那由他恒河沙^lb劫；正法住世劫數，如一閻浮提微塵；像法住^lb世劫數，如四天下微塵。其佛饒益眾生已，然^lb後滅度。正法、像法滅盡之後，於此國土復有^lb佛出，亦號威音王如來、應供、正遍知、明行足、^pb51善逝、世間解、無上士、調御丈夫、天人師、佛、世^lb尊。如是次第有二萬億佛，皆同一號。
^cb#50c14「最初威^lb音王如來既已滅度，正法滅後，於像法中，增^lb上慢比丘有大勢力。
爾時有一菩薩比丘名^lb常不輕。得大勢！以何因緣名常不輕？是比丘，^lb凡有所見——若比丘、比丘尼、優婆塞、優婆夷——^pb52皆悉禮拜讚歎而作是言：『我深敬汝等，不敢輕^lb慢。
所以者何？汝等皆行菩薩道，當得作佛。』
而^lb是比丘，不專讀誦經典，但行禮拜，乃至遠見^lb四眾，亦復故往禮拜讚歎而作是言：『我不敢^lb輕於汝等，汝等皆當作佛。』
四眾之中，有生瞋^lb恚、心不淨者，惡口罵詈言：『是無智比丘從何^pb53所來？自言：「我不輕汝。」而與我等授記，當得作^lb佛。我等不用如是虛妄授記。』如此經歷多年，^lb常被罵詈，不生瞋恚，常作是言：『汝當作佛。』
說^lb是語時，眾人或以杖木瓦石而打擲之，避走^lb遠住，猶高聲唱言：
『我不敢輕於汝等，汝等皆^lb當作佛。』
以其常作是語故，增上慢比丘、比丘^pb54尼、優婆塞、優婆夷，號之為常不輕。
是比丘臨^lb欲終時，於虛空中，具聞威音王佛先所說法^lb華經二十千萬億偈，悉能受持，即得如上眼^lb根清淨、耳鼻舌身意根清淨。
得是六根清淨^lb已，更增壽命二百萬億那由他歲，廣為人說^lb是法華經。
於時增上慢四眾——比丘、比丘尼、優^pb55婆塞、優婆夷——輕賤是人，為作不輕名者，見其^lb得大神通力、樂說辯力、大善寂力，聞其所說，^lb皆信伏隨從。
是菩薩復化千萬億眾，令住阿^lb耨多羅三藐三菩提。
命終之後，得值二千億^lb佛，皆號日月燈明，於其法中，說是法華經。
以^lb是因緣，復值二千億佛，同號雲自在燈王，於^pb56此諸佛法中，受持讀誦，為諸四眾說此經典^lb故，得是常眼清淨，耳、鼻、舌、身、意諸根清淨，於^lb四眾中說法，心無所畏。
^cb#51a17「得大勢！是常不輕菩^lb薩摩訶薩，供養如是若干諸佛，恭敬、尊重、讚^lb歎、種諸善根，於後復值千萬億佛，亦於諸佛^lb法中說是經典，功德成就，當得作佛。
^cb#51a21「得大勢！^pb57於意云何？爾時常不輕菩薩豈異人乎？則我^lb身是。
若我於宿世不受持讀誦此經、為他人^lb說者，不能疾得阿耨多羅三藐三菩提。
我於^lb先佛所，受持讀誦此經、為人說故，疾得阿耨^lb多羅三藐三菩提。
^cb#51a26「得大勢！彼時四眾——比丘、比^lb丘尼、優婆塞、優婆夷——以瞋恚意輕賤我故，二^pb58百億劫常不值佛、不聞法、不見僧，千劫於阿^lb鼻地獄受大苦惱。
畢是罪已，復遇常不輕菩^lb薩，教化阿耨多羅三藐三菩提。
^cb#51b01「得大勢，於汝^lb意云何？爾時四眾常輕是菩薩者，豈異人乎？^lb今此會中跋陀婆羅等五百菩薩、師子月等^lb五百比丘、尼思佛等五百優婆塞，皆於阿耨^pb59多羅三藐三菩提不退轉者是。
^cb#51b05「得大勢！當知^lb是法華經，大饒益諸菩薩摩訶薩，能令至於^lb阿耨多羅三藐三菩提。
是故諸菩薩摩訶薩，^lb於如來滅後，常應受持、讀誦、解說、書寫是經。」
^lb^cb#51b09爾時世尊欲重宣此義，而說偈言：
^lb^gatha「過去有佛，　　號威音王，　　神智無量，
　將導一切，　　^pb60天人龍神，　　所共供養。
　是佛滅後，　　法欲盡時，　　^lb有一菩薩，
　名常不輕。　　時諸四眾，　　計著於法。
　^lb不輕菩薩，　　往到其所，　　而語之言：
『我不輕汝，　　^lb汝等行道，　　皆當作佛。』
　諸人聞已，　　輕毀罵詈；　　^lb不輕菩薩，
　能忍受之。　　其罪畢已，　　臨命終時，
　^lb得聞此經，　　六根清淨。　　神通力故，
　增益壽命，　　^pb61復為諸人，　　廣說是經。
　諸著法眾，　　皆蒙菩薩，　　^lb教化成就，
　令住佛道。　　不輕命終，　　值無數佛，
　^lb說是經故，　　得無量福，　　漸具功德，
　疾成佛道。　　^lb彼時不輕，　　則我身是。
　時四部眾，　　著法之者，　　^lb聞不輕言：
『汝當作佛。』　　以是因緣，　　值無數佛。
　^lb此會菩薩，　　五百之眾，　　并及四部，
　清信士女，　　^pb62今於我前，　　聽法者是。
　我於前世，　　勸是諸人，　　^lb聽受斯經，
　第一之法。　　開示教人，　　令住涅槃，
　^lb世世受持，　　如是經典。　　億億萬劫，
　至不可議，　　^lb時乃得聞，　　是法華經。
　億億萬劫，　　至不可議，　　^lb諸佛世尊、
　時說是經。　　是故行者，　　於佛滅後，
　^lb聞如是經，　　勿生疑惑。　　應當一心、
　廣說此經，　　^pb63世世值佛，　　疾成佛道。」
^lb^ck21〔如來神力品第二十一〕
^lb^cb#51c09爾時，千世界微塵等菩薩摩訶薩，從地踊出^lb者，皆於佛前一心合掌，瞻仰尊顏，而白佛言：^lb「世尊！我等於佛滅後，世尊分身所在國土滅^lb度之處，當廣說此經。
所以者何？我等亦自欲^pb64得是真淨大法，受持、讀誦、解說、書寫，而供養^lb之。」
^cb#51c14爾時世尊，於文殊師利等無量百千萬億^lb舊住娑婆世界菩薩摩訶薩，及諸比丘、比丘^lb尼、優婆塞、優婆夷，天、龍、夜叉、乾闥婆、阿修羅、^lb迦樓羅、緊那羅、摩睺羅伽、人非人等，一切眾^lb前，現大神力，出廣長舌上至梵世，一切毛孔^pb65放於無量無數色光，皆悉遍照十方世界。
眾^lb寶樹下、師子座上諸佛，亦復如是，出廣長舌，^lb放無量光。
釋迦牟尼佛及寶樹下諸佛現神^lb力時，滿百千歲，然後還攝舌相。
一時謦欬、俱^lb共彈指，是二音聲，遍至十方諸佛世界，地皆^lb六種震動。
其中眾生，天、龍、夜叉、乾闥婆、阿修^pb66羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，以佛^lb神力故，皆見此娑婆世界，無量無邊百千萬^lb億眾寶樹下、師子座上諸佛；及見釋迦牟尼^lb佛共多寶如來，在寶塔中、坐師子座；
又見無^lb量無邊百千萬億菩薩摩訶薩及諸四眾，恭^lb敬圍繞釋迦牟尼佛。既見是已，皆大歡喜，得^pb67未曾有。
即時諸天、於虛空中、高聲唱言：「過此^lb無量無邊百千萬億阿僧祇世界，有國名娑^lb婆，是中有佛名釋迦牟尼，今為諸菩薩摩訶^lb薩說大乘經，名妙法蓮華，教菩薩法，佛所護^lb念。
汝等當深心隨喜，亦當禮拜供養釋迦牟^lb尼佛。」
彼諸眾生，聞虛空中聲已，合掌向娑婆^pb68世界作如是言：「南無釋迦牟尼佛！南無釋迦^lb牟尼佛！」
以種種華、香、瓔珞、幡蓋，及諸嚴身之^lb具、珍寶妙物，皆共遙散娑婆世界。
所散諸物，^lb從十方來，譬如雲集，變成寶帳，遍覆此間諸^lb佛之上。
于時十方世界，通達無礙，如一佛土。
^lb^cb#52a13爾時，佛告上行等菩薩大眾：「諸佛神力如是，^pb69無量無邊、不可思議，若我以是神力，於無量^lb無邊百千萬億阿僧祇劫，為囑累故，說此經^lb功德，猶不能盡。
以要言之，如來一切所有之^lb法、如來一切自在神力、如來一切祕要之藏、^lb如來一切甚深之事，皆於此經宣示顯說。
是^lb故汝等於如來滅後，應一心受持、讀誦、解說、^pb70書寫、如說修行。
所在國土，若有受持、讀誦、解^lb說、書寫、如說修行，若經卷所住之處，若於園^lb中、若於林中、若於樹下、若於僧坊、若白衣舍、^lb若在殿堂、若山谷曠野，是中皆應起塔供養。
^lb所以者何？當知是處、即是道場，諸佛於此得^lb阿耨多羅三藐三菩提，諸佛於此轉于法輪，^pb71諸佛於此而般涅槃。」
^lb^cb#52a27爾時世尊欲重宣此義，而說偈言：
^lb^gatha「諸佛救世者，　　住於大神通，
　為悅眾生故，　　^lb現無量神力，
　舌相至梵天，　　身放無數光，
　^lb為求佛道者，　　現此希有事。
　諸佛謦欬聲，　　^lb及彈指之聲，
　周聞十方國，　　地皆六種動。
　^pb72以佛滅度後，　　能持是經故，
　諸佛皆歡喜，　　^lb現無量神力。
　囑累是經故，　　讚美受持者，
　^lb於無量劫中，　　猶故不能盡。
　是人之功德，　　^lb無邊無有窮，
　如十方虛空，　　不可得邊際。
　^lb能持是經者，　　則為已見我，
　亦見多寶佛，　　^lb及諸分身者，
　又見我今日，　　教化諸菩薩。
　^pb73能持是經者，　　令我及分身，
　滅度多寶佛，　　^lb一切皆歡喜。
　十方現在佛，　　并過去未來，
　^lb亦見亦供養，　　亦令得歡喜。
　諸佛坐道場，　　^lb所得祕要法，
　能持是經者，　　不久亦當得。
　^lb能持是經者，　　於諸法之義，
　名字及言辭，　　^lb樂說無窮盡，
　如風於空中，　　一切無障礙。
　^pb74於如來滅後，　　知佛所說經，
　因緣及次第，　　^lb隨義如實說，
　如日月光明，　　能除諸幽冥。
　^lb斯人行世間，　　能滅眾生闇，
　教無量菩薩，　　^lb畢竟住一乘。
　是故有智者，　　聞此功德利，
　^lb於我滅度後，　　應受持斯經，
　是人於佛道，　　^lb決定無有疑。」
^pb75^ck22〔囑累品第二十二〕
^lb^cb#52c04爾時，釋迦牟尼佛從法座起，現大神力，以右^lb手摩無量菩薩摩訶薩頂，而作是言：「我於無^lb量百千萬億阿僧祇劫，修習是難得阿耨多^lb羅三藐三菩提法，今以付囑汝等。
汝等應當^lb一心流布此法，廣令增益。」
如是三摩諸菩薩^pb76摩訶薩頂，而作是言：「我於無量百千萬億阿^lb僧祇劫，修習是難得阿耨多羅三藐三菩提^lb法，今以付囑汝等。
汝等當受持、讀誦、廣宣此^lb法，令一切眾生普得聞知。
所以者何？如來有^lb大慈悲，無諸慳悋，亦無所畏，能與眾生，佛之^lb智慧、如來智慧、自然智慧，如來是一切眾生^pb77之大施主。
汝等亦應隨學如來之法，勿生慳^lb悋。
於未來世，若有善男子、善女人，信如來智^lb慧者，當為演說此法華經，使得聞知，為令其^lb人得佛慧故。
若有眾生不信受者，當於如來^lb餘深法中，示教利喜。
汝等若能如是，則為已^lb報諸佛之恩。」
^cb#52c21時諸菩薩摩訶薩，聞佛作是說^pb78已，皆大歡喜遍滿其身，益加恭敬，曲躬、低頭，^lb合掌向佛，俱發聲言：「如世尊勅，當具奉行。唯^lb然，世尊！願不有慮。」諸菩薩摩訶薩眾，如是三^lb反，俱發聲言：「如世尊勅，當具奉行。唯然，世尊！^lb願不有慮。」
^cb#52c26爾時釋迦牟尼佛令十方來諸分^lb身佛各還本土，而作是言：「諸佛各隨所安，多^pb79寶佛塔還可如故。」說是語時，十方無量分身^lb諸佛——坐寶樹下師子座上者，及多寶佛，并上^lb行等無邊阿僧祇菩薩大眾，舍利弗等聲聞^lb四眾，及一切世間天、人、阿修羅等，聞佛所說，^lb皆大歡喜。
^lb^ck23〔藥王菩薩本事品第二十三〕
^pb80^cb#53a05爾時宿王華菩薩白佛言：「世尊！藥王菩薩云^lb何遊於娑婆世界？世尊！是藥王菩薩有若干^lb百千萬億那由他難行苦行？善哉，世尊！願少^lb解說。」諸天、龍、神、夜叉、乾闥婆、阿修羅、迦樓羅、^lb緊那羅、摩睺羅伽、人非人等，又他國土諸來^lb菩薩，及此聲聞眾，聞皆歡喜。
^cb#53a10爾時佛告宿王^pb81華菩薩：「乃往過去無量恒河沙劫，有佛號日^lb月淨明德如來、應供、正遍知、明行足、善逝、世^lb間解、無上士、調御丈夫、天人師、佛、世尊。
其佛^lb有八十億大菩薩摩訶薩，七十二恒河沙大^lb聲聞眾，佛壽四萬二千劫，菩薩壽命亦等。
彼^lb國無有女人、地獄、餓鬼、畜生、阿修羅等，及以^pb82諸難；地平如掌，琉璃所成，寶樹莊嚴，寶帳覆^lb上，垂寶華幡，寶瓶香爐周遍國界，七寶為臺，^lb一樹一臺，其樹去臺盡一箭道。
此諸寶樹，皆^lb有菩薩、聲聞而坐其下。諸寶臺上，各有百億^lb諸天作天伎樂，歌歎於佛，以為供養。
爾時彼^lb佛為一切眾生喜見菩薩，及眾菩薩、諸聲聞^pb83眾，說法華經。
^cb#53a23「是一切眾生喜見菩薩，樂習苦^lb行，於日月淨明德佛法中，精進經行，一心求^lb佛，滿萬二千歲已，得現一切色身三昧。
得此^lb三昧已，心大歡喜，即作念言：『我得現一切色^lb身三昧，皆是得聞法華經力，我今當供養日^lb月淨明德佛及法華經。』即時入是三昧，於虛^pb84空中，雨曼陀羅華、摩訶曼陀羅華、細末堅黑^lb栴檀，滿虛空中，如雲而下，又雨海此岸栴檀^lb之香——此香六銖，價直娑婆世界——以供養佛。
作^lb是供養已，從三昧起，而自念言：『我雖以神力^lb供養於佛，不如以身供養。』即服諸香——栴檀、薰^lb陸、兜樓婆、畢力迦、沈水、膠香，又飲瞻蔔諸華^pb85香油，滿千二百歲已，香油塗身，於日月淨明^lb德佛前，以天寶衣而自纏身，灌諸香油，以神^lb通力願而自然身，光明遍照八十億恒河沙^lb世界。
其中諸佛同時讚言：『善哉，善哉！善男子！^lb是真精進，是名真法供養如來。
若以華、香、瓔^lb珞、燒香、末香、塗香、天繒、幡蓋及海此岸栴檀^pb86之香，如是等種種諸物供養，所不能及；假使^lb國城、妻子布施，亦所不及。
善男子！是名第一^lb之施，於諸施中最尊最上，以法供養諸如來^lb故。』
作是語已而各默然。其身火燃千二百歲，^lb過是已後，其身乃盡。
^cb#53b18「一切眾生喜見菩薩作^lb如是法供養已，命終之後，復生日月淨明德^pb87佛國中，於淨德王家結加趺坐，忽然化生。即^lb為其父而說偈言：
^lb^gatha「『大王今當知，　　我經行彼處，
　　即時得一切，　　^lb現諸身三昧。
　　勤行大精進，　　捨所愛之身，
^missing<t=供養於世尊，　　為求無上慧。』>
^lb^cb#53b26「說是偈已，而白父言：『日月淨明德佛，今故現^lb在。
我先供養佛已，得解一切眾生語言陀羅^pb88尼，復聞是法華經八百千萬億那由他甄迦^lb羅、頻婆羅、阿閦婆等偈。大王！我今當還供養^lb此佛。』白已，即坐七寶之臺，上昇虛空，高七多^lb羅樹，往到佛所，頭面禮足，合十指爪，以偈讚^lb佛：
^lb^gatha「『容顏甚奇妙，　　光明照十方，
　　我適曾供養，　　^pb89今復還親覲。』
^lb^cb#53c06「爾時，一切眾生喜見菩薩說是偈已，而白佛^lb言：『世尊！世尊猶故在世。』
爾時日月淨明德佛，^lb告一切眾生喜見菩薩：『善男子！我涅槃時到、^lb滅盡時至，汝可安施床座，我於今夜當般涅^lb槃。』又勅一切眾生喜見菩薩：『善男子！我以佛^pb90法囑累於汝及諸菩薩大弟子，并阿耨多羅^lb三藐三菩提法，亦以三千大千七寶世界諸^lb寶樹、寶臺及給侍諸天，悉付於汝。
我滅度後，^lb所有舍利亦付囑汝，當令流布，廣設供養，應^lb起若干千塔。』如是日月淨明德佛勅一切眾^lb生喜見菩薩已，於夜後分入於涅槃。
^cb#53c17「爾時，一^pb91切眾生喜見菩薩見佛滅度，悲感、懊惱，戀慕^lb於佛，即以海此岸栴檀為𧂐，供養佛身，而以^lb燒之。
火滅已後，收取舍利，作八萬四千寶瓶，^lb以起八萬四千塔，高三世界，表剎莊嚴，垂諸^lb幡蓋，懸眾寶鈴。
^cb#53c22「爾時一切眾生喜見菩薩復^lb自念言：『我雖作是供養，心猶未足，我今當更^pb92供養舍利。』便語諸菩薩大弟子及天、龍、夜叉^lb等一切大眾：『汝等當一心念，我今供養日月^lb淨明德佛舍利。』作是語已，即於八萬四千塔^lb前，燃百福莊嚴臂七萬二千歲而以供養，令^lb無數求聲聞眾、無量阿僧祇人，發阿耨多羅^lb三藐三菩提心，皆使得住現一切色身三昧。
^pb93^cb#54a01「爾時，諸菩薩、天、人、阿修羅等，見其無臂，憂惱^lb悲哀而作是言：『此一切眾生喜見菩薩，是我^lb等師，教化我者，而今燒臂，身不具足。』于時一^lb切眾生喜見菩薩，於大眾中立此誓言：『我捨^lb兩臂，必當得佛金色之身，若實不虛，令我兩^lb臂還復如故。』作是誓已，自然還復，由斯菩薩^pb94福德智慧淳厚所致。
當爾之時，三千大千世^lb界六種震動，天雨寶華，一切人、天得未曾有。」
^lb^cb#54a09佛告宿王華菩薩：「於汝意云何？一切眾生喜^lb見菩薩，豈異人乎？今藥王菩薩是也。
其所捨^lb身布施，如是無量百千萬億那由他數。
^cb#54a12「宿王^lb華！若有發心欲得阿耨多羅三藐三菩提者，^pb95能燃手指，乃至足一指，供養佛塔，勝以國城、^lb妻子，及三千大千國土山林河池、諸珍寶物、^lb而供養者，若復有人，以七寶滿三千大千世^lb界，供養於佛，及大菩薩、辟支佛、阿羅漢，是人^lb所得功德，不如受持此法華經，乃至一四句^lb偈，其福最多。
^cb#54a19「宿王華！譬如一切川流江河，諸^pb96水之中海為第一；此法華經亦復如是，於諸^lb如來所說經中，最為深大。
又如土山、黑山、小^lb鐵圍山、大鐵圍山及十寶山，眾山之中，須彌^lb山為第一；
此法華經亦復如是，於諸經中最^lb為其上。又如眾星之中，月天子最為第一；此^lb法華經亦復如是，於千萬億種諸經法中最^pb97為照明。
又如日天子能除諸闇；此經亦復如^lb是，能破一切不善之闇。
又如諸小王中，轉輪^lb聖王最為第一；此經亦復如是，於眾經中最^lb為其尊。
又如帝釋、於三十三天中王，此經亦^lb復如是，諸經中王。
又如大梵天王，一切眾生^lb之父；此經亦復如是，一切賢聖，學、無學，及發^pb98菩薩心者之父。
又如一切凡夫人中，須陀洹、^lb斯陀含、阿那含、阿羅漢、辟支佛為第一；此經^lb亦復如是，一切如來所說、若菩薩所說、若聲^lb聞所說，諸經法中，最為第一。
有能受持是經^lb典者，亦復如是，於一切眾生中、亦為第一。
一^lb切聲聞、辟支佛中，菩薩為第一；此經亦復如^pb99是，於一切諸經法中、最為第一。
如佛為諸法^lb王；此經亦復如是，諸經中王。
^cb#54b11「宿王華！此經能^lb救一切眾生者，此經能令一切眾生離諸苦^lb惱，此經能大饒益一切眾生，充滿其願。
如清^lb涼池！能滿一切諸渴乏者，如寒者得火，如裸^lb者得衣，如商人得主，如子得母，如渡得船，如^pb100病得醫，如暗得燈，如貧得寶，如民得王，如賈^lb客得海，如炬除暗；此法華經亦復如是，能令^lb眾生離一切苦、一切病痛，能解一切生死之^lb縛。
若人得聞此法華經，若自書、若使人書，所^lb得功德，以佛智慧籌量多少，不得其邊。
若書^lb是經卷，華、香、瓔珞、燒香、末香、塗香，幡蓋、衣服，^pb101種種之燈——酥燈、油燈、諸香油燈、瞻蔔油燈、須^lb曼那油燈、波羅羅油燈、婆利師迦油燈、那婆^lb摩利油燈——供養，所得功德，亦復無量。
^cb#54b26「宿王華！^lb若有人聞是藥王菩薩本事品者，亦得無量^lb無邊功德。
若有女人聞是藥王菩薩本事品，^lb能受持者，盡是女身，後不復受。
若如來滅後^pb102後五百歲中，若有女人聞是經典，如說修行。
^lb於此命終，即往安樂世界，阿彌陀佛、大菩薩^lb眾，圍繞住處，生蓮華中，寶座之上，不復為貪^lb欲所惱，亦復不為瞋恚愚癡所惱，亦復不為^lb憍慢嫉妬諸垢所惱，得菩薩神通、無生法忍。
^lb得是忍已，眼根清淨，以是清淨眼根，見七百^pb103萬二千億那由他恒河沙等諸佛如來。
是時^lb諸佛遙共讚言：『善哉，善哉！善男子！汝能於釋^lb迦牟尼佛法中，受持讀誦思惟是經，為他人^lb說，所得福德無量無邊，火不能燒，水不能漂，^lb汝之功德，千佛共說不能令盡。
汝今已能破^lb諸魔賊，壞生死軍，諸餘怨敵皆悉摧滅。
善男^pb104子！百千諸佛，以神通力共守護汝，於一切世^lb間天、人之中無如汝者，唯除如來，其諸聲聞、^lb辟支佛、乃至菩薩，智慧禪定無有與汝等者。』^lb宿王華！此菩薩成就如是功德智慧之力。
若^lb有人聞是藥王菩薩本事品，能隨喜讚善者，^lb是人現世口中常出青蓮華香，身毛孔中常^pb105出牛頭栴檀之香，所得功德，如上所說。
是故，^lb宿王華！以此藥王菩薩本事品囑累於汝。
我^lb滅度後後五百歲中，廣宣流布於閻浮提，無^lb令斷絕，惡魔、魔民、諸天、龍、夜叉、鳩槃茶等，得^lb其便也。
^cb#54c23「宿王華！汝當以神通之力守護是經。
^lb所以者何？此經則為閻浮提人，病之良藥。若^pb106人有病，得聞是經，病即消滅，不老不死。宿王^lb華！汝若見有受持是經者，應以青蓮花盛滿^lb末香，供散其上。
散已，作是念言：『此人不久必^lb當取草坐於道場，破諸魔軍，當吹法螺、擊大^lb法鼓，度脫一切眾生老病死海。』是故求佛道^lb者、見有受持是經典人，應當如是生恭敬心。」
^pb107^cb#55a03說是藥王菩薩本事品時，八萬四千菩薩得^lb解一切眾生語言陀羅尼。
多寶如來於寶塔^lb中讚宿王華菩薩言：「善哉，善哉！宿王華！汝成^lb就不可思議功德，乃能問釋迦牟尼佛如此^lb之事，利益無量一切眾生。」
^lb妙法蓮華經卷第六^pb108
^pb1^folio#sdpdrk7<lines=6>妙法蓮華經卷第七^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck24〔妙音菩薩品第二十四〕
^lb^cb#55a17爾時釋迦牟尼佛放大人相肉髻光明，及放^lb眉間白毫相光，遍照東方百八萬億那由他^lb恒河沙等諸佛世界。
過是數已，有世界名淨^pb2光莊嚴，其國有佛，號淨華宿王智如來、應供、^lb正遍知、明行足、善逝、世間解、無上士、調御丈^lb夫、天人師、佛、世尊，為無量無邊菩薩大眾恭^lb敬圍繞而為說法，釋迦牟尼佛白毫光明遍^lb照其國。
爾時一切淨光莊嚴國中，有一菩薩名^lb曰妙音，久已殖眾德本，供養親近無量百^pb3千萬億諸佛，而悉成就甚深智慧，得妙幢相^lb三昧、法華三昧、淨德三昧、宿王戲三昧、無緣^lb三昧、智印三昧、解一切眾生語言三昧、集一^lb切功德三昧、清淨三昧、神通遊戲三昧、慧炬^lb三昧、莊嚴王三昧、淨光明三昧、淨藏三昧、不^lb共三昧、日旋三昧，得如是等百千萬億恒河^pb4沙等諸大三昧。
釋迦牟尼佛光照其身，即白^lb淨華宿王智佛言：「世尊！我當往詣娑婆世界，^lb禮拜、親近、供養釋迦牟尼佛，及見文殊師利^lb法王子菩薩、藥王菩薩、勇施菩薩、宿王華菩^lb薩、上行意菩薩、莊嚴王菩薩、藥上菩薩。」
^cb#55b08爾時^lb淨華宿王智佛告妙音菩薩：「汝莫輕彼國，生^pb5下劣想。
善男子！彼娑婆世界，高下不平，土石^lb諸山，穢惡充滿，佛身卑小，諸菩薩眾其形亦^lb小。
而汝身四萬二千由旬，我身六百八十萬^lb由旬，汝身第一端正，百千萬福，光明殊妙，是^lb故汝往、莫輕彼國——若佛、菩薩及國土，生下劣^lb想。」
^cb#55b14妙音菩薩白其佛言：「世尊！我今詣娑婆世^pb6界，皆是如來之力，如來神通遊戲，如來功德^lb智慧莊嚴。」於是妙音菩薩不起于座，身不動^lb搖，而入三昧，以三昧力，於耆闍崛山，去法座^lb不遠，化作八萬四千眾寶蓮華，閻浮檀金為^lb莖，白銀為葉，金剛為鬚，甄叔迦寶以為其臺。
^lb^cb#55b21爾時，文殊師利法王子見是蓮華，而白佛言：^pb7「世尊！是何因緣，先現此瑞？有若干千萬蓮華，^lb閻浮檀金為莖，白銀為葉，金剛為鬚，甄叔迦^lb寶以為其臺。」
^cb#55b24爾時釋迦牟尼佛告文殊師利：^lb「是妙音菩薩摩訶薩，欲從淨華宿王智佛國，^lb與八萬四千菩薩，圍繞而來至此娑婆世界，^lb供養、親近、禮拜於我，亦欲供養、聽法華經。」
^cb#55b28文^pb8殊師利白佛言：「世尊！是菩薩種何善本？修何^lb功德？而能有是大神通力？行何三昧？願為我^lb等說是三昧名字，我等亦欲勤修行之，行此^lb三昧，乃能見是菩薩色相大小，威儀進止。
唯^lb願世尊以神通力，彼菩薩來，令我得見。」
^cb#55c04爾時^lb釋迦牟尼佛告文殊師利：「此久滅度多寶如^pb9來，當為汝等而現其相。」
^cb#55c06時多寶佛告彼菩薩：^lb「善男子！來，文殊師利法王子欲見汝身。」于時^lb妙音菩薩於彼國沒，與八萬四千菩薩俱共^lb發來。
所經諸國，六種震動，皆悉雨於七寶蓮^lb華；百千天樂，不鼓自鳴。
是菩薩目如廣大青^lb蓮華葉，正使和合百千萬月，其面貌端正復^pb10過於此，身真金色，無量百千功德莊嚴，威德^lb熾盛，光明照曜，諸相具足，如那羅延堅固之^lb身。
入七寶臺，上昇虛空，去地七多羅樹，諸菩^lb薩眾恭敬圍繞，而來詣此娑婆世界耆闍崛^lb山。
到已，下七寶臺，以價直百千瓔珞，持至釋^lb迦牟尼佛所，頭面禮足，奉上瓔珞，而白佛言：^pb11「世尊！淨華宿王智佛問訊世尊，少病、少惱，起^lb居輕利，安樂行不？四大調和不？
世事可忍不？^lb眾生易度不？無多貪欲、瞋恚、愚癡、嫉妬、慳慢^lb不？無不孝父母、不敬沙門、邪見、不善心、不攝^lb五情不？世尊！眾生能降伏諸魔怨不？久滅度^lb多寶如來在七寶塔中，來聽法不？又問訊多^pb12寶如來，安隱、少惱，堪忍久住不？世尊！我今欲^lb見多寶佛身，唯願世尊，示我令見。」
^cb#55c26爾時釋迦^lb牟尼佛語多寶佛：「是妙音菩薩欲得相見。」
^cb#55c28時^lb多寶佛告妙音言：「善哉，善哉！汝能為供養釋^lb迦牟尼佛及聽法華經，并見文殊師利等，故^lb來至此。」
^cb#56a02爾時華德菩薩白佛言：「世尊！是妙音^pb13菩薩，種何善根，修何功德，有是神力？」
^cb#56a03佛告華^lb德菩薩：「過去有佛，名雲雷音王多陀阿伽度、^lb阿羅訶、三藐三佛陀，國名現一切世間，劫名^lb喜見，妙音菩薩於萬二千歲，以十萬種伎樂^lb供養雲雷音王佛，并奉上八萬四千七寶鉢。
^lb以是因緣果報，今生淨華宿王智佛國，有是^pb14神力。
華德！於汝意云何？爾時雲雷音王佛所，^lb妙音菩薩——伎樂供養、奉上寶器者，豈異人乎？^lb今此妙音菩薩摩訶薩是。
華德！是妙音菩薩，^lb已曾供養親近無量諸佛，久殖德本，又值恒^lb河沙等百千萬億那由他佛。
^cb#56a14「華德！汝但見妙^lb音菩薩其身在此，而是菩薩，現種種身，處處^pb15為諸眾生說是經典——或現梵王^lb身，或現帝釋身，或現自在天身，或現大自在天身，或現天^lb大將軍身，或現毘沙門天王身，或現轉輪聖^lb王身，或現諸小王身，或現長者身，或現居士身，或現宰官身，或現婆羅門^lb身，
或現比丘、比^lb丘尼、優婆塞、優婆夷身，或現長者居士婦女^pb16身，或現宰官婦女身，或現婆羅門婦女身，或^lb現童男、童女身，或現天、龍、夜叉、乾闥婆、阿修^lb羅、迦樓羅、緊那羅、摩睺羅伽、人非人等身，而^lb說是經。
諸有地獄、餓鬼、畜生，及眾難處，皆能^lb救濟，乃至於王後宮，變為女身，而說是經。
^cb#56a26「華^lb德！是妙音菩薩，能救護娑婆世界諸眾生者，^pb17是妙音菩薩如是種種變化現身，在此娑婆^lb國土，為諸眾生說是經典，於神通、變化、智慧^lb無所損減。
是菩薩，以若干智慧明照娑婆世^lb界，令一切眾生各得所知；於十方恒河沙世^lb界中，亦復如是。
若應以聲^lb聞形得度者，現聲聞形而為說法；應以辟^pb18支佛形得度者，現辟支佛形而為說法；應以菩^lb薩形得度者，現菩薩形而為說法；應以佛形得度者，即現佛形^lb而為說法。
如是種種，隨所應度而為現形，乃^lb至應以滅度而得度者，示現滅度。
^cb#56b09「華德！妙音^lb菩薩摩訶薩，成就大神通智慧之力，其事如^lb是。」
^cb#56b12爾時華德菩薩白佛言：「世尊！是妙音菩薩，^pb19深種善根。
世尊！是菩薩住何三昧，而能如是^lb在所變現，度脫眾生？」
^cb#56b14佛告華德菩薩：「善男子！^lb其三昧名現一切色身，妙音菩薩住是三昧^lb中，能如是饒益無量眾生。」
^cb#56b16說是妙音菩薩品^lb時，與妙音菩薩俱來者八萬四千人，皆得現^lb一切色身三昧；此娑婆世界無量菩薩，亦得^pb20是三昧及陀羅尼。
^cb#56b19爾時妙音菩薩摩訶薩供^lb養釋迦牟尼佛及多寶佛塔已，還歸本土，所^lb經諸國，六種震動，雨寶蓮華，作百千萬億種^lb種伎樂。
既到本國，與八萬四千菩薩、圍繞至^lb淨華宿王智佛所，白佛言：
「世尊！我到娑婆世^lb界饒益眾生，見釋迦牟尼佛，及見多寶佛塔，^pb21禮拜、供養；又見文殊師利法王子菩薩，及見^lb藥王菩薩、得勤精進力菩薩、勇施菩薩等，亦^lb令是八萬四千菩薩得現一切色身三昧。`)