jsonp(4,{"name":"dc","start":5421},`　如是今當說，　　^pb52汝等一心聽。」
^lb^cb#41a28爾時世尊說此偈已，告彌勒菩薩：「我今於此^lb大眾，宣告汝等。
阿逸多！是諸大菩薩摩訶薩，^lb無量無數阿僧祇，從地踊出，汝等昔所未見^lb者，我於是娑婆世界得阿耨多羅三藐三菩^lb提已，教化示導是諸菩薩，調伏其心，令發道^pb53意。
此諸菩薩，皆於是娑婆世界之下、此界虛^lb空中住；於諸經典，讀誦通利，思惟分別，正憶^lb念。
阿逸多！是諸善男子等，不樂在眾多有所^lb說；常樂靜處，懃行精進未曾休息；亦不依止^lb人天而住。
常樂深智，無有障礙，亦常樂於諸^lb佛之法，一心精進，求無上慧。」
^cb#41b10爾時世尊欲重^pb54宣此義，而說偈言：
^lb^gatha「阿逸汝當知！　　是諸大菩薩，
　從無數劫來，　　^lb修習佛智慧，
　悉是我所化，　　令發大道心。
　^lb此等是我子，　　依止是世界，
　常行頭陀事，　　^lb志樂於靜處，
　捨大眾憒閙，　　不樂多所說。
　^lb如是諸子等，　　學習我道法，
　晝夜常精進，　　^pb55為求佛道故，
　在娑婆世界，　　下方空中住。
　^lb志念力堅固，　　常懃求智慧，
　說種種妙法，　　^lb其心無所畏。
　我於伽耶城，　　菩提樹下坐，
　^lb得成最正覺，　　轉無上法輪。
　爾乃教化之，　　^lb令初發道心，
　今皆住不退，　　悉當得成佛。
　^lb我今說實語，　　汝等一心信，
　我從久遠來，　　^pb56教化是等眾。」
^lb^cb#41b29爾時，彌勒菩薩摩訶薩及無數諸菩薩等，心^lb生疑惑，怪未曾有，而作是念：「云何世尊於少^lb時間、教化如是無量無邊阿僧祇諸大菩薩，^lb令住阿耨多羅三藐三菩提？」即白佛言：「世尊！^lb如來為太子時，出於釋宮，去伽耶城不遠，坐^pb57於道場，得成阿耨多羅三藐三菩提。從是已^lb來，始過四十餘年。世尊！云何於此少時，大作^lb佛事，以佛勢力、以佛功德，教化如是無量大^lb菩薩眾，當成阿耨多羅三藐三菩提？
^cb#41c09「世尊！此^lb大菩薩眾，假使有人於千萬億劫數不能盡，^lb不得其邊。
斯等久遠已來，於無量無邊諸佛^pb58所，殖諸善根，成就菩薩道，常修梵行。世尊！如^lb此之事，世所難信。
譬如有人，色美髮黑，年二^lb十五，指百歲人，言：『是我子。』其百歲人，亦指年^lb少，言：『是我父，生育我等。』是事難信。佛亦如是，^lb得道已來，其實未久，而此大眾諸菩薩等，已^lb於無量千萬億劫，為佛道故，懃行精進，善入^pb59出住無量百千萬億三昧，得大神通，久修梵^lb行，善能次第習諸善法，巧於問答，人中之寶，^lb一切世間甚為希有。
今日世尊方云：『得佛道^lb時，初令發心，教化示導，令向阿耨多羅三藐^lb三菩提。』
世尊得佛未久，乃能作此大功德事。^lb我等雖復信佛隨宜所說，佛所出言未曾虛^pb60妄，佛所知者皆悉通達。
然諸新發意菩薩，於^lb佛滅後，若聞是語，或不信受，而起破法罪業^lb因緣。
唯然，世尊！願為解說，除我等疑，及未來^lb世諸善男子聞此事已，亦不生疑。」
^cb#41c28爾時彌勒^lb菩薩欲重宣此義，而說偈言：
^lb^gatha「佛昔從釋種，　　出家近伽耶，
　坐於菩提樹，　　^pb61爾來尚未久。
　此諸佛子等，　　其數不可量，
　^lb久已行佛道，　　住於神通力，
　善學菩薩道，　　^lb不染世間法，
　如蓮華在水，　　從地而踊出。
　^lb皆起恭敬心，　　住於世尊前。
　是事難思議，　　^lb云何而可信？
　佛得道甚近，　　所成就甚多，
　^lb願為除眾疑，　　如實分別說。
　譬如少壯人，　　^pb62年始二十五，
　示人百歲子，　　髮白而面皺，
　^lb是等我所生；　　子亦說是父。
　父少而子老，　　^lb舉世所不信。
　世尊亦如是，　　得道來甚近。
　^lb是諸菩薩等，　　志固無怯弱，
　從無量劫來，　　^lb而行菩薩道，
　巧於難問答，　　其心無所畏，
　^lb忍辱心決定，　　端正有威德，
　十方佛所讚。　　^pb63善能分別說，
　不樂在人眾，　　常好在禪定，
　^lb為求佛道故，　　於下空中住。
　我等從佛聞，　　^lb於此事無疑，
　願佛為未來，　　演說令開解。
　^lb若有於此經，　　生疑不信者，
　即當墮惡道。　　^lb願今為解說，
　是無量菩薩，　　云何於少時，
　^lb教化令發心，　　而住不退地？」
^pb64^ck16〔如來壽量品第十六〕
^lb^cb#42b01爾時，佛告諸菩薩及一切大眾：「諸善男子！汝^lb等當信解如來誠諦之語。」復告大眾：「汝等當^lb信解如來誠諦之語。」又復告諸大眾：「汝等當^lb信解如來誠諦之語。」
^cb#42b04是時菩薩大眾，彌勒為^lb首，合掌白佛言：「世尊！唯願說之，我等當信受^pb65佛語。」如是三白已，復言：「唯願說之，我等當信^lb受佛語。」
^cb#42b07爾時世尊知諸菩薩三請不止，而告^lb之言：「汝等諦聽，如來祕密神通之力。
一切世^lb間天、人及阿修羅，皆謂：『今釋迦牟尼佛，出釋^lb氏宮，去伽耶城不遠，坐於道場，得阿耨多羅^lb三藐三菩提。』
然，善男子！我實成佛已來無量^pb66無邊百千萬億那由他劫。
譬如五百千萬億^lb那由他阿僧祇三千大千世界，假使有人末^lb為微塵，過於東方五百千萬億那由他阿僧^lb祇國乃下一塵，如是東行，盡是微塵。
諸善男^lb子！於意云何？是諸世界，可得思惟校計知其^lb數不？」
^cb#42b18彌勒菩薩等俱白佛言：「世尊！是諸世界，^pb67無量無邊，非算數所知，亦非心力所及；一切^lb聲聞、辟支佛，以無漏智，不能思惟知其限數；^lb我等住阿惟越致地，於是事中亦所不達。世^lb尊！如是諸世界，無量無邊。」
^cb#42b22爾時佛告大菩薩^lb眾：「諸善男子！今當分明宣語汝等。
是諸世界，^lb若著微塵及不著者盡以為塵，一塵一劫，我^pb68成佛已來，復過於此百千萬億那由他阿僧^lb祇劫。
自從是來，我常在此娑婆世界說法教^lb化，亦於餘處百千萬億那由他阿僧祇國導^lb利眾生。
^cb#42b28「諸善男子！於是中間，我說燃燈佛等，^lb又復言其入於涅槃，如是皆以方便分別。
^cb#42c01「諸^lb善男子！若有眾生來至我所，我以佛眼，觀其^pb69信等諸根利鈍，隨所應度，處處自說，名字不^lb同、年紀大小，亦復現言當入涅槃，又以種種^lb方便說微妙法，能令眾生發歡喜心。
^cb#42c05「諸善男^lb子！如來見諸眾生樂於小法、德薄垢重者，為^lb是人說：『我少出家，得阿耨多羅三藐三菩提。』^lb然我實成佛已來久遠若斯，但以方便，教化^pb70眾生，令入佛道，作如是說。
^cb#42c09「諸善男子！如來所^lb演經典，皆為度脫眾生，或說己身、或說他身，^lb或示己身、或示他身，或示己事、或示他事，諸^lb所言說，皆實不虛。
所以者何？如來如實知見^lb三界之相，無有生死、若退若出，亦無在世及^lb滅度者，非實非虛，非如非異，不如^pb71三界見於三界，如斯之事，如來明見，無有錯謬。
以諸眾^lb生有種種性、種種欲、種種行、種種憶想分別^lb故，欲令生諸善根，以若干因緣、譬喻、言辭種^lb種說法，所作佛事，未曾暫廢。
如是，我成佛已^lb來，甚大久遠，壽命無量阿僧祇劫，常住不滅。
^lb^cb#42c22「諸善男子！我本行菩薩道所成壽命，今猶未^pb72盡，復倍上數。
然今非實滅度，而便唱言：『當取^lb滅度。』如來以是方便，教化眾生。
所以者何？若^lb佛久住於世，薄德之人，不種善根，貧窮下賤，^lb貪著五欲，入於憶想妄見網中。
若見如來常^lb在不滅，便起憍恣而懷厭怠，不能生難遭之^lb想、恭敬之心。
是故如來以方便說：『比丘當知！^pb73諸佛出世，難可值遇。』所以者何？諸薄德人，過^lb無量百千萬億劫，或有見佛，或不見者，以此^lb事故，我作是言：『諸比丘！如來難可得見。』斯眾^lb生等聞如是語，必當生於難遭之想，心懷戀^lb慕，渴仰於佛，便種善根。是故如來雖不實滅，^lb而言滅度。
^cb#43a07「又，善男子！諸佛如來，法皆如是，為^pb74度眾生，皆實不虛。
譬如良醫，智慧聰達，明練^lb方藥，善治眾病。其人多諸子息——若十、二十乃^lb至百數，以有事緣，遠至餘國。
諸子於後，飲他^lb毒藥，藥發悶亂，宛轉于地。是時其父還來歸^lb家，諸子飲毒，或失本心、或不失者，遙見其父，^lb皆大歡喜，拜跪問訊：『善安隱歸。
我等愚癡，誤^pb75服毒藥，願見救療，更賜壽命。』
父見子等苦惱^lb如是，依諸經方，求好藥草，色香美味皆悉具^lb足，擣篩和合與子令服，而作是言：『此大良藥，^lb色香美味皆悉具足，汝等可服，速除苦惱，無^lb復眾患。』其諸子中不失心者，見此良藥、色香^lb俱好，即便服之，病盡除愈。
餘失心者，見其父^pb76來，雖亦歡喜問訊，求索治病，然與其藥而不^lb肯服。
所以者何？毒氣深入，失本心故，於此好^lb色香藥而謂不美。
父作是念：『此子可愍，為毒^lb所中，心皆顛倒。
雖見我喜，求索救療；如是好^lb藥而不肯服。我今當設方便，令服此藥。』
即作^lb是言：『汝等當知！我今衰老，死時已至，是好良^pb77藥，今留在此，汝可取服，勿憂不差。』作是教已，^lb復至他國，遣使還告：『汝父已死。』
是時諸子聞^lb父背喪，心大憂惱而作是念：『若父在者，慈愍^lb我等，能見救護，今者捨我遠喪他國。』自惟孤^lb露，無復恃怙，常懷悲感，心遂醒悟，乃知此藥^lb色味香美，即取服之，毒病皆愈。
其父聞子悉^pb78已得差，尋便來歸，咸使見之。
^cb#43b06「諸善男子！於意^lb云何？頗有人能說此良醫虛妄罪不？」
^cb#43b07「不也，世^lb尊！」
佛言：「我亦如是，成佛已來、無量無邊百千^lb萬億那由他阿僧祇劫，為眾生故，以方便力、^lb言當滅度，亦無有能如法說我虛妄過者。」
^cb#43b10爾^lb時世尊欲重宣此義，而說偈言：
^pb79^gatha「自我得佛來，　　所經諸劫數，
　無量百千萬，　　^lb億載阿僧祇，
　常說法教化，　　無數億眾生，
　^lb令入於佛道。　　爾來無量劫，
　為度眾生故，　　^lb方便現涅槃，
　而實不滅度，　　常住此說法。
　^lb我常住於此，　　以諸神通力，
　令顛倒眾生，　　^lb雖近而不見。
　眾見我滅度，　　廣供養舍利，
　^pb80咸皆懷戀慕，　　而生渴仰心。
　眾生既信伏，　　^lb質直意柔軟，
　一心欲見佛，　　不自惜身命。
　^lb時我及眾僧，　　俱出靈鷲山，
　我時語眾生：　　^lb『常在此不滅，
　以方便力故，　　現有滅不滅。』
　^lb餘國有眾生，　　恭敬信樂者，
　我復於彼中，　　^lb為說無上法。
　汝等不聞此，　　但謂我滅度。
　^pb81我見諸眾生，　　沒在於苦惱，
　故不為現身，　　^lb令其生渴仰，
　因其心戀慕，　　乃出為說法。
　^lb神通力如是，　　於阿僧祇劫，
　常在靈鷲山，　　^lb及餘諸住處。
　眾生見劫盡，　　大火所燒時，
　^lb我此土安隱，　　天人常充滿。
　園林諸堂閣，　　^lb種種寶莊嚴，
　寶樹多花菓，　　眾生所遊樂。
　^pb82諸天擊天鼓，　　常作眾伎樂，
　雨曼陀羅花，　　^lb散佛及大眾。
　我淨土不毀，　　而眾見燒盡，
　^lb憂怖諸苦惱，　　如是悉充滿。
　是諸罪眾生，　　^lb以惡業因緣，
　過阿僧祇劫，　　不聞三寶名。
　^lb諸有修功德，　　柔和質直者，
　則皆見我身，　　^lb在此而說法。
　或時為此眾，　　說佛壽無量，
　^pb83久乃見佛者，　　為說佛難值。
　我智力如是，　　^lb慧光照無量，
　壽命無數劫，　　久修業所得。
　^lb汝等有智者，　　勿於此生疑，
　當斷令永盡，　　^lb佛語實不虛。
　如醫善方便，　　為治狂子故，
　^lb實在而言死，　　無能說虛妄。
　我亦為世父，　　^lb救諸苦患者，
　為凡夫顛倒，　　實在而言滅。
　^pb84以常見我故，　　而生憍恣心，
　放逸著五欲，　　^lb墮於惡道中。
　我常知眾生，　　行道不行道，
　^lb隨所應可度，　　為說種種法。
　每自作是意，　　^lb以何令眾生，
　得入無上慧，　　速成就佛身。」
^ck17〔別功德品第十七〕
^lb^cb#44a06爾時大會，聞佛說壽命劫數長遠如是，無量^pb85無邊阿僧祇眾生得大饒益。
於時世尊告彌^lb勒菩薩摩訶薩：「阿逸多！我說是如來壽命長^lb遠時，六百八十萬億那由他恒河沙眾生，得^lb無生法忍；
復有千倍菩薩摩訶薩，得聞持陀^lb羅尼門；
復有一世界微塵數菩薩摩訶薩，得^lb樂說無礙辯才；
復有一世界微塵數菩薩摩^pb86訶薩，得百千萬億無量旋陀羅尼；
復有三千^lb大千世界微塵數菩薩摩訶薩，能轉不退法^lb輪；
復有二千中國土微塵數菩薩摩訶薩，能^lb轉清淨法輪；
復有小千國土微塵數菩薩摩^lb訶薩，八生當得阿耨多羅三藐三菩提；
復有^lb四四天下微塵數菩薩摩訶薩，四生當得阿^pb87耨多羅三藐三菩提；
復有三四天下微塵數^lb菩薩摩訶薩，三生當得阿耨多羅三藐三菩^lb提；
復有二四天下微塵數菩薩摩訶薩，二生^lb當得阿耨多羅三藐三菩提；
復有一四天下^lb微塵數菩薩摩訶薩，一生當得阿耨多羅三^lb藐三菩提；
復有八世界微塵數眾生，皆發阿^pb88耨多羅三藐三菩提心。」
^cb#44a25佛說是諸菩薩摩訶^lb薩得大法利時，於虛空中，雨曼陀羅華、摩訶^lb曼陀羅華，以散無量百千萬億眾寶樹下、師子^lb座上諸佛，并散七寶塔中師子座上釋迦牟^lb尼佛及久滅度多寶如來，亦散一切諸大菩^lb薩及四部眾。
又雨細末栴檀、沈水香等。於虛^pb89空中，天鼓自鳴，妙聲深遠。又雨千種天衣，垂^lb諸瓔珞、真珠瓔珞、摩尼珠瓔珞、如意珠瓔珞，^lb遍於九方。
眾寶香爐燒無價香，自然周至，供^lb養大會。
一一佛上，有諸菩薩，執持幡蓋，次第^lb而上，至于梵天。
是諸菩薩，以妙音聲，歌無量^lb頌，讚歎諸佛。
^cb#44b08爾時彌勒菩薩從座而起，偏袒^pb90右肩，合掌向佛，而說偈言：
^lb^gatha「佛說希有法，　　昔所未曾聞，
　世尊有大力，　　^lb壽命不可量。
　無數諸佛子，　　聞世尊分別，
　^lb說得法利者，　　歡喜充遍身。
　或住不退地，　　^lb或得陀羅尼，
　或無礙樂說，　　萬億旋總持。
　^lb或有大千界，　　微塵數菩薩，
　各各皆能轉，　　^pb91不退之法輪。
　復有中千界，　　微塵數菩薩，
　^lb各各皆能轉，　　清淨之法輪。
　復有小千界，　　^lb微塵數菩薩，
　餘各八生在，　　當得成佛道。
　^lb復有四三二，　　如此四天下，
　微塵諸菩薩，　　^lb隨數生成佛。
　或一四天下，　　微塵數菩薩，
　^lb餘有一生在，　　當成一切智。
　如是等眾生，　　^pb92聞佛壽長遠，
　得無量無漏，　　清淨之果報。
　^lb復有八世界，　　微塵數眾生，
　聞佛說壽命，　　^lb皆發無上心。
　世尊說無量，　　不可思議法，
　^lb多有所饒益，　　如虛空無邊。
　雨天曼陀羅、　　^lb摩訶曼陀羅，
　釋梵如恒沙，　　無數佛土來。
　^lb雨栴檀沈水，　　繽紛而亂墜，
　如鳥飛空下，　　^pb93供散於諸佛。
　天鼓虛空中，　　自然出妙聲，
　^lb天衣千萬種，　　旋轉而來下。
　眾寶妙香爐，　　^lb燒無價之香，
　自然悉周遍、　　供養諸世尊。
　^lb其大菩薩眾，　　執七寶幡蓋，
　高妙萬億種，　　^lb次第至梵天。
　一一諸佛前，　　寶幢懸勝幡，
　^lb亦以千萬偈、　　歌詠諸如來。
　如是種種事，　　^pb94昔所未曾有，
　聞佛壽無量，　　一切皆歡喜。
　^lb佛名聞十方，　　廣饒益眾生，
　一切具善根，　　^lb以助無上心。」
^lb^cb#44c19爾時佛告彌勒菩薩摩訶薩：「阿逸多！其有眾^lb生，聞佛壽命長遠如是，乃至能生一念信解，^lb所得功德，無有限量。
若有善男子、善女人，為^pb95阿耨多羅三藐三菩提故，於八十萬億那由^lb他劫，行五波羅蜜——檀波羅蜜、尸羅波羅蜜、羼^lb提波羅蜜、毘梨耶波羅蜜、禪波羅蜜——除般若^lb波羅蜜，以是功德比前功德，百分、千分、百千^lb萬億分、不及其一，乃至算數譬喻所不能知。
^lb若善男子、善女人，有如是功德，於阿耨多羅^pb96三藐三菩提退者，無有是處。」
^cb#44c29爾時世尊欲重^lb宣此義，而說偈言：
^lb^gatha「若人求佛慧，　　於八十萬億，
　那由他劫數，　　^lb行五波羅蜜。
　於是諸劫中，　　布施供養佛，
　^lb及緣覺弟子，　　并諸菩薩眾。
　珍異之飲食、　　^lb上服與臥具，
　栴檀立精舍，　　以園林莊嚴。
　^pb97如是等布施，　　種種皆微妙，
　盡此諸劫數，　　^lb以迴向佛道。
　若復持禁戒，　　清淨無缺漏，
　^lb求於無上道，　　諸佛之所歎。
　若復行忍辱，　　^lb住於調柔地，
　設眾惡來加，　　其心不傾動。
　^lb諸有得法者，　　懷於增上慢，
　為此所輕惱，　　^lb如是亦能忍。
　若復懃精進，　　志念常堅固，
　^pb98於無量億劫，　　一心不懈息。
　又於無數劫，　　^lb住於空閑處，
　若坐若經行，　　除睡常攝心。
　^lb以是因緣故，　　能生諸禪定，
　八十億萬劫、　　^lb安住心不亂。
　持此一心福，　　願求無上道，
　^lb我得一切智，　　盡諸禪定際。
　是人於百千，　　^lb萬億劫數中，
　行此諸功德，　　如上之所說。
　^pb99有善男女等，　　聞我說壽命，
　乃至一念信，　　^lb其福過於彼。
　若人悉無有，　　一切諸疑悔，
　^lb深心須臾信，　　其福為如此。
　其有諸菩薩，　　^lb無量劫行道，
　聞我說壽命，　　是則能信受。
　^lb如是諸人等，　　頂受此經典，
　願我於未來，　　^lb長壽度眾生。
　如今日世尊、　　諸釋中之王，
　^pb100道場師子吼，　　說法無所畏。
　我等未來世，　　^lb一切所尊敬，
　坐於道場時，　　說壽亦如是。
　^lb若有深心者，　　清淨而質直，
　多聞能總持，　　^lb隨義解佛語，
　如是諸人等，　　於此無有疑。
^lb^cb#45b11「又，阿逸多！若有聞佛壽命長遠，解其言趣，是^lb人所得功德無有限量，能起如來無上之慧。
^pb101何況廣聞是經、若教人聞，若自持、若教人持，^lb若自書、若教人書，若以華、香、瓔珞、幢幡、繒蓋、^lb香油、酥燈，供養經卷，是人功德無量無邊，能^lb生一切種智。
^cb#45b16「阿逸多！若善男子、善女人，聞我^lb說壽命長遠，深心信解，則為見佛常在耆闍^lb崛山，共大菩薩、諸聲聞眾圍繞說法。
又見此^pb102娑婆世界，其地琉璃，坦然平正，閻浮檀金以^lb界八道，寶樹行列，諸臺樓觀皆悉寶成，其菩^lb薩眾咸處其中。
若有能如是觀者，當知是為^lb深信解相。
^cb#45b22「又復如來滅後，若聞是經而不毀^lb訾，起隨喜心，當知已為深信解相，何況讀誦、^lb受持之者，斯人則為頂戴如來。
^cb#45b25「阿逸多！是善^pb103男子、善女人，不須為我復起塔寺，及作僧坊、^lb以四事供養眾僧。
所以者何？是善男子、善女^lb人，受持讀誦是經典者，為已起塔、造立僧坊、^lb供養眾僧。
則為以佛舍利起七寶塔，高廣漸^lb小至于梵天，懸諸幡蓋及眾寶鈴，華、香、瓔珞，^lb末香、塗香、燒香，眾鼓、伎樂，簫、笛、箜篌，種種舞^pb104戲，以妙音聲歌唄讚頌，則為於無量千萬億^lb劫作是供養已。
^cb#45c05「阿逸多！若我滅後，聞是經典，^lb有能受持，若自書、若教人書，則為起立僧坊，^lb以赤栴檀作諸殿堂三十有二，高八多羅樹，^lb高廣嚴好，百千比丘於其中止，園林、浴池、經^lb行、禪窟，衣服、飲食、床褥、湯藥，一切樂具充滿^pb105其中。
如是僧坊、堂閣，若干百千萬億，其數無^lb量，以此現前供養於我及比丘僧。
是故我說：^lb『如來滅後，若有受持、讀誦、為他人說，若自書、^lb若教人書，供養經卷，不須復起塔寺，及造僧^lb坊、供養眾僧。』況復有人能持是經，兼行布施、^lb持戒、忍辱、精進、一心、智慧，其德最勝，無量無^pb106邊。
譬如虛空，東西南北、四維上下無量無邊；
^lb是人功德，亦復如是無量無邊，疾至一切種^lb智。
若人讀誦受持是經，為他人說，若自書、若^lb教人書，復能起塔，及造僧坊、供養讚歎聲聞^lb眾僧，亦以百千萬億讚歎之法讚歎菩薩功^lb德，又為他人，種種因緣隨義解說此法華經，^pb107復能清淨持戒，與柔和者而共同止，忍辱無^lb瞋，志念堅固，常貴坐禪得諸深定，精進勇猛^lb攝諸善法，利根智慧善答問難。
^cb#45c26「阿逸多！若我^lb滅後，諸善男子、善女人，受持讀誦是經典者，^lb復有如是諸善功德，當知是人已趣道場，近^lb阿耨多羅三藐三菩提，坐道樹下。
^cb#45c29「阿逸多！是^pb108善男子、善女人，若坐、若立、若行處，此中便應^lb起塔，一切天人皆應供養如佛之塔。」
^cb#46a02爾時世^lb尊欲重宣此義，而說偈言：
^lb^gatha「若我滅度後，　　能奉持此經，
　斯人福無量，　　^lb如上之所說，
　是則為具足，　　一切諸供養。
　^lb以舍利起塔，　　七寶而莊嚴，
　表剎甚高廣，　　^pb109漸小至梵天，
　寶鈴千萬億，　　風動出妙音。
　^lb又於無量劫，　　而供養此塔，
　華香諸瓔珞，　　^lb天衣眾伎樂，
　燃香油酥燈，　　周匝常照明。
　^lb惡世法末時，　　能持是經者，
　則為已如上，　　^lb具足諸供養。
　若能持此經，　　則如佛現在，
　^lb以牛頭栴檀，　　起僧坊供養。
　堂有三十二，　　^pb110高八多羅樹，
　上饌妙衣服，　　床臥皆具足，
　^lb百千眾住處，　　園林諸浴池，
　經行及禪窟，　　^lb種種皆嚴好。
　若有信解心，　　受持讀誦書，
　^lb若復教人書，　　及供養經卷，
　散華香末香，　　^lb以須曼瞻蔔、
　阿提目多伽，　　薰油常燃之。
　^lb如是供養者，　　得無量功德，
　如虛空無邊，　　^pb111其福亦如是。
　況復持此經，　　兼布施持戒，
　^lb忍辱樂禪定，　　不瞋不惡口，
　恭敬於塔廟，　　^lb謙下諸比丘，
　遠離自高心，　　常思惟智慧，
　^lb有問難不瞋，　　隨順為解說，
　若能行是行，　　^lb功德不可量。
　若見此法師，　　成就如是德，
　^lb應以天華散，　　天衣覆其身，
　頭面接足禮，　　^pb112生心如佛想。
　又應作是念：　　『不久詣道樹，
　^lb得無漏無為，　　廣利諸人天。』
　其所住止處，　　^lb經行若坐臥，
　乃至說一偈，　　是中應起塔，
　^lb莊嚴令妙好，　　種種以供養。
　佛子住此地，　　^lb則是佛受用，
　常在於其中，　　經行及坐臥。」
^lb妙法蓮華經卷第五
^pb1^folio#sdpdrk6^bk#sdpdrk6<hidden=1>【妙法蓮華經卷第六】^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck18〔隨喜功德品第十八〕
^cb#46b22爾時，彌勒菩薩摩訶薩白佛言：「世尊！若有善^lb男子、善女人，聞是法華經隨喜者，得幾所福？」
^lb^cb#46b24而說偈言：
^pb2^gatha「世尊滅度後，　　其有聞是經，
　若能隨喜者，　　^lb為得幾所福？」
^lb^cb#46b27爾時，佛告彌勒菩薩摩訶薩：「阿逸多！如來滅^lb後，若比丘、比丘尼、優婆塞、優婆夷，及餘智者^lb若長若幼，聞是經隨喜已，從法會出，至於餘^lb處，若在僧坊，若空閑地，若城邑、巷陌、聚落、田^pb3里，如其所聞，為父母、宗親、善友、知識，隨力演^lb說。
是諸人等，聞已隨喜，復行轉教；餘人聞已，^lb亦隨喜轉教。如是展轉，至第五十。
^cb#46c04「阿逸多！其^lb第五十善男子、善女人，隨喜功德，我今說之，^lb汝當善聽。
若四百萬億阿僧祇世界，六趣四^lb生眾生——卵生、胎生、濕生、化生，若有形、無形，有^pb4想、無想，非有想、非無想，無足、二足、四足、多足，^lb如是等在眾生數者——有人求福，隨其所欲娛^lb樂之具，皆給與之。
一一眾生，與滿閻浮提金、^lb銀、琉璃、車璩馬腦、珊瑚、虎珀，諸妙珍寶，及象、^lb馬車乘，七寶所成宮殿樓閣等。
是大施主，如^lb是布施滿八十年已，而作是念：『我已施眾生^pb5娛樂之具，隨意所欲，然此眾生，皆已衰老年^lb過八十，髮白面皺，將死不久，我當以佛法而^lb訓導之。』
即集此眾生，宣布法化，示教利喜，一^lb時皆得須陀洹道、斯陀含道、阿那含道、阿羅^lb漢道，盡諸有漏，於深禪定皆得自在，具八解^lb脫。
於汝意云何，是大施主所得功德寧為多^pb6不？」
^cb#46c20彌勒白佛言：「世尊！是人功德甚多，無量無^lb邊。
若是施主，但施眾生一切樂具，功德無量；^lb何況令得阿羅漢果。」
^cb#46c23佛告彌勒：「我今分明語^lb汝，是人以一切樂具，施於四百萬億阿僧祇^lb世界六趣眾生，又令得阿羅漢果，所得功德，^lb不如是第五十人，聞法華經一偈隨喜功德，^pb7百分、千分、百千萬億分、不及其一，乃至算數^lb譬喻所不能知。
^cb#46c28「阿逸多！如是第五十人展轉^lb聞法華經隨喜功德，尚無量無邊阿僧祇，何^lb況最初於會中聞而隨喜者，其福復勝，無量^lb無邊阿僧祇，不可得比。
^cb#47a02「又，阿逸多！若人為是^lb經故，往詣僧坊，若坐、若立須臾聽受，緣是功^pb8德，轉身所生，得好上妙象、馬車乘、珍寶輦輿，^lb及乘天宮。
若復有人於講法處坐，更有人來，^lb勸令坐聽，若分座令坐，是人功德，轉身得帝^lb釋坐處，若梵王坐處，若轉輪聖王所坐之處。
^lb^cb#47a08「阿逸多！若復有人，語餘人言：『有經，名法華，可^lb共往聽。』即受其教，乃至須臾間聞，是人功德，^pb9轉身得與陀羅尼菩薩共生一處，利根智慧，^lb百千萬世終不瘖瘂，口氣不臭，舌常無病，口^lb亦無病，齒不垢黑、不黃、不踈，亦不缺落，不差、^lb不曲，脣不下垂亦不褰縮、不麁澁、不瘡胗，亦^lb不缺壞，亦不喎斜，不厚、不大，亦不黧黑，無諸^lb可惡。
鼻不匾㔸，亦不曲戾，面色不黑，亦不狹^pb10長，亦不窊曲，無有一切不可喜相。
脣舌牙齒^lb悉皆嚴好，鼻修高直，面貌圓滿，眉高而長，額^lb廣平正，人相具足，世世所生，見佛聞法、信受^lb教誨。
^cb#47a20「阿逸多！汝且觀是，勸於一人令往聽法，^lb功德如此，何況一心聽說、讀誦，而於大眾為^lb人分別、如說修行？」
^cb#47a23爾時世尊欲重宣此義，而^pb11說偈言：
^lb^gatha「若人於法會，　　得聞是經典，
　乃至於一偈，　　^lb隨喜為他說，
　如是展轉教，　　至于第五十，
　^lb最後人獲福，　　今當分別之。
　如有大施主，　　^lb供給無量眾，
　具滿八十歲，　　隨意之所欲。
　^lb見彼衰老相，　　髮白而面皺，
　齒踈形枯竭，　　^pb12念其死不久，
　我今應當教，　　令得於道果。
　^lb即為方便說，　　涅槃真實法，
　世皆不牢固，　　^lb如水沫泡焰，
　汝等咸應當，　　疾生厭離心。
　^lb諸人聞是法，　　皆得阿羅漢，
　具足六神通，　　^lb三明八解脫。
　最後第五十，　　聞一偈隨喜，
　^lb是人福勝彼，　　不可為譬喻。
　如是展轉聞，　　^pb13其福尚無量，
　何況於法會，　　初聞隨喜者。
　^lb若有勸一人，　　將引聽法華，
　言此經深妙，　　^lb千萬劫難遇，
　即受教往聽，　　乃至須臾聞，
　^lb斯人之福報，　　今當分別說。
　世世無口患，　　^lb齒不踈黃黑，
　脣不厚褰缺，　　無有可惡相，
　^lb舌不乾黑短，　　鼻高修且直，
　額廣而平正，　　^pb14面目悉端嚴，
　為人所喜見，　　口氣無臭穢，
　^lb優鉢華之香、　　常從其口出。
　若故詣僧坊，　　^lb欲聽法華經，
　須臾聞歡喜，　　今當說其福。
　^lb後生天人中，　　得妙象馬車，
　珍寶之輦輿，　　^lb及乘天宮殿。
　若於講法處，　　勸人坐聽經，
　^lb是福因緣得，　　釋梵轉輪座。
　何況一心聽，　　^pb15解說其義趣，
　如說而修行，　　其福不可量。」
^lb^ck19〔法師功德品第十九〕
^lb^cb#47c03爾時佛告常精進菩薩摩訶薩：「若善男子、善^lb女人，受持是法華經，若讀、若誦、若解說、若書^lb寫，是人當得八百眼功德、千二百耳功德、八^lb百鼻功德、千二百舌功德、八百身功德、千二^pb16百意功德，以是功德、莊嚴六根，皆令清淨。
是^lb善男子、善女人，父母所生清淨肉眼，見於三^lb千大千世界內外所有山林河海，下至阿鼻^lb地獄，上至有頂，亦見其中一切眾生，及業因^lb緣、果報生處，悉見悉知。」
^cb#47c11爾時世尊欲重宣此^lb義，而說偈言：
^pb17^gatha「若於大眾中，　　以無所畏心、
　說是法華經，　　^lb汝聽其功德。
　是人得八百、　　功德殊勝眼，
　^lb以是莊嚴故，　　其目甚清淨。
　父母所生眼，　　^lb悉見三千界，
　內外彌樓山，　　須彌及鐵圍，
　^lb并諸餘山林、　　大海江河水，
　下至阿鼻獄，　　^lb上至有頂處，
　其中諸眾生，　　一切皆悉見。
　^pb18雖未得天眼，　　肉眼力如是。
^lb^cb#47c23「復次，常精進！若善男子、善女人，受持此經，若^lb讀、若誦、若解說、若書寫，得千二百耳功德。
以^lb是清淨耳，聞三千大千世界，下至阿鼻地獄，^lb上至有頂，其中內外種種語言音聲——
象聲、馬^lb聲、牛聲、車聲，啼哭聲、愁歎聲，螺聲、鼓聲、鐘聲、^pb19鈴聲，笑聲、語聲，男聲、女聲、童子聲、童女聲，法^lb聲、非法聲，苦聲、樂聲，凡夫聲、聖人聲，喜聲、不^lb喜聲，天聲、龍聲、夜叉聲、乾闥婆聲、阿修羅聲、^lb迦樓羅聲、緊那羅聲、摩睺羅伽聲，火聲、水聲、^lb風聲，地獄聲、畜生聲、餓鬼聲，比丘聲、比丘尼^lb聲，聲聞聲、辟支佛聲，菩薩聲、佛聲——
以要言之，^pb20三千大千世界中一切內外所有諸聲，雖未^lb得天耳，以父母所生清淨常耳，皆悉聞知，如^lb是分別種種音聲而不壞耳根。」
^cb#48a08爾時世尊欲^lb重宣此義，而說偈言：
^lb^gatha「父母所生耳，　　清淨無濁穢，
　以此常耳聞，　　^lb三千世界聲。
　象馬車牛聲，　　鍾鈴螺鼓聲，
　^pb21琴瑟箜篌聲，　　簫笛之音聲，
　清淨好歌聲，　　^lb聽之而不著，
　無數種人聲，　　聞悉能解了。
　^lb又聞諸天聲，　　微妙之歌音，
　及聞男女聲，　　^lb童子童女聲。
　山川嶮谷中，　　迦陵頻伽聲，
　^lb命命等諸鳥，　　悉聞其音聲。
　地獄眾苦痛，　　^lb種種楚毒聲，
　餓鬼飢渴逼，　　求索飲食聲，
　^pb22諸阿修羅等，　　居在大海邊，
　自共語言時，　　^lb出于大音聲。
　如是說法者，　　安住於此間，
　^lb遙聞是眾聲，　　而不壞耳根。
　十方世界中，　　^lb禽獸鳴相呼，
　其說法之人，　　於此悉聞之。
　^lb其諸梵天上，　　光音及遍淨，
　乃至有頂天，　　^lb言語之音聲，
　法師住於此，　　悉皆得聞之。
　^pb23一切比丘眾，　　及諸比丘尼，
　若讀誦經典，　　^lb若為他人說，
　法師住於此，　　悉皆得聞之。
　^lb復有諸菩薩，　　讀誦於經法，
　若為他人說，　　^lb撰集解其義，
　如是諸音聲，　　悉皆得聞之。
　^lb諸佛大聖尊，　　教化眾生者，
　於諸大會中，　　^lb演說微妙法，
　持此法華者，　　悉皆得聞之。
　^pb24三千大千界，　　內外諸音聲，
　下至阿鼻獄，　　^lb上至有頂天，
　皆聞其音聲，　　而不壞耳根，
　^lb其耳聰利故，　　悉能分別知。
　持是法花者，　　^lb雖未得天耳，
　但用所生耳，　　功德已如是。
^lb^cb#48b16「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦、若解說、若書寫，成就八百鼻功德。
以^pb25是清淨鼻根，聞於三千大千世界上下內外^lb種種諸香——
須曼那華香、闍提華香、末利華香、^lb瞻蔔華香、波羅羅華香，赤蓮華香、青蓮華香、^lb白蓮華香，華樹香、菓樹香，栴檀香、沈水香、多^lb摩羅跋香、多伽羅香，及千萬種和香，若末、若^lb丸、若塗香——
持是經者，於此間住，悉能分別。又^pb26復別知眾生之香——
象香、馬香、牛羊等香，男香、^lb女香、童子香、童女香，及草木叢林香——
若近、若^lb遠、所有諸香，悉皆得聞，分別不錯。
持是經者，^lb雖住於此，亦聞天上諸天之香——波利質多羅、^lb拘鞞陀羅樹香，及曼陀羅華香、摩訶曼陀羅^lb華香、曼殊沙華香、摩訶曼殊沙華香、栴檀、沈^pb27水、種種末香，諸雜華香——如是等天香和合所^lb出之香，無不聞知。
又聞諸天身香——釋提桓因^lb在勝殿上，五欲娛樂嬉戲時香；若在妙法堂^lb上，為忉利諸天說法時香；若於諸園遊戲時^lb香；及餘天等男女身香，皆悉遙聞。
如是展轉^lb乃至梵世，上至有頂諸天身香，亦皆聞之，并^pb28聞諸天所燒之香。
及聲聞香、辟支佛香、菩薩^lb香、諸佛身香，亦皆遙聞，知其所在。
雖聞此香，^lb然於鼻根不壞不錯，若欲分別為他人說，憶^lb念不謬。」
^cb#48c11爾時世尊欲重宣此義，而說偈言：
^lb^gatha「是人鼻清淨，　　於此世界中，
　若香若臭物，　　^lb種種悉聞知。
　須曼那闍提、　　多摩羅栴檀、
　^pb29沈水及桂香，　　種種華菓香，
　及知眾生香，　　^lb男子女人香，
　說法者遠住，　　聞香知所在。
　^lb大勢轉輪王，　　小轉輪及子，
　群臣諸宮人，　　^lb聞香知所在。
　身所著珍寶，　　及地中寶藏，
　^lb轉輪王寶女，　　聞香知所在。
　諸人嚴身具，　　^lb衣服及瓔珞，
　種種所塗香，　　聞香知其身。
　^pb30諸天若行坐，　　遊戲及神變，
　持是法華者，　　^lb聞香悉能知。
　諸樹華菓實，　　及酥油香氣，
　^lb持經者住此，　　悉知其所在。
　諸山深嶮處，　　^lb栴檀樹花敷，
　眾生在中者，　　聞香皆能知。
　^lb鐵圍山大海，　　地中諸眾生，
　持經者聞香，　　^lb悉知其所在。
　阿修羅男女，　　及其諸眷屬，
　^pb31鬪諍遊戲時，　　聞香皆能知。
　曠野險隘處，　　^lb師子象虎狼，
　野牛水牛等，　　聞香知所在。
　^lb若有懷妊者，　　未辯其男女，
　無根及非人，　　^lb聞香悉能知。
　以聞香力故，　　知其初懷妊，
　^lb成就不成就，　　安樂產福子。
　以聞香力故，　　^lb知男女所念，
　染欲癡恚心，　　亦知修善者。
　^pb32地中眾伏藏，　　金銀諸珍寶，
　銅器之所盛，　　^lb聞香悉能知。
　種種諸瓔珞，　　無能識其價，
　^lb聞香知貴賤，　　出處及所在。
　天上諸華等，　　^lb曼陀曼殊沙、
　波利質多樹，　　聞香悉能知。
　^lb天上諸宮殿，　　上中下差別，
　眾寶花莊嚴，　　^lb聞香悉能知。
　天園林勝殿，　　諸觀妙法堂，
　^pb33在中而娛樂，　　聞香悉能知。
　諸天若聽法，　　^lb或受五欲時，
　來往行坐臥，　　聞香悉能知。
　^lb天女所著衣，　　好華香莊嚴，
　周旋遊戲時，　　^lb聞香悉能知。
　如是展轉上，　　乃至於梵世，
　^lb入禪出禪者，　　聞香悉能知。
　光音遍淨天，　　^lb乃至于有頂，
　初生及退沒，　　聞香悉能知。
　^pb34諸比丘眾等，　　於法常精進，
　若坐若經行，　　^lb及讀誦經法，
　或在林樹下，　　專精而坐禪，
　^lb持經者聞香，　　悉知其所在。
　菩薩志堅固，　　^lb坐禪若讀誦，
　或為人說法，　　聞香悉能知。
　^lb在在方世尊，　　一切所恭敬，
　愍眾而說法，　　^lb聞香悉能知。
　眾生在佛前，　　聞經皆歡喜，
　^pb35如法而修行，　　聞香悉能知。
　雖未得菩薩，　　^lb無漏法生鼻，
　而是持經者，　　先得此鼻相。」
^lb^cb#49b15「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦、若解說、若書寫，得千二百舌功德。
若^lb好、若醜，若美、不美，及諸苦澁物，在其舌根，皆^lb變成上味，如天甘露，無不美者。
若以舌根於^pb36大眾中有所演說，出深妙聲，能入其心，皆令^lb歡喜快樂。
又諸天子、天女，釋梵諸天，聞是深^lb妙音聲，有所演說言論次第，皆悉來聽。
及諸^lb龍、龍女，夜叉、夜叉女，乾闥婆、乾闥婆女，阿修^lb羅、阿修羅女，迦樓羅、迦樓羅女，緊那羅、緊那^lb羅女，摩睺羅伽、摩睺羅伽女，為聽法故，皆來^pb37親近恭敬供養。
及比丘、比丘尼，優婆塞、優婆^lb夷，國王、王子、群臣、眷屬，小轉輪王、大轉輪王、^lb七寶千子內外眷屬，乘其宮殿，俱來聽法，以^lb是菩薩善說法故。
婆羅門、居士、國內人民、盡^lb其形壽，隨侍供養。
又諸聲聞、辟支佛、菩薩、諸^lb佛，常樂見之。是人所在方面，諸佛皆向其處^pb38說法，悉能受持一切佛法，又能出於深妙法^lb音。」
^cb#49c03爾時世尊欲重宣此義，而說偈言：
^lb^gatha「是人舌根淨，　　終不受惡味，
　其有所食噉，　　^lb悉皆成甘露。
　以深淨妙聲，　　於大眾說法，
　^lb以諸因緣喻，　　引導眾生心，
　聞者皆歡喜，　　^lb設諸上供養。
　諸天龍夜叉，　　及阿修羅等，
　^pb39皆以恭敬心，　　而共來聽法，
　是說法之人，　　^lb若欲以妙音，
　遍滿三千界，　　隨意即能至。
　^lb大小轉輪王，　　及千子眷屬，
　合掌恭敬心，　　^lb常來聽受法。
　諸天龍夜叉、　　羅剎毘舍闍，
　^lb亦以歡喜心，　　常樂來供養。
　梵天王魔王，　　^lb自在大自在，
　如是諸天眾，　　常來至其所。
　^pb40諸佛及弟子，　　聞其說法音，
　常念而守護，　　^lb或時為現身。
^lb^cb#49c22「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦，若解說、若書寫，得八百身功德。得清^lb淨身、如淨琉璃，眾生憙見。其身淨故，三千大^lb千世界眾生，生時、死時，上下、好醜，生善處、惡^pb41處，悉於中現。
及鐵圍山、大鐵圍山、彌樓山、摩^lb訶彌樓山等諸山，及其中眾生，悉於中現。
下^lb至阿鼻地獄，上至有頂，所有及眾生，悉於中^lb現。
若聲聞、辟支佛、菩薩、諸佛、說法，皆於身中^lb現其色像。」
^cb#50a01爾時世尊欲重宣此義，而說偈言：
^lb^gatha「若持法花者，　　其身甚清淨，
　如彼淨琉璃，　　^pb42眾生皆憙見。
　又如淨明鏡，　　悉見諸色像，
　^lb菩薩於淨身，　　皆見世所有，
　唯獨自明了，　　^lb餘人所不見。
　三千世界中，　　一切諸群萌，
　^lb天人阿修羅、　　地獄鬼畜生，
　如是諸色像，　　^lb皆於身中現。
　諸天等宮殿，　　乃至於有頂，
　^lb鐵圍及彌樓、　　摩訶彌樓山，
　諸大海水等，　　^pb43皆於身中現。
　諸佛及聲聞，　　佛子菩薩等，
　^lb若獨若在眾，　　說法悉皆現。
　雖未得無漏，　　^lb法性之妙身，
　以清淨常體，　　一切於中現。
^lb^cb#50a18「復次，常精進！若善男子、善女人，如來滅後、受^lb持是經，若讀、若誦、若解說、若書寫，得千二百^lb意功德。
以是清淨意根，乃至聞一偈一句，通^pb44達無量無邊之義，解是義已，能演說一句一^lb偈至於一月、四月乃至一歲，諸所說法，隨其^lb義趣，皆與實相不相違背。
若說俗間經書、治^lb世語言、資生業等，皆順正法。
三千大千世界^lb六趣眾生，心之所行、心所動作、心所戲論，皆^lb悉知之。
雖未得無漏智慧，而其意根、清淨如^pb45此。是人有所思惟、籌量、言說，皆是佛法，無不^lb真實，亦是先佛經中所說。」
^cb#50a29爾時世尊欲重宣^lb此義，而說偈言：
^lb^gatha「是人意清淨，　　明利無穢濁，
　以此妙意根，　　^lb知上中下法，
　乃至聞一偈，　　通達無量義，
　^lb次第如法說，　　月四月至歲。
　是世界內外，　　^pb46一切諸眾生，
　若天龍及人、　　夜叉鬼神等，
　^lb其在六趣中，　　所念若干種，
　持法花之報，　　^lb一時皆悉知。
　十方無數佛，　　百福莊嚴相，
　^lb為眾生說法，　　悉聞能受持。
　思惟無量義，　　^lb說法亦無量，
　終始不忘錯，　　以持法華故。
　^lb悉知諸法相，　　隨義識次第，
　達名字語言，　　^pb47如所知演說。
　此人有所說，　　皆是先佛法，
　^lb以演此法故，　　於眾無所畏。
　持法花經者，　　^lb意根淨若斯，
　雖未得無漏，　　先有如是相。
　^lb是人持此經，　　安住希有地，
　為一切眾生，　　^lb歡喜而愛敬。
　能以千萬種，　　善巧之語言，
　^lb分別而說法，　　持法花經故。」
^pb48^ck20〔常不輕菩薩品第二十〕
^lb^cb#50b24爾時，佛告得大勢菩薩摩訶薩：「汝今當知！若^lb比丘、比丘尼、優婆塞、優婆夷持法花經者，若^lb有惡口、罵詈、誹謗，獲大罪報，如前所說；其所^lb得功德，如向所說，眼、耳、鼻、舌、身、意清淨。
^cb#50b28「得大^lb勢！乃往古昔，過無量無邊不可思議阿僧祇^pb49劫，有佛名威音王如來、應供、正遍知、明行足、^lb善逝、世間解、無上士、調御丈夫、天人師、佛、世^lb尊。劫名離衰，國名大成。其威音王佛，於彼世^lb中，為天、人、阿修羅說法，為求聲聞者，說應四^lb諦法，度生老病死，究竟涅槃；為求辟支佛者，^lb說應十二因緣法；為諸菩薩，因阿耨多羅三^pb50藐三菩提，說應六波羅蜜法，究竟佛慧。
^cb#50c07「得大^lb勢！是威音王佛，壽四十萬億那由他恒河沙^lb劫；正法住世劫數，如一閻浮提微塵；像法住^lb世劫數，如四天下微塵。其佛饒益眾生已，然^lb後滅度。正法、像法滅盡之後，於此國土復有^lb佛出，亦號威音王如來、應供、正遍知、明行足、^pb51善逝、世間解、無上士、調御丈夫、天人師、佛、世^lb尊。如是次第有二萬億佛，皆同一號。
^cb#50c14「最初威^lb音王如來既已滅度，正法滅後，於像法中，增^lb上慢比丘有大勢力。
爾時有一菩薩比丘名^lb常不輕。得大勢！以何因緣名常不輕？是比丘，^lb凡有所見——若比丘、比丘尼、優婆塞、優婆夷——^pb52皆悉禮拜讚歎而作是言：『我深敬汝等，不敢輕^lb慢。
所以者何？汝等皆行菩薩道，當得作佛。』
而^lb是比丘，不專讀誦經典，但行禮拜，乃至遠見^lb四眾，亦復故往禮拜讚歎而作是言：『我不敢^lb輕於汝等，汝等皆當作佛。』
四眾之中，有生瞋^lb恚、心不淨者，惡口罵詈言：『是無智比丘從何^pb53所來？自言：「我不輕汝。」而與我等授記，當得作^lb佛。我等不用如是虛妄授記。』如此經歷多年，^lb常被罵詈，不生瞋恚，常作是言：『汝當作佛。』
說^lb是語時，眾人或以杖木瓦石而打擲之，避走^lb遠住，猶高聲唱言：
『我不敢輕於汝等，汝等皆^lb當作佛。』
以其常作是語故，增上慢比丘、比丘^pb54尼、優婆塞、優婆夷，號之為常不輕。
是比丘臨^lb欲終時，於虛空中，具聞威音王佛先所說法^lb華經二十千萬億偈，悉能受持，即得如上眼^lb根清淨、耳鼻舌身意根清淨。
得是六根清淨^lb已，更增壽命二百萬億那由他歲，廣為人說^lb是法華經。
於時增上慢四眾——比丘、比丘尼、優^pb55婆塞、優婆夷——輕賤是人，為作不輕名者，見其^lb得大神通力、樂說辯力、大善寂力，聞其所說，^lb皆信伏隨從。
是菩薩復化千萬億眾，令住阿^lb耨多羅三藐三菩提。
命終之後，得值二千億^lb佛，皆號日月燈明，於其法中，說是法華經。
以^lb是因緣，復值二千億佛，同號雲自在燈王，於^pb56此諸佛法中，受持讀誦，為諸四眾說此經典^lb故，得是常眼清淨，耳、鼻、舌、身、意諸根清淨，於^lb四眾中說法，心無所畏。
^cb#51a17「得大勢！是常不輕菩^lb薩摩訶薩，供養如是若干諸佛，恭敬、尊重、讚^lb歎、種諸善根，於後復值千萬億佛，亦於諸佛^lb法中說是經典，功德成就，當得作佛。
^cb#51a21「得大勢！^pb57於意云何？爾時常不輕菩薩豈異人乎？則我^lb身是。
若我於宿世不受持讀誦此經、為他人^lb說者，不能疾得阿耨多羅三藐三菩提。
我於^lb先佛所，受持讀誦此經、為人說故，疾得阿耨^lb多羅三藐三菩提。
^cb#51a26「得大勢！彼時四眾——比丘、比^lb丘尼、優婆塞、優婆夷——以瞋恚意輕賤我故，二^pb58百億劫常不值佛、不聞法、不見僧，千劫於阿^lb鼻地獄受大苦惱。
畢是罪已，復遇常不輕菩^lb薩，教化阿耨多羅三藐三菩提。
^cb#51b01「得大勢，於汝^lb意云何？爾時四眾常輕是菩薩者，豈異人乎？^lb今此會中跋陀婆羅等五百菩薩、師子月等^lb五百比丘、尼思佛等五百優婆塞，皆於阿耨^pb59多羅三藐三菩提不退轉者是。
^cb#51b05「得大勢！當知^lb是法華經，大饒益諸菩薩摩訶薩，能令至於^lb阿耨多羅三藐三菩提。
是故諸菩薩摩訶薩，^lb於如來滅後，常應受持、讀誦、解說、書寫是經。」
^lb^cb#51b09爾時世尊欲重宣此義，而說偈言：
^lb^gatha「過去有佛，　　號威音王，　　神智無量，
　將導一切，　　^pb60天人龍神，　　所共供養。
　是佛滅後，　　法欲盡時，　　^lb有一菩薩，
　名常不輕。　　時諸四眾，　　計著於法。
　^lb不輕菩薩，　　往到其所，　　而語之言：
『我不輕汝，　　^lb汝等行道，　　皆當作佛。』
　諸人聞已，　　輕毀罵詈；　　^lb不輕菩薩，
　能忍受之。　　其罪畢已，　　臨命終時，
　^lb得聞此經，　　六根清淨。　　神通力故，
　增益壽命，　　^pb61復為諸人，　　廣說是經。
　諸著法眾，　　皆蒙菩薩，　　^lb教化成就，
　令住佛道。　　不輕命終，　　值無數佛，
　^lb說是經故，　　得無量福，　　漸具功德，
　疾成佛道。　　^lb彼時不輕，　　則我身是。
　時四部眾，　　著法之者，　　^lb聞不輕言：
『汝當作佛。』　　以是因緣，　　值無數佛。
　^lb此會菩薩，　　五百之眾，　　并及四部，
　清信士女，　　^pb62今於我前，　　聽法者是。
　我於前世，　　勸是諸人，　　^lb聽受斯經，
　第一之法。　　開示教人，　　令住涅槃，
　^lb世世受持，　　如是經典。　　億億萬劫，
　至不可議，　　^lb時乃得聞，　　是法華經。
　億億萬劫，　　至不可議，　　^lb諸佛世尊、
　時說是經。　　是故行者，　　於佛滅後，
　^lb聞如是經，　　勿生疑惑。　　應當一心、
　廣說此經，　　^pb63世世值佛，　　疾成佛道。」
^lb^ck21〔如來神力品第二十一〕
^lb^cb#51c09爾時，千世界微塵等菩薩摩訶薩，從地踊出^lb者，皆於佛前一心合掌，瞻仰尊顏，而白佛言：^lb「世尊！我等於佛滅後，世尊分身所在國土滅^lb度之處，當廣說此經。
所以者何？我等亦自欲^pb64得是真淨大法，受持、讀誦、解說、書寫，而供養^lb之。」
^cb#51c14爾時世尊，於文殊師利等無量百千萬億^lb舊住娑婆世界菩薩摩訶薩，及諸比丘、比丘^lb尼、優婆塞、優婆夷，天、龍、夜叉、乾闥婆、阿修羅、^lb迦樓羅、緊那羅、摩睺羅伽、人非人等，一切眾^lb前，現大神力，出廣長舌上至梵世，一切毛孔^pb65放於無量無數色光，皆悉遍照十方世界。
眾^lb寶樹下、師子座上諸佛，亦復如是，出廣長舌，^lb放無量光。
釋迦牟尼佛及寶樹下諸佛現神^lb力時，滿百千歲，然後還攝舌相。
一時謦欬、俱^lb共彈指，是二音聲，遍至十方諸佛世界，地皆^lb六種震動。
其中眾生，天、龍、夜叉、乾闥婆、阿修^pb66羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，以佛^lb神力故，皆見此娑婆世界，無量無邊百千萬^lb億眾寶樹下、師子座上諸佛；及見釋迦牟尼^lb佛共多寶如來，在寶塔中、坐師子座；
又見無^lb量無邊百千萬億菩薩摩訶薩及諸四眾，恭^lb敬圍繞釋迦牟尼佛。既見是已，皆大歡喜，得^pb67未曾有。
即時諸天、於虛空中、高聲唱言：「過此^lb無量無邊百千萬億阿僧祇世界，有國名娑^lb婆，是中有佛名釋迦牟尼，今為諸菩薩摩訶^lb薩說大乘經，名妙法蓮華，教菩薩法，佛所護^lb念。
汝等當深心隨喜，亦當禮拜供養釋迦牟^lb尼佛。」
彼諸眾生，聞虛空中聲已，合掌向娑婆^pb68世界作如是言：「南無釋迦牟尼佛！南無釋迦^lb牟尼佛！」
以種種華、香、瓔珞、幡蓋，及諸嚴身之^lb具、珍寶妙物，皆共遙散娑婆世界。
所散諸物，^lb從十方來，譬如雲集，變成寶帳，遍覆此間諸^lb佛之上。
于時十方世界，通達無礙，如一佛土。
^lb^cb#52a13爾時，佛告上行等菩薩大眾：「諸佛神力如是，^pb69無量無邊、不可思議，若我以是神力，於無量^lb無邊百千萬億阿僧祇劫，為囑累故，說此經^lb功德，猶不能盡。
以要言之，如來一切所有之^lb法、如來一切自在神力、如來一切祕要之藏、^lb如來一切甚深之事，皆於此經宣示顯說。
是^lb故汝等於如來滅後，應一心受持、讀誦、解說、^pb70書寫、如說修行。
所在國土，若有受持、讀誦、解^lb說、書寫、如說修行，若經卷所住之處，若於園^lb中、若於林中、若於樹下、若於僧坊、若白衣舍、^lb若在殿堂、若山谷曠野，是中皆應起塔供養。
^lb所以者何？當知是處、即是道場，諸佛於此得^lb阿耨多羅三藐三菩提，諸佛於此轉于法輪，^pb71諸佛於此而般涅槃。」
^cb#52a27爾時世尊欲重宣此義，而說偈言：
^lb^gatha「諸佛救世者，　　住於大神通，
　為悅眾生故，　　^lb現無量神力，
　舌相至梵天，　　身放無數光，
　^lb為求佛道者，　　現此希有事。
　諸佛謦欬聲，　　^lb及彈指之聲，
　周聞十方國，　　地皆六種動。
　^pb72以佛滅度後，　　能持是經故，
　諸佛皆歡喜，　　^lb現無量神力。
　囑累是經故，　　讚美受持者，
　^lb於無量劫中，　　猶故不能盡。
　是人之功德，　　^lb無邊無有窮，
　如十方虛空，　　不可得邊際。
　^lb能持是經者，　　則為已見我，
　亦見多寶佛，　　^lb及諸分身者，
　又見我今日，　　教化諸菩薩。
　^pb73能持是經者，　　令我及分身，
　滅度多寶佛，　　^lb一切皆歡喜。
　十方現在佛，　　并過去未來，
　^lb亦見亦供養，　　亦令得歡喜。
　諸佛坐道場，　　^lb所得祕要法，
　能持是經者，　　不久亦當得。
　^lb能持是經者，　　於諸法之義，
　名字及言辭，　　^lb樂說無窮盡，
　如風於空中，　　一切無障礙。
　^pb74於如來滅後，　　知佛所說經，
　因緣及次第，　　^lb隨義如實說，
　如日月光明，　　能除諸幽冥。
　^lb斯人行世間，　　能滅眾生闇，
　教無量菩薩，　　^lb畢竟住一乘。
　是故有智者，　　聞此功德利，
　^lb於我滅度後，　　應受持斯經，
　是人於佛道，　　^lb決定無有疑。」
^pb75^ck22〔囑累品第二十二〕
^lb^cb#52c04爾時，釋迦牟尼佛從法座起，現大神力，以右^lb手摩無量菩薩摩訶薩頂，而作是言：「我於無^lb量百千萬億阿僧祇劫，修習是難得阿耨多^lb羅三藐三菩提法，今以付囑汝等。
汝等應當^lb一心流布此法，廣令增益。」
如是三摩諸菩薩^pb76摩訶薩頂，而作是言：「我於無量百千萬億阿^lb僧祇劫，修習是難得阿耨多羅三藐三菩提^lb法，今以付囑汝等。
汝等當受持、讀誦、廣宣此^lb法，令一切眾生普得聞知。
所以者何？如來有^lb大慈悲，無諸慳悋，亦無所畏，能與眾生，佛之^lb智慧、如來智慧、自然智慧，如來是一切眾生^pb77之大施主。
汝等亦應隨學如來之法，勿生慳^lb悋。
於未來世，若有善男子、善女人，信如來智^lb慧者，當為演說此法華經，使得聞知，為令其^lb人得佛慧故。
若有眾生不信受者，當於如來^lb餘深法中，示教利喜。
汝等若能如是，則為已^lb報諸佛之恩。」
^cb#52c21時諸菩薩摩訶薩，聞佛作是說^pb78已，皆大歡喜遍滿其身，益加恭敬，曲躬、低頭，^lb合掌向佛，俱發聲言：「如世尊勅，當具奉行。唯^lb然，世尊！願不有慮。」諸菩薩摩訶薩眾，如是三^lb反，俱發聲言：「如世尊勅，當具奉行。唯然，世尊！^lb願不有慮。」
^cb#52c26爾時釋迦牟尼佛令十方來諸分^lb身佛各還本土，而作是言：「諸佛各隨所安，多^pb79寶佛塔還可如故。」說是語時，十方無量分身^lb諸佛——坐寶樹下師子座上者，及多寶佛，并上^lb行等無邊阿僧祇菩薩大眾，舍利弗等聲聞^lb四眾，及一切世間天、人、阿修羅等，聞佛所說，^lb皆大歡喜。
^lb^ck23〔藥王菩薩本事品第二十三〕
^pb80^cb#53a05爾時宿王華菩薩白佛言：「世尊！藥王菩薩云^lb何遊於娑婆世界？世尊！是藥王菩薩有若干^lb百千萬億那由他難行苦行？善哉，世尊！願少^lb解說。」諸天、龍、神、夜叉、乾闥婆、阿修羅、迦樓羅、^lb緊那羅、摩睺羅伽、人非人等，又他國土諸來^lb菩薩，及此聲聞眾，聞皆歡喜。
^cb#53a10爾時佛告宿王^pb81華菩薩：「乃往過去無量恒河沙劫，有佛號日^lb月淨明德如來、應供、正遍知、明行足、善逝、世^lb間解、無上士、調御丈夫、天人師、佛、世尊。
其佛^lb有八十億大菩薩摩訶薩，七十二恒河沙大^lb聲聞眾，佛壽四萬二千劫，菩薩壽命亦等。
彼^lb國無有女人、地獄、餓鬼、畜生、阿修羅等，及以^pb82諸難；地平如掌，琉璃所成，寶樹莊嚴，寶帳覆^lb上，垂寶華幡，寶瓶香爐周遍國界，七寶為臺，^lb一樹一臺，其樹去臺盡一箭道。
此諸寶樹，皆^lb有菩薩、聲聞而坐其下。諸寶臺上，各有百億^lb諸天作天伎樂，歌歎於佛，以為供養。
爾時彼^lb佛為一切眾生喜見菩薩，及眾菩薩、諸聲聞^pb83眾，說法華經。
^cb#53a23「是一切眾生喜見菩薩，樂習苦^lb行，於日月淨明德佛法中，精進經行，一心求^lb佛，滿萬二千歲已，得現一切色身三昧。
得此^lb三昧已，心大歡喜，即作念言：『我得現一切色^lb身三昧，皆是得聞法華經力，我今當供養日^lb月淨明德佛及法華經。』即時入是三昧，於虛^pb84空中，雨曼陀羅華、摩訶曼陀羅華、細末堅黑^lb栴檀，滿虛空中，如雲而下，又雨海此岸栴檀^lb之香——此香六銖，價直娑婆世界——以供養佛。
作^lb是供養已，從三昧起，而自念言：『我雖以神力^lb供養於佛，不如以身供養。』即服諸香——栴檀、薰^lb陸、兜樓婆、畢力迦、沈水、膠香，又飲瞻蔔諸華^pb85香油，滿千二百歲已，香油塗身，於日月淨明^lb德佛前，以天寶衣而自纏身，灌諸香油，以神^lb通力願而自然身，光明遍照八十億恒河沙^lb世界。
其中諸佛同時讚言：『善哉，善哉！善男子！^lb是真精進，是名真法供養如來。
若以華、香、瓔^lb珞、燒香、末香、塗香、天繒、幡蓋及海此岸栴檀^pb86之香，如是等種種諸物供養，所不能及；假使^lb國城、妻子布施，亦所不及。
善男子！是名第一^lb之施，於諸施中最尊最上，以法供養諸如來^lb故。』
作是語已而各默然。其身火燃千二百歲，^lb過是已後，其身乃盡。
^cb#53b18「一切眾生喜見菩薩作^lb如是法供養已，命終之後，復生日月淨明德^pb87佛國中，於淨德王家結加趺坐，忽然化生。即^lb為其父而說偈言：
^lb^gatha「『大王今當知，　　我經行彼處，
　　即時得一切，　　^lb現諸身三昧。
　　勤行大精進，　　捨所愛之身，
^missing<t=供養於世尊，　　為求無上慧。』>
^lb^cb#53b26「說是偈已，而白父言：『日月淨明德佛，今故現^lb在。
我先供養佛已，得解一切眾生語言陀羅^pb88尼，復聞是法華經八百千萬億那由他甄迦^lb羅、頻婆羅、阿閦婆等偈。大王！我今當還供養^lb此佛。』白已，即坐七寶之臺，上昇虛空，高七多^lb羅樹，往到佛所，頭面禮足，合十指爪，以偈讚^lb佛：
^lb^gatha「『容顏甚奇妙，　　光明照十方，
　　我適曾供養，　　^pb89今復還親覲。』
^lb^cb#53c06「爾時，一切眾生喜見菩薩說是偈已，而白佛^lb言：『世尊！世尊猶故在世。』
爾時日月淨明德佛，^lb告一切眾生喜見菩薩：『善男子！我涅槃時到、^lb滅盡時至，汝可安施床座，我於今夜當般涅^lb槃。』又勅一切眾生喜見菩薩：『善男子！我以佛^pb90法囑累於汝及諸菩薩大弟子，并阿耨多羅^lb三藐三菩提法，亦以三千大千七寶世界諸^lb寶樹、寶臺及給侍諸天，悉付於汝。
我滅度後，^lb所有舍利亦付囑汝，當令流布，廣設供養，應^lb起若干千塔。』如是日月淨明德佛勅一切眾^lb生喜見菩薩已，於夜後分入於涅槃。
^cb#53c17「爾時，一^pb91切眾生喜見菩薩見佛滅度，悲感、懊惱，戀慕^lb於佛，即以海此岸栴檀為𧂐，供養佛身，而以^lb燒之。
火滅已後，收取舍利，作八萬四千寶瓶，^lb以起八萬四千塔，高三世界，表剎莊嚴，垂諸^lb幡蓋，懸眾寶鈴。
^cb#53c22「爾時一切眾生喜見菩薩復^lb自念言：『我雖作是供養，心猶未足，我今當更^pb92供養舍利。』便語諸菩薩大弟子及天、龍、夜叉^lb等一切大眾：『汝等當一心念，我今供養日月^lb淨明德佛舍利。』作是語已，即於八萬四千塔^lb前，燃百福莊嚴臂七萬二千歲而以供養，令^lb無數求聲聞眾、無量阿僧祇人，發阿耨多羅^lb三藐三菩提心，皆使得住現一切色身三昧。
^pb93^cb#54a01「爾時，諸菩薩、天、人、阿修羅等，見其無臂，憂惱^lb悲哀而作是言：『此一切眾生喜見菩薩，是我^lb等師，教化我者，而今燒臂，身不具足。』于時一^lb切眾生喜見菩薩，於大眾中立此誓言：『我捨^lb兩臂，必當得佛金色之身，若實不虛，令我兩^lb臂還復如故。』作是誓已，自然還復，由斯菩薩^pb94福德智慧淳厚所致。
當爾之時，三千大千世^lb界六種震動，天雨寶華，一切人、天得未曾有。」
^lb^cb#54a09佛告宿王華菩薩：「於汝意云何？一切眾生喜^lb見菩薩，豈異人乎？今藥王菩薩是也。
其所捨^lb身布施，如是無量百千萬億那由他數。
^cb#54a12「宿王^lb華！若有發心欲得阿耨多羅三藐三菩提者，^pb95能燃手指，乃至足一指，供養佛塔，勝以國城、^lb妻子，及三千大千國土山林河池、諸珍寶物、^lb而供養者，若復有人，以七寶滿三千大千世^lb界，供養於佛，及大菩薩、辟支佛、阿羅漢，是人^lb所得功德，不如受持此法華經，乃至一四句^lb偈，其福最多。
^cb#54a19「宿王華！譬如一切川流江河，諸^pb96水之中海為第一；此法華經亦復如是，於諸^lb如來所說經中，最為深大。
又如土山、黑山、小^lb鐵圍山、大鐵圍山及十寶山，眾山之中，須彌^lb山為第一；
此法華經亦復如是，於諸經中最^lb為其上。又如眾星之中，月天子最為第一；此^lb法華經亦復如是，於千萬億種諸經法中最^pb97為照明。
又如日天子能除諸闇；此經亦復如^lb是，能破一切不善之闇。
又如諸小王中，轉輪^lb聖王最為第一；此經亦復如是，於眾經中最^lb為其尊。
又如帝釋、於三十三天中王，此經亦^lb復如是，諸經中王。
又如大梵天王，一切眾生^lb之父；此經亦復如是，一切賢聖，學、無學，及發^pb98菩薩心者之父。
又如一切凡夫人中，須陀洹、^lb斯陀含、阿那含、阿羅漢、辟支佛為第一；此經^lb亦復如是，一切如來所說、若菩薩所說、若聲^lb聞所說，諸經法中，最為第一。
有能受持是經^lb典者，亦復如是，於一切眾生中、亦為第一。
一^lb切聲聞、辟支佛中，菩薩為第一；此經亦復如^pb99是，於一切諸經法中、最為第一。
如佛為諸法^lb王；此經亦復如是，諸經中王。
^cb#54b11「宿王華！此經能^lb救一切眾生者，此經能令一切眾生離諸苦^lb惱，此經能大饒益一切眾生，充滿其願。
如清^lb涼池！能滿一切諸渴乏者，如寒者得火，如裸^lb者得衣，如商人得主，如子得母，如渡得船，如^pb100病得醫，如暗得燈，如貧得寶，如民得王，如賈^lb客得海，如炬除暗；此法華經亦復如是，能令^lb眾生離一切苦、一切病痛，能解一切生死之^lb縛。
若人得聞此法華經，若自書、若使人書，所^lb得功德，以佛智慧籌量多少，不得其邊。
若書^lb是經卷，華、香、瓔珞、燒香、末香、塗香，幡蓋、衣服，^pb101種種之燈——酥燈、油燈、諸香油燈、瞻蔔油燈、須^lb曼那油燈、波羅羅油燈、婆利師迦油燈、那婆^lb摩利油燈——供養，所得功德，亦復無量。
^cb#54b26「宿王華！^lb若有人聞是藥王菩薩本事品者，亦得無量^lb無邊功德。
若有女人聞是藥王菩薩本事品，^lb能受持者，盡是女身，後不復受。
若如來滅後^pb102後五百歲中，若有女人聞是經典，如說修行。
^lb於此命終，即往安樂世界，阿彌陀佛、大菩薩^lb眾，圍繞住處，生蓮華中，寶座之上，不復為貪^lb欲所惱，亦復不為瞋恚愚癡所惱，亦復不為^lb憍慢嫉妬諸垢所惱，得菩薩神通、無生法忍。
^lb得是忍已，眼根清淨，以是清淨眼根，見七百^pb103萬二千億那由他恒河沙等諸佛如來。
是時^lb諸佛遙共讚言：『善哉，善哉！善男子！汝能於釋^lb迦牟尼佛法中，受持讀誦思惟是經，為他人^lb說，所得福德無量無邊，火不能燒，水不能漂，^lb汝之功德，千佛共說不能令盡。
汝今已能破^lb諸魔賊，壞生死軍，諸餘怨敵皆悉摧滅。
善男^pb014子！百千諸佛，以神通力共守護汝，於一切世^lb間天、人之中無如汝者，唯除如來，其諸聲聞、^lb辟支佛、乃至菩薩，智慧禪定無有與汝等者。』^lb宿王華！此菩薩成就如是功德智慧之力。
若^lb有人聞是藥王菩薩本事品，能隨喜讚善者，^lb是人現世口中常出青蓮華香，身毛孔中常^pb105出牛頭栴檀之香，所得功德，如上所說。
是故，^lb宿王華！以此藥王菩薩本事品囑累於汝。
我^lb滅度後後五百歲中，廣宣流布於閻浮提，無^lb令斷絕，惡魔、魔民、諸天、龍、夜叉、鳩槃茶等，得^lb其便也。
^cb#54c23「宿王華！汝當以神通之力守護是經。
^lb所以者何？此經則為閻浮提人，病之良藥。若^pb106人有病，得聞是經，病即消滅，不老不死。宿王^lb華！汝若見有受持是經者，應以青蓮花盛滿^lb末香，供散其上。
散已，作是念言：『此人不久必^lb當取草坐於道場，破諸魔軍，當吹法螺、擊大^lb法鼓，度脫一切眾生老病死海。』是故求佛道^lb者、見有受持是經典人，應當如是生恭敬心。」
^pb107^cb#55a03說是藥王菩薩本事品時，八萬四千菩薩得^lb解一切眾生語言陀羅尼。
多寶如來於寶塔^lb中讚宿王華菩薩言：「善哉，善哉！宿王華！汝成^lb就不可思議功德，乃能問釋迦牟尼佛如此^lb之事，利益無量一切眾生。」
^lb妙法蓮華經卷第六
^pb1^folio#sdpdrk7^bk#sdpdrk7<hidden=1>【妙法蓮華經卷第七】^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck24〔妙音菩薩品第二十四〕
^lb^cb#55a17爾時釋迦牟尼佛放大人相肉髻光明，及放^lb眉間白毫相光，遍照東方百八萬億那由他^lb恒河沙等諸佛世界。
過是數已，有世界名淨^pb2光莊嚴，其國有佛，號淨華宿王智如來、應供、^lb正遍知、明行足、善逝、世間解、無上士、調御丈^lb夫、天人師、佛、世尊，為無量無邊菩薩大眾恭^lb敬圍繞而為說法，釋迦牟尼佛白毫光明遍^lb照其國。
爾時一切淨光莊嚴國中，有一菩薩名^lb曰妙音，久已殖眾德本，供養親近無量百^pb3千萬億諸佛，而悉成就甚深智慧，得妙幢相^lb三昧、法華三昧、淨德三昧、宿王戲三昧、無緣^lb三昧、智印三昧、解一切眾生語言三昧、集一^lb切功德三昧、清淨三昧、神通遊戲三昧、慧炬^lb三昧、莊嚴王三昧、淨光明三昧、淨藏三昧、不^lb共三昧、日旋三昧，得如是等百千萬億恒河^pb4沙等諸大三昧。
釋迦牟尼佛光照其身，即白^lb淨華宿王智佛言：「世尊！我當往詣娑婆世界，^lb禮拜、親近、供養釋迦牟尼佛，及見文殊師利^lb法王子菩薩、藥王菩薩、勇施菩薩、宿王華菩^lb薩、上行意菩薩、莊嚴王菩薩、藥上菩薩。」
^cb#55b08爾時^lb淨華宿王智佛告妙音菩薩：「汝莫輕彼國，生^pb5下劣想。
善男子！彼娑婆世界，高下不平，土石^lb諸山，穢惡充滿，佛身卑小，諸菩薩眾其形亦^lb小。
而汝身四萬二千由旬，我身六百八十萬^lb由旬，汝身第一端正，百千萬福，光明殊妙，是^lb故汝往、莫輕彼國——若佛、菩薩及國土，生下劣^lb想。」
^cb#55b14妙音菩薩白其佛言：「世尊！我今詣娑婆世^pb6界，皆是如來之力，如來神通遊戲，如來功德^lb智慧莊嚴。」於是妙音菩薩不起于座，身不動^lb搖，而入三昧，以三昧力，於耆闍崛山，去法座^lb不遠，化作八萬四千眾寶蓮華，閻浮檀金為^lb莖，白銀為葉，金剛為鬚，甄叔迦寶以為其臺。
^lb^cb#55b21爾時，文殊師利法王子見是蓮華，而白佛言：^pb7「世尊！是何因緣，先現此瑞？有若干千萬蓮華，^lb閻浮檀金為莖，白銀為葉，金剛為鬚，甄叔迦^lb寶以為其臺。」
^cb#55b24爾時釋迦牟尼佛告文殊師利：^lb「是妙音菩薩摩訶薩，欲從淨華宿王智佛國，^lb與八萬四千菩薩，圍繞而來至此娑婆世界，^lb供養、親近、禮拜於我，亦欲供養、聽法華經。」
^cb#55b28文^pb8殊師利白佛言：「世尊！是菩薩種何善本？修何^lb功德？而能有是大神通力？行何三昧？願為我^lb等說是三昧名字，我等亦欲勤修行之，行此^lb三昧，乃能見是菩薩色相大小，威儀進止。
唯^lb願世尊以神通力，彼菩薩來，令我得見。」
^cb#55c04爾時^lb釋迦牟尼佛告文殊師利：「此久滅度多寶如^pb9來，當為汝等而現其相。」
^cb#55c06時多寶佛告彼菩薩：^lb「善男子！來，文殊師利法王子欲見汝身。」于時^lb妙音菩薩於彼國沒，與八萬四千菩薩俱共^lb發來。
所經諸國，六種震動，皆悉雨於七寶蓮^lb華；百千天樂，不鼓自鳴。
是菩薩目如廣大青^lb蓮華葉，正使和合百千萬月，其面貌端正復^pb10過於此，身真金色，無量百千功德莊嚴，威德^lb熾盛，光明照曜，諸相具足，如那羅延堅固之^lb身。
入七寶臺，上昇虛空，去地七多羅樹，諸菩^lb薩眾恭敬圍繞，而來詣此娑婆世界耆闍崛^lb山。
到已，下七寶臺，以價直百千瓔珞，持至釋^lb迦牟尼佛所，頭面禮足，奉上瓔珞，而白佛言：^pb11「世尊！淨華宿王智佛問訊世尊，少病、少惱，起^lb居輕利，安樂行不？四大調和不？
世事可忍不？^lb眾生易度不？無多貪欲、瞋恚、愚癡、嫉妬、慳慢^lb不？無不孝父母、不敬沙門、邪見、不善心、不攝^lb五情不？世尊！眾生能降伏諸魔怨不？久滅度^lb多寶如來在七寶塔中，來聽法不？又問訊多^pb12寶如來，安隱、少惱，堪忍久住不？世尊！我今欲^lb見多寶佛身，唯願世尊，示我令見。」
^cb#55c26爾時釋迦^lb牟尼佛語多寶佛：「是妙音菩薩欲得相見。」
^cb#55c28時^lb多寶佛告妙音言：「善哉，善哉！汝能為供養釋^lb迦牟尼佛及聽法華經，并見文殊師利等，故^lb來至此。」
^cb#56a02爾時華德菩薩白佛言：「世尊！是妙音^pb13菩薩，種何善根，修何功德，有是神力？」
^cb#56a03佛告華^lb德菩薩：「過去有佛，名雲雷音王多陀阿伽度、^lb阿羅訶、三藐三佛陀，國名現一切世間，劫名^lb喜見，妙音菩薩於萬二千歲，以十萬種伎樂^lb供養雲雷音王佛，并奉上八萬四千七寶鉢。
^lb以是因緣果報，今生淨華宿王智佛國，有是^pb14神力。
華德！於汝意云何？爾時雲雷音王佛所，^lb妙音菩薩——伎樂供養、奉上寶器者，豈異人乎？^lb今此妙音菩薩摩訶薩是。
華德！是妙音菩薩，^lb已曾供養親近無量諸佛，久殖德本，又值恒^lb河沙等百千萬億那由他佛。
^cb#56a14「華德！汝但見妙^lb音菩薩其身在此，而是菩薩，現種種身，處處^pb15為諸眾生說是經典——或現梵王^lb身，或現帝釋身，或現自在天身，或現大自在天身，或現天^lb大將軍身，或現毘沙門天王身，或現轉輪聖^lb王身，或現諸小王身，或現長者身，或現居士身，或現宰官身，或現婆羅門^lb身，
或現比丘、比^lb丘尼、優婆塞、優婆夷身，或現長者居士婦女^pb16身，或現宰官婦女身，或現婆羅門婦女身，或^lb現童男、童女身，或現天、龍、夜叉、乾闥婆、阿修^lb羅、迦樓羅、緊那羅、摩睺羅伽、人非人等身，而^lb說是經。
諸有地獄、餓鬼、畜生，及眾難處，皆能^lb救濟，乃至於王後宮，變為女身，而說是經。
^cb#56a26「華^lb德！是妙音菩薩，能救護娑婆世界諸眾生者，^pb17是妙音菩薩如是種種變化現身，在此娑婆^lb國土，為諸眾生說是經典，於神通、變化、智慧^lb無所損減。
是菩薩，以若干智慧明照娑婆世^lb界，令一切眾生各得所知；於十方恒河沙世^lb界中，亦復如是。
若應以聲^lb聞形得度者，現聲聞形而為說法；應以辟^pb18支佛形得度者，現辟支佛形而為說法；應以菩^lb薩形得度者，現菩薩形而為說法；應以佛形得度者，即現佛形^lb而為說法。
如是種種，隨所應度而為現形，乃^lb至應以滅度而得度者，示現滅度。
^cb#56b09「華德！妙音^lb菩薩摩訶薩，成就大神通智慧之力，其事如^lb是。」
^cb#56b12爾時華德菩薩白佛言：「世尊！是妙音菩薩，^pb19深種善根。
世尊！是菩薩住何三昧，而能如是^lb在所變現，度脫眾生？」
^cb#56b14佛告華德菩薩：「善男子！^lb其三昧名現一切色身，妙音菩薩住是三昧^lb中，能如是饒益無量眾生。」
^cb#56b16說是妙音菩薩品^lb時，與妙音菩薩俱來者八萬四千人，皆得現^lb一切色身三昧；此娑婆世界無量菩薩，亦得^pb20是三昧及陀羅尼。
^cb#56b19爾時妙音菩薩摩訶薩供^lb養釋迦牟尼佛及多寶佛塔已，還歸本土，所^lb經諸國，六種震動，雨寶蓮華，作百千萬億種^lb種伎樂。
既到本國，與八萬四千菩薩、圍繞至^lb淨華宿王智佛所，白佛言：
「世尊！我到娑婆世^lb界饒益眾生，見釋迦牟尼佛，及見多寶佛塔，^pb21禮拜、供養；又見文殊師利法王子菩薩，及見^lb藥王菩薩、得勤精進力菩薩、勇施菩薩等，亦^lb令是八萬四千菩薩得現一切色身三昧。
說^lb是妙音菩薩來往品時，四萬二千天子得無^lb生法忍，華德菩薩得法華三昧。」
^lb^ck25〔觀世音菩薩普門品第二十五〕
^pb22^cb#56c03爾時，無盡意菩薩即從座起，偏袒右肩，合掌^lb向佛，而作是言：「世尊！觀世音菩薩，以何因緣^lb名觀世音？」
^cb#56c05佛告無盡意菩薩：「善男子！若有無^lb量百千萬億眾生受諸苦惱，聞是觀世音菩^lb薩，一心稱名，觀世音菩薩即時觀其音聲，皆^lb得解脫。
若有持是觀世音菩薩名者，設入大^pb23火，火不能燒，由是菩薩威神力故。
若為大水^lb所漂，稱其名號，即得淺處。若有百千萬億眾^lb生，為求金、銀、琉璃、車璩、馬瑙、珊瑚、虎珀、真珠^lb等寶，入於大海，假使黑風吹其船舫，飄墮羅^lb剎鬼國，其中若有，乃至一人，稱觀世音菩薩^lb名者，是諸人等皆得解脫羅剎之難。以是因^pb24緣，名觀世音。
若復有人臨當被害，稱觀世音^lb菩薩名者，彼所執刀杖尋段段壞，而得解脫。
^lb若三千大千國土，滿中夜叉、羅剎，欲來惱人，^lb聞其稱觀世音菩薩名者，是諸惡鬼，尚不能^lb以惡眼視之，況復加害。
設復有人，若有罪、若^lb無罪，杻械、枷鎖檢繫其身，稱觀世音菩薩名^pb25者，皆悉斷壞，即得解脫。
若三千大千國土，滿^lb中怨賊，有一商主，將諸商人，齎持重寶、經過^lb險路，其中一人作是唱言：『諸善男子！勿得恐^lb怖，汝等應當一心稱觀世音菩薩名號。
是菩^lb薩能以無畏施於眾生，汝等若稱名者，於此^lb怨賊當得解脫。』眾商人聞，俱發聲言：『南無觀^pb26世音菩薩。』稱其名故，即得解脫。
^cb#56c29「無盡意！觀世^lb音菩薩摩訶薩，威神之力巍巍如是。
若有眾^lb生多於婬欲，常念恭敬觀世音菩薩，便得離^lb欲。
若多瞋恚，常念恭敬觀世音菩薩，便得離^lb瞋。若多愚癡，常念恭敬觀世音菩薩，便得離^lb癡。
^cb#57a05「無盡意！觀世音菩薩有如是等大威神力，^pb27多所饒益，是故眾生常應心念。
若有女人，設^lb欲求男，禮拜供養觀世音菩薩，便生福德智^lb慧之男；設欲求女，便生端正有相之女。宿殖^lb德本，眾人愛敬。
^cb#57a09「無盡意！觀世音菩薩有如是^lb力，若有眾生，恭敬禮拜觀世音菩薩，福不唐^lb捐，是故眾生皆應受持觀世音菩薩名號。
^cb#57a12「無^pb28盡意！若有人受持六十二億恒河沙菩薩名^lb字，復盡形供養飲食、衣服、臥具、醫藥。
於汝意^lb云何？是善男子、善女人，功德多不？」
^cb#57a15無盡意言：^lb「甚多，世尊！」
^cb#57a16佛言：「若復有人受持觀世音菩薩^lb名號，乃至一時禮拜、供養，是二人福，正等無^lb異，於百千萬億劫不可窮盡。
無盡意！受持觀^pb29世音菩薩名號，得如是無量無邊福德之利。」
^lb^cb#57a20無盡意菩薩白佛言：「世尊！觀世音菩薩，云何^lb遊此娑婆世界？云何而為眾生說法？方便之^lb力，其事云何？」
^cb#57a22佛告無盡意菩薩：「善男子！若有^lb國土眾生，
應以佛身得度者，觀世音菩薩即^lb現佛身而為說法；
應以辟支佛身得度者，即^pb30現辟支佛身而為說法；
應以聲聞身得度者，^lb即現聲聞身而為說法；
應以梵王身得度者，^lb即現梵王身而為說法；
應以帝釋身得度者，^lb即現帝釋身而為說法；
應以自在天身得度^lb者，即現自在天身而為說法；
應以大自在天^lb身得度者，即現大自在天身而為說法；
應以^pb31天大將軍身得度者，即現天大將軍身而為^lb說法；
應以毘沙門身得度者，即現毘沙門身^lb而為說法；
應以小王身得度者，即現小王身^lb而為說法；
應以長者身得度者，即現長者身^lb而為說法；
應以居士身得度者，即現居士身^lb而為說法；
應以宰官身得度者，即現宰官身^pb32而為說法；
應以婆羅^lb門身得度者，即現婆羅門身而為說法；
應以比丘、比丘尼、優婆塞、優^lb婆夷身得度者，即現比丘、比丘尼、優婆塞、優^lb婆夷身而為說法；
應以長者、居士、宰官、婆羅^lb門婦女身得度者，即現婦女身而為說法；
應^lb以童男、童女身得度者，即現童男、童女身而^pb33為說法；
應以天、龍、夜叉、乾闥婆、阿修羅、迦樓^lb羅、緊那羅、摩睺羅伽、人非人等身得度者，即^lb皆現之而為說法；
應以執金剛身得度者，即^lb現執金剛身而為說法。
^cb#57b19「無盡意！是觀世音菩^lb薩成就如是功德，以種種形，遊諸國土，度脫^lb眾生。
是故汝等，應當一心供養觀世音菩薩。^pb34是觀世音菩薩摩訶薩，於怖畏急難之中能^lb施無畏，是故此娑婆世界，皆號之為施無畏^lb者。」
^cb#57b24無盡意菩薩白佛言：「世尊！我今當供養觀^lb世音菩薩。」即解頸眾寶珠、瓔珞，價直百千兩^lb金，而以與之，作是言：「仁者！受此法施珍寶瓔^lb珞。」時觀世音菩薩不肯受之。無盡意復白觀^pb35世音菩薩言：「仁者！愍我等故，受此瓔珞。」
^cb#57c01爾時^lb佛告觀世音菩薩：「當愍此無盡意菩薩及四^lb眾，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、^lb摩睺羅伽、人非人等故，受是瓔珞。」
^cb#57c03即時觀世^lb音菩薩愍諸四眾，及於天、龍、人非人等，受其^lb瓔珞，分作二分，一分奉釋迦牟尼佛，一分奉^lb多寶佛塔。
^cb#57c06「無盡意，觀世音菩薩有如是自在^lb神力，遊於娑婆世界。」
^cb#57c07爾時無盡意菩薩以偈^lb問曰：
^pb36^gatha「世尊妙相具，　　我今重問彼，
　佛子何因緣，　　^lb名為觀世音？
　具足妙相尊，　　偈答無盡意：
^lb『汝聽觀音行，　　善應諸方所，
　弘誓深如海，　　^pb37歷劫不思議，
　侍多千億佛，　　發大清淨願。
　^lb我為汝略說，　　聞名及見身，
　心念不空過，　　^lb能滅諸有苦。
　假使興害意，　　推落大火坑，
　^lb念彼觀音力，　　火坑變成池。
　或漂流巨海，　　^lb龍魚諸鬼難，
　念彼觀音力，　　波浪不能沒。
　^lb或在須彌峯，　　為人所推墮，
　念彼觀音力，　　^pb38如日虛空住。
　或被惡人逐，　　墮落金剛山，
　^lb念彼觀音力，　　不能損一毛。
　或值怨賊繞，　　^lb各執刀加害，
　念彼觀音力，　　咸即起慈心。
　^lb或遭王難苦，　　臨刑欲壽終，
　念彼觀音力，　　^lb刀尋段段壞。
　或囚禁枷鎖，　　手足被杻械，
　^lb念彼觀音力，　　釋然得解脫。
　呪詛諸毒藥，　　^pb39所欲害身者，
　念彼觀音力，　　還著於本人。
　^lb或遇惡羅剎、　　毒龍諸鬼等，
　念彼觀音力，　　^lb時悉不敢害。
　若惡獸圍遶，　　利牙爪可怖，
　^lb念彼觀音力，　　疾走無邊方。
　蚖蛇及蝮蠍，　　^lb氣毒煙火燃，
　念彼觀音力，　　尋聲自迴去。
　^lb雲雷鼓掣電，　　降雹澍大雨，
　念彼觀音力，　　^pb40應時得消散。
　眾生被困厄，　　無量苦逼身，
　^lb觀音妙智力，　　能救世間苦。
　具足神通力，　　^lb廣修智方便，
　十方諸國土，　　無剎不現身。
　^lb種種諸惡趣，　　地獄鬼畜生，
　生老病死苦，　　^lb以漸悉令滅。
　真觀清淨觀，　　廣大智慧觀，
　^lb悲觀及慈觀，　　常願常瞻仰。
　無垢清淨光，　　^pb41慧日破諸闇，
　能伏災風火，　　普明照世間。
　^lb悲體戒雷震，　　慈意妙大雲，
　澍甘露法雨，　　^lb滅除煩惱焰。
　諍訟經官處，　　怖畏軍陣中，
　^lb念彼觀音力，　　眾怨悉退散。
　妙音觀世音，　　^lb梵音海潮音，
　勝彼世間音，　　是故須常念，
　^lb念念勿生疑。　　觀世音淨聖，
　於苦惱死厄，　　^pb42能為作依怙，
　具一切功德，　　慈眼視眾生，
　^lb福聚海無量，　　是故應頂禮。』」
^lb^cb#58b03爾時持地菩薩即從座起，前白佛言：「世尊！若^lb有眾生，聞是觀世音菩薩品自在之業，普門^lb示現神通力者，當知是人功德不少。」
^cb#58b05佛說是^lb普門品時，眾中八萬四千眾生，皆發無等等^pb43阿耨多羅三藐三菩提心。
^lb^ck26〔陀羅尼品第二十六〕
^lb^cb#58b09爾時，藥王菩薩即從座起，偏袒右肩，合掌向^lb佛，而白佛言：「世尊！若善男子、善女人，有能受^lb持法華經者——若讀誦通利，若書寫經卷——得幾^lb所福？」
^cb#58b12佛告藥王：「若有善男子、善女人，供養八^pb44百萬億那由他恒河沙等諸佛。
於汝意云何？^lb其所得福，寧為多不？」
^cb#58b14「甚多，世尊。」
^cb#58b15佛言：「若善男^lb子、善女人，能於是經，乃至受持一四句偈，讀^lb誦、解義、如說修行，功德甚多。」
^lb^cb#58b17爾時藥王菩薩白佛言：「世尊！我今當與說法^lb者陀羅尼呪，以守護之。」即說呪曰：
^pb45^cb#58b19「安爾(一)　曼爾(二)　摩禰(三)　摩摩禰(四)　旨隷(五)　遮^lb梨第(六)　賒咩(羊鳴音)(七)　賒履(冈雉反)多瑋(八)　羶(輸千反)^lb帝(九)　目帝(十)　目多履(十一)　娑履(十二)　阿瑋娑履(十三)　^lb桑履(十四)　娑履(十五)　叉裔(十六)　阿叉裔(十七)　阿耆膩(十八)　^lb羶帝(十九)　賒履(二十)　陀羅尼(二十一)　阿盧伽婆娑(蘇奈反)^lb簸蔗毘叉膩(二十二)　禰毘剃(二十三)　阿便哆(都餓反)邏禰履剃^pb46(廾四)　阿亶哆波隷輸地(途賣反)(二十五)　漚究隷(二十六)　^lb牟究隷(二十七)　阿羅隷(二十八)　波羅隷(二十九)　首迦差(初几反)(三十)　^lb阿三磨三履(三十一)　佛馱毘吉利袠帝(三十二)　^lb達磨波利差(猜離反)帝(三十三)　僧伽涅瞿沙禰^lb(三十四)　婆舍婆舍輸地(三十五)　曼哆邏(三十六)　曼哆^lb邏叉夜多(三十七)　郵樓哆(三十八)　郵樓哆憍舍^pb47略(來加反)(三十九)　惡叉邏(四十)　惡叉冶多冶(四十一)　阿婆^lb盧(四十二)　阿摩若(荏蔗反)那多夜(四十三)
^lb^cb#58c04「世尊！是陀羅尼神咒，六十二億恒河沙等諸^lb佛所說，若有侵毀此法師者，則為侵毀是諸^lb佛已。」
^cb#58c06時釋迦牟尼佛讚藥王菩薩言：「善哉，善^lb哉！藥王！汝愍念擁護此法師故，說是陀羅尼，^pb48於諸眾生，多所饒益。」
^cb#58c09爾時勇施菩薩白佛言：^lb「世尊！我亦為擁護讀誦受持法華經者，說陀^lb羅尼。
若此法師得是陀羅尼，若夜叉、若羅剎、^lb若富單那、若吉遮、若鳩槃茶、若餓鬼等，伺求^lb其短，無能得便。」即於佛前而說呪曰：
^lb^cb#58c14「痤(誓螺反)隷(一)摩訶痤隷(二)郁枳(三)目枳(四)^pb49阿隷(五)阿羅婆第(六)涅隷第(七)涅隷多婆第^lb(八)伊緻(猪履反)柅(女氏反)(九)韋緻柅(十)旨緻柅(十一)涅^lb隷墀柅(十二)涅犁墀婆底(十三)
^lb^cb#59a04「世尊！是陀羅尼神呪，恒河沙等諸佛所說，亦^lb皆隨喜，若有侵毀此法師者，則為侵毀是諸^lb佛已。」
^cb#59a07爾時毘沙門天王護世者白佛言：「世尊！^pb50我亦為愍念眾生、擁護此法師故，說是陀羅^lb尼。」即說呪曰：
^lb^cb#59a10「阿梨(一)那梨(二)㝹那梨(三)阿那盧(四)那履(五)^lb拘那履(六)
^lb^cb#59a12「世尊！以是神呪擁護法師，我亦自當擁護持^lb是經者，令百由旬內無諸衰患。」
^cb#59a13爾時持國天^pb51王在此會中，與千萬億那由他乾闥婆眾，恭^lb敬圍繞，前詣佛所，合掌白佛言：「世尊！我亦以^lb陀羅尼神呪，擁護持法華經者。」即說呪曰：
^lb^cb#59a18「阿伽禰(一)伽禰(二)瞿利(三)乾陀利(四)旃陀^lb利(五)摩蹬耆(六)常求利(七)浮樓莎柅(八)頞^lb(音遏)底(九)
^pb52^cb#59a20「世尊！是陀羅尼神呪，四十二億諸佛所說，若^lb有侵毀此法師者，則為侵毀是諸佛已。」
^cb#59a22爾時^lb有羅剎女等，一名藍婆，二名毘藍婆，三名曲^lb齒，四名華齒，五名黑齒，六名多髮，七名無厭^lb足，八名持瓔珞，九名睪帝，十名奪一切眾生^lb精氣，是十羅剎女，與鬼子母，并其子及眷屬，^pb53俱詣佛所，同聲白佛言：「世尊！我等亦欲擁護^lb讀誦受持法華經者，除其衰患，若有伺求法^lb師短者，令不得便。」即於佛前，而說呪曰：
^lb^cb#59b01「伊提履(一)伊提泯(二)伊提履(三)阿提履(四)伊^lb提履(五)泥履(六)泥履(七)泥履(八)泥履(九)泥履^lb(十)樓醯(十一)樓醯(十二)樓醯(十三)樓醯(十四)多醯^pb54(十五)多醯(十六)多醯(十七)兜醯(十八)㝹醯(十九)
^lb^cb#59b05「寧上我頭上，莫惱於法師。
若夜叉、若羅剎、若^lb餓鬼、若富單那、若吉遮、若毘陀羅、若犍馱、若^lb烏摩勒伽、若阿跋摩羅、若夜叉吉遮、若人吉^lb遮，若熱病若一日、若二日、若三日、若四日乃^lb至七日，若常熱病，若男形、若女形、若童男形、^pb55若童女形，乃至夢中，亦復莫惱。」即於佛前、而^lb說偈言：
^lb^gatha「若不順我呪，　　惱亂說法者，
　頭破作七分，　　^lb如阿梨樹枝。
　如殺父母罪，　　亦如壓油殃，
　^gatha斗秤欺誑人，　　調達破僧罪。
　犯此法師者，　　^lb當獲如是殃。」
^pb56^cb#59b17諸羅剎女說此偈已，白佛言：「世尊！我等亦當^lb身自擁護受持、讀誦、修行是經者，令得安隱，離諸衰患，消眾毒藥。」
^cb#59b19佛告諸羅剎女：「善哉，善^lb哉！汝等但能擁護受持法華名者，福不可量，^lb何況擁護具足受持，供養經卷——華、香、瓔珞，末^lb香、塗香、燒香，幡蓋、伎樂；燃種種燈：酥燈、油燈、^pb57諸香油燈、蘇摩那華油燈、瞻蔔華油燈、婆師^lb迦華油燈、優鉢羅華油燈，如是等百千種供^lb養者。
睪帝！汝等及眷屬，應當擁護如是法師。」
^lb^cb#59b26說是陀羅尼品時，六萬八千人、得無生法忍。
^lb^ck27〔妙莊嚴王本事品第二十七〕
^lb^cb#59b29爾時佛告諸大眾：「乃往古世，過無量無邊不^pb58可思議阿僧祇劫，有佛名雲雷音宿王華智^lb多陀阿伽度、阿羅訶、三藐三佛陀，國名光明^lb莊嚴，劫名憙見。
彼佛法中有王，名妙莊嚴，其^lb王夫人名曰淨德，有二子，一名淨藏，二名淨^lb眼。
是二子有大神力，福德智慧，久修菩薩所^lb行之道，所謂檀波羅蜜、尸羅波羅蜜、羼提波^pb59羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜、^lb方便波羅蜜，慈悲喜捨，乃至三十七品助道^lb法皆悉明了通達。
又得菩薩淨三昧、日星宿^lb三昧、淨光三昧、淨色三昧、淨照明三昧、長莊^lb嚴三昧、大威德藏三昧，於此三昧亦悉通達。
^lb^cb#59c12「爾時彼佛欲引導妙莊嚴王，及愍念眾生故，^pb60說是法華經。
時淨藏、淨眼二子到其母所，合^lb十指爪掌白言：『願母往詣雲雷音宿王華智^lb佛所，我等亦當侍從，親近、供養、禮拜。
所以者^lb何？此佛於一切天人眾中說法華經，宜應聽^lb受。』母告子言：『汝父信受外道，深著婆羅門法，^lb汝等應往白父，與共俱去。』淨藏、淨眼合十指^pb61爪掌白母：『我等是法王子，而生此邪見家。』母^lb告子言：『汝等當憂念汝父，為現神變，若得見^lb者，心必清淨，或聽我等，往至佛所。』
於是二子^lb念其父故，踊在虛空，高七多羅樹，現種種神^lb變——於虛空中行住坐臥；身上出水、^lb身下出火，身下出水、身上出火；或現大身滿虛空中，而^pb62復現小，小復現大；於空中滅，忽然在地；入地^lb如水，履水如地。
現如是等種種神變，令其父^lb王心淨信解。
時父見子神力如是，心大歡喜，^lb得未曾有，合掌向子言：『汝等，師為是誰，誰之^lb弟子？』二子白言：『大王！彼雲雷音宿王華智佛，^lb今在七寶菩提樹下法座上坐，於一切世間^pb63天人眾中廣說法華經，是我等師，我是弟子。』
^lb父語子言：『我今亦欲見汝等師，可共俱往。』於^lb是二子從空中下，到其母所，合掌白母：『父王^lb今已信解，堪任發阿耨多羅三藐三菩提心。
^lb我等為父已作佛事，願母見聽，於彼佛所出^lb家修道。』
^cb#60a20「爾時二子欲重宣其意，以偈白母：
^pb64^gatha「『願母放我等，　　出家作沙門，
　　諸佛甚難值，　　^lb我等隨佛學。
　　如優曇鉢羅，　　值佛復難是，
　　^lb脫諸難亦難，　　願聽我出家。』
^lb^cb#60a26「母即告言：『聽汝出家。所以者何？佛難值故。』
^cb#60a27「於^lb是二子白父母言：『善哉，父母！願時往詣雲雷^lb音宿王華智佛所，親近供養。
所以者何？佛難^pb65得值，如優曇鉢羅華，又如一眼之龜，值浮木^lb孔。
而我等宿福深厚，生值佛法，是故父母當^lb聽我等，令得出家。所以者何？諸佛難值，時亦^lb難遇。』
^cb#60b03「彼時妙莊嚴王後宮八萬四千人，皆悉^lb堪任受持是法華經。
淨眼菩薩，於法華三昧，^lb久已通達；淨藏菩薩，已於無量百千萬億劫^pb66通達離諸惡趣三昧，欲令一切眾生離諸惡^lb趣故。
其王夫人，得諸佛集三昧，能知諸佛祕^lb密之藏。
^cb#60b08「二子如是以方便力善化其父，令心^lb信解，好樂佛法。
於是妙莊嚴王與群臣眷屬^lb俱，淨德夫人與後宮婇女眷屬俱，其王二子^lb與四萬二千人俱，一時共詣佛所。
到已，頭面^pb67禮足，繞佛三匝，却住一面。
^cb#60b14「爾時彼佛為王說^lb法，示教利喜。王大歡悅。
爾時妙莊嚴王及其^lb夫人，解頸真珠瓔珞，價直百千，以散佛上，於^lb虛空中化成四柱寶臺，臺中有大寶床，敷百^lb千萬天衣，其上有佛結加趺坐，放大光明。
爾^lb時妙莊嚴王作是念：『佛身希有，端嚴殊特，成^pb68就第一微妙之色。』時雲雷音宿王華智佛告^lb四眾言：『汝等見是妙莊嚴王，於我前合掌立^lb不？此王於我法中作比丘，精勤修習，助佛道^lb法，當得作佛，號娑羅樹王，國名大光，劫名大^lb高王。
其娑羅樹王佛，有無量菩薩眾及無量^lb聲聞，其國平正，功德如是。』其王即時以國付^pb69弟，與夫人、二子并諸眷屬，於佛法中出家修^lb道。
^cb#60b27「王出家已，於八萬四千歲，常勤精進修行^lb妙法華經。
過是已後，得一切淨功德莊嚴三^lb昧，即昇虛空，高七多羅樹，而白佛言：『世尊！此^lb我二子，已作佛事，以神通變化轉我邪心，令^lb得安住於佛法中，得見世尊。
此二子者，是我^pb70善知識，為欲發起宿世善根，饒益我故，來生^lb我家。』
^cb#60c05「爾時，雲雷音宿王華智佛告妙莊嚴王^lb言：『如是，如是！如汝所言。
若善男子、善女人，種^lb善根故，世世得善知識，其善知識，能作佛事，^lb示教利喜，令入阿耨多羅三藐三菩提。
大王！^lb當知善知識者是大因緣，所謂化導令得見^pb71佛，發阿耨多羅三藐三菩提心。
大王！汝見此^lb二子不？此二子，已曾供養六十五百千萬億^lb那由他恒河沙諸佛，親近恭敬，於諸佛所受^lb持法華經，愍念邪見眾生，令住正見。』妙莊嚴^lb王即從虛空中下，而白佛言：
『世尊！如來甚希^lb有，以功德智慧故，頂上肉髻光明顯照，其眼^pb72長廣而紺青色，眉間毫相白如珂月，齒白齊^lb密常有光明，脣色赤好如頻婆果。』
^cb#60c18「爾時妙莊^lb嚴王，讚歎佛如是等無量百千萬億功德已，^lb於如來前，一心合掌，復白佛言：『世尊！未曾有^lb也。
如來之法，具足成就不可思議微妙功德，^lb教誡所行，安隱快善，我從今日，不復自隨心^pb73行，不生邪見、憍慢、瞋恚諸惡之心。』說是語已，^lb禮佛而出。」
^cb#60c23佛告大眾：「於意云何？妙莊嚴王，豈^lb異人乎？今華德菩薩是。
其淨德夫人，今佛前^lb光照莊嚴相菩薩是。哀愍妙莊嚴王及諸眷^lb屬故，於彼中生。其二子者，今藥王菩薩、藥上^lb菩薩是。是藥王、藥上菩薩，成就如此諸大功^pb74德，已於無量百千萬億諸佛所殖眾德本，成^lb就不可思議諸善功德。
若有人識是二菩薩^lb名字者，一切世間諸天人民亦應禮拜。」
^cb#61a02佛說^lb是妙莊嚴王本事品時，八萬四千人遠塵離^lb垢，於諸法中得法眼淨。
^lb^ck28〔普賢菩薩勸發品第二十八〕
^pb75^cb#61a06爾時普賢菩薩，以自在神通力，威德名聞，與^lb大菩薩無量無邊不可稱數，從東方來。
所經^lb諸國，普皆震動，雨寶蓮華，作無量百千萬億^lb種種伎樂。
又與無數諸天、龍、夜叉、乾闥婆、阿^lb修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，大^lb眾圍繞，各現威德神通之力，到娑婆世界耆^pb76闍崛山中，頭面禮釋迦牟尼佛，右繞七匝，白^lb佛言：
「世尊，我於寶威德上王佛國，遙聞此娑^lb婆世界說法華經，與無量無邊百千萬億諸^lb菩薩眾共來聽受，唯願世尊當為說之。
若善^lb男子、善女人，於如來滅後，云何能得是法華^lb經？」
^cb#61a17佛告普賢菩薩：「若善男子、善女人，成就四^pb77法，於如來滅後，當得是法華經：一者、為諸佛^lb護念，二者、殖眾德本，三者、入正定聚，四者、發^lb救一切眾生之心。
善男子、善女人，如是成就^lb四法，於如來滅後，必得是經。」
^cb#61a22爾時普賢菩薩^lb白佛言：「世尊！於後五百歲、濁惡世中，其有受^lb持是經典者，我當守護，除其衰患，令得安隱，^pb78使無伺求得其便者，若魔、若魔子、若魔女、若^lb魔民、若為魔所著者，若夜叉、若羅剎、若鳩槃^lb茶、若毘舍闍、若吉遮、若富單那、若韋陀羅等，^lb諸惱人者，皆不得便。
是人若行、若立、讀誦此^lb經，我爾時乘六牙白象王，與大菩薩眾俱詣^lb其所，而自現身，供養守護，安慰其心，亦為供^pb79養法華經故。
是人若坐、思惟此經，爾時我復^lb乘白象王現其人前，其人若於法華經有所^lb忘失一句一偈，我當教之，與共讀誦，還令通^lb利。
爾時受持讀誦法華經者，得見我身，甚大^lb歡喜，轉復精進，以見我故，即得三昧及陀羅^lb尼，名為旋陀羅尼、百千萬億旋陀羅尼、法音^pb80方便陀羅尼，得如是等陀羅尼。
^cb#61b09「世尊！若後世^lb後五百歲、濁惡世中，比丘、比丘尼、優婆塞、優^lb婆夷，求索者、受持者、讀誦者、書寫者，欲修習^lb是法華經，於三七日中，應一心精進。
滿三七^lb日已，我當乘六牙白象，與無量菩薩而自圍^lb繞，以一切眾生所憙見身，現其人前，而為說^pb81法，示教利喜，亦復與其陀羅尼呪，得是陀羅^lb尼故，無有非人能破壞者，亦不為女人之所^lb惑亂，我身亦自常護是人。唯願世尊聽我說^lb此陀羅尼呪。」即於佛前而說呪曰：
^lb^cb#61b19「阿檀地(途賣反)(一)檀陀婆地(二)檀陀婆帝(三)檀陀鳩^lb舍隷(四)檀陀修陀隷(五)修陀隷(六)修陀羅婆^pb82底(七)佛馱波羶禰(八)薩婆陀羅尼阿婆多尼^lb(九)薩婆婆沙阿婆多尼(十)修阿婆多尼(十一)僧^lb伽婆履叉尼(十二)僧伽涅伽陀尼(十三)阿僧祇(十四)^lb僧伽波伽地(十五)帝隷阿惰僧伽兜略(盧遮反)阿^lb羅帝婆羅帝(十六)薩婆僧伽三摩地伽蘭地^lb(十七)薩婆達磨修波利剎帝(十八)薩婆薩埵樓馱^pb83憍舍略阿㝹伽地(十九)辛阿毘吉利地帝(二十)
^lb^cb#61b28「世尊！若有菩薩得聞是陀羅尼者，當知普賢^lb神通之力，若法華經行閻浮提，有受持者，應^lb作此念：『皆是普賢威神之力。』若有受持、讀誦，^lb正憶念，解其義趣，如說修行，當知是人行^lb普賢行，於無量無邊諸佛所深種善根，為諸如^pb84來手摩其頭。
若但書寫，是人命終，當生忉利^lb天上，是時八萬四千天女作眾伎樂而來迎^lb之，其人即著七寶冠，於婇女中娛樂快樂；
何^lb況受持、讀誦，正憶念，解其義趣，如說修行。
若^lb有人受持、讀誦，解其義趣，是人命終，為千佛^lb授手，令不恐怖，不墮惡趣，即往兜率天上彌^pb85勒菩薩所。
彌勒菩薩，有三十二相大菩薩眾^lb所共圍繞，有百千萬億天女眷屬，而於中生，^lb有如是等功德利益。
是故智者，應當一心自^lb書、若使人書，受持、讀誦，正憶念，如說修行。
^cb#61c14「世^lb尊！我今以神通力故，守護是經，於如來滅後^lb閻浮提內，廣令流布，使不斷絕。」
^cb#61c16爾時釋迦牟^pb86尼佛讚言：「善哉，善哉！普賢！汝能護助是經，令^lb多所眾生安樂利益。
汝已成就不可思議功^lb德，深大慈悲，從久遠來，發阿耨多羅三藐三^lb菩提意，而能作是神通之願，守護是經。
我當^lb以神通力，守護能受持普賢菩薩名者。
^cb#61c21「普賢！^lb若有受持、讀誦，正憶念，修習、書寫是法華經^pb87者，當知是人，則見釋迦牟尼佛，如從佛口聞^lb此經典；當知是人，供養釋迦牟尼佛；當知是^lb人，佛讚善哉；當知是人，為釋迦牟尼佛手摩^lb其頭；當知是人，為釋迦牟尼佛衣之所覆。
如^lb是之人，不復貪著世樂，不好外道經書、手筆，^lb亦復不喜親近其人及諸惡者——若屠兒、若畜^pb88猪羊雞狗、若獵師、若衒賣女色——是人心意質^lb直，有正憶念，有福德力，是人不為三毒所惱，^lb亦不為嫉妬、我慢、邪慢、增上慢所惱，是人少^lb欲知足，能修普賢之行。
^cb#62a09「普賢！若如來滅後後^lb五百歲，若有人見受持、讀誦法華經者，應作^lb是念：『此人不久當詣道場，破諸魔眾，得阿耨^pb89多羅三藐三菩提，轉法輪、擊法鼓、吹法螺、雨^lb法雨，當坐天人大眾中師子法座上。』
^cb#62a13「普賢！若^lb於後世，受持、讀誦是經典者，是人不復貪著^lb衣服、臥具、飲食、資生之物，所願不虛，亦於現^lb世得其福報。
若有人輕毀之，言：『汝狂人耳，空^lb作是行，終無所獲。』如是罪報，當世世無眼；若^pb90有供養讚歎之者，當於今世得現果報。
若復^lb見受持是經者，出其過惡，若實、若不實，此人^lb現世得白癩病。
若有輕笑之者，當世世牙齒踈^lb缺，醜脣、平鼻，手腳繚戾，眼目角睞，身體臭穢，^lb惡瘡、膿血、水腹、短氣、諸惡重病。
是故，普賢！若^lb見受持是經典者，當起遠迎，當如敬佛。」
^cb#62a24說是^pb91普賢勸發品時，恒河沙等無量無邊菩薩，得^lb百千萬億旋陀羅尼；三千大千世界微塵等^lb諸菩薩，具普賢道。
^cb#62a27佛說是經時，普賢等諸菩^lb薩，舍利弗等諸聲聞，及諸天、龍、人非人等，一^lb切大會，皆大歡喜，受持佛語，作禮而去。
^lb妙法蓮華經卷第七^pb92
^:<name=timestamp preload=true>vid	videohost	bookid	performer	timestamp=numbers
5C4INS3hK40P5HI-Yw7AaoRquHJ4jzXKsXpROd_PKBb0bDOcp6uk584m9ZmMrY88qEn7ehR3iVBLgw35152ox685wjvwySjCVoQz-IpOREVDHo

youtubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubetencentyoutubeyoutube
vcpp_kumarajivapphsvcpp_kumarajivavcpp_kumarajivapphsvcpp_kumarajivapphvcpp_kumarajivavcpp_kumarajivavcpp_kumarajiva
養德禪寺王菲張智霖法鼓山王菲般禪梵唱心定法師王菲朗誦王菲蔣勳見輝法師
;' ;-.;'!>7..
^:<name=timestamp_sanskrit preload=true>vid	videohost	bookid	performer	timestamp=numbers
bDOcp6uk584bDOcp6uk584

youtubeyoutube
pphspphs
般禪梵唱般禪梵唱
;;
^pb1^folio#vcpp_kumarajiva^bk#vcpp_kumarajiva<heading=金剛經>【金剛般若波羅蜜經】^ck0【經題】^lb^gatha^au【．．．姚秦．三藏法師．鳩摩羅什譯】
^lb^ck1【法會因由】
如是我聞：
一時，
佛在舍衛國祇樹給孤獨園，
^lb與大比丘眾千二百五十人俱。
爾時，世尊食^lb時，著衣持缽，
入舍衛大城乞食。
於其城中，次^pb2第乞已，
還至本處。
飯食訖，收衣缽，洗足已，
敷^lb座而坐。

^ck2【善現啟請】
時長老須菩提，
在大眾中，
即從座起，^lb偏袒右肩，右膝著地，合掌恭敬，而白佛言：
希^lb有，世尊！
如來善護念諸菩薩，
善付囑諸菩薩。
^lb世尊！善男子、善女人，發阿耨多羅三藐三菩^pb3提心，
云何應住？云何降伏其心？
佛言：善哉、善^lb哉！須菩提，如汝所說，
如來善護念諸菩薩，
善^lb付囑諸菩薩。
汝今諦聽，
當為汝說！
善男子、善^lb女人發阿耨多羅三藐三菩提心，應如是住、^lb如是降伏其心。」 
「唯然，世尊！」願樂欲聞。
^ck3【大乘正宗】
佛告須^pb4菩提∶諸菩薩摩訶薩，應如是降伏其心，
所有^lb一切眾生之類，
若卵生、若胎生、若濕生、若化^lb生、
若有色、若無色、若有想、若無想、若非有想^lb非無想，
我皆令入無餘涅槃而滅度之；
如是^lb滅度無量無數無邊眾生，實無眾生得滅度^pb5者。

何以故？須菩提，若菩薩有我相、人相、眾生^lb相、壽者相，即非菩薩。
^ck4【妙行無住】
復次，須菩提，
菩薩於法，^lb應無所住行於布施。
所謂不住色布施，不住^lb聲、香、味、觸、法布施。
須菩提，菩薩應如是布施，^lb不住於相。
何以故？若菩薩不住相布施，其福^pb6德不可思量。
須菩提！於意云何，東方虛空，可^lb思量不？
不也，世尊！
須菩提！南西北方、四維上^lb下虛空，可思量不？
不也，世尊！
須菩提！菩薩無^lb住相布施，福德亦復如是不可思量。
須菩提，^lb菩薩但應如所教住。
^ck5【如理實見】
須菩提！於意云何，可以^pb7身相見如來不？
不也，世尊，不可以身相得見^lb如來！
何以故？如來所說身相，即非身相。
佛告^lb須菩提：
凡所有相，皆是虛妄！若見諸相、非相，^lb則見如來！
^ck6【正信希有】
須菩提白佛言：
世尊！頗有眾生，得^lb聞如是言說章句，生實信不？
佛告須菩提：莫^pb8作是說。
如來滅後，後五百歲，有持戒修福者，
^lb於此章句能生信心，以此為實。

當知是人，不^lb於一佛、二佛、三四五佛而種善根，
已於無量^lb千萬佛所種諸善根，
聞是章句，乃至一念，生^lb淨信者，
須菩提，如來悉知、悉見，是諸眾生得^pb9如是無量福德。
何以故？是諸眾生無復我相、^lb人相、眾生相、壽者相，
無法相，亦無非法相。
何^lb以故？是諸眾生若心取相，則為著我、人、眾生、^lb壽者。若取法相，即著我、人、眾生、壽者；
何以故？^lb若取非法相，即著我、人、眾生、壽者。
是故，不應^pb10取法、不應取非法！
以是義故，如來常說，汝等^lb比丘知我說法如筏喻者。法尚應捨，何況非^lb法！
^ck7【無得無說】

須菩提，於意云何，如來得阿耨多羅三藐^lb三菩提耶，如來有所說法耶？
須菩提言：
如我^lb解佛所說義，無有定法名阿耨多羅三藐三^pb11菩提，亦無有定法如來可說。
何以故？如來所^lb說法皆不可取、不可說，非法、非非法。
所以者^lb何？一切賢聖皆以無為法而有差別。
^ck8【依法出生】
須菩提，^lb於意云何，若人滿三千大千世界七寶以用^lb布施 ，是人所得福德寧為多不？
須菩提言：甚^pb12多，世尊！
何以故？是福德即非福德性，是故如^lb來說福德多。

若復有人，於此經中受持乃至^lb四句偈等，為他人說，其福勝彼。
何以故？須菩^lb提，一切諸佛，及諸佛阿耨多羅三藐三菩提^lb法，皆從此經出。
須菩提，所謂佛法者，即非佛^pb13法！
^ck9【一相無相】
須菩提，於意云何，須陀洹能作是念『我得^lb須陀洹果』不？
須菩提言：不也，世尊！何以故？須^lb陀洹，名為入流，而無所入；
不入色、聲、香、味、觸、^lb法，是名須陀洹。

須菩提，於意云何，斯陀含能^lb作是念『我得斯陀含果』不？
須菩提言：「不也，世^pb14尊！何以故？斯陀含，名一往來，而實無往來，是^lb名斯陀含。」
「須菩提，於意云何，阿那含能作是^lb念『我得阿那含果』不？」
須菩提言：「不也，世尊！何^lb以故？阿那含，名為不來，而實無來，是故名^lb阿那含。」
「須菩提，於意云何，阿羅漢能作是念^pb15『我得阿羅漢道』不？」
須菩提言：「不也，世尊！何以^lb故？實無有法名阿羅漢！
世尊，若阿羅漢作是念^lb『我得阿羅漢道』，即為著我、人、眾生、壽者。
世^lb尊！佛說我得無諍三昧，人中最為第一，是第^lb一離欲阿羅漢。我不作是念：『我是離欲阿羅^pb16漢』。
世尊，我若作是念『我得阿羅漢道』，世尊則^lb不說『須菩提是樂阿蘭那行』者！以須菩提實^lb無所行，而名須菩提是樂阿蘭那行！」
^ck10【莊嚴淨土】
佛告須^lb菩提：「於意云何，如來昔在然燈佛所，於法有^lb所得不？」
「不也，世尊，如來在然燈佛所，於法實^pb17無所得。」
「須菩提，於意云何，菩薩莊嚴佛土不？」
^lb不也，世尊！何以故？莊嚴佛土者，則非莊嚴，是^lb名莊嚴。
是故，須菩提，諸菩薩摩訶薩應如是^lb生清淨心，不應住色生心，不應住聲、香、味、觸、^lb法生心，應無所住而生其心。
「須菩提！譬如有^pb18人，身如須彌山王。於意云何，是身為大不？」
須^lb菩提言：「甚大，世尊！何以故？佛說非身，是名大^lb身。」
^ck11【無為福勝】
「須菩提，如恒河中所有沙數，如是沙等恒^lb河，於意云何，是諸恒河沙寧為多不？」 
須菩提^lb言：「甚多，世尊！但諸恒河尚多無數，何況其沙！」
^pb19「須菩提，我今實言告汝，若有善男子、善女人，^lb以七寶滿爾所恒河沙數三千大千世界，以^lb用布施，得福多不？」
須菩提言：「甚多，世尊！」
佛告^lb須菩提∶「若善男子、善女人，於此經中乃至受^lb持四句偈等，為他人說，而此福德勝前福德。
^pb20^ck12【尊重正教】
復次，須菩提，隨說是經乃至四句偈等，當知^lb此處，一切世間天、人、阿修羅皆應供養，如佛^lb塔廟。
何況有人，盡能受持、讀誦！
須菩提！當知^lb是人成就最上第一希有之法！若是經典所^lb在之處，則為有佛，若尊重弟子。」
^ck13【如法受持】
爾時，須菩提^pb21白佛言：
「世尊，當何名此經，我等云何奉持？」
佛^lb告須菩提：
「是經名為『金剛般若波羅蜜』。
以是^lb名字，汝當奉持。
所以者何？須菩提，佛說般若^lb波羅蜜，則非般若波羅蜜。」
「須菩提，於意云何，^lb如來有所說法不？」
須菩提白佛言：「世尊！如來^pb22無所說。」
「須菩提，於意云何，三千大千世界所^lb有微塵，是為多不？」
須菩提言：「甚多，世尊！」
「須菩^lb提，諸微塵如來說非微塵，是名微塵；如來說^lb世界非世界，是名世界。」
「須菩提，於意云何，可^lb以三十二相見如來不？」
「不也，世尊，不可以三^pb23十二相得見如來！
何以故？如來說三十二相^lb即是非相，是名三十二相。」
「須菩提，若有善男^lb子、善女人，以恒河沙等身命布施；
若復有人，^lb於此經中乃至受持四句偈等，為他人說，其^lb福甚多。」
^ck14【離相寂滅】
爾時，須菩提聞說是經，深解義趣，涕^pb24淚悲泣而白佛言：
「希有，世尊！佛說如是甚深^lb經典！我從昔來所得慧眼，未曾得聞如是之經！

^lb世尊，若復有人得聞是經，信心清淨，則生^lb實相，當知是人成就第一希有功德！
世尊！是^lb實相者，則是非相，是故如來說名實相。
世尊，^pb25我今得聞如是經典，信解受持，不足為難。
若^lb當來世，後五百歲，其有眾生得聞是經，信解^lb受持，是人則為第一希有！
何以故？此人無我^lb相、人相、眾生相、壽者相。
所以者何？我相即是^lb非相，人相、眾生相、壽者相，即是非相。
何以故？^pb26離一切諸相，則名諸佛。」
佛告須菩提：
「如是、如^lb是！
若復有人得聞是經，不驚、不怖、不畏，當知^lb是人甚為希有！
何以故？須菩提，如來說第一^lb波羅蜜，非第一波羅蜜，是名第一波羅蜜。
^lb須菩提，忍辱波羅蜜，如來說非忍辱波羅蜜。
^pb27何以故？須菩提，如我昔為歌利王割截身體。^lb我於爾時，無我相、無人相、無眾生相、無壽者^lb相。
何以故？我於往昔節節支解時，若有我相、^lb人相、眾生相、壽者相，應生瞋恨。
須菩提！又念^lb過去，於五百世作忍辱仙人。於爾所世，無我^pb28相、無人相、無眾生相、無壽者相。
是故，須菩提，^lb菩薩應離一切相，發阿耨多羅三藐三菩提^lb心，
不應住色生心，不應住聲、香、味、觸、法生心，^lb應生無所住心。
若心有住，則為非住！
是故佛^lb說：『菩薩心不應住色布施。』
須菩提，菩薩為利^pb29益一切眾生，應如是布施。
如來說一切諸相^lb即是非相；又說一切眾生則非眾生。

須菩提，^lb如來是真語者、實語者、如語者、不誑語者、不^lb異語者。
須菩提，如來所得法，此法無實無虛。
^lb須菩提，若菩薩心住於法而行布施，如人^pb30入闇，則無所見；
若菩薩心不住法而行布施，如^lb人有目，日光明照，見種種色。
須菩提，當來之^lb世，若有善男子、善女人，能於此經受持、讀誦，^lb則為如來以佛智慧，悉知是人、悉見是人，皆^lb得成就無量無邊功德。
^ck15【持經功德】
須菩提，若有善男子、^pb31善女人，初日分以恒河沙等身布施，
中日分^lb復以恒河沙等身布施，
後日分亦以恒河沙^lb等身布施，
如是無量百千萬億劫以身布施；
^lb若復有人聞此經典，信心不逆，其福勝彼。何^lb況書寫、受持、讀誦、為人解說！
須菩提，以要言^pb32之，是經有不可思議、不可稱量无邊功德！
如^lb來為發大乘者說、為發最上乘者說！
若有人^lb能受持、讀誦、廣為人說，如來悉知是人、悉見^lb是人！
皆得成就不可量、不可稱、無有邊、不可^lb思議功德！
如是人等，則為荷擔如來阿耨多^pb33羅三藐三菩提！
何以故？須菩提，若樂小法者，
^lb著我見、人見、眾生見、壽者見，
則於此經不能^lb聽受、讀誦、為人解說！
須菩提，在在處處若有^lb此經，一切世間天、人、阿修羅所應供養！當知^lb此處則為是塔。皆應恭敬，作禮圍繞，以諸華^pb34香而散其處！
^ck16【能淨業障】
復次，須菩提，善男子、善女人受^lb持、讀誦此經，若為人輕賤，
是人先世罪業，應^lb墮惡道，以今世人輕賤故，先世罪業則為消^lb滅，當得阿耨多羅三藐三菩提！
須菩提，我念^lb過去無量阿僧祇劫，於然燈佛前，得值八百^pb35四千萬億那由他諸佛，悉皆供養承事，無空^lb過者！
若復有人於後末世能受持、讀誦此經，
^lb所得功德於我所供養諸佛功德， 百分不及^lb一，千萬億分、乃至算數譬喻所不能及！
須菩^lb提，若善男子、善女人，於後末世，有受持、讀誦^pb36此經所得功德，我若具說者，或有人聞，心則^lb狂亂、狐疑不信！
須菩提，當知是經義不可思^lb議，果報亦不可思議！」
^ck17【究竟無我】
爾時，須菩提白佛言：「世尊，善^lb男子、善女人，發阿耨多羅三藐三菩提^lb心，云何應住、云何降伏其心？」
佛告須菩提：「善^pb37男子、善女人，發阿耨多羅三藐三菩提者，^lb當生如是心：
『我應滅度一切眾生。
滅度一切^lb眾生已，而無有一眾生實滅度者。』
何以故？須^lb菩提，若菩薩有我相、人相、眾生相、壽者相，則^lb非菩薩！
所以者何？須菩提，實無有法，發阿耨^pb38多羅三藐三菩提者！」
「須菩提，於意云何，如^lb來於然燈佛所，有法得阿耨多羅三藐三菩^lb提不？」
「不也，世尊，如我解佛所說義，佛於然燈^lb佛所，無有法得阿耨多羅三藐三菩提！」
佛言：「^lb如是、如是
須菩提，實無有法，如來得阿耨多^pb39羅三藐三菩提！
須菩提，若有法如來得阿耨^lb多羅三藐三菩提者，然燈佛則不與我受記：^lb『汝於來世，當得作佛，號釋迦牟尼。』
以實無有^lb法，得阿耨多羅三藐三菩提！是故，然燈佛與^lb我受記，作是言：『汝於來世，當得作佛，號釋迦^pb40牟尼。』
何以故？如來者，即諸法如義！




若有人言^lb『如來得阿耨多羅三藐三菩提』。須菩提，實無^lb有法，佛得阿耨多羅三藐三菩提！
須菩提，如^lb來所得阿耨多羅三藐三菩提，於是中，無實^lb無虛。
是故如來說一切法皆是佛法！
須菩提，^pb41所言一切法者，即非一切法，是故名一切法！」
^lb「須菩提，譬如人身長大。」
須菩提言：「世尊，如來^lb說人身長大，則為非大身，是名大身。」
「須菩提，^lb菩薩亦如是！若作是言『我當滅度無量眾生』，^lb則不名菩薩！
何以故？須菩提，實無有法，名為^pb42菩薩！」


是故佛說，『一切法無我、無人、無眾生、無^lb壽者』。
須菩提，若菩薩作是言：『我當莊嚴佛土』，^lb是不名菩薩！
何以故？如來說莊嚴佛土者，即^lb非莊嚴，是名莊嚴。
須菩提，若菩薩通達無我^lb法者，如來說名真是菩薩！」
^ck18【一體同觀】
「須菩提，於意云何，^pb43如來有肉眼不？」
「如是，世尊，如來有肉眼！」
「須菩^lb提，於意云何，如來有天眼不？」
「如是，世尊！如來^lb有天眼！」
「須菩提，於意云何，如來有慧眼不？」
「如^lb是，世尊！如來有慧眼！」
「須菩提，於意云何，如來^lb有法眼不？」
「如是，世尊！如來有法眼！」
「須菩提，於^pb44意云何，如來有佛眼不？」
「如是，世尊！如來有佛^lb眼！」
「須菩提，於意云何，恒河中所有沙，佛說^lb是沙不？」
「如是，世尊！如來說是沙！」
「須菩提，於意^lb云何，如一恒河中所有沙，有如是等恒河，^lb是諸恒河所有沙數佛世界，如是寧為多不？」
^pb45「甚多，世尊！」
佛告須菩提：「爾所國土中所有眾^lb生若干種心，如來悉知。
何以故？如來說諸心^lb皆為非心，是名為心！
所以者何？須菩提，過去^lb心不可得、現在心不可得、未來心不可得！」
^ck19【法界通化】
「須^lb菩提，於意云何，若有人滿三千大千世界七^pb46寶以用布施，是人以是因緣得福多不？」
「如是，^lb世尊！此人以是因緣得福甚多！」

「須菩提，若福^lb德有實，如來不說得福德多，以福德無故，如^lb來說得福德多！」
^ck20【離色離相】
「須菩提，於意云何，佛可以具^lb足色身見不？」
「不也，世尊！如來不應以具足色^pb47身見！
何以故？如來說具足色身，即非具足色^lb身，是名具足色身！」
「須菩提，於意云何，如來可^lb以具足諸相見不？」
「不也，世尊！如來不應以具^lb足諸相見！
何以故？如來說諸相具足，即非具^lb足，是名諸相具足！」
^ck21【非說所說】


「須菩提，汝勿謂如來作是^pb48念『我當有所說法』！莫作是念！何以故？若人言^lb如來有所說法，即為謗佛！不能解我所說故！
^lb須菩提，說法者，無法可說，是名說法！」
爾時，慧^lb命須菩提白佛言：
「世尊，頗有眾生，於未來世，^lb聞說是法，生信心不？」
佛言：「須菩提，彼非眾生，^pb49非不眾生！
何以故？須菩提，眾生眾生者，如來^lb說非眾生，是名眾生！」
^ck22【無法可得】

須菩提白佛言：
「世尊，佛^lb得阿耨多羅三藐三菩提，為無所得耶？」
佛言：^lb「如是、如是！須菩提，我於阿耨多羅三藐三菩^lb提，乃至無有少法可得，是名阿耨多羅三藐^pb50三菩提！
^ck23【淨心行善】
復次，須菩提，是法平等，無有高下，是^lb名阿耨多羅三藐三菩提！
以無我、無人、無眾^lb生、無壽者，
修一切善法，則得阿耨多羅三藐^lb三菩提！
須菩提，所言善法者，如來說非善^lb法，是名善法！
^ck24【福智無比】
須菩提，若三千大千世界中所^pb51有諸須彌山王，如是等七寶聚，有人持用布^lb施；
若人以此般若波羅蜜經乃至四句偈等，^lb受持、讀誦、為他人說，於前福德，百分不及一、^lb百千萬億分、乃至算數譬喻所不能及！」
^ck25【化無所化】
「須菩^lb提，於意云何？汝等勿謂如來作是念『我當度^pb52眾生』！須菩提，莫作是念！
何以故？實無有眾生^lb如來度者，
若有眾生如來度者，如來則有我、^lb人、眾生、壽者！
須菩提，如來說有我者，則非有^lb我，而凡夫之人，以為有我！
須菩提，凡夫者，如^lb來說則非凡夫！」
^ck26【法身非相】
「須菩提，於意云何，可以三十^pb53二相觀如來不？」
須菩提言：「如是、如是，以三十^lb二相觀如來。」
佛言：「須菩提，若以三十二相觀^lb如來者，轉輪聖王則是如來。」
須菩提白佛言：^lb「世尊，如我解佛所說義，不應以三十二相觀^lb如來。」
爾時，世尊而說偈言：
^pb54^gatha「若以色見我．以音聲求我．是人行邪道，^lb^gatha不能見如來。

^lb^ck27【無斷無滅】
「須菩提，汝若作是念『如來不以具足相故，得^lb阿耨多羅三藐三菩提』。
須菩提，莫作是念！
如^lb來不以具足相故，得阿耨多羅三藐三菩提！
^pb55須菩提，汝若作是念『發阿耨多羅三藐三菩^lb提心者，說諸法斷滅』，莫作是念！
何以故？發阿^lb耨多羅三藐三菩提心者，於法不說斷滅相！
^lb^ck28【不受不貪】
須菩提，若菩薩以滿恒河沙等世界七寶持^lb用布施；
若復有人知一切法無我，得成於忍，^pb56此菩薩勝前菩薩所得功德！
何以故？須菩提，^lb以諸菩薩不受福德故。」
須菩提白佛言：「世尊，^lb云何菩薩不受福德？」
「須菩提，菩薩所作福德^lb不應貪著，是故說不受福德。
^ck29【威儀寂靜】
須菩提，若有人^lb言『如來若來、若去、若坐、若臥』，是人不解我所^pb57說義！
何以故？如來者，無所從來，亦無所去，故^lb名如來！
^ck30【一合理相】
須菩提，若善男子、善女人，以三千大^lb千世界碎為微塵。於意云何，是微塵眾寧為^lb多不？」
「甚多，世尊！
何以故？若是微塵眾實有者，^lb佛則不說是微塵眾！
所以者何？佛說微塵眾，^pb58則非微塵眾，是名微塵眾！
世尊，如來所說三^lb千大千世界，則非世界，是名世界！
何以故？若^lb世界實有者，則是一合相！
如來說一合相，則^lb非一合相，是名一合相！」
「須菩提，一合相者，則^lb是不可說，
但凡夫之人，貪著其事！
^ck31【知見不生】
須菩提，若^pb59人言，『佛說我見、人見、眾生見、壽者見。』須菩提，^lb於意云何，是人解我所說義不？」
「世尊，是^lb人不解如來所說義！
何以故？世尊說我見、人^lb見、眾生見、壽者見，即非我見、人見、眾生見、壽者^lb見，是名我見、人見、眾生見、壽者見！」
「須菩提，^pb60發阿耨多羅三藐三菩提心者，於一切法，應^lb如是知、如是見、如是信解，不生法相！
須菩提，^lb所言法相者，如來說即非法相，是名法相！
^ck32【應化非真】
須^lb菩提，若有人以滿無量阿僧祇世界七寶持^lb用布施；
若有善男子、善女人，發菩薩心者，持^pb61於此經乃至四句偈等，受持、讀誦、為人演說，^lb其福勝彼！
云何為人演說？
不取於相，如如不^lb動！
何以故？^lb^gatha一切有為法．如夢幻泡影．如露亦如電．^lb^gatha應作如是觀！」
^pb62佛說是經已，長老須菩提及諸比丘、比丘尼、^lb優婆塞、優婆夷，一切世間天、人、阿修羅，聞佛^lb所說，皆大歡喜，信受奉行。
^lb金剛般若波羅蜜經
^pb1^folio#vcpp_bodhiruci^bk#vcpp_bodhiruci<heading=金剛經留支 hidden=1>【金剛般若波羅蜜經】^ck0【經題】^lb^au【元魏天竺三藏菩提留支譯】
^lb^ck1〔序分第一〕
^lb如是我聞：
一時
婆伽婆，在舍婆提城祇樹給^lb孤獨園，
與大比丘眾千二百五十人俱。
爾時，^pb2世尊食時，著衣持鉢，
入舍婆提大城乞食。
於^lb其城中，次第乞食已，
還至本處。
飯食訖，收衣^lb鉢，洗足已，
如常敷座，結加趺坐，端身而住，正^lb念不動。
^lb〔護念付囑分第二〕^pb3爾時，諸比丘來詣佛所，到已，頂禮佛足，右遶^lb三匝，退坐一面。
^ck2【善現啟請】
爾時，慧命須菩提，
在大眾中，
^lb即從座起，偏袒右肩，右膝著地，向佛合掌，恭^lb敬而立，白佛言：
「希有！世尊！
如來、應供、正遍知，^lb善護念諸菩薩，
善付囑諸菩薩。
^pb4住分第三^lb世尊！云何菩薩大乘中，發阿耨多羅三藐三^lb菩提心？
應云何住？云何修行？云何降伏其心？」
^lb爾時，佛告須菩提：「善哉，善哉！須菩提！如汝所^lb說：
『如來善護念諸菩薩，
善付囑諸菩薩。』
汝今^pb5諦聽，
當為汝說。
如菩薩大乘中，發阿耨多羅^lb三藐三菩提心，應如是住，如是修行，如是降^lb伏其心。」
須菩提白佛言：「世尊！如是。願樂欲聞。」
^ck3【大乘正宗】
^lb佛告須菩提：「諸菩薩生如是心：
『所有一切眾^lb生，眾生所攝，
若卵生、若胎生、若濕生、若化生，
^pb6若有色、若無色，若有想、若無想、若非有想非^lb無想，
所有眾生界，眾生所攝，我皆令入無餘^lb涅槃而滅度之。』
如是滅度無量無邊眾生，實^lb無眾生得滅度者。
何以故？須菩提！若菩薩有^lb眾生相，即非菩薩。
何以故非？須菩提！若菩薩^pb7起眾生相、人相、壽者相，則不名菩薩。
^lb^ck4〔如實修行分第四〕
^lb「復次，須菩提！
菩薩不住於事行於布施，無所^lb住行於布施，
不住色布施，不住聲、香、味、觸、法^lb布施。
須菩提！菩薩應如是布施，不住於相想。
^pb8何以故？若菩薩不住相布施，其福德聚不可^lb思量。
「須菩提！於汝意云何？東方虛空可思量^lb不？」
須菩提言：「不也，世尊！」
佛言：「如是，須菩提！南^lb西北方四維上下虛空，可思量不？」
須菩提言：^lb「不也，世尊！」
佛言：「如是，如是！須菩提！菩薩無住^pb9相布施，福德聚亦復如是不可思量。」
佛復告^lb須菩提：「菩薩但應如是行於布施。」
^lb^ck5〔如來非有為分第五〕
^lb「須菩提！於意云何？可以相成就見如來不？」
須^lb菩提言：「不也，世尊！不可以相成就得見如來。
^pb10何以故？如來所說相，即非相。」
佛告須菩提：
「凡^lb所有相，皆是妄語。若見諸相非相，則非妄語。^lb如是諸相非相，則見如來。」
^lb^ck6〔我空法分第六〕
^lb須菩提白佛言：
「世尊！頗有眾生，於未來世末^pb11世，得聞如是修多羅章句，生實相不？」
佛告須^lb菩提：「莫作是說：
『頗有眾生，於未來世末世，得^lb聞如是修多羅章句，生實相不？』」
佛復告須菩^lb提：「有未來世末世，有菩薩摩訶薩，法欲滅時，^lb有持戒修福德智慧者，
於此修多羅章句，能^pb12生信心，以此為實。」
佛復告須菩提：「當知彼菩^lb薩摩訶薩，非於一佛二佛三四五佛所修行^lb供養，非於一佛二佛三四五佛所而種善根。」
^lb佛復告須菩提：「已於無量百千萬諸佛所修^lb行供養，無量百千萬諸佛所種諸善根。
聞是^pb13修多羅，乃至一念能生淨信。
須菩提！如來悉^lb知是諸眾生，如來悉見是諸眾生。須菩提！是^lb諸菩薩，生如是無量福德聚，取如是無量福^lb德。
何以故？須菩提！是諸菩薩，無復我相、眾生^lb相、人相、壽者相。
「須菩提！是諸菩薩，無法相，亦^pb14非無法相。無相，亦非無相。
何以故？須菩提！是^lb諸菩薩，若取法相，則為著我、人、眾生、壽者。
須^lb菩提！若是菩薩有法相，即著我相、人相、眾生^lb相、壽者相。
何以故？須菩提！不應取法，非不取^lb法。
以是義故，如來常說栰喻法門，是法應捨，^pb15非捨法故。」
^ck7【無得無說】
復次，佛告慧命須菩提：
「須菩提！於^lb意云何？如來得阿耨多羅三藐三菩提耶？如^lb來有所說法耶？」
須菩提言：
「如我解佛所說義，^lb無有定法如來得阿耨多羅三藐三菩提，亦^lb無有定法如來可說。
何以故？如來所說法，皆^pb16不可取不可說，非法非非法。
何以故？一切聖^lb人，皆以無為法得名。」
^lb^ck8〔具足功德校量分第七〕
^lb「須菩提！於意云何？若滿三千大千世界七寶，^lb以用布施。須菩提！於意云何？是善男子、善女^pb17人，所得福德，寧為多不？」
須菩提言：「甚多，婆伽^lb婆！甚多，修伽陀！彼善男子、善女人，得福甚多。
^lb何以故？世尊！是福德聚，即非福德聚，是故如^lb來說福德聚、福德聚。」
佛言：「須菩提！若善男子、^lb善女人，以滿三千大千世界七寶，持用布施。
^pb18若復於此經中，受持乃至四句偈等，為他人^lb說，其福勝彼無量不可數。
何以故？須菩提！一^lb切諸佛阿耨多羅三藐三菩提法，皆從此經^lb出。一切諸佛如來，皆從此經生。
須菩提！所謂^lb佛法、佛法者，即非佛法。
^ck9【一相無相】
「須菩提！於^pb19意云何？須陀洹能作是念：『我得須陀洹果。』不？」
^lb須菩提言：「不也，世尊！何以故？實無有法名須^lb陀洹。
不入色聲香味觸法，是名須陀洹。」

佛言：「^lb須菩提！於意云何？斯陀含能作是念：『我得斯^lb陀含果。』不？」
須菩提言：「不也，世尊！何以故？實無^pb20有法名斯陀含。是名斯陀含。」
「須菩提！於意云^lb何？阿那含能作是念：『我得阿那含果。』不？」
須菩^lb提言：「不也，世尊！何以故？實無有法名阿那含。^lb是名阿那含。」
「須菩提！於意云何？阿羅漢能作^lb是念：『我得阿羅漢。』不？」
須菩提言：「不也，世尊！^pb21何以故？實無有法名阿羅漢。
世尊！若阿羅漢^lb作是念：『我得阿羅漢。』即為著我、人、眾生、壽者。
^lb世尊！佛說我得無諍三昧，最為第一，世尊說^lb我是離欲阿羅漢。世尊！我不作是念：『我是離^lb欲阿羅漢。』
世尊！我若作是念：『我得阿羅漢。』世^pb22尊則不說我無諍行第一。以須菩提實無所^lb行，而名須菩提無諍、無諍行。」
^ck10【莊嚴淨土】
佛告須菩提：「於^lb意云何？如來昔在燃燈佛所，得阿耨多羅三^lb藐三菩提法不？」
須菩提言：「不也，世尊！如來在^lb燃燈佛所，於法實無所得阿耨多羅三藐三^pb23菩提。」
佛告須菩提：「若菩薩作是言：『我莊嚴佛^lb國土。』
彼菩薩不實語。何以故？須菩提！如來所^lb說莊嚴佛土者，則非莊嚴，是名莊嚴佛土。
是^lb故須菩提！諸菩薩摩訶薩，應如是生清淨心，^lb而無所住，不住色生心，不住聲、香、味、觸、法生^pb24心，應無所住而生其心。
「須菩提！譬如有人，身^lb如須彌山王。須菩提！於意云何？是身為大不？」
^lb須菩提言：「甚大，世尊！何以故？佛說非身，是名^lb大身。彼身非身，是名大身。」
^ck11【無為福勝】
佛言：「須菩提！如恒^lb河中所有沙數，如是沙等恒河，於意云何？是^pb25諸恒河沙，寧為多不？」
須菩提言：「甚多，世尊！但^lb諸恒河，尚多無數，何況其沙。」
佛言：「須菩提！我^lb今實言告汝。若有善男子、善女人，以七寶滿^lb爾所恒河沙數世界，以施諸佛如來。須菩提！^lb於意云何？彼善男子、善女人，得福多不？」
須菩^pb26提言：「甚多，世尊！彼善男子、善女人，得福甚多。」
^lb佛告須菩提：「以七寶滿爾數恒河沙世界，持^lb用布施。若善男子、善女人，於此法門，乃至受^lb持四句偈等，為他人說，而此福德，勝前福德^lb無量阿僧祇。
^lb^ck12【尊重正教】
「復次，須菩提！隨所有處，說是法^pb27門，乃至四句偈等，當知此處，一切世間天人^lb阿修羅，皆應供養，如佛塔廟。
何況有人，盡能^lb受持讀誦此經。
須菩提！當知是人，成就最上^lb第一希有之法。若是經典所在之處，則為有^lb佛，若尊重似佛。」
^ck13【如法受持】
爾時，須菩提白佛言：
「世尊！當^pb28何名此法門？我等云何奉持？」
佛告須菩提：
「是^lb法門名為『金剛般若波羅蜜』。
以是名字，汝當^lb奉持。
何以故？須菩提！佛說般若波羅蜜，則非^lb般若波羅蜜。
「須菩提！於意云何？如來有所說^lb法不？」
須菩提言：「世尊！如來無所說法。」
「須菩提！^pb29於意云何？三千大千世界所有微塵，是為多^lb不？」
須菩提言：「彼微塵甚多。世尊！」
「須菩提！是諸^lb微塵，如來說非微塵，是名微塵。如來說世界，^lb非世界，是名世界。」
佛言：「須菩提！於意云何？可^lb以三十二大人相見如來不？」
須菩提言：「不也，^pb30世尊！
何以故？如來說三十二大人相，即是非^lb相，是名三十二大人相。」
佛言：「須菩提！若有善^lb男子、善女人，以恒河沙等身命布施，
若復有^lb人，於此法門中，乃至受持四句偈等，為他人^lb說，其福甚多無量阿僧祇。」
^ck14【離相寂滅】
爾時，須菩提聞說^pb31是經，深解義趣，涕淚悲泣，捫淚而白佛言：
「希^lb有，婆伽婆！希有，修伽陀！佛說如是甚深法門，^lb我從昔來所得慧眼，未曾得聞如是法門。」
「何^lb以故？須菩提！佛說般若波^lb羅蜜，即非般若波羅蜜。」
「世尊！若復有人得聞是經，信心清淨，則^pb32生實相，當知是名成就第一希有功德。
世尊！^lb是實相者則是非相。是故如來說名實相、實^lb相。
世尊！我今得聞如是法門，信解受持，不足^lb為難。
若當來世其有眾生得聞是法門信解^lb受持，是人則為第一希有。
何以故？此人無我^pb33相、人相、眾生相、壽者相。
何以故？我相，即是非^lb相；人相、眾生相、壽者相，即是非相。
何以故？離^lb一切諸相，則名諸佛。」
佛告須菩提：
「如是，如是！
^lb若復有人得聞是經，不驚不怖不畏，當知是^lb人甚為希有。
何以故？須菩提！如來說第一波^pb34羅蜜，非第一波羅蜜。如來說第一波羅蜜者，^lb彼無量諸佛亦說波羅蜜，是名第一波羅蜜。
^lb「須菩提！如來說忍辱波羅蜜，即非忍辱波羅^lb蜜。
何以故？須菩提！如我昔為歌利王割截身^lb體。我於爾時，無我相、無眾生相、無人相、無壽^pb35者相，無相，亦非無相。
何以故？須菩提！我於往^lb昔節節支解時，若有我相、眾生相、人相、壽者^lb相，應生瞋恨。
須菩提！又念過去於五百世，作^lb忍辱仙人，於爾所世，無我相、無眾生相、無人^lb相、無壽者相。
是故須菩提！菩薩應離一切相，^pb36發阿耨多羅三藐三菩提心。何以故？若心有^lb住，則為非住。
不應住色生心，不應住聲、香、味、^lb觸、法生心，應生無所住心。

是故佛說：『菩薩心^lb不住色布施。』
須菩提！菩薩為利益一切眾生，^lb應如是布施。」
須菩提言：「世尊！一切眾生相，即^pb37是非相。
何以故？如來說：『一切眾生，即非眾生。』」
^lb「須菩提！如來是真語者、實語者、如語者、不異^lb語者。
須菩提！如來所得法，所說法，無實無妄^lb語。
^lb真如分第八^pb38「須菩提！譬如有人入闇，則無所見。若菩薩心^lb住於事而行布施，亦復如是。
須菩提！譬如人^lb有目，夜分已盡，日光明照，見種種色。若菩薩^lb不住於事行於布施，亦復如是。
「復次，須菩提！^lb若有善男子、善女人，能於此法門，受持讀誦^pb39修行，則為如來以佛智慧，悉知是人，悉見是^lb人，悉覺是人，皆得成就無量無邊功德聚。
^ck15【持經功德】
「須^lb菩提！若有善男子、善女人，初日分以恒河沙^lb等身布施，
中日分復以恒河沙等身布施，
後^lb日分復以恒河沙等身布施，如是捨恒河沙^pb40等無量身，
如是百千萬億那由他劫以身布^lb施。
若復有人，聞此法門，信心不謗，其福勝彼^lb無量阿僧祇，何況書寫受持讀誦修行，為人^lb廣說。
^lb利益分第九^pb41「須菩提！以要言之，是經有不可思議不可稱^lb量無邊功德。
此法門，如來為發大乘者說，為^lb發最上乘者說。
若有人能受持讀誦修行此^lb經，廣為人說，如來悉知是人，悉見是人，
皆成^lb就不可思議不可稱無有邊無量功德聚。
如^pb42是人等，則為荷擔如來阿耨多羅三藐三菩^lb提。
何以故？須菩提！若樂小法者，則於此經，不^lb能受持讀誦修行，為人解說。
若有我見眾生^lb見人見壽者見，
於此法門，能受持讀誦修行^lb為人解說者，無有是處。
「須菩提！在在處處，若^pb43有此經，一切世間天、人、阿修羅所應供養。當^lb知此處，則為是塔，皆應恭敬，作禮圍繞，以諸^lb華香而散其處。
^ck16【能淨業障】
「復次，須菩提！若善男子、善女^lb人，受持讀誦此經，為人輕賤。
何以故？是人先^lb世罪業，應墮惡道，以今世人輕賤故，先世罪^pb44業則為消滅，當得阿耨多羅三藐三菩提。
「須^lb菩提！我念過去無量阿僧祇阿僧祇劫，於燃^lb燈佛前，得值八十四億那由他百千萬諸佛，^lb我皆親承供養，無空過者。須菩提！如是無量^lb諸佛，我皆親承供養，無空過者。
若復有人，於^pb45後世末世，能受持讀誦修行此經，
所得功德，^lb我所供養諸佛功德，於彼百分不及一，千萬^lb億分，乃至算數譬喻所不能及。
「須菩提！若有^lb善男子、善女人，於後世末世，有受持讀誦修^lb行此經，所得功德，若我具說者，或有人聞，心^pb46則狂亂，疑惑不信。
須菩提！當知是法門不可^lb思議，果報亦不可思議。」
^lb^ck17〔斷疑分第十〕
^lb爾時，須菩提白佛言：「世尊！云何菩薩發阿耨^lb多羅三藐三菩提心？云何住？云何修行？云何^pb47降伏其心？」
佛告須菩提：「菩薩發阿耨多羅三^lb藐三菩提心者，當生如是心：
『我應滅度一切^lb眾生，令入無餘涅槃界。
如是滅度一切眾生^lb已，而無一眾生實滅度者。』
何以故？須菩提！若^lb菩薩有眾生相、人相、壽者相，則非菩薩。
何以^pb48故？須菩提！實無有法，名為菩薩發阿耨多羅^lb三藐三菩提心者。
「須菩提！於意云何？如來於^lb燃燈佛所，有法得阿耨多羅三藐三菩提不？」
^lb須菩提白佛言：「不也！世尊！如我解佛所說義，^lb佛於燃燈佛所，無有法得阿耨多羅三藐三^pb49菩提。」
佛言：「如是，如是！
須菩提！實無有法，如來^lb於燃燈佛所得阿耨多羅三藐三菩提。
須菩^lb提！若有法如來得阿耨多羅三藐三菩提者，^lb燃燈佛則不與我受記：『汝於來世，當得作佛，^lb號釋迦牟尼。』
以實無有法，得阿耨多羅三藐^pb50三菩提，是故燃燈佛與我受記，作如是言：『摩^lb那婆！汝於來世，當得作佛，號釋迦牟尼。』
何以^lb故？須菩提！言如來者，即實真如。




「須菩提！若有^lb人言：『如來得阿耨多羅三藐三菩提。』者，是人^lb不實語。須菩提！實無有法，佛得阿耨多羅三^pb51藐三菩提。
須菩提！如來所得阿耨多羅三藐^lb三菩提，於是中不實不妄語。
是故如來說：『一^lb切法皆是佛法。』
須菩提！所言一切法、一切法^lb者，即非一切法，是故名一切法。
「須菩提！譬如^lb有人，其身妙大。」
須菩提言：「世尊！如來說人身^pb52妙大，則非大身，是故如來說名大身。」
佛言：「須^lb菩提！菩薩亦如是。若作是言：『我當滅度無量^lb眾生。』則非菩薩。」
佛言：「須菩提！於意云何？頗有^lb實法名為菩薩？」
須菩提言：「不也，世尊！實無^lb有法名為菩薩。」

「是故佛說：『一切法無眾生、無^pb53人、無壽者。』
須菩提！若菩薩作是言：『我莊嚴佛^lb國土。』是不名菩薩。
何以故？如來說莊嚴佛土、^lb莊嚴佛土者，即非莊嚴，是名莊嚴佛國土。
須^lb菩提！若菩薩通達無我、無我法者，如來說名^lb真實菩薩。
^ck18【一體同觀】
「須菩提！於意云何？如來有肉眼不？」
^pb54須菩提言：「如是，世尊！如來有肉眼。」
佛言：「須菩^lb提！於意云何？如來有天眼不？」
須菩提言：「如是，^lb世尊！如來有天眼。」
佛言：「須菩提！於意云何？如^lb來有慧眼不？」
須菩提言：「如是，世尊！如來有慧^lb眼。」
佛言：「須菩提！於意云何？如來有法眼不？」
須^pb55菩提言：「如是，世尊！如來有法眼。」
佛言：「須菩提！^lb於意云何？如來有佛眼不？」
須菩提言：「如是，世^lb尊！如來有佛眼。」
佛言：「須菩提！於意云何？如恒^lb河中所有沙，佛說是沙不？」
須菩提言：「如是，世^lb尊！如來說是沙。」
佛言：「須菩提！於意云何？如一^pb56恒河中所有沙，有如是等恒河，是諸恒河所^lb有沙數佛世界，如是世界，寧為多不？」
須菩提^lb言：「彼世界甚多。世尊！」
佛告須菩提：「爾所世界^lb中，所有眾生，若干種心住，如來悉知。
何以故？^lb如來說諸心住，皆為非心住，是名為心住。
何^pb57以故？須菩提！過去心不可得，現在心不可得，^lb未來心不可得。
^ck19【法界通化】
「須菩提！於意云何？若有人以^lb滿三千大千世界七寶持用布施，是善男子、^lb善女人，以是因緣，得福多不？」
須菩提言：「如是，^lb世尊！此人以是因緣，得福甚多。」
佛言：「如是，如^pb58是！須菩提！彼善男子、善女人，以是因緣，得福^lb德聚多。
須菩提！若福德聚有實，如來則不說^lb福德聚、福德聚。
^ck20【離色離相】
「須菩提！於意云何？佛可以具^lb足色身見不？」
須菩提言：「不也，世尊！如來不應^lb以色身見。
何以故？如來說具足色身，即非具^pb59足色身，是故如來說名具足色身。」
佛言：「須菩^lb提！於意云何？如來可以具足諸相見不？」
須菩^lb提言：「不也，世尊！如來不應以具足諸相見。
何^lb以故？如來說諸相具足，即非具足，是故如來^lb說名諸相具足。」
^ck21【非說所說】


佛言：「須菩提！於意云何？汝謂^pb60如來作是念：『我當有所說法。』耶？須菩提！莫作^lb是念。何以故？若人言：『如來有所說法。』即為謗^lb佛，不能解我所說故。
何以故？須菩提！如來說^lb法、說法者，無法可說，是名說法。」
爾時，慧命須^lb菩提白佛言：
「世尊！頗有眾生，於未來世，聞說^pb61是法，生信心不？」
佛言：「須菩提！彼非眾生，非不^lb眾生。
何以故？須菩提！眾生、眾生者，如來說非^lb眾生，是名眾生。」
^ck22【無法可得】
佛言：「須菩提！於意云何？如來^lb得阿耨多羅三藐三菩提耶？」
須菩提言：
「不也！^lb世尊！世尊，無有少法如來得阿耨多羅三藐^pb62三菩提。」
佛言：「如是，如是！須菩提！我於阿耨多^lb羅三藐三菩提，乃至無有少法可得，是名阿^lb耨多羅三藐三菩提。
^ck23【淨心行善】
「復次，須菩提！是法平等，^lb無有高下，是名阿耨多羅三藐三菩提。
以無^lb眾生、無人、無壽者，
得平等阿耨多羅三藐三^pb63菩提，一切善法得阿耨多羅三藐三菩提。
須^lb菩提！所言善法、善法者，如來說非善法，是名^lb善法。
^ck24【福智無比】
「須菩提！三千大千世界中，所有諸須彌^lb山王，如是等七寶聚，有人持用布施，
若人以^lb此般若波羅蜜經，乃至四句偈等，受持讀誦，^pb64為他人說，於前福德，百分不及一，千分不及^lb一，百千萬分不及一，歌羅分不及一，數分不^lb及一，優波尼沙陀分不及一，乃至算數譬喻^lb所不能及。
^ck25【化無所化】
「須菩提！於意云何？汝謂如來作是^lb念：『我度眾生。』耶？須菩提！莫作是念。
何以故？實^pb65無有眾生如來度者。」
佛言：「須菩提！若有實眾^lb生如來度者，如來則有我、人、眾生、壽者相。
須^lb菩提！如來說：『有我者，則非有我，而毛道凡夫^lb生者以為有我。』
須菩提！毛道凡夫生者，如來^lb說名非生，是故言毛道凡夫生。
^ck26【法身非相】
「須菩提！於意^pb66云何？可以相成就得見如來不？」
須菩提言：「如^lb我解如來所說義，不以相成就得見如來。」
佛^lb言：「如是，如是！須菩提！不以相成就得見如來。」
^lb佛言：「須菩提！若以相成就觀如來者，轉輪聖^lb王應是如來，是故非以相成就得見如來。」
爾^pb67時，世尊而說偈言：
^lb^gatha「若以色見我．以音聲求我．是人行邪道，^lb^gatha不能見如來。
^gatha彼如來妙體．即法身諸佛，^lb^gatha法體不可見．彼識不能知。
^ck27【無斷無滅】
^lb「須菩提！於意云何？如來可以相成就得阿耨^pb68多羅三藐三菩提？
須菩提！莫作是念：『如來^lb以相成就得阿耨多羅三藐三菩提。』
須菩提！^lb汝若作是念：『菩薩發阿耨多羅三藐三菩提^lb心者，說諸法斷滅相。』須菩提！莫作是念。
菩薩^lb發阿耨多羅三藐三菩提心者，不說諸法斷滅相。
^pb69何以故？菩薩摩訶薩發阿耨多羅三藐三菩^lb提心者，於法不說斷滅相故。
^ck28【不受不貪】
「須菩提！若善男^lb子、善女人，以滿恒河沙等世界七寶，持用布^lb施。
若有菩薩，知一切法無我，得無生法忍。此^lb功德勝前所得福德。
須菩提！以諸菩薩不取^pb70福德故。」
須菩提白佛言：「世尊！菩薩不取福德？」
^lb佛言：「須菩提！菩薩受福德，不取福德，是故菩^lb薩取福德。
^ck29【威儀寂靜】
「須菩提！若有人言：『如來若去若來^lb若住、若坐若臥。』是人不解我所說義。
何以故？^lb如來者，無所至去，無所從來，故名如來。
^ck30【一合理相】
「須菩^pb71提！若善男子、善女人，以三千大千世界微塵。^lb復以爾許微塵世界，碎為微塵阿僧祇。須菩^lb提！於意云何？是微塵眾，寧為多不？」
須菩提言：「^lb彼微塵眾甚多。
世尊！何以故？若是微塵眾實^lb有者，佛則不說是微塵眾。
何以故？佛說微塵^pb72眾，則非微塵眾，是故佛說微塵眾。
世尊！如來^lb所說三千大千世界，則非世界，是故佛說三^lb千大千世界。
何以故？若世界實有者，則是一^lb合相。
如來說一合相，則非一合相，是故佛說^lb一合相。」
佛言：「須菩提！一合相者，則是不可說，
^pb73但凡夫之人，貪著其事。
^ck31〔知見不生〕
何以故？須菩提！若人^lb如是言：『佛說我見、人見、眾生見、壽者見。』須菩^lb提！於意云何？是人所說，為正語不？」
須菩提言：^lb「不也，世尊！
何以故？世尊！如來說我見、人見、眾^lb生見、壽者見，即非我見、人見、眾生見、壽者見，^pb74是名我見、人見、眾生見、壽者見。」
「須菩提！菩薩^lb發阿耨多羅三藐三菩提心者，於一切法，應^lb如是知，如是見，如是信，如是不住法相。
何以^lb故？須菩提！所言法相、法相者，如來說即非法^lb相，是名法相。
^ck32〔應化非真〕
須菩提！若有菩薩摩訶薩以滿^pb75無量阿僧祇世界七寶，持用布施。
若有善男^lb子、善女人，發菩薩心者，於此般若波羅蜜經，^lb乃至四句偈等，受持讀誦，為他人說，其福勝^lb彼無量阿僧祇。
云何為人演說
而不名說，是^lb名為說。」
爾時世尊而說偈言：^pb76不住道分第十一^lb^gatha「一切有為法．如星、翳、燈、幻．露、泡、夢、電、雲，^lb^gatha應作如是觀。」
^lb流通分第十二^lb佛說是經已，長老須菩提，及諸比丘、比丘尼、^pb77優婆塞、優婆夷、菩薩摩訶薩，一切世間天、人、^lb阿修羅、乾闥婆等，聞佛所說，皆大歡喜，信受^lb奉行。
^lb^lb金剛般若波羅蜜經
^pb1^folio#vcpp_gupta^bk#vcpp_gupta<heading=金剛經笈多 hidden=1>【金剛能斷般若波羅蜜經】^ck0【經題】^lb^au【．．．隋．．三藏．．笈多】
^lb^ck1【法會因由】歸命一切佛菩薩海等
^lb如是我聞：
一時
世尊聞者遊行勝林中，無親^lb搏施與園中，
大比丘眾共，半三十比丘百。
爾^pb2時，世尊前分時，上裙著已，器上絡衣持，
聞者^lb大城搏為入。
爾時，世尊聞者大城搏為行已，
^lb作已食作已，
後食搏墮過，器上絡衣收攝，兩^lb足洗，
坐具世尊施設，如是座中跏趺結，直身^lb作，現前念近住。
爾時，多比丘，若世尊彼詣到^pb3已，世尊兩足頂禮，世尊邊三右繞作已，一邊^lb坐。
^ck2【善現啟請】
彼復時，命者善實，彼所如是眾聚集會坐。

^lb爾時，命者善實起坐。一肩上著作已，右膝輪^lb地著已，若世尊，彼合掌，向世尊邊如是言。
希^lb有，世尊！
乃至所有如來、應、正遍知，菩薩摩訶^pb4薩順攝，最勝順攝；
乃至所有如來、應、正遍知，^lb菩薩摩訶薩付囑，最勝付囑。
彼云何，世尊！菩^lb薩乘發行，住應？
云何修行應？云何心降伏應？
^lb如是語已。世尊，命者善實邊如是言：善，善！善^lb實！如是，如是！善實！如是，如是。
順攝，如來，菩薩^pb5摩訶薩最勝順攝；
付囑，如來，菩薩摩訶薩最^lb勝付囑。
彼，善實！聽善，善意念作，
說當。
如菩薩^lb乘發行住應，如修行應，如心降伏應。
‘如是，世^lb尊！’命者善實，世尊邊願欲聞。
^ck3【大乘正宗】
世尊於此言：「此，^lb善實！菩薩乘發行，如是心發生應。
所有，善實！^pb6眾生，眾生攝攝已，
卵生、若胎生、若濕生、若化^lb生，
若色、若無色，若想、若無想、若非想非無想，
^lb所有眾生界施設已，彼我一切無受餘涅槃^lb界滅度應。
如是無量雖眾生滅度，無有一眾^lb生滅度有。
彼何所因？若，善實！菩薩摩訶薩眾^pb7生想轉，不彼菩薩摩訶薩名說應。
彼何所因？^lb不彼，善實！菩薩名說應，若眾生想轉，壽想若、^lb人想若轉。
^ck4【妙行無住】
雖然復次時，善實！
不菩薩摩訶薩^lb事住施與應，無所住施與應。
不色住施與應，^lb不聲、香、味、觸、法中住施與應。
如是，此，善實！菩^pb8薩摩訶薩施與應，如不相想亦住。
彼何所因？^lb若，善實！菩薩摩訶薩不住與施，彼所，善實！福^lb聚不可量受取。
彼何意念？善實！可前方虛空，^lb量受取？
善實言：‘不如此，世尊！’
世尊言：‘如是右南、^lb後西、高北、下、上方，順不正方，普十方，可虛^pb9空量受取？’
善實言：‘不如此，世尊！’
世尊言：‘如是，^lb如是！善實！如是，如是！若菩薩摩訶薩不住施^lb與，彼所，善實！福聚不可量受取。’
雖然復次時，^lb善實！如是菩薩乘發行施與應，如不相想亦^lb住。
^ck5【如理實見】
彼何意念？善實！相具足如來見應？
善實言：‘^pb10不，世尊！相具足如來見應。’
彼何所因？若彼，如^lb來相具足說；彼如是非相具足。
如是語已。世^lb尊，命者善實邊如是言：
所有，善實！相具足，所^lb有妄，所有不相具足，所有不妄，名此相不相^lb如來見應。
^ck6【正信希有】
如是語已。命者善實，世尊邊如是^pb11言：
雖然，世尊！頗有眾生當有，未來世，後時、後^lb長時、後分五百，正法破壞時中，轉時中，若此^lb中，如是色類經中說中，實想發生當有？
世尊^lb言：莫，善實！汝如是語：
‘雖然，世尊！頗有眾生，當^lb有未來世，後時、後長時、後分五百，正法破壞^pb12時中，轉時中，若此中，如是色類經中說中，實^lb想發生當有？’
雖然復次時，善實！當有未來世，^lb菩薩摩訶薩，後分五百，正法破壞時中，轉時^lb中，戒究竟、功德究竟、智慧究竟。

不，復次時，彼，^lb善實！菩薩摩訶薩一佛親近供養當有，不一^pb13佛種植善根。
雖然復次時，善實！不一佛百千^lb親近供養，不一佛百千種植善根，彼菩薩摩^lb訶薩當有，
若此中，如是色類中，經句中說中，^lb一心淨信亦得當。
知彼，善實！如來佛智；見彼，^lb善實！如來佛眼。一切彼，善實！無量福聚生當^pb14取當。
彼何所因？不，善實！彼等菩薩摩訶薩我^lb想轉，不眾生想、不壽想、不人想轉。
不亦彼等，^lb善實！菩薩摩訶薩，法想轉，無法想轉；不亦彼^lb等，想、無想轉不。
彼何所因？若，善實！彼等菩薩^lb摩訶薩法想轉，彼如是，彼等我取有，眾生取、^pb15壽取、人取有。
若無法想轉，彼如是，彼等我取^lb有，眾生取、壽取、人取有。
彼何所因？不，復次時，^lb善實！菩薩摩訶薩法取應，不非法取應。
彼故，^lb此義意，如來說，筏喻法本，解法如是捨應，何^lb況非法。
^ck7【無得無說】
復次，世尊，命者善實邊如是言：
彼何^pb16意念？善實！有如來、應、正遍知，無上正遍知證^lb覺？有復法如來說？
善實言：
‘如我，世尊！世尊說^lb義解我，無有一法若如來無上正遍知證覺；^lb無有一法若如來說。’
彼何所因？若彼，如來法^lb說，不可取，彼不可說，不彼法，非不法。
彼何因？^pb17無為法顯明聖人。
^ck8【依法出生】
世尊言：‘彼何意念？善實！若^lb有善家子，若善家女，若此三千大千世界七^lb寶滿作已，如來等，應等，正遍知等施與。彼何^lb意念？善實！雖然，彼善家子，若善家女，若彼緣，^lb多福聚生？
善實言：‘多，世尊！多，善逝！彼善家子，^pb18若善家女，若彼緣，多福聚生！’
彼何所因？若彼，^lb世尊！福聚如來說，非聚彼。世尊！如來說福^lb聚、福聚者。
世尊言：若復，善實！善家子，若善家^lb女，若此三千大千世界七寶滿作已，如來等、^lb應等、正遍知等施與。
若此法本，乃至四句等^pb19偈，受已，為他等分別廣說，此，彼緣，多過福聚^lb生，無量、不可數。
彼何所因？此出，善實！如來、應、^lb正遍知，無上正遍知；此生佛、世尊。
彼何所因？^lb佛法、佛法者，善實！非佛法，如是彼；彼故說名^lb佛法者。
^ck9【一相無相】
世尊言：彼何意念？善實！雖然，流入如^pb20是念：『我流入果得到。』？
善實言：「不如此，世尊！彼^lb何所因？不彼，世尊！一入，彼故說名流入。
不色^lb入，不聲、不香、不味、不觸、不法入，彼故說名流^lb入者。
彼若，世尊！流入如是念：『我流入果得到。』^lb彼如是，彼所我取有，眾生取、壽取、人取有。
世^pb21尊言：彼何意念？善實！雖然，一來如是念：『我一^lb來果得到』？
善實言：「不如此，世尊！彼何所因？不^lb一來如是念：『我一來果得到。』彼何所因？彼^lb有法若一來人，彼故說名一來者。
世尊言：「彼^lb何意念？善實！雖然，不來如是念：『我不來果得^pb22到。』？
善實言：「不如此，世尊！彼何所因？不彼有法^lb若不來入，彼故說名不來者。」
世尊言：「彼何意^lb念？善實！雖然，應如是念：『我應得到。』」？
善實言：‘不^lb如此，世尊！彼何所因？不彼，世尊！有法若應名，^lb彼故說名應者。
彼若，世尊！應如是念：『我應得^pb23到。』如是彼所我取有，眾生取、壽取、人取有。
彼^lb何所因？我是，世尊！如來、應、正遍知，無諍行最^lb勝說，我此，世尊！應離欲。不我，世尊！如是念：『我^lb此應者。』
若我，世尊！如是念：『我應得到。』不我如^lb來記說：『無諍行最勝』，善實善家子無所行，彼^pb24故說名無諍行、無諍行者。
^ck10【莊嚴淨土】
世尊言：「彼何意念？^lb善實！有一法若，如來燈作如來、應、正遍知受^lb取？」。
善實言：「不如此，世尊！無一法，若如來燈作^lb如來、應、正遍知受取。」
世尊言：「若有，善實！菩薩^lb摩訶薩如是語：『我國土莊嚴成就我者。』彼不^pb25如語。
彼何所因？國土莊嚴者，善實！不莊嚴彼^lb如來說；彼故說名國土莊嚴者。
彼故此，善實！^lb菩薩摩訶薩如是不住心發生應，不色住心^lb發生應，不聲、香、味、觸、法住心發生應，無所住^lb心發生應！
譬如，善實！丈夫有，此如是色我身^lb有，譬如善高山王。彼何意念？善實！雖然，彼大^pb26我身有？！
善實言：「大，世尊！大，善逝！彼我身有。彼^lb何所因？我身、我身者，世尊！不有，彼，如來說；彼^lb故，說名我身者。不彼，世尊！有；彼故，說名我身^lb者。」
^ck11【無為福勝】
世尊言：「彼何意念？善實！所有恒伽大河沙，^pb27彼所有，如是恒伽大河有，彼中若沙，雖然，彼^lb多沙有？」
善實言：「彼如是所有，世尊！多，恒伽大^lb河有，何況若彼中沙。」
世尊言：「欲我汝，善實！知^lb我汝。所有彼中恒伽大河中沙有，彼所有世^lb界有，如是婦女，若丈夫，若七寶滿作已，如來^pb28等、應等、正遍知等施與。彼何意念？善實！雖然，^lb彼婦女，若丈夫，若彼緣，多福聚生？」
善實言：「多，^lb世尊！多，善逝！彼婦女，若丈夫，若彼緣，多福聚^lb生，無量、不可數。」
世尊言：「若復時，善實！善家子，^lb若善家女，若彼所有世界七寶滿作已，如來^pb29等、應等、正遍知等施與。若此法本乃至四句^lb等偈，受已，為他等分別廣說，此如是，彼緣，多^lb過福聚生，無量、不可數！
^ck12【尊重正教】
雖然復次時，善實！此^lb中地分，此法本乃至四句等偈，為他等說，若^lb分別，若廣說，若彼地分支帝有天、人、阿脩羅^pb30世。
何復言，善實！若此法本，持當、讀當、誦當，他^lb等及分別廣說當。
最勝彼希有具足當有。此^lb中，善實！地分教師遊行，別異尊重處相似，共^lb梵行。」
^ck13【如法受持】
如是語已。命者善實，世尊邊如是言：
「何^lb名此，世尊！法本？云何及如此持我？」
如是語已。^pb31世尊，命者善實邊如是言：
「‘智慧彼岸到’名此，^lb善實！
法本，如是此持。
彼何所因？若如是，善實！^lb智慧彼岸到；如來說，彼如是非彼岸到；彼故，^lb說名智慧彼岸到者
彼何意念？善實！雖然，有^lb法若如來說？
善實言：「不如此，世尊！不有，世尊！^pb32法，若如來說。」
世尊言：「所有，善實！三千大千世^lb界地塵有多有？」
善實言：「多，世尊！多，善逝！彼地^lb塵。」
彼何所因？若彼，世尊！地塵如來說；非塵彼^lb如來說；彼故，說名地塵者。若彼世界如來說；^lb非界如來說；彼故說名世界者。
世尊言：「彼何^pb33意念？善實！三十二大丈夫相，如來、應、正遍知^lb見應？」
善實言：「不如此，世尊！不三十二大丈夫^lb相，如來、應、正遍知見應。
彼何所因？所有，世尊！^lb三十二大丈夫相，如來說；非相所有，如來說；^lb彼故說名三十二大丈夫相者。」
世尊言：「若復^pb34時，善實！婦女，若丈夫，若日日恒伽河沙等我^lb身捨，如是捨恒伽河沙等劫所有我身捨，
若^lb此法本乃至四句等偈，受已，為他等分別，此^lb如是，彼緣，多過福聚生，無量、不可數。」
^ck14【離相寂滅】
爾時，命^lb者善實，法疾轉力淚出，彼淚拭已，世尊邊如^pb35是言。
希有，世尊！最勝希有，善逝！所有此法本^lb如來說，此我，世尊！智生，不我曾生來，如是色^lb類法本聞先。

最勝，彼，世尊！希有具足眾生有^lb當，若此經中說中，實想發生當。
彼何所因？若^lb此，世尊！實想；彼如是，非想；彼故，如來說實想、^pb36實想者。
不我，世尊！希有。若我此法本說中，信^lb我、解我。
若彼，世尊！眾生有當，未來世，此法本，^lb受當、持當、讀當、誦當，他等及分別廣說當，彼^lb最勝希有具足有當。
雖然復次時，世尊！不彼^lb等菩薩摩訶薩我想轉當，不眾生想、不壽想、^pb37不人想轉當。
彼何所因？若彼，世尊！我想，彼如^lb是非想；若及如是眾生想、壽想、人想，彼如是^lb非想。
彼何所因？一切想遠離，此佛、世尊。」如是^lb語已。
世尊，命者善實邊如是言：
如是，如是！善^lb實！如是，如是！如言汝。
最勝希有具足彼眾生^pb38有當，若此經中說中，不驚當，不怖當，不畏當。
^lb彼何所因？最勝彼岸到，此，善實！如來說；若及，^lb善實！如來最勝彼岸到說，彼無量亦佛、世尊^lb說；彼故，說名最勝彼岸到者。
雖然復次時，善^lb實！若如來忍彼岸到，彼如是非彼岸到。
彼何^pb39所因？此時我，善實！惡王分別分肉割斷，不時^lb我彼中時我想，若眾生想，若壽想，若人想，若^lb不我有想非想有。
彼何所因？若我，善實！彼中^lb時我想有，瞋恨想亦我彼中時有；眾生想、壽^lb想、人想有，瞋恨想亦我彼中時有。
念知我，善^pb40實！過去世五百生，若我忍語仙人有，彼中亦^lb我不想有，不眾生想、不壽想、不人想，不亦我^lb有想非想有。
彼故此，善實！菩薩摩訶薩一切^lb想捨離，無上正遍知心發生應，
不色住心發^lb生應，不聲、香、味、觸住心發生應，不法住、非無^pb41法住心發生應，無所住心發生應。
彼何所因？^lb若無所住，彼如是住。
彼故，如是如來說，不色^lb住，菩薩摩訶薩施與應；不聲、香、味、觸、法住施^lb與應。
雖然復次時，善實！菩薩摩訶薩如是捨^lb施應，一切眾生為故。
彼何所因？若如是，善實！^pb42眾生想，彼如是非想。若如是，彼一切眾生如^lb來說，彼如是非眾生。
彼何所因？真語，
善實！如^lb來，實語如來，不異語如來，如語如來，非不如^lb語如來。
雖然復次時，善實！若如來法證覺說，^lb若思惟，若不彼中實不妄。
譬如，善實！丈夫闇^pb43舍入，不一亦見。如是事墮，菩薩見應，若事墮^lb施與。
譬如，善實！眼者丈夫，顯明夜日出，種種^lb色見。如是菩薩摩訶薩見應，若事不墮施與。
^lb雖然復次時，善實！若善家子、善家女，若此法^lb本，受當、持當、讀當、誦當，為他等及分別廣說^pb44當。知彼，善實！如來佛智，見彼，善實！如來佛眼。^lb一切彼，善實！眾生，無量福聚生當取當。
^ck15【持經功德】
若復^lb時，善實！婦女，若丈夫，若前分時，恒伽河沙等^lb我身捨，
如是中分時，
如是晚分時，恒伽河沙^lb等我身捨。
以此因緣，劫俱致那由多百千我^pb45身捨。
若此法本，聞已不謗，此如是，彼緣，多過^lb福聚生，無量、不可數。何復言若寫已受持讀^lb誦，為他等及分別廣說。
雖然復次時，善實！不^lb可思、不可稱，此法本，彼不可思，如是果報觀^lb察應。
此，善實！法本如來說，勝乘發行眾生為^pb46故，最勝乘發行眾生為故。
若此法本，受當、持^lb當、讀當、誦當，為他等及分別廣說當。知彼，善^lb實！如來佛智；見彼，善實！如來佛眼。`)