jsonp(5,{"name":"dc","start":7569},`^cb#56b19爾時妙音菩薩摩訶薩供^lb養釋迦牟尼佛及多寶佛塔已，還歸本土，所^lb經諸國，六種震動，雨寶蓮華，作百千萬億種^lb種伎樂。
既到本國，與八萬四千菩薩、圍繞至^lb淨華宿王智佛所，白佛言：
「世尊！我到娑婆世^lb界饒益眾生，見釋迦牟尼佛，及見多寶佛塔，^pb21禮拜、供養；又見文殊師利法王子菩薩，及見^lb藥王菩薩、得勤精進力菩薩、勇施菩薩等，亦^lb令是八萬四千菩薩得現一切色身三昧。
說^lb是妙音菩薩來往品時，四萬二千天子得無^lb生法忍，華德菩薩得法華三昧。」
^lb^ck25〔觀世音菩薩普門品第二十五〕
^pb22^cb#56c03爾時，無盡意菩薩即從座起，偏袒右肩，合掌^lb向佛，而作是言：「世尊！觀世音菩薩，以何因緣^lb名觀世音？」
^cb#56c05佛告無盡意菩薩：「善男子！若有無^lb量百千萬億眾生受諸苦惱，聞是觀世音菩^lb薩，一心稱名，觀世音菩薩即時觀其音聲，皆^lb得解脫。
若有持是觀世音菩薩名者，設入大^pb23火，火不能燒，由是菩薩威神力故。
若為大水^lb所漂，稱其名號，即得淺處。若有百千萬億眾^lb生，為求金、銀、琉璃、車璩、馬瑙、珊瑚、虎珀、真珠^lb等寶，入於大海，假使黑風吹其船舫，飄墮羅^lb剎鬼國，其中若有，乃至一人，稱觀世音菩薩^lb名者，是諸人等皆得解脫羅剎之難。以是因^pb24緣，名觀世音。
若復有人臨當被害，稱觀世音^lb菩薩名者，彼所執刀杖尋段段壞，而得解脫。
^lb若三千大千國土，滿中夜叉、羅剎，欲來惱人，^lb聞其稱觀世音菩薩名者，是諸惡鬼，尚不能^lb以惡眼視之，況復加害。
設復有人，若有罪、若^lb無罪，杻械、枷鎖檢繫其身，稱觀世音菩薩名^pb25者，皆悉斷壞，即得解脫。
若三千大千國土，滿^lb中怨賊，有一商主，將諸商人，齎持重寶、經過^lb險路，其中一人作是唱言：『諸善男子！勿得恐^lb怖，汝等應當一心稱觀世音菩薩名號。
是菩^lb薩能以無畏施於眾生，汝等若稱名者，於此^lb怨賊當得解脫。』眾商人聞，俱發聲言：『南無觀^pb26世音菩薩。』稱其名故，即得解脫。
^cb#56c29「無盡意！觀世^lb音菩薩摩訶薩，威神之力巍巍如是。
若有眾^lb生多於婬欲，常念恭敬觀世音菩薩，便得離^lb欲。
若多瞋恚，常念恭敬觀世音菩薩，便得離^lb瞋。若多愚癡，常念恭敬觀世音菩薩，便得離^lb癡。
^cb#57a05「無盡意！觀世音菩薩有如是等大威神力，^pb27多所饒益，是故眾生常應心念。
若有女人，設^lb欲求男，禮拜供養觀世音菩薩，便生福德智^lb慧之男；設欲求女，便生端正有相之女。宿殖^lb德本，眾人愛敬。
^cb#57a09「無盡意！觀世音菩薩有如是^lb力，若有眾生，恭敬禮拜觀世音菩薩，福不唐^lb捐，是故眾生皆應受持觀世音菩薩名號。
^cb#57a12「無^pb28盡意！若有人受持六十二億恒河沙菩薩名^lb字，復盡形供養飲食、衣服、臥具、醫藥。
於汝意^lb云何？是善男子、善女人，功德多不？」
^cb#57a15無盡意言：^lb「甚多，世尊！」
^cb#57a16佛言：「若復有人受持觀世音菩薩^lb名號，乃至一時禮拜、供養，是二人福，正等無^lb異，於百千萬億劫不可窮盡。
無盡意！受持觀^pb29世音菩薩名號，得如是無量無邊福德之利。」
^lb^cb#57a20無盡意菩薩白佛言：「世尊！觀世音菩薩，云何^lb遊此娑婆世界？云何而為眾生說法？方便之^lb力，其事云何？」
^cb#57a22佛告無盡意菩薩：「善男子！若有^lb國土眾生，
應以佛身得度者，觀世音菩薩即^lb現佛身而為說法；
應以辟支佛身得度者，即^pb30現辟支佛身而為說法；
應以聲聞身得度者，^lb即現聲聞身而為說法；
應以梵王身得度者，^lb即現梵王身而為說法；
應以帝釋身得度者，^lb即現帝釋身而為說法；
應以自在天身得度^lb者，即現自在天身而為說法；
應以大自在天^lb身得度者，即現大自在天身而為說法；
應以^pb31天大將軍身得度者，即現天大將軍身而為^lb說法；
應以毘沙門身得度者，即現毘沙門身^lb而為說法；
應以小王身得度者，即現小王身^lb而為說法；
應以長者身得度者，即現長者身^lb而為說法；
應以居士身得度者，即現居士身^lb而為說法；
應以宰官身得度者，即現宰官身^pb32而為說法；
應以婆羅^lb門身得度者，即現婆羅門身而為說法；
應以比丘、比丘尼、優婆塞、優^lb婆夷身得度者，即現比丘、比丘尼、優婆塞、優^lb婆夷身而為說法；
應以長者、居士、宰官、婆羅^lb門婦女身得度者，即現婦女身而為說法；
應^lb以童男、童女身得度者，即現童男、童女身而^pb33為說法；
應以天、龍、夜叉、乾闥婆、阿修羅、迦樓^lb羅、緊那羅、摩睺羅伽、人非人等身得度者，即^lb皆現之而為說法；
應以執金剛身得度者，即^lb現執金剛身而為說法。
^cb#57b19「無盡意！是觀世音菩^lb薩成就如是功德，以種種形，遊諸國土，度脫^lb眾生。
是故汝等，應當一心供養觀世音菩薩。^pb34是觀世音菩薩摩訶薩，於怖畏急難之中能^lb施無畏，是故此娑婆世界，皆號之為施無畏^lb者。」
^cb#57b24無盡意菩薩白佛言：「世尊！我今當供養觀^lb世音菩薩。」即解頸眾寶珠、瓔珞，價直百千兩^lb金，而以與之，作是言：「仁者！受此法施珍寶瓔^lb珞。」時觀世音菩薩不肯受之。無盡意復白觀^pb35世音菩薩言：「仁者！愍我等故，受此瓔珞。」
^cb#57c01爾時^lb佛告觀世音菩薩：「當愍此無盡意菩薩及四^lb眾，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、^lb摩睺羅伽、人非人等故，受是瓔珞。」
^cb#57c03即時觀世^lb音菩薩愍諸四眾，及於天、龍、人非人等，受其^lb瓔珞，分作二分，一分奉釋迦牟尼佛，一分奉^lb多寶佛塔。
^cb#57c06「無盡意，觀世音菩薩有如是自在^lb神力，遊於娑婆世界。」
^cb#57c07爾時無盡意菩薩以偈^lb問曰：
^pb36^gatha「世尊妙相具，　　我今重問彼，
　佛子何因緣，　　^lb名為觀世音？
　具足妙相尊，　　偈答無盡意：
^lb『汝聽觀音行，　　善應諸方所，
　弘誓深如海，　　^pb37歷劫不思議，
　侍多千億佛，　　發大清淨願。
　^lb我為汝略說，　　聞名及見身，
　心念不空過，　　^lb能滅諸有苦。
　假使興害意，　　推落大火坑，
　^lb念彼觀音力，　　火坑變成池。
　或漂流巨海，　　^lb龍魚諸鬼難，
　念彼觀音力，　　波浪不能沒。
　^lb或在須彌峯，　　為人所推墮，
　念彼觀音力，　　^pb38如日虛空住。
　或被惡人逐，　　墮落金剛山，
　^lb念彼觀音力，　　不能損一毛。
　或值怨賊繞，　　^lb各執刀加害，
　念彼觀音力，　　咸即起慈心。
　^lb或遭王難苦，　　臨刑欲壽終，
　念彼觀音力，　　^lb刀尋段段壞。
　或囚禁枷鎖，　　手足被杻械，
　^lb念彼觀音力，　　釋然得解脫。
　呪詛諸毒藥，　　^pb39所欲害身者，
　念彼觀音力，　　還著於本人。
　^lb或遇惡羅剎、　　毒龍諸鬼等，
　念彼觀音力，　　^lb時悉不敢害。
　若惡獸圍遶，　　利牙爪可怖，
　^lb念彼觀音力，　　疾走無邊方。
　蚖蛇及蝮蠍，　　^lb氣毒煙火燃，
　念彼觀音力，　　尋聲自迴去。
　^lb雲雷鼓掣電，　　降雹澍大雨，
　念彼觀音力，　　^pb40應時得消散。
　眾生被困厄，　　無量苦逼身，
　^lb觀音妙智力，　　能救世間苦。
　具足神通力，　　^lb廣修智方便，
　十方諸國土，　　無剎不現身。
　^lb種種諸惡趣，　　地獄鬼畜生，
　生老病死苦，　　^lb以漸悉令滅。
　真觀清淨觀，　　廣大智慧觀，
　^lb悲觀及慈觀，　　常願常瞻仰。
　無垢清淨光，　　^pb41慧日破諸闇，
　能伏災風火，　　普明照世間。
　^lb悲體戒雷震，　　慈意妙大雲，
　澍甘露法雨，　　^lb滅除煩惱焰。
　諍訟經官處，　　怖畏軍陣中，
　^lb念彼觀音力，　　眾怨悉退散。
　妙音觀世音，　　^lb梵音海潮音，
　勝彼世間音，　　是故須常念，
　^lb念念勿生疑。　　觀世音淨聖，
　於苦惱死厄，　　^pb42能為作依怙，
　具一切功德，　　慈眼視眾生，
　^lb福聚海無量，　　是故應頂禮。』」
^lb^cb#58b03爾時持地菩薩即從座起，前白佛言：「世尊！若^lb有眾生，聞是觀世音菩薩品自在之業，普門^lb示現神通力者，當知是人功德不少。」
^cb#58b05佛說是^lb普門品時，眾中八萬四千眾生，皆發無等等^pb43阿耨多羅三藐三菩提心。
^lb^ck26〔陀羅尼品第二十六〕
^lb^cb#58b09爾時，藥王菩薩即從座起，偏袒右肩，合掌向^lb佛，而白佛言：「世尊！若善男子、善女人，有能受^lb持法華經者——若讀誦通利，若書寫經卷——得幾^lb所福？」
^cb#58b12佛告藥王：「若有善男子、善女人，供養八^pb44百萬億那由他恒河沙等諸佛。
於汝意云何？^lb其所得福，寧為多不？」
^cb#58b14「甚多，世尊。」
^cb#58b15佛言：「若善男^lb子、善女人，能於是經，乃至受持一四句偈，讀^lb誦、解義、如說修行，功德甚多。」
^lb^cb#58b17爾時藥王菩薩白佛言：「世尊！我今當與說法^lb者陀羅尼呪，以守護之。」即說呪曰：
^pb45^cb#58b19「安爾(一)　曼爾(二)　摩禰(三)　摩摩禰(四)　旨隷(五)　遮^lb梨第(六)　賒咩(羊鳴音)(七)　賒履(冈雉反)多瑋(八)　羶(輸千反)^lb帝(九)　目帝(十)　目多履(十一)　娑履(十二)　阿瑋娑履(十三)　^lb桑履(十四)　娑履(十五)　叉裔(十六)　阿叉裔(十七)　阿耆膩(十八)　^lb羶帝(十九)　賒履(二十)　陀羅尼(二十一)　阿盧伽婆娑(蘇奈反)^lb簸蔗毘叉膩(二十二)　禰毘剃(二十三)　阿便哆(都餓反)邏禰履剃^pb46(廾四)　阿亶哆波隷輸地(途賣反)(二十五)　漚究隷(二十六)　^lb牟究隷(二十七)　阿羅隷(二十八)　波羅隷(二十九)　首迦差(初几反)(三十)　^lb阿三磨三履(三十一)　佛馱毘吉利袠帝(三十二)　^lb達磨波利差(猜離反)帝(三十三)　僧伽涅瞿沙禰^lb(三十四)　婆舍婆舍輸地(三十五)　曼哆邏(三十六)　曼哆^lb邏叉夜多(三十七)　郵樓哆(三十八)　郵樓哆憍舍^pb47略(來加反)(三十九)　惡叉邏(四十)　惡叉冶多冶(四十一)　阿婆^lb盧(四十二)　阿摩若(荏蔗反)那多夜(四十三)
^lb^cb#58c04「世尊！是陀羅尼神咒，六十二億恒河沙等諸^lb佛所說，若有侵毀此法師者，則為侵毀是諸^lb佛已。」
^cb#58c06時釋迦牟尼佛讚藥王菩薩言：「善哉，善^lb哉！藥王！汝愍念擁護此法師故，說是陀羅尼，^pb48於諸眾生，多所饒益。」
^cb#58c09爾時勇施菩薩白佛言：^lb「世尊！我亦為擁護讀誦受持法華經者，說陀^lb羅尼。
若此法師得是陀羅尼，若夜叉、若羅剎、^lb若富單那、若吉遮、若鳩槃茶、若餓鬼等，伺求^lb其短，無能得便。」即於佛前而說呪曰：
^lb^cb#58c14「痤(誓螺反)隷(一)摩訶痤隷(二)郁枳(三)目枳(四)^pb49阿隷(五)阿羅婆第(六)涅隷第(七)涅隷多婆第^lb(八)伊緻(猪履反)柅(女氏反)(九)韋緻柅(十)旨緻柅(十一)涅^lb隷墀柅(十二)涅犁墀婆底(十三)
^lb^cb#59a04「世尊！是陀羅尼神呪，恒河沙等諸佛所說，亦^lb皆隨喜，若有侵毀此法師者，則為侵毀是諸^lb佛已。」
^cb#59a07爾時毘沙門天王護世者白佛言：「世尊！^pb50我亦為愍念眾生、擁護此法師故，說是陀羅^lb尼。」即說呪曰：
^lb^cb#59a10「阿梨(一)那梨(二)㝹那梨(三)阿那盧(四)那履(五)^lb拘那履(六)
^lb^cb#59a12「世尊！以是神呪擁護法師，我亦自當擁護持^lb是經者，令百由旬內無諸衰患。」
^cb#59a13爾時持國天^pb51王在此會中，與千萬億那由他乾闥婆眾，恭^lb敬圍繞，前詣佛所，合掌白佛言：「世尊！我亦以^lb陀羅尼神呪，擁護持法華經者。」即說呪曰：
^lb^cb#59a18「阿伽禰(一)伽禰(二)瞿利(三)乾陀利(四)旃陀^lb利(五)摩蹬耆(六)常求利(七)浮樓莎柅(八)頞^lb(音遏)底(九)
^pb52^cb#59a20「世尊！是陀羅尼神呪，四十二億諸佛所說，若^lb有侵毀此法師者，則為侵毀是諸佛已。」
^cb#59a22爾時^lb有羅剎女等，一名藍婆，二名毘藍婆，三名曲^lb齒，四名華齒，五名黑齒，六名多髮，七名無厭^lb足，八名持瓔珞，九名睪帝，十名奪一切眾生^lb精氣，是十羅剎女，與鬼子母，并其子及眷屬，^pb53俱詣佛所，同聲白佛言：「世尊！我等亦欲擁護^lb讀誦受持法華經者，除其衰患，若有伺求法^lb師短者，令不得便。」即於佛前，而說呪曰：
^lb^cb#59b01「伊提履(一)伊提泯(二)伊提履(三)阿提履(四)伊^lb提履(五)泥履(六)泥履(七)泥履(八)泥履(九)泥履^lb(十)樓醯(十一)樓醯(十二)樓醯(十三)樓醯(十四)多醯^pb54(十五)多醯(十六)多醯(十七)兜醯(十八)㝹醯(十九)
^lb^cb#59b05「寧上我頭上，莫惱於法師。
若夜叉、若羅剎、若^lb餓鬼、若富單那、若吉遮、若毘陀羅、若犍馱、若^lb烏摩勒伽、若阿跋摩羅、若夜叉吉遮、若人吉^lb遮，若熱病若一日、若二日、若三日、若四日乃^lb至七日，若常熱病，若男形、若女形、若童男形、^pb55若童女形，乃至夢中，亦復莫惱。」即於佛前、而^lb說偈言：
^lb^gatha「若不順我呪，　　惱亂說法者，
　頭破作七分，　　^lb如阿梨樹枝。
　如殺父母罪，　　亦如壓油殃，
　^gatha斗秤欺誑人，　　調達破僧罪。
　犯此法師者，　　^lb當獲如是殃。」
^pb56^cb#59b17諸羅剎女說此偈已，白佛言：「世尊！我等亦當^lb身自擁護受持、讀誦、修行是經者，令得安隱，離諸衰患，消眾毒藥。」
^cb#59b19佛告諸羅剎女：「善哉，善^lb哉！汝等但能擁護受持法華名者，福不可量，^lb何況擁護具足受持，供養經卷——華、香、瓔珞，末^lb香、塗香、燒香，幡蓋、伎樂；燃種種燈：酥燈、油燈、^pb57諸香油燈、蘇摩那華油燈、瞻蔔華油燈、婆師^lb迦華油燈、優鉢羅華油燈，如是等百千種供^lb養者。
睪帝！汝等及眷屬，應當擁護如是法師。」
^lb^cb#59b26說是陀羅尼品時，六萬八千人、得無生法忍。
^lb^ck27〔妙莊嚴王本事品第二十七〕
^lb^cb#59b29爾時佛告諸大眾：「乃往古世，過無量無邊不^pb58可思議阿僧祇劫，有佛名雲雷音宿王華智^lb多陀阿伽度、阿羅訶、三藐三佛陀，國名光明^lb莊嚴，劫名憙見。
彼佛法中有王，名妙莊嚴，其^lb王夫人名曰淨德，有二子，一名淨藏，二名淨^lb眼。
是二子有大神力，福德智慧，久修菩薩所^lb行之道，所謂檀波羅蜜、尸羅波羅蜜、羼提波^pb59羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜、^lb方便波羅蜜，慈悲喜捨，乃至三十七品助道^lb法皆悉明了通達。
又得菩薩淨三昧、日星宿^lb三昧、淨光三昧、淨色三昧、淨照明三昧、長莊^lb嚴三昧、大威德藏三昧，於此三昧亦悉通達。
^lb^cb#59c12「爾時彼佛欲引導妙莊嚴王，及愍念眾生故，^pb60說是法華經。
時淨藏、淨眼二子到其母所，合^lb十指爪掌白言：『願母往詣雲雷音宿王華智^lb佛所，我等亦當侍從，親近、供養、禮拜。
所以者^lb何？此佛於一切天人眾中說法華經，宜應聽^lb受。』母告子言：『汝父信受外道，深著婆羅門法，^lb汝等應往白父，與共俱去。』淨藏、淨眼合十指^pb61爪掌白母：『我等是法王子，而生此邪見家。』母^lb告子言：『汝等當憂念汝父，為現神變，若得見^lb者，心必清淨，或聽我等，往至佛所。』
於是二子^lb念其父故，踊在虛空，高七多羅樹，現種種神^lb變——於虛空中行住坐臥；身上出水、^lb身下出火，身下出水、身上出火；或現大身滿虛空中，而^pb62復現小，小復現大；於空中滅，忽然在地；入地^lb如水，履水如地。
現如是等種種神變，令其父^lb王心淨信解。
時父見子神力如是，心大歡喜，^lb得未曾有，合掌向子言：『汝等，師為是誰，誰之^lb弟子？』二子白言：『大王！彼雲雷音宿王華智佛，^lb今在七寶菩提樹下法座上坐，於一切世間^pb63天人眾中廣說法華經，是我等師，我是弟子。』
^lb父語子言：『我今亦欲見汝等師，可共俱往。』於^lb是二子從空中下，到其母所，合掌白母：『父王^lb今已信解，堪任發阿耨多羅三藐三菩提心。
^lb我等為父已作佛事，願母見聽，於彼佛所出^lb家修道。』
^cb#60a20「爾時二子欲重宣其意，以偈白母：
^pb64^gatha「『願母放我等，　　出家作沙門，
　　諸佛甚難值，　　^lb我等隨佛學。
　　如優曇鉢羅，　　值佛復難是，
　　^lb脫諸難亦難，　　願聽我出家。』
^lb^cb#60a26「母即告言：『聽汝出家。所以者何？佛難值故。』
^cb#60a27「於^lb是二子白父母言：『善哉，父母！願時往詣雲雷^lb音宿王華智佛所，親近供養。
所以者何？佛難^pb65得值，如優曇鉢羅華，又如一眼之龜，值浮木^lb孔。
而我等宿福深厚，生值佛法，是故父母當^lb聽我等，令得出家。所以者何？諸佛難值，時亦^lb難遇。』
^cb#60b03「彼時妙莊嚴王後宮八萬四千人，皆悉^lb堪任受持是法華經。
淨眼菩薩，於法華三昧，^lb久已通達；淨藏菩薩，已於無量百千萬億劫^pb66通達離諸惡趣三昧，欲令一切眾生離諸惡^lb趣故。
其王夫人，得諸佛集三昧，能知諸佛祕^lb密之藏。
^cb#60b08「二子如是以方便力善化其父，令心^lb信解，好樂佛法。
於是妙莊嚴王與群臣眷屬^lb俱，淨德夫人與後宮婇女眷屬俱，其王二子^lb與四萬二千人俱，一時共詣佛所。
到已，頭面^pb67禮足，繞佛三匝，却住一面。
^cb#60b14「爾時彼佛為王說^lb法，示教利喜。王大歡悅。
爾時妙莊嚴王及其^lb夫人，解頸真珠瓔珞，價直百千，以散佛上，於^lb虛空中化成四柱寶臺，臺中有大寶床，敷百^lb千萬天衣，其上有佛結加趺坐，放大光明。
爾^lb時妙莊嚴王作是念：『佛身希有，端嚴殊特，成^pb68就第一微妙之色。』時雲雷音宿王華智佛告^lb四眾言：『汝等見是妙莊嚴王，於我前合掌立^lb不？此王於我法中作比丘，精勤修習，助佛道^lb法，當得作佛，號娑羅樹王，國名大光，劫名大^lb高王。
其娑羅樹王佛，有無量菩薩眾及無量^lb聲聞，其國平正，功德如是。』其王即時以國付^pb69弟，與夫人、二子并諸眷屬，於佛法中出家修^lb道。
^cb#60b27「王出家已，於八萬四千歲，常勤精進修行^lb妙法華經。
過是已後，得一切淨功德莊嚴三^lb昧，即昇虛空，高七多羅樹，而白佛言：『世尊！此^lb我二子，已作佛事，以神通變化轉我邪心，令^lb得安住於佛法中，得見世尊。
此二子者，是我^pb70善知識，為欲發起宿世善根，饒益我故，來生^lb我家。』
^cb#60c05「爾時，雲雷音宿王華智佛告妙莊嚴王^lb言：『如是，如是！如汝所言。
若善男子、善女人，種^lb善根故，世世得善知識，其善知識，能作佛事，^lb示教利喜，令入阿耨多羅三藐三菩提。
大王！^lb當知善知識者是大因緣，所謂化導令得見^pb71佛，發阿耨多羅三藐三菩提心。
大王！汝見此^lb二子不？此二子，已曾供養六十五百千萬億^lb那由他恒河沙諸佛，親近恭敬，於諸佛所受^lb持法華經，愍念邪見眾生，令住正見。』妙莊嚴^lb王即從虛空中下，而白佛言：
『世尊！如來甚希^lb有，以功德智慧故，頂上肉髻光明顯照，其眼^pb72長廣而紺青色，眉間毫相白如珂月，齒白齊^lb密常有光明，脣色赤好如頻婆果。』
^cb#60c18「爾時妙莊^lb嚴王，讚歎佛如是等無量百千萬億功德已，^lb於如來前，一心合掌，復白佛言：『世尊！未曾有^lb也。
如來之法，具足成就不可思議微妙功德，^lb教誡所行，安隱快善，我從今日，不復自隨心^pb73行，不生邪見、憍慢、瞋恚諸惡之心。』說是語已，^lb禮佛而出。」
^cb#60c23佛告大眾：「於意云何？妙莊嚴王，豈^lb異人乎？今華德菩薩是。
其淨德夫人，今佛前^lb光照莊嚴相菩薩是。哀愍妙莊嚴王及諸眷^lb屬故，於彼中生。其二子者，今藥王菩薩、藥上^lb菩薩是。是藥王、藥上菩薩，成就如此諸大功^pb74德，已於無量百千萬億諸佛所殖眾德本，成^lb就不可思議諸善功德。
若有人識是二菩薩^lb名字者，一切世間諸天人民亦應禮拜。」
^cb#61a02佛說^lb是妙莊嚴王本事品時，八萬四千人遠塵離^lb垢，於諸法中得法眼淨。
^lb^ck28〔普賢菩薩勸發品第二十八〕
^pb75^cb#61a06爾時普賢菩薩，以自在神通力，威德名聞，與^lb大菩薩無量無邊不可稱數，從東方來。
所經^lb諸國，普皆震動，雨寶蓮華，作無量百千萬億^lb種種伎樂。
又與無數諸天、龍、夜叉、乾闥婆、阿^lb修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，大^lb眾圍繞，各現威德神通之力，到娑婆世界耆^pb76闍崛山中，頭面禮釋迦牟尼佛，右繞七匝，白^lb佛言：
「世尊，我於寶威德上王佛國，遙聞此娑^lb婆世界說法華經，與無量無邊百千萬億諸^lb菩薩眾共來聽受，唯願世尊當為說之。
若善^lb男子、善女人，於如來滅後，云何能得是法華^lb經？」
^cb#61a17佛告普賢菩薩：「若善男子、善女人，成就四^pb77法，於如來滅後，當得是法華經：一者、為諸佛^lb護念，二者、殖眾德本，三者、入正定聚，四者、發^lb救一切眾生之心。
善男子、善女人，如是成就^lb四法，於如來滅後，必得是經。」
^cb#61a22爾時普賢菩薩^lb白佛言：「世尊！於後五百歲、濁惡世中，其有受^lb持是經典者，我當守護，除其衰患，令得安隱，^pb78使無伺求得其便者，若魔、若魔子、若魔女、若^lb魔民、若為魔所著者，若夜叉、若羅剎、若鳩槃^lb茶、若毘舍闍、若吉遮、若富單那、若韋陀羅等，^lb諸惱人者，皆不得便。
是人若行、若立、讀誦此^lb經，我爾時乘六牙白象王，與大菩薩眾俱詣^lb其所，而自現身，供養守護，安慰其心，亦為供^pb79養法華經故。
是人若坐、思惟此經，爾時我復^lb乘白象王現其人前，其人若於法華經有所^lb忘失一句一偈，我當教之，與共讀誦，還令通^lb利。
爾時受持讀誦法華經者，得見我身，甚大^lb歡喜，轉復精進，以見我故，即得三昧及陀羅^lb尼，名為旋陀羅尼、百千萬億旋陀羅尼、法音^pb80方便陀羅尼，得如是等陀羅尼。
^cb#61b09「世尊！若後世^lb後五百歲、濁惡世中，比丘、比丘尼、優婆塞、優^lb婆夷，求索者、受持者、讀誦者、書寫者，欲修習^lb是法華經，於三七日中，應一心精進。
滿三七^lb日已，我當乘六牙白象，與無量菩薩而自圍^lb繞，以一切眾生所憙見身，現其人前，而為說^pb81法，示教利喜，亦復與其陀羅尼呪，得是陀羅^lb尼故，無有非人能破壞者，亦不為女人之所^lb惑亂，我身亦自常護是人。唯願世尊聽我說^lb此陀羅尼呪。」即於佛前而說呪曰：
^lb^cb#61b19「阿檀地(途賣反)(一)檀陀婆地(二)檀陀婆帝(三)檀陀鳩^lb舍隷(四)檀陀修陀隷(五)修陀隷(六)修陀羅婆^pb82底(七)佛馱波羶禰(八)薩婆陀羅尼阿婆多尼^lb(九)薩婆婆沙阿婆多尼(十)修阿婆多尼(十一)僧^lb伽婆履叉尼(十二)僧伽涅伽陀尼(十三)阿僧祇(十四)^lb僧伽波伽地(十五)帝隷阿惰僧伽兜略(盧遮反)阿^lb羅帝婆羅帝(十六)薩婆僧伽三摩地伽蘭地^lb(十七)薩婆達磨修波利剎帝(十八)薩婆薩埵樓馱^pb83憍舍略阿㝹伽地(十九)辛阿毘吉利地帝(二十)
^lb^cb#61b28「世尊！若有菩薩得聞是陀羅尼者，當知普賢^lb神通之力，若法華經行閻浮提，有受持者，應^lb作此念：『皆是普賢威神之力。』若有受持、讀誦，^lb正憶念，解其義趣，如說修行，當知是人行^lb普賢行，於無量無邊諸佛所深種善根，為諸如^pb84來手摩其頭。
若但書寫，是人命終，當生忉利^lb天上，是時八萬四千天女作眾伎樂而來迎^lb之，其人即著七寶冠，於婇女中娛樂快樂；
何^lb況受持、讀誦，正憶念，解其義趣，如說修行。
若^lb有人受持、讀誦，解其義趣，是人命終，為千佛^lb授手，令不恐怖，不墮惡趣，即往兜率天上彌^pb85勒菩薩所。
彌勒菩薩，有三十二相大菩薩眾^lb所共圍繞，有百千萬億天女眷屬，而於中生，^lb有如是等功德利益。
是故智者，應當一心自^lb書、若使人書，受持、讀誦，正憶念，如說修行。
^cb#61c14「世^lb尊！我今以神通力故，守護是經，於如來滅後^lb閻浮提內，廣令流布，使不斷絕。」
^cb#61c16爾時釋迦牟^pb86尼佛讚言：「善哉，善哉！普賢！汝能護助是經，令^lb多所眾生安樂利益。
汝已成就不可思議功^lb德，深大慈悲，從久遠來，發阿耨多羅三藐三^lb菩提意，而能作是神通之願，守護是經。
我當^lb以神通力，守護能受持普賢菩薩名者。
^cb#61c21「普賢！^lb若有受持、讀誦，正憶念，修習、書寫是法華經^pb87者，當知是人，則見釋迦牟尼佛，如從佛口聞^lb此經典；當知是人，供養釋迦牟尼佛；當知是^lb人，佛讚善哉；當知是人，為釋迦牟尼佛手摩^lb其頭；當知是人，為釋迦牟尼佛衣之所覆。
如^lb是之人，不復貪著世樂，不好外道經書、手筆，^lb亦復不喜親近其人及諸惡者——若屠兒、若畜^pb88猪羊雞狗、若獵師、若衒賣女色——是人心意質^lb直，有正憶念，有福德力，是人不為三毒所惱，^lb亦不為嫉妬、我慢、邪慢、增上慢所惱，是人少^lb欲知足，能修普賢之行。
^cb#62a09「普賢！若如來滅後後^lb五百歲，若有人見受持、讀誦法華經者，應作^lb是念：『此人不久當詣道場，破諸魔眾，得阿耨^pb89多羅三藐三菩提，轉法輪、擊法鼓、吹法螺、雨^lb法雨，當坐天人大眾中師子法座上。』
^cb#62a13「普賢！若^lb於後世，受持、讀誦是經典者，是人不復貪著^lb衣服、臥具、飲食、資生之物，所願不虛，亦於現^lb世得其福報。
若有人輕毀之，言：『汝狂人耳，空^lb作是行，終無所獲。』如是罪報，當世世無眼；若^pb90有供養讚歎之者，當於今世得現果報。
若復^lb見受持是經者，出其過惡，若實、若不實，此人^lb現世得白癩病。
若有輕笑之者，當世世牙齒踈^lb缺，醜脣、平鼻，手腳繚戾，眼目角睞，身體臭穢，^lb惡瘡、膿血、水腹、短氣、諸惡重病。
是故，普賢！若^lb見受持是經典者，當起遠迎，當如敬佛。」
^cb#62a24說是^pb91普賢勸發品時，恒河沙等無量無邊菩薩，得^lb百千萬億旋陀羅尼；三千大千世界微塵等^lb諸菩薩，具普賢道。
^cb#62a27佛說是經時，普賢等諸菩^lb薩，舍利弗等諸聲聞，及諸天、龍、人非人等，一^lb切大會，皆大歡喜，受持佛語，作禮而去。
^lb妙法蓮華經卷第七^pb92
^folio#ssv1_ruci^bk#ssv_ruci
大寶積經卷[＊]第十七
大唐三藏菩提流志奉　詔譯
無量壽如來會第五之一
如是我聞：
一時佛住王舍城耆闍崛山中，與大比丘眾萬二千人俱，皆是諸大聲聞眾所知識，其名曰：尊者阿若憍陳如、馬勝、大名、有賢、無垢、須跋陀羅、善稱、圓滿、憍梵鉢提、優樓頻䗍迦葉、那提迦葉、伽耶迦葉、摩訶迦葉、舍利弗、大目揵連、摩訶迦旃延、摩訶劫賓那、摩訶注那、滿慈子、阿尼樓馱、離波多、上首王、住彼岸、摩俱羅、難陀、有光、善來、羅睺羅、阿難陀等，而為上首。復有菩薩摩訶薩眾，所謂普賢菩薩、文殊師利菩薩、彌勒菩薩，及賢劫中諸菩薩摩訶薩眾，前後圍繞。
又與賢護等十六丈夫眾俱，所謂善思惟義菩薩、慧辯才菩薩、觀無住菩薩、善化神通菩薩、光幢菩薩、智上菩薩、寂根菩薩、慧願菩薩、香象菩薩、寶幢菩薩等，而為上首，咸共遵修普賢之道，滿足菩薩一切行願，安住一切功德法中，到諸佛法究竟彼岸。願於一切世界之中成等正覺，又願生彼兜率陀天，於彼壽終降生右脇見行七步，放大光明，普佛世界六種震動，而自唱言：「我於一切世間最為尊貴。」釋梵諸天咸來親奉。又見習學書計曆數聲明伎巧醫方養生符印，及餘博戲擅美過人。身處王宮厭諸欲境，見老病死悟世非常，捐捨國位踰城學道。解諸纓絡及迦尸迦，被服袈裟六年苦行，能於五濁剎中作斯示見。順世間故浴尼連河行趣道場，龍王迎讚，諸菩薩眾右繞稱揚。菩薩爾時受草，自敷菩提樹下，結加趺坐。又見魔眾合圍將加危害，菩薩以定慧力降伏魔怨，成無上覺。梵王勸請轉於法輪，勇猛無畏佛音震吼，擊法鼓、吹法螺、建大法幢、然正法炬，攝受正法及諸禪定，雨大法雨澤潤含生，震大法雷開悟一切。諸佛剎土普照大光，世界之中地皆震動，魔宮摧毀驚怖波旬，破煩惱城墮諸見網，遠離黑法生諸白法。於佛施食能受能消，為調眾生宣揚妙理。或見微笑放百千光，昇灌頂階受菩提記，或成佛道見入涅槃，使無量有情皆得漏盡，成熟菩薩無邊善根。如是諸佛剎中皆能示見。譬如幻師善知幻術，而能示見男女等相，於彼相中實無可得。如是如是，諸菩薩等善學無邊幻術功德故，能示見變化相應，能善了知變化之道故，示諸佛土見大慈悲，一切群生普皆饒益。菩薩願行成就無疆，無量義門通達平等，一切善法具足修成。諸佛剎中平等趣入，常為諸佛勸進加威。一切如來識知印可，為教菩薩作阿闍梨。常習相應無邊諸行，通達一切法界所行，能善了知有情及土，亦常發趣供諸如來。見種種身猶如影像，善學因陀羅網能破魔網，壞諸見網入有情網，能超煩惱眷屬及魔侶魔人。遠出聲聞辟支佛地，入空無相無願法門，而能安住方便善巧。初不樂入二乘涅槃，得無生無滅諸三摩地，及得一切陀羅尼門，廣大諸根辯才決定，於菩薩藏法善能了知。佛華三昧隨時悟入，具一切種甚深禪定，一切諸佛皆悉見前，於一念中遍遊佛土，周旋往返不異其時。於難非難邊能了諸邊，敷演實際差別善知，得佛辯才住普賢行。善能分別眾生語言，超過世間一切之法，善知一切出世間法。得資具自在波羅蜜多，荷擔有情為不請友。能持一切如來法藏，安住不斷一切佛種。哀愍有情能開法眼，閉諸惡趣開善趣門。普觀有情能作父母兄弟之想，又觀眾生如己身想。證得一切讚歎功德，波羅蜜多能善了知，讚歎如來一切功德，及餘稱讚諸功德法。如是菩薩摩訶薩眾無量無邊皆來集會。
爾時尊者阿難從坐而起，整理衣服，偏袒右肩右膝著地，合掌向佛，白言：「大德世尊！身色諸根悉皆清淨，威光赫奕如融金聚，又如明鏡凝照光暉。從昔已來初未曾見，喜得瞻仰生希有心。世尊今者入大寂定，行如來行皆悉圓滿，善能建立大丈夫行，思惟去來現在諸佛。世尊何故住斯念耶？」
爾時佛告阿難：「汝今云何能知此義？為有諸天來告汝耶？為以見我及自知耶？」
阿難白佛言
「世尊！我見如來光瑞希有故發斯念，非因天等。」
佛告阿難：「善哉善哉！汝今快問。善能觀察微妙辯才，能問如來如是之義。汝為一切如來、應、正等覺，及安住大悲利益群生如優曇花希有大士出見世間，故問斯義。又為哀愍利樂諸眾生故，能問如來如是之義。阿難！如來、應、正等覺善能開示無量知見。何以故？如來知見無有障礙。阿難！如來、應、正等覺欲樂住世，能於念頃住無量無數百千億那由他劫，若復增過如上數量，而如來身及以諸根無有增減。何以故？如來得三昧自在到於彼岸，於一切法最勝自在。是故阿難！諦聽，善思念之，吾當為汝分別解說。」
阿難白佛言：「唯然世尊！願樂欲聞。」
爾時佛告阿難：「往昔過阿僧祇無數大劫，有佛出現，號曰然燈。於彼佛前極過數量，有苦行佛出興于世。苦行佛前復有如來，號為月面。月面佛前過於數量，有旃檀香佛。於彼佛前有蘇迷盧積佛，盧積佛前復有妙高劫佛。如是展轉，有離垢面佛、不染污佛、龍天佛、山聲王佛、蘇迷盧積佛、金藏佛、照曜光佛、光帝佛、大地種姓佛、光明熾盛琉璃金光佛、月像佛、開敷花莊嚴光佛、妙海勝覺遊戲神通佛、金剛光佛、大阿伽陀香光佛、捨離煩惱心佛、寶增長佛、勇猛積佛、勝積佛、持大功德法施神通佛、映蔽日月光佛、照曜琉璃佛、心覺花佛、月光佛、日光佛、花瓔珞色王開敷神通佛、水月光佛、破無明暗佛、真珠珊瑚蓋佛、底沙佛、勝花佛、法慧吼佛、有師子吼鵝鴈聲佛、梵音龍吼佛。如是等佛出現於世，相去劫數皆過數量。彼龍吼佛未出世前無央數劫，有世主佛。世主佛前無邊劫數有佛出世，號世間自在王如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、世尊。
「阿難！彼佛法中有一比丘名曰法處，有殊勝行願及念慧力增上，其心堅固不動，福智殊勝人相端嚴。阿難！彼法處比丘往詣世間自在王如來所，偏袒右肩頂禮佛足，向佛合掌以頌讚曰：
「『如來無量無邊光，  	舉世無光可能喻，
一切日月摩尼寶，  	佛之光威皆映蔽。
世尊能演一音聲，  	有情各各隨類解，
又能現一妙色身，  	普使眾生隨類見。
戒定慧進及多聞，  	一切有情無與等，
心流覺慧如大海，  	善能了知甚深法。
惑盡過亡應受供，  	如是聖德惟世尊，
佛有殊勝大威光，  	普照十方無量剎。
我今稱讚諸功德，  	冀希福慧等如來，
能救一切諸世間，  	生老病死眾苦惱。
願當安住三摩地，  	演說施戒諸法門，
忍辱精勤及定慧，  	庶當成佛濟群生。
為求無上大菩提，  	供養十方諸妙覺，
百千俱胝那由他，  	極彼恒沙之數量。
又願當獲大神光，  	倍照恒沙億佛剎，
及以無邊勝進力，  	感得殊勝廣淨居。
如是無等佛剎中，  	安處群生當利益，
十方最勝之大士，  	彼皆當往生喜心。
唯佛聖智能證知，  	我今希求堅固力，
縱沈無間諸地獄，  	如是願心終不退。
一切世間無礙智，  	應當了知如是心。』
「復次阿難！法處比丘讚佛德已白言：『世尊！我今發阿耨多羅三藐三菩提心，惟願如來為我演說如是等法，令於世間得無等等成大菩提，具攝清淨莊嚴佛土。』佛告比丘：『汝應自攝清淨佛國。』法處白佛言：『世尊！我無威力堪能攝受，唯願如來說餘佛土清淨莊嚴，我等聞已誓當圓滿。』爾時世尊為其廣說二十一億清淨佛土具足莊嚴，說是法時經于億歲。阿難！法處比丘於彼二十一億諸佛土中所有嚴淨之事悉皆攝受，既攝受已滿足五劫思惟修習。」
阿難白佛言：「世尊！彼世間自在王如來壽量幾何？」
世尊告曰：「彼佛壽量滿四十劫。阿難！彼二十一俱胝佛剎，法處比丘所攝佛國超過於彼。既攝受已，往詣世間自在王如來所，頂禮雙足右繞七匝，却住一面白言：『世尊！我已攝受具足功德嚴淨佛土。』佛言：『今正是時，汝應具說令眾歡喜，亦令大眾皆當攝受圓滿佛土。』
「法處白言：『唯願世尊大慈留聽，我今將說殊勝之願。
「『若我證得無上菩提，國中有地獄、餓鬼、畜生趣者，我終不取無上正覺。
「『若我成佛，國中眾生有墮三惡趣者，我終不取正覺。
「『若我成佛，國中有情若不皆同真金色者，不取正覺。
「『若我成佛，國中有情形貌差別有好醜者，不取正覺。
「『若我成佛，國中有情不得宿念，下至不知億那由他百千劫事者，不取正覺。
「『若我成佛，國中有情若無天眼，乃至不見億那由他百千佛國土者，不取正覺。
「『若我成佛，國中有情不獲天耳，乃至不聞億那由他百千踰繕那外佛說法者，不取正覺。
「『若我成佛，國中有情無他心智，乃至不知億那由他百千佛國土中有情心行者，不取正覺。
「『若我成佛，國中有情不獲神通自在波羅蜜多，於一念頃不能超過億那由他百千佛剎者，不取正覺。
「『若我成佛，國中有情起於少分我我所想者，不取菩提。
「『若我成佛，國中有情若不決定成等正覺、證大涅槃者，不取菩提。
「『若我成佛，光明有限，下至不照億那由他百千及算數佛剎者，不取菩提。
「『若我成佛，壽量有限，乃至俱胝那由他百千及算數劫者，不取菩提。
「『若我成佛，國中聲聞無有知其數者，假使三千大千世界滿中有情及諸緣覺，於百千歲盡其智算亦不能知；若有知者，不取正覺。
「『若我成佛，國中有情壽量有限齊者，不取菩提；唯除願力而受生者。
「『若我成佛，國中眾生若有不善名者，不取正覺。
「『若我成佛，彼無量剎中無數諸佛不共諮嗟稱歎我國者，不取正覺。
「『若我證得無上覺時，餘佛剎中諸有情類聞我名已，所有善根心心迴向願生我國，乃至十念若不生者，不取菩提；唯除造無間惡業、誹謗正法及諸聖人。
「『若我成佛，於他剎土有諸眾生發菩提心，及於我所起清淨念，復以善根迴向願生極樂。彼人臨命終時，我與諸比丘眾現其人前。若不爾者，不取正覺。
「『若我成佛，無量國中所有眾生聞說我名，以己善根迴向極樂。若不生者，不取菩提。
「『若我成佛，國中菩薩皆不成就三十二相者，不取菩提。
「『若我成佛，於彼國中所有菩薩，於大菩提咸悉位階一生補處。唯除大願諸菩薩等，為諸眾生被精進甲，勤行利益修大涅槃，遍諸佛國行菩薩行，供養一切諸佛如來，安立恒沙眾生住無上覺，所修諸行復勝於前，行普賢道而得出離。若不爾者，不取菩提。
「『若我成佛，國中菩薩每於晨朝供養他方乃至無量億那由他百千諸佛，以佛威力即以食前還到本國。若不爾者，不取菩提。
「『若我成佛，於彼剎中諸菩薩眾所須種種供具，於諸佛所殖諸善根，如是色類不圓滿者，不取菩提。
「『若我當成佛時，國中菩薩說諸法要不善順入一切智者，不取菩提。
「『若我成佛，彼國所生諸菩薩等若無那羅延堅固力者，不取正覺。
「『若我成佛，周遍國中諸莊嚴具，無有眾生能總演說，乃至有天眼者不能了知所有雜類形色光相。若有能知及總宣說者，不取菩提。
「『若我成佛，國中具有無量色樹高百千由旬，諸菩薩中有善根劣者若不能了知，不取正覺。
「『若我成佛，國中眾生讀誦經典教授敷演，若不獲得勝辯才者，不取菩提。
「『若我成佛，國中菩薩有不成就無邊辯才者，不取菩提。
「『若我成佛，國土光淨遍無與等，徹照無量無數不可思議諸佛世界，如明鏡中現其面像。若不爾者，不取菩提。
「『若我成佛，國界之內地及虛空有無量種香，復有百千億那由他數眾寶香鑪，香氣普熏遍虛空界，其香殊勝超過人天珍，奉如來及菩薩眾。若不爾者，不取菩提。
「『若我成佛，周遍十方無量無數不可思議無等界眾生之輩，蒙佛威光所照觸者，身心安樂超過人天。若不爾者，不取正覺。
「『若我成佛，無量不可思議無等界諸佛剎中菩薩之輩聞我名已，若不證得離生、獲陀羅尼者，不取正覺。
「『若我成佛，周遍無數不可思議無有等量諸佛國中所有女人，聞我名已得清淨信，發菩提心厭患女身。若於來世不捨女人身者，不取菩提。
「『若我成佛，無量無數不可思議無等佛剎菩薩之眾，聞我名已得離生法，若不修行殊勝梵行，乃至到於大菩提者，不取正覺。
「『若我成佛，周遍十方無有等量諸佛剎中所有菩薩，聞我名已五體投地，以清淨心修菩薩行。若諸天人不禮敬者，不取正覺。
「『若我成佛，國中眾生所須衣服隨念即至，如佛命：「善來，比丘。」法服自然在體。若不爾者，不取菩提。
「『若我成佛，諸眾生類纔生我國中，若不皆獲資具心淨安樂如得漏盡諸比丘者，不取菩提。
「『若我成佛，國中群生隨心欲見諸佛淨國殊勝莊嚴，於寶樹間悉皆出現，猶如明鏡見其面像。若不爾者，不取菩提。
「『若我成佛，餘佛剎中所有眾生聞我名已，乃至菩提諸根有闕、德用非廣者，不取菩提。
「『若我成佛，餘佛剎中所有菩薩聞我名已，若不皆善分別勝三摩地名字語言，菩薩住彼三摩地中，於一剎那言說之頃不能供養無量無數不可思議無等諸佛，又不現證六三摩地者，不取正覺。
「『若我成佛，餘佛土中有諸菩薩聞我名已，壽終之後若不得生豪貴家者，不取正覺。
「『若我成佛，餘佛剎中所有菩薩聞我名已，若不應時修菩薩行，清淨歡喜得平等住具諸善根，不取正覺。
「『若我成佛，他方菩薩聞我名已，皆得平等三摩地門，住是定中常供無量無等諸佛，乃至菩提終不退轉。若不爾者，不取正覺。
「『若我成佛，國中菩薩隨其志願，所欲聞法自然得聞。若不爾者，不取正覺。
「『若我證得無上菩提，餘佛剎中所有菩薩聞我名已，於阿耨多羅三藐三菩提有退轉者，不取正覺。
「『若我成佛，餘佛國中所有菩薩若聞我名，應時不獲一二三忍、於諸佛法不能現證不退轉者，不取菩提。』」
爾時佛告阿難：「彼法處比丘於世間自在王如來前發此願已，承佛威神而說頌曰：
「『今對如來發弘誓，  	當證無上菩提日，
若不滿足諸上願，  	不取十力無等尊。
心或不堪常行施，  	廣濟貧窮免諸苦，
利益世間使安樂，  	不成救世之法王。
我證菩提坐道場，  	名聞不遍十方界，
無量無邊異佛剎，  	不取十力世中尊。
方趣無上大菩提，  	出家為求於欲境，
於彼念慧行無有，  	不作調御天人師。
願獲如來無量光，  	普照十方諸佛土，
能滅一切貪恚癡，  	亦斷世間諸惡趣。
願得光開淨慧眼，  	於諸有中破冥暗，
除滅諸難使無餘，  	安處天人大威者。
修習本行已清淨，  	獲得無量勝威光，
日月諸天摩尼火，  	所有光暉皆映蔽。
最勝丈夫修行已，  	於彼貧窮為伏藏，
圓滿善法無等倫，  	於大眾中師子吼。
往昔供養自然智，  	多劫勤修諸苦行，
為求最勝諸慧蘊，  	滿足本願天人尊。
如來知見無所礙，  	一切有為皆能了，
願我當成無與等，  	最勝智者真導師。
我若當證大菩提，  	如斯弘誓實圓滿，
願動三千大千界，  	天眾空中皆雨花。
是時大地咸震動，  	天花鼓樂滿虛空，
并雨栴檀細末香，  	唱言未來當作佛。』」
佛告阿難：「彼法處比丘於世間自在王如來。及諸天人魔梵沙門婆羅門等前，廣發如是大弘誓願，皆已成就世間希有。發是願已，如實安住種種功德，具足莊嚴威德廣大清淨佛土。修習如是菩薩行時，經於無量無數不可思議無有等等億那由他百千劫內，初未曾起貪瞋及癡欲害恚想，不起色聲香味觸想，於諸眾生常樂愛敬猶如親屬，其性溫和易可同處。有來求者不逆其意，善言勸諭無不從心，資養所須趣支身命。少欲知足常樂虛閑，稟識聰明而無矯妄。其性調順無有暴惡，於諸有情常懷慈忍。心不詐諂亦無懈怠，善言策進求諸白法。普為群生勇猛無退，利益世間大願圓滿。奉事師長敬佛法僧，於菩薩行常被甲冑，志樂寂靜離諸染著。為令眾生常修白法，於善法中而為上首，住空無相無願、無作無生、不起不滅無有憍慢。而彼正士行菩薩道時，常護語言，不以語言害他及己，常以語業利己及人。若入王城及諸村落，雖見諸色心無所染，以清淨心不愛不恚。菩薩爾時於檀波羅蜜起自行已，又能令他行於惠施。於尸波羅蜜乃至般若波羅蜜，起前二行皆悉圓滿。由成如是諸善根故，所生之處有無量億那由他百千伏藏自然涌出，復令無量無數不可思議無等無邊諸眾生類，安住阿耨多羅三藐三菩提。如是無邊諸菩薩眾起諸妙行，供養奉事於諸世尊乃至成佛，皆不可以語言分別之所能知。或作輪王、帝釋、蘇焰摩天、兜率陀天、善化天、他化自在天、大梵天王，皆能奉事供養諸佛，及能請佛轉於法輪。若作閻浮提王及諸長者、宰官、婆羅門、剎帝利等，諸種姓中皆能尊重供養諸佛，又能演說無量法門。從此永棄世間，成無上覺。然彼菩薩能以上妙衣服臥具飲食醫藥，盡形供養一切如來得安樂住。如是種種圓滿善根，非以語言能盡邊際。口中常出栴檀妙香，其香普熏無量無數乃至億那由他百千世界，復從一切毛孔出過人天優鉢羅花上妙香氣。隨所生處，相好端嚴殊勝圓滿。又得諸資具自在波羅蜜多，一切服用周遍無乏。所謂諸寶香花幢幡繒蓋、上妙衣服飲食湯藥，及諸伏藏珍玩所須，皆從菩薩掌中自然流出，身諸毛孔流出一切人天音樂。由是因緣，能令無量無數不可思議諸眾生等，安住阿耨多羅三藐三菩提。阿難！我今已說法處菩薩本所修行。」
爾時阿難白佛言：「世尊！彼法處菩薩成菩提者，為過去耶？為未來耶？為今現在他方世界耶？」
佛告阿難：「西方去此十萬億佛剎，彼有世界名曰極樂。法處比丘在彼成佛，號無量壽，今現在說法，無量菩薩及聲聞眾恭敬圍繞。
「阿難！彼佛光明普照佛剎無量無數不可思議，我今略說，光照東方如恒河沙等國土，南西北方四維上下亦復如是，唯除諸佛本願威神所加，悉皆照燭。是諸佛光，或有加一尋者，或有加一由旬乃至億那由他百千由旬光者，或普照佛剎者。阿難，以是義故，無量壽佛復有異名，謂無量光、無邊光、無著光、無礙光、光照王端嚴光、愛光、喜光、可觀光、不思議光、無等光、不可稱量光、映蔽日光、映蔽月光、掩奪日月光。彼之光明清淨廣大，普令眾生身心悅樂，復令一切餘佛剎中天、龍、夜叉、阿修羅等皆得歡悅。阿難！我今開示彼佛光明，滿足一劫說不能盡。
「復次阿難！彼無量壽如來，諸聲聞眾不可稱量知其邊際。假使比丘滿億那由他百千數量，皆如大目揵連神通自在，於晨朝時周歷大千世界、須臾之頃還至本處，彼經億那由他百千歲數欲共計算無量壽佛初會之中諸聲聞眾，盡其神力乃至滅度，於百分中不知其一、於千分百千分乃至鄔波尼殺曇分中亦不知其一。阿難！譬如大海深八萬四千由旬，以目極觀不知邊際。若有丈夫析一毛端為五十分，以其一分於大海中霑取一滴。阿難！彼之水滴比於大海，何者為多？」
阿難白言：「假使取千由旬水，猶以為少，況以毛端一分而可方之！」
佛告阿難：「假使比丘滿億那由他百千數量，皆如大目揵連，經百千億那由他歲皆共算數彼無量壽如來初會聲聞，所知數量如彼毛端一滴之水，餘不測者猶如大海。諸菩薩摩訶薩眾亦復如是，非以算計之所能知。
「阿難！彼佛壽命無量無邊，不可知其劫數多少；聲聞、菩薩及諸天人，壽量亦爾。」
阿難白佛言：「世尊！彼佛出世于今幾時，能得如是無量壽命？」
佛告阿難：「彼佛受生，經今十劫。
「復次阿難！彼極樂界無量功德具足莊嚴，國土豐稔天人熾盛，志意和適常得安隱，無有地獄、畜生及琰魔王界。有種種香周遍芬馥，種種妙花亦皆充滿。有七寶幢周布行列，其寶幢上懸諸幡蓋及眾寶鈴，具足百千諸妙雜色。
「阿難！彼如來國多諸寶樹，或純黃金、白銀、琉璃、頗梨、赤珠、馬瑙、玉樹，唯一寶成不雜餘寶，或以二寶乃至七寶莊嚴。阿難！彼金為樹者，以金為根莖，白銀為葉及以花果。白銀之樹，銀為根莖，黃金為葉及以花果。馬瑙之樹，馬瑙根莖，美玉為葉及以花果。美玉樹者，玉為根莖，七寶為葉及諸花果。或有金樹，黃金為根，白銀為莖，琉璃為枝，頗梨為條，赤珠為葉，馬瑙為花，美玉為果。或有銀樹，以銀為根，黃金為莖，餘枝果等飾同金樹。琉璃樹者，琉璃為根，黃金為莖，白銀為枝，頗梨為條，赤珠為葉，馬瑙為花，美玉為果。頗梨、真珠、馬瑙等樹，諸寶轉飾皆若琉璃。復有玉樹，玉為其根，黃金為莖，白銀為枝，琉璃為條，頗梨為葉，赤珠為花，馬瑙為果。復有無量摩尼珠等寶莊嚴樹，周遍其國。是諸寶樹光輝赫奕世無能比，以七寶羅網而覆其上，其網柔軟如兜羅綿。
「復次阿難！無量壽佛有菩提樹，高十六億由旬，枝葉垂布八億由旬。樹本隆起高五千由旬，周圓亦爾。其條葉花果常有無量百千種種妙色，及諸珍寶殊勝莊嚴，謂月光摩尼寶、釋迦毘楞伽寶、心王摩尼寶、海乘流注摩尼寶，光輝遍照超過人天。於其樹上有諸金鎖垂寶瓔珞周遍莊嚴，謂盧遮迦寶、末瑳寶，及赤白青色真珠等寶以為瓔珞。有師子雲聚寶等以為其鎖，飾諸寶柱。又以純金真珠雜寶鈴鐸以為其網，莊嚴寶鎖彌覆其上，以頗梨萬字半月寶等互相映飾，微風吹動出種種聲，令千世界諸眾生等隨樂差別，於甚深法證無生忍。阿難！彼千世界諸有情等聞此音已，住不退轉無上菩提，及無量無數有情得無生法忍。
「復次阿難！若有眾生見菩提樹、聞聲、嗅香、嘗其果味、觸其光影、念樹功德，由此因緣乃至涅槃，五根無患心無散亂，皆於阿耨多羅三藐三菩提得不退轉。復由見彼菩提樹故獲三種忍。何等為三？一者隨聲忍，二者隨順忍，三者無生法忍。此皆無量壽佛本願威神見所加，及往修靜慮無比喻故、無缺減故、善修習故、善攝受故、善成就故。
大寶積經卷第十七
^folio#ssv2_ruci
大寶積經卷[＊]第十八
[＊]大唐[＊]三藏菩提流志奉　詔譯
無量壽會第五之二
「復次阿難！彼極樂界，無諸黑山、鐵圍山、大鐵圍山、妙高山等。」
阿難白佛言：「世尊！其四天王天、三十三天，既無諸山，依何而住？」
佛告阿難：「於汝意云何？妙高已上有夜摩天乃至他化自在天，及色界諸天等，依何而住？」
阿難白佛言：「世尊！不可思議業力所致。」
佛語阿難：「不思議業汝可知耶？」
答言：「不也。」
佛告阿難：「諸佛及眾生善根業力，汝可知耶？」
答言：「不也。世尊！我今於此法中實無所惑，為破未來疑網故發斯問。」
佛告阿難：「彼極樂界，其地無海而有諸河，河之狹者滿十由旬，水之淺者十二由旬，如是諸河深廣之量或二十、三十乃至百數，或有極深廣者至千由旬。其水清冷具八功德，濬流恒激出微妙音，譬若諸天百千伎樂，安樂世界其聲普聞。有諸名花沿流而下，和風微動出種種香。居兩岸邊多栴檀樹，修條密葉交覆於河，結實開花芳輝可玩。群生遊樂隨意往來，或有涉河濯流嬉戲，感諸天水善順物宜，深淺寒溫曲從人好。阿難！大河之下地布金砂，有諸天香世無能喻，隨風散馥，雜水流馚。天曼陀羅花、優鉢羅花、波頭摩花、拘物頭華、芬陀利花彌覆其上。
「復次阿難！彼國人眾或時遊覽同萃河濱，有不願聞激流之響，雖獲天耳終竟不聞。或有願聞，即時領悟百千萬種喜愛之聲，所謂佛法僧聲、止息之聲、無性聲、波羅蜜聲、十力四無所畏聲、神通聲、無作聲、無生無滅聲、寂靜聲、邊寂靜聲、極寂靜聲、大慈大悲聲、無生法忍聲、灌頂受位聲。得聞如是種種聲已，獲得廣大愛樂歡悅，而與觀察相應、厭離相應、滅壞相應、寂靜相應、邊寂靜相應、極寂靜相應、義味相應、佛法僧相應、力無畏相應、神通相應、止息相應、菩提相應、聲聞相應、涅槃相應。
「復次阿難！彼極樂世界，不聞諸惡趣名、邊無障礙煩惱覆蔽名、無有地獄琰摩畜生名、邊無八難名，亦無苦受不苦不樂受名，尚無假設何況實苦，是故彼國名為極樂。阿難！我今略說極樂因緣，若廣說者窮劫不盡。
「復次阿難！彼極樂世界所有眾生，或已生、或現生、或當生，皆得如是諸妙色身，形貌端正神通自在，福力具足，受用種種宮殿園林、衣服飲食、香華瓔珞，隨意所須悉皆如念，譬如他化自在諸天。
「復次阿難！彼佛國中有微細食，諸有情類嘗無噉者，如第六天隨所思念如是飲食即同食已，色力增長而無便穢。復有無量如意妙香、塗香、末香，其香普熏彼佛國界。及散花幢幡亦皆遍滿。其有欲聞香者隨願即聞，或不樂者終無所受。復有無量上妙衣服寶冠、環釧耳璫、瓔珞花鬘帶鎖，諸寶莊嚴，無量光明百千妙色悉皆具足，自然在身。復有金銀真珠妙寶之網，懸諸寶鈴周遍嚴飾。若諸有情所須宮殿樓閣等，隨所樂欲高下長短廣狹方圓，及諸床座妙衣敷上，以種種寶而嚴飾之，於眾生前自然出現，人皆自謂各處其宮。
「復次阿難！極樂國土所有眾生無差別相，順餘方俗有天人名。阿難！譬如下賤半挓迦人，對於輪王則無可諭，威光德望悉皆無有。又如帝釋方第六天，威光等類皆所不及，園苑宮殿、衣服雜飾、尊貴自在、階位神通及以變化不可為比，唯受法樂則無差別。阿難應知，彼國有情猶如他化自在天王。
「阿難！彼極樂界於晨朝時，周遍四方和風微動不逆不亂，吹諸雜花種種香氣，其香普熏周遍國界。一切有情為風觸身，安和調適猶如比丘得滅盡定。其風吹動七寶樹林，華飄成聚高七人量，種種色光照曜佛土。譬如有人以花布地手按令平，隨雜色花間錯分布。彼諸花聚亦復如是，其花微妙廣大柔軟如兜羅綿，若諸有情足蹈彼花沒深四指，隨其舉足還復如初。過晨朝已其花自然沒入於地，舊花既沒大地清淨，更雨新花還復周遍。如是中時、晡時、初中後夜，飄花成聚亦復如是。阿難！一切廣大珍奇之寶，無有不生極樂界者。
「阿難！彼佛國中有七寶蓮花，一一蓮花有無量百千億葉，其葉有無量百千珍奇異色，以百千摩尼妙寶莊嚴，覆以寶網轉相映飾。阿難！彼蓮花量或半由旬，或一二三四乃至百千由旬者。是一一花出三十六億那由他百千光明，一一光中出三十六億那由他百千諸佛，身如金色，具三十二大丈夫相、八十隨好，殊勝莊嚴，放百千光普照世界。是諸佛等，現往東方為眾說法，皆為安立無量有情於佛法中；南西北方四維上下亦復如是。
「復次阿難！極樂世界無有昏闇亦無火光，涌泉陂湖彼皆非有，亦無住著家室林苑之名，及表示之像幼童色類，亦無日月晝夜之像。於一切處標式既無亦無名號，唯除如來所加威者。
「阿難！彼國眾生若當生者，皆悉究竟無上菩提到涅槃處。何以故？若邪定聚及不定聚，不能了知建立彼因故。
「阿難！東方如恒沙界，一一界中如恒沙佛，彼諸佛等各各稱歎阿彌陀佛無量功德；南西北方四維上下諸佛稱讚亦復如是。何以故？他方佛國所有眾生聞無量壽如來名號，乃至能發一念淨信歡喜愛樂，所有善根迴向願生無量壽國者，隨願皆生，得不退轉乃至無上正等菩提，除五無間、誹毀正法及謗聖者。
「阿難！若有眾生於他佛剎發菩提心，專念無量壽佛，及恒種殖眾多善根，發心迴向願生彼國。是人臨命終時，無量壽佛與比丘眾前後圍繞現其人前，即隨如來往生彼國得不退轉，當證無上正等菩提。是故阿難！若有善男子、善女人，願生極樂世界、欲見無量壽佛者，應發無上菩提心，復當專念極樂國土，積集善根應持迴向，由此見佛生彼國中，得不退轉乃至無上菩提。阿難！若他國眾生發菩提心，雖不專念無量壽佛，亦非恒種眾多善根，隨己修行諸善功德，迴向彼佛願欲往生。此人臨命終時，無量壽佛即遣化身，與比丘眾前後圍繞，其所化佛光明相好與真無異，現其人前攝受導引。即隨化佛往生其國，得不退轉無上菩提。阿難！若有眾生住大乘者，以清淨心向無量壽如來，乃至十念念無量壽佛願生其國，聞甚深法即生信解，心無疑惑。乃至獲得一念淨心，發一念心念無量壽佛，此人臨命終時，如在夢中見無量壽佛，定生彼國得不退轉無上菩提。阿難！以此義利故，無量無數不可思議無有等等無邊世界諸佛如來，皆共稱讚無量壽佛所有功德。」
佛告阿難：「東方如恒河沙界，一一界中有如恒沙菩薩，為欲瞻禮供養無量壽佛及諸聖眾來詣佛所；南西北方四維上下亦復如是。」
爾時世尊而說頌曰：
「東方諸佛剎，  	數如恒河沙，
如是佛土中，  	恒沙菩薩眾，
皆現神通來，  	禮無量壽佛；
三方諸聖眾，  	禮覲亦同歸。
彼於沙界中，  	道光諸辯論，
住深禪定樂，  	四無所畏心。
各齎眾妙花，  	名香皆可悅，
并奏諸天樂，  	百千和雅音，
以獻天人師，  	名聞十方者。
究竟威神力，  	善學諸法門，
種種供養中，  	勤修無懈倦，
功德智慧景，  	能破諸幽冥，
咸以尊重心，  	奉諸珍妙供。
彼觀殊勝剎，  	菩薩眾無邊，
願速成菩提，  	淨界如安樂。
世尊知欲樂，  	廣大不思議，
微笑現金容，  	告成如所願。
了諸法如幻，  	佛國猶夢響，
恒發誓莊嚴，  	當成微妙土。
菩薩以願力，  	修勝菩提行，
知土如影像，  	發諸弘誓心。
若求遍清淨，  	殊勝無邊剎，
聞佛聖德名，  	願生安樂國。
若有諸菩薩，  	志求清淨土，
了知法無我，  	願生安樂國。
「復次阿難！極樂世界所有菩薩，於無上菩提皆悉安住一生補處，唯除大願能師子吼擐大甲冑摩訶薩眾為度群生修大涅槃者。
「復次阿難！彼佛剎中諸聲聞眾，皆有身光能照一尋。菩薩光照極百千尋，除二菩薩光明常照三千大千世界。」
阿難白佛言：「世尊！彼二菩薩名為何等？」
佛告阿難：「汝今諦聽。彼二菩薩，一名觀自在，二名大勢至。阿難！此二菩薩從娑婆世界捨壽量已往生彼國。
「阿難！彼極樂界所生菩薩皆具三十二相，膚體柔軟、諸根聰利、智慧善巧，於差別法無不了知，禪定神通善能遊戲，皆非薄德鈍根之流。彼菩薩中有得初忍或第二忍者無量無邊，或有證得無生法忍。
「阿難！彼國菩薩，乃至菩提不墮惡趣，生生之處能了宿命，唯除五濁剎中出現於世。
「阿難！彼國菩薩皆於晨朝供養他方無量百千諸佛，隨所希求種種花鬘、塗香、末香、幢幡、繒蓋及諸音樂，以佛神力皆現手中供養諸佛。如是供具廣大甚多，無數無邊不可思議。若復樂求種種名花，花有無量百千光色，皆現手中奉散諸佛。阿難！其所散花，即於空中變成花蓋，蓋之小者滿十由旬，若不更以新花重散，前所散花終不墮落。阿難！或有花蓋滿二十由旬，如是三十四十乃至千由旬，或等四洲或遍小千中千，乃至三千大千世界。此諸菩薩生希有心得大喜愛，於晨朝時奉事供養尊重讚歎無量百千億那由他佛，及種諸善根已，即於晨朝還到本國。此皆由無量壽佛本願加威，及曾供如來善根相續無缺減故、善修習故、善攝取故、善成就故。
「復次阿難！彼極樂界諸菩薩眾，所說語言與一切智相應，於所受用皆無攝取，遍遊佛剎無愛無厭亦無希求。不希求想，無自想、無煩惱想、無我想、無鬪諍相違怨瞋之想。何以故？彼諸菩薩於一切眾生有大慈悲利益心故，有柔軟無障礙心、不濁心、無忿恨心，有平等調伏寂靜之心、忍心、忍調伏心，有等引澄淨無散亂心、無覆蔽心、淨心、極淨心、照曜心、無塵心、大威德心、善心、廣大心、無比心、甚深心、愛法心、喜法心、善意心、捨離一切執著心、斷一切眾生煩惱心、閉一切惡趣心故，行智慧行已成就無量功德，於禪定覺分善能演說，而常遊戲無上菩提勤修敷演。肉眼發生能有簡擇，天眼出現鑒諸佛土，法眼清淨能離諸著，慧眼通達到於彼岸，佛眼成就覺悟開示，生無礙慧為他廣說。於三界中平等勤修，既自調伏亦能調伏一切有情，能令獲得勝奢摩他。於一切法證無所得，善能說法言辭巧妙，勤修供養一切諸佛，摧伏有情一切煩惱，為諸如來之所悅可，而能如是如是思惟。作是思惟時，能集能見一切諸法皆無所得，以方便智修行滅法，善知取捨理非理趣，於理趣非理趣中皆得善巧。於世語言心不愛樂，出世經典誠信勤修，善巧尋求一切諸法，求一切法增長了知。知法本無實不可得，於所行處亦無取捨，解脫老病住諸功德，從本已來安住神通勤修深法，於甚深法而無退轉，於難解法悉能通達，得一乘道無有疑惑。於佛教法不由他悟，其智宏深譬之巨海，菩提高廣喻若須彌，自身威光超於日月。凡所思擇與慧相應，猶如雪山其心潔白。光明普照無邊功德，燒煩惱薪方之於火。不為善惡之所動搖，心靜常安猶如大地。洗滌煩惑如清淨水，心無所主猶如火，不著世間猶如風，養諸有情猶如地，觀諸世界如虛空。荷載眾生猶如良乘，不染世法譬之蓮花，遠暢法音猶如雷震，雨一切法方之大雨，光蔽賢聖猶彼大仙，善能調伏如大龍象，勇猛無畏如師子王，覆護眾生如尼拘陀樹，他論不動如鐵圍山，修慈無量如彼恒河。諸善法王能為前導如大梵天，無所聚積猶如飛鳥，摧伏他論如金翅王，難遇希有如優曇花。最勝丈夫其心正直，無有懈怠能善修行，於諸見中善巧決定，柔和忍辱無嫉妬心。論法無厭求法不倦，常勤演說利益眾生。戒若琉璃內外明潔，善聞諸法而為勝寶，其所說言令眾悅伏。以智慧力建大法幢、吹大法螺、擊大法鼓，常樂勤修建諸法表。由智慧光心無迷惑，遠眾過失亦無損害。以淳淨心離諸穢染，常行惠施永捨慳貪，稟性溫和常懷慚恥。其心寂定智慧明察，作世間燈破眾生闇，堪受利養殊勝福田，為大導師周濟群物。遠離憎愛心淨無憂，勇進無怖為大法將，了知地獄調伏自他，利益有情拔諸毒箭，為世間解、為世間師，引導群生捨諸愛著。永離三垢遊戲神通，因力、緣力、願力、發起力、世俗力、出生力、善根力、三摩地力、聞力、捨力、戒力、忍力、精進力、定力、慧力、奢摩他力、毘鉢舍那力、神通力、念力、覺力、摧伏一切大魔軍力，并他論法力、能破一切煩惱怨力及殊勝大力，威福具足相好端嚴，智慧辯才善根圓滿。目淨脩廣人所愛樂，其身清潔遠離貢高。以尊重心奉事諸佛，於諸佛所植眾善本，拔除憍慢離貪瞋癡，殊勝吉祥應供中最。住勝智境赫奕慧光，心生歡喜雄猛無畏，福智具足無有滯限，但說所聞開示群物，隨所聞法皆能解了。於菩提分法勇猛勤修，空無相願而常安住，及不生不滅諸三摩地，行遍道場遠二乘境。阿難！我今略說彼極樂界所生菩薩摩訶薩眾真實功德悉皆如是。阿難！假令我身住壽百千億那由他劫，以無礙辯欲具稱揚彼諸菩薩摩訶薩等真實功德不可窮盡。阿難！彼諸菩薩摩訶薩等，盡其壽量亦不能知。」
爾時世尊告阿難言：「此是無量壽佛極樂世界。汝應從坐而起，合掌恭敬五體投地為佛作禮。彼佛名稱遍滿十方，彼一一方恒沙諸佛皆共稱讚無礙無斷。」
是時阿難即從坐起，偏袒右肩，西面合掌五體投地，白佛言：「世尊！我今欲見極樂世界無量壽如來，并供養奉事無量百千億那由他佛及菩薩眾，種諸善根。」
時無量壽佛即於掌中放大光明，遍照百千俱胝那由他剎。彼諸佛剎所有大小諸山，黑山、寶山、須彌盧山、迷盧山、大迷盧山、目真隣陀山、摩訶目真隣陀山、鐵圍山、大鐵圍山，叢薄園林及諸宮殿天人等物，以佛光明皆悉照見。譬如有人以淨天眼觀一尋地見諸所有，又如日光出現萬物斯覩。彼諸國中比丘、比丘尼、優婆塞、優婆夷，悉見無量壽如來如須彌山王照諸佛剎，時諸佛國皆悉明現如處一尋。以無量壽如來殊勝光明極清淨故，見彼高座及諸聲聞、菩薩等眾。譬如大地洪水盈滿，樹林山河皆沒不現，唯有大水。
「如是阿難！彼佛剎中無有他論及異形類，唯除一切大聲聞眾一尋光明，及彼菩薩摩訶薩踰繕那等百千尋光。」彼無量壽如來、應、正等覺光明，映蔽一切聲聞及諸菩薩，令諸有情悉皆得見。彼極樂界菩薩、聲聞、人天眾等，一切皆覩娑婆世界釋迦如來，及比丘眾圍繞說法。
爾時佛告彌勒菩薩言：「汝頗見具足清淨威德莊嚴佛剎，及見空中樹林園苑涌泉池沼不耶？汝見大地乃至色究竟天，於虛空中散花樹林以為莊嚴。復有眾鳥住虛空界出種種音，猶如佛聲普聞世界。是諸眾鳥皆是化作，非實畜生。汝見是耶？」
彌勒白佛言：「唯然已見。」
佛復告彌勒菩薩言：「汝見此諸眾生入踰繕那百千宮殿已，遊行虛空無著無礙，遍諸剎土供養諸佛，及見彼有情於晝夜分念佛相續不耶？」
彌勒白言：「唯然盡見。」
佛復告言：「汝見他化自在天與極樂諸人受用資具有差別不？」
彌勒白言：「我不見彼有少差別。」
佛告彌勒：「汝見極樂世界人住胎不？」
彌勒白言：「世尊！譬如三十三天夜摩天等，入百由旬若五百由旬宮殿之內遊戲歡樂。我見極樂世界人住胎者如夜摩天處於宮殿，又見眾生於蓮華內結加趺坐自然化生。」
時彌勒菩薩復白佛言：「世尊！何因緣故，彼國眾生有胎生者、化生者？」
佛告彌勒：「若有眾生墮於疑悔積集善根，希求佛智、普遍智、不思議智、無等智、威德智、廣大智。於自善根不能生信，以此因緣，於五百歲住宮殿中，不見佛、不聞法、不見菩薩及聲聞眾。若有眾生斷除疑悔積集善根，希求佛智乃至廣大智，信已善根。此人於蓮華內結加趺坐忽然化生，瞬息而出。譬如他國有人來至，而此菩薩亦復如是。餘國發心來生極樂，見無量壽佛奉事供養，及諸菩薩聲聞之眾。阿逸多！汝觀殊勝智者，彼因廣慧力故受彼化生，於蓮花中結加趺坐。汝觀下劣之輩，於五百歲中不見佛、不聞法、不見菩薩及聲聞眾，不知菩薩威儀法則，不能修習諸功德故，無因奉事無量壽佛。是諸人等皆為昔緣疑悔所致。譬如剎帝利王其子犯法，幽之內宮、處以花觀，層樓綺殿妙飾奇珍，寶帳金床重敷茵褥，名花布地燒大寶香，服御所資悉皆豐備，而以閻浮金鎖繫其兩足。」
佛告彌勒：「於意云何？彼王子心寧樂此不？」
答言：「不也。世尊！彼幽縶時常思解脫，求諸親識居士宰官長者近臣。王之太子雖希出離終不從心，乃至剎帝利王心生歡喜方得解脫。」
佛告彌勒：「如是如是。若有墮於疑悔，種諸善根希求佛智乃至廣大智，於自善根不能生信。由聞佛名起信心故，雖生彼國，於蓮花中不得出現。彼等眾生處花胎中，猶如園苑宮殿之想。何以故？彼中清淨無諸穢惡，一切無有不可樂者。然彼眾生於五百歲，不見佛、不聞法、不見菩薩及聲聞眾，不得供養奉事諸佛，不得問於菩薩法藏。遠離一切殊勝善根，彼等於中不生欣樂，不能出現修習善法；往昔世中過失盡已然後乃出，彼於出時，心迷上下四方之所。若五百歲無疑惑者，即當供養無量百千俱胝那由他佛，并種無量無邊善根。汝阿逸多！當知疑惑與諸菩薩為大損害。」
爾時彌勒菩薩白佛言：「世尊！於此國界不退菩薩，當生極樂國者，其數幾何？」
佛告彌勒：「此佛土中有七十二億菩薩，彼於無量億那由他百千佛所種諸善根成不退轉，當生彼國。況餘菩薩由少善根生彼國者，不可稱計。阿逸多！從難忍如來佛國，有十八億不退菩薩當生極樂世界。東北方寶藏佛國中，有九十億不退菩薩當生彼土。從無量聲如來國中，有二十二億不退菩薩當生彼土。從光明如來國中，有三十二億不退菩薩當生彼土。從龍天如來國中，有十四億不退菩薩當生彼土。從勝天力如來國中，有十二千不退菩薩當生彼土。從師子如來國中，有五百不退菩薩當生彼土。從離塵如來國中，有八十一億不退菩薩當生彼土。從世天如來國中，有六十億不退菩薩當生彼土。從勝積如來國中，有六十億不退菩薩當生彼土。從人王如來國中，有十俱胝不退菩薩當生彼土。從勝花如來國中，有五百菩薩具大精進發趣一乘，於七日中能令眾生離百千億那由他劫生死流轉，彼等亦當生極樂界。從發起精進如來國中，有六十九億不退菩薩當生彼土，到彼國已，供養禮拜無量壽如來及菩薩眾。阿逸多！我若具說諸方菩薩生極樂界，若已到、今到、當到，為供養禮拜瞻仰無量壽佛等者，但說其名窮劫不盡。
「阿逸多！汝觀彼諸菩薩摩訶薩善獲利益，若有聞彼佛名能生一念喜愛之心，當獲如上所說功德，心無下劣亦不貢高，成就善根悉皆增上。阿逸多！是故告汝及天人、世間、阿修羅等，今此法門付囑於汝。應當愛樂修習，乃至經一晝夜受持讀誦生希望心，於大眾中為他開示，當令書寫執持經卷，於此經中生導師想。
「阿逸多！是故菩薩摩訶薩，欲令無量諸眾生等速疾安住不退轉於阿耨多羅三藐三菩提，及欲見彼廣大莊嚴攝受殊勝佛剎圓滿功德者，應當起精進力聽此法門。假使經過大千世界滿中猛火，為求法故不生退屈諂偽之心，讀誦受持書寫經卷，乃至於須臾頃為他開示，勸令聽聞不生憂惱，設入大火不應疑悔。何以故？彼無量億諸菩薩等皆悉求此微妙法門，尊重聽聞不生違背。是故汝等應求此法。阿逸多！彼諸眾生獲大善利，若於來世乃至正法滅時，當有眾生殖諸善本，已曾供養無量諸佛，由彼如來加威力故，能得如是廣大法門，一切如來稱讚悅可。若於彼法攝取受持，當獲廣大一切智智，隨意所樂種諸善根。若善男子善女人等，於彼法中廣大勝解之者，當能聽聞獲大歡喜，受持讀誦廣為他說常樂修行。阿逸多！無量億數諸菩薩等求請此法不曾厭背，是故汝等諸善男子及善女人，於今來世能於是法，若已求、現求、當求者，皆獲善利。
「阿逸多！如來所應作者皆已作之。汝等應當安住無疑種諸善本，應常修學使無疑滯，不入一切種類珍寶成就牢獄。阿逸多！如是等類大威德者，能生廣大佛法異門，由於此法不聽聞故，有一億菩薩退轉阿耨多羅三藐三菩提。阿逸多！佛出世難，離八難身亦為難得。諸佛如來無上之法，十力無畏無礙無著甚深之法，及波羅蜜等菩薩之法，能說法人亦難開示。阿逸多！善說法人非易可遇，堅固深信時亦難遭。是故我今如理宣說，汝等修習應如教住。
「汝阿逸多！我以此法門及諸佛法囑累於汝，汝當修行無令滅沒。如是廣大微妙法門，一切諸佛之所稱讚。勿違佛教而棄捨之，當令汝等獲不善利，淪沒長夜備眾危苦。是故我今為大囑累，當令是法久住不滅，應勤修行隨順我教。」
爾時世尊而說頌曰：
「若於福德初未修，  	終不聞斯微妙法；
勇猛能成諸善利，  	當聞如是甚深經。
彼人曾見諸世尊，  	能作大光拯濁世，
多聞總持如巨海，  	彼獲聖賢喜愛心。
懈怠邪見下劣人，  	不信如來斯正法；
若曾於佛殖眾善，  	救世之行彼能修。
譬如盲人恒處闇，  	不能開導於他路；
聲聞於佛智亦然，  	況餘有情而悟解。
如來功德佛自知，  	唯有世尊能開示，
天龍夜叉所不及，  	二乘自絕於名言。
若諸有情當作佛，  	行超普賢登彼岸，
敷演一佛之功德，  	時逾多劫不思議，
於是中間身滅度，  	佛之勝慧莫能量。
是故具足於信聞，  	及諸善友之攝受，
得聞如是深妙法，  	當獲愛重諸聖尊。
如來勝智遍虛空，  	所說義言唯佛悟，
是故博聞諸智士，  	應信我教如實言。
人趣之身得甚難，  	如來出世遇亦難，
信慧多時方乃獲，  	是故修者應精進。
如是妙法已聽聞，  	常念諸佛而生喜，
彼人往昔真吾友，  	善能樂欲佛菩提。」
爾時世尊說是經已，天人世間有萬二千那由他億眾生遠塵離垢得法眼淨；二十億眾生得阿那含果；六千八百比丘諸漏已盡心得解脫；四十億菩薩於無上菩提住不退轉，被大甲冑當成正覺；有二十五億眾生得不退忍；有四萬億那由他百千眾生於無上菩提未曾發意，今始初發種諸善根，願生極樂世界見阿彌陀佛，皆當往生彼如來土，各於異方次第成佛同名妙音。有八萬億那由他眾生，得授記法忍成無上菩提。彼無量壽佛昔行菩薩道時成熟有情，悉皆當生極樂世界，憶念儔昔所發思願皆得成滿。
爾時三千大千世界六種震動，并現種種希有神變，放大光明普照世界。無量億那由他百千天人，同時音樂不鼓自鳴，雨天曼陀羅花沒至于膝；乃至阿迦膩吒天，皆作種種殊妙供養。
佛說經已，彌勒菩薩等及尊者阿難，一切大眾，聞佛所說，皆大歡喜。
大寶積經卷第十八
佛說大乘無量壽莊嚴經卷上
西天譯經三藏朝散大夫試光祿卿明教大師臣法賢奉　詔譯
如是我聞：
一時佛在王舍城鷲峯山中，與大苾芻眾三萬二千人俱，皆得阿羅漢，具大神通。其名曰：尊者阿若憍陳如、尊者馬勝、尊者麼瑟比拏、尊者大名、尊者跋多婆、尊者稱天、尊者離垢、尊者妙臂、尊者布闌拏枳曩、尊者憍梵波提、尊者優樓頻螺迦葉、尊者那提迦葉、尊者舍利子、尊者大目乾連、尊者摩訶迦栴延、尊者摩訶俱絺羅、尊者劫賓那、尊者摩訶𠟃那、尊者彌多羅尼子、尊者阿那律、尊者喜、尊者緊鼻哩拏、尊者須菩提、尊者哩嚩帝、尊者佉禰囉嚩儞枳曩、尊者摩賀囉倪、尊者波囉野尼枳曩、尊者嚩拘隷曩、尊者阿難陀、尊者羅睺羅、尊者善來，如是等三萬二千人俱。
爾時，尊者阿難即從座起，偏袒右肩，右膝著地，合掌頂禮，白佛言：「世尊！如來、應、正等覺諸根清淨、面色圓滿、寶剎莊嚴，如是功德得未曾有。云何所行廣大妙行？及過去、未來諸佛所行？願為宣說。」
佛告阿難：「善哉，善哉！汝為利益一切眾生，懷慈愍心，能問如來微妙之義。汝今諦聽！善思念之！如來、應供、正遍知今為汝說。」
佛告阿難：「如過去無量無邊不可思議阿僧祇劫，爾時有佛世尊出現於世，名曰然燈如來、應、正等覺。彼然燈佛前，復有世尊出現世間，名鉢囉多波野輸如來。又彼佛前有佛出世，名發光如來。又彼佛前有佛出世，名贊那曩誐囉護如來。又彼佛前有佛出世，名須彌劫如來。又彼佛前有佛出世，名月面如來。又彼佛前有佛出世，名無垢面如來。又彼佛前有佛出世，名無著如來。又彼佛前有佛出世，名龍主如來。又彼佛前有佛出世，名日面如來。又彼佛前有佛出世，名山響音王如來。又彼佛前有佛出世，名須彌峯如來。又彼佛前有佛出世，名金藏如來。又彼佛前有佛出世，名火光如來。又彼佛前有佛出世，名不動地如來。又彼佛前有佛出世，名瑠璃光如來。又彼佛前有佛出世，名月王如來。又彼佛前有佛出世，名日音如來。又彼佛前有佛出世，名散華莊嚴如來。又彼佛前有佛出世，名吉祥峯如來。又彼佛前有佛出世，名持海慧自在通王如來。又彼佛前有佛出世，名施光如來。又彼佛前有佛出世，名大香象光如來。又彼佛前有佛出世，名離一切垢如來。又彼佛前有佛出世，名勇猛峯如來。又彼佛前有佛出世，名寶光如來。又彼佛前有佛出世，名持多德得通如來。又彼佛前有佛出世，名過日月光如來。又彼佛前有佛出世，名最上瑠璃光如來。又彼佛前有佛出世，名慧花開心行出生如來。又彼佛前有佛出世，名大華林通王如來。又彼佛前有佛出世，名一月光如來。又彼佛前有佛出世，名破無明黑暗如來。又彼佛前有佛出世，名真珠珊瑚蓋如來。又彼佛前有佛出世，名三乘法自在王如來。又彼佛前有佛出世，名師子海峯自在王如來。又彼佛前有佛出世，名梵音聲自在王如來。又彼佛前有佛出世，名世自在王如來、應、正等覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。而於法中，有一苾芻，名曰作法，信解第一、明記第一、修行第一、精進第一、智慧第一、大乘第一。爾時，苾芻離自本處來詣佛前，頭面禮足，於一面立。即以伽他嘆佛，面色端嚴；復發廣大誓願，頌曰：
「『如來微妙色端嚴，  	一切世間無有等；
光明無量照十方，  	日、月、火珠皆暱曜。
願我得佛清淨聲，  	法音普及無邊界，
宣揚戒、定、精進門，  	通達甚深微妙法。
智慧廣大深如海，  	內心清淨絕塵勞，
超過無邊惡趣門，  	速到菩提究竟岸。
亦如過去無量佛，  	威光普照眾生界，
為彼群生大導師，  	度脫老死令安隱。
常行布施及戒、忍，  	精進、定、慧六波羅，
未度有情令得度，  	已度之者使成佛。
我以一切伸供養，  	百千俱胝那由他，
恒河沙數佛世尊，  	令我成就寂滅果。
復有十方諸佛剎，  	恒放光明照一切，
殊勝莊嚴無等倫，  	願我成就利群品。
所有無邊世界中，  	輪迴諸趣眾生類，
速生我剎受快樂，  	不久俱成無上道。
願我精進恒決定，  	常運慈心拔有情，
度盡阿鼻苦眾生，  	所發弘誓永不斷。』」
爾時，世尊告阿難言：「彼作法苾芻說是偈已，白世自在王如來：『我今發阿耨多羅三藐三菩提心，樂求無上正等正覺。唯願世尊，說諸佛剎功德莊嚴。若我得聞，恒自修持嚴土之行。』爾時，世自在王如來告作法苾芻言：『汝自思惟，修何方便，而能成就佛剎莊嚴？』苾芻白言：『我智慧微淺，不能了知嚴剎之行。如來、應、正遍知，願為宣說諸佛剎土莊嚴之事。』時世自在王如來，即為宣說八十四百千俱胝那由佛剎功德莊嚴廣大圓滿之相，經於一劫方可究竟。」
爾時阿難聞是事已，白佛言：「世尊！彼世自在王佛壽量長短，云何說土經於一劫？」
佛告阿難：「彼佛壽命滿四十劫。阿難！彼作法苾芻，聞佛所說八十四百千俱胝那由他佛剎功德莊嚴之事，明了通達如一佛剎。即時會中頭面禮足，辭佛而退。往一靜處獨坐思惟，修習功德莊嚴佛剎，發大誓願經於五劫。爾時作法苾芻，復詣世自在王如來所；五體投地禮世尊足，禮已合掌，白佛言：『世尊！如是八十四百千俱胝那由他佛剎，功德莊嚴所行行願，我今成就。』時世自在王如來告苾芻言：『善哉，善哉！汝之行願思惟究竟，今正是時為眾解說。時諸菩薩，聞是法已得大善利，能於佛剎修習莊嚴。』
「爾時，作法苾芻聞佛聖旨；偏袒右肩，右膝著地，合掌向佛即為宣說：『世尊！我發誓言：願如世尊證得阿耨多羅三藐三菩提；所居佛剎，具足無量不可思議功德莊嚴。所有一切眾生，及焰摩羅界，三惡道中地獄、餓鬼、畜生，皆生我剎受我法化，不久悉成阿耨多羅三藐三菩提，一切皆得身真金色。
「『世尊！我得菩提成正覺已，十方世界所有眾生，令生我剎如諸佛土。人天之眾，遠離分別諸根寂靜；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，十方世界所有眾生，令生我剎得大神通，經一念中，周遍巡歷百千俱胝那由他佛剎，供養諸佛深植善本；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，一切皆得宿命通，能善觀察百千俱胝那由他劫過去之事；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，一切皆得清淨天眼，能見百千俱胝那由他世界麁細色相；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，一切皆得他心通，善能了知百千俱胝那由他眾心心所法；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，一切皆得住正信位，離顛倒想堅固修習；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，所修正行善根無量，遍圓寂界而無間斷；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，雖住聲聞緣覺之位，往百千俱胝那由他寶剎之內，遍作佛事；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，一切皆得無邊光明，而能照曜百千俱胝那由他諸佛剎土；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，命不中夭，壽百千俱胝那由他劫；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，無不善名，聞無量無數諸佛剎土，無名、無號、無相、無形，無所稱讚，而無疑謗身心不動；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生求生我剎，念吾名號發志誠心堅固不退，彼命終時，我令無數苾芻現前圍繞來迎彼人，經須臾間得生我剎；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有十方無量無邊，無數世界一切眾生，聞吾名號發菩提心，種諸善根隨意求生，諸佛剎土無不得生；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，皆具三十二種大丈夫相；一生令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，若有大願未欲成佛為菩薩者，我以威力，令彼教化一切眾生，皆發信心，修菩提行、普賢行、寂滅行、淨梵行、最勝行，及一切善行；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生令生我剎，於一切處承事供養無量百千俱胝那由他諸佛，種諸善根，隨意所求無不滿願；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，我剎土中所有菩薩，皆得成就一切智慧，善談諸法祕要之義；不久速成阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，我居寶剎所有菩薩，發勇猛心運大神通，往無量無邊無數世界諸佛剎中，以真珠、瓔珞、寶蓋、幢幡、衣服、臥具、飲食、湯藥、香華、伎樂，供養承事迴求菩提；速得成就阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，我居寶剎所有菩薩，發大道心，欲以真珠、瓔珞、寶蓋、幢幡、衣服、臥具、飲食、湯藥、香華、伎樂，承事供養他方世界無量無邊諸佛世尊，而不能往，我於爾時以宿願力，令彼他方諸佛世尊，各舒手臂至我剎中受是供養；令彼速成阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，我居寶剎所有菩薩，隨自意樂不離此界，欲以真珠、瓔珞、寶蓋、幢幡、衣服、臥具、飲食、湯藥、香華、伎樂，供養他方無量諸佛。又復思惟：「如佛展臂至此受供，劬勞諸佛令我無益。」作是念時，我以神力，令此供具自至他方諸佛面前，一一供養。爾時菩薩，不久悉成阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，我居寶剎所有菩薩，身長十六由旬，得那羅延力，身相端嚴光明照曜，善根具足；成就阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，我居寶剎所有菩薩，為諸眾生通達法藏，安立無邊一切智慧，斷盡諸結；悉得證成阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，我居寶剎所有菩薩，以百千俱胝那由他種種珍寶造作香爐，下從地際上至空界，常以無價栴檀之香，普薰供養十方諸佛；令得速成阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所居佛剎廣博嚴淨光瑩如鏡，悉能照見無量無邊一切佛剎，眾生覩者生希有心；不久速成阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，我居寶剎所有菩薩，晝、夜六時恒受快樂，過於諸天，入平等總持門，身光普照無邊世界；不久得成阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有十方無量無邊無數世界一切女人，若有厭離女身者，聞我名號發清淨心歸依頂禮，彼人命終即生我剎成男子身；悉皆令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有十方無量無邊無數佛剎聲聞、緣覺，聞我名號修持淨戒，堅固不退速坐道場；成就阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有十方無量無邊不可思議無等佛剎一切菩薩，聞我名號五體投地禮拜歸命，復得天上人間一切有情，尊重恭敬親近侍奉增益功德；成就阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有眾生發淨信心，為諸沙門、婆羅門，染衣、洗衣、裁衣、縫衣、修作僧服，或自手作或使人作，作已迴向；是人所感，八十一生得最上衣隨身豐足，於最後身來生我剎；成就阿耨多羅三藐三菩提。』
佛說大乘無量壽莊嚴經卷上
佛說大乘無量壽莊嚴經卷中
[＊]西天譯經三藏朝散大夫試光祿卿明教大師[＊]臣法賢奉　詔譯
「爾時，作法苾芻白世尊言：『我得菩提成正覺已，所有一切眾生聞我名號，永離熱惱心得清涼，行正信行得生我剎，坐寶樹下證無生忍；成就阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有十方一切佛剎諸菩薩眾，聞我名號，應時證得寂靜三摩地。住是定已，於一念中，得見無量無邊不可思議諸佛世尊，承事供養；成就阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有十方一切佛剎聲聞、菩薩，聞我名號證無生忍，成就一切平等善根，住無功用離加行故；不久令得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有十方一切佛剎諸菩薩眾，聞我名已生希有心，是人即得普遍菩薩三摩地。住此定已，於一念中，得至無量無數不可思議諸佛剎中，恭敬尊重供養諸佛；成就阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，於我剎中所有菩薩，或樂說法、或樂聽法、或現神足、或往他方，隨意修習無不圓滿；皆令證得阿耨多羅三藐三菩提。
「『世尊！我得菩提成正覺已，所有十方一切佛剎聞我名者，應時即得初忍、二忍乃至無生法忍；成就阿耨多羅三藐三菩提。』
「爾時作法苾芻，向彼佛前發如是願已，承佛威神，即說頌曰：
「『我今對佛前，  	而發誠實願。
獲佛十力身，  	威德無等等；
復為大國王，  	富豪而自在。
廣以諸財寶，  	普施於貧苦；
令彼諸群生，  	長夜無憂惱；
出生眾善根，  	成就菩提果。
我若成正覺，  	立名無量壽；
眾生聞此號，  	俱來我剎中。
如佛金色身，  	妙相悉圓滿，
亦以大慈心，  	利益諸群品。
願我智慧光，  	廣照十方剎；
除滅諸有情，  	貪、瞋、煩惱闇。
地獄、鬼、畜生，  	悉捨三塗苦；
亦生我剎中，  	修習清淨行。
獲彼光明身，  	如佛普照曜；
日月珠寶光，  	其明不可比。
願我未來世，  	常作天人師；
百億世界中，  	而作師子吼。
如彼過去佛，  	所行慈愍行，
廣無量無邊，  	俱胝諸有情，
圓滿昔所願，  	一切皆成佛。』
發是大願時，  	三千大千界，
震動遍十方，  	天人空界中；
散雨一切花，  	栴檀及沈水，
稱讚大苾芻，  	願力甚希有；
決定當作佛，  	廣利眾生界。
「復次，阿難！時作法苾芻，對世自在王如來，及天人、魔、梵、沙門、婆羅門、阿修羅等，發是願已，住真實慧，勇猛精進，修習無量功德，莊嚴佛剎，入三摩地。歷大阿僧祇劫，修菩薩行。不生慳貪心、瞋恚心、愚癡心；亦無欲想、瞋想、癡想、色、聲、香、味、觸想。心不迷亂，口不瘖瘂，身不懈怠，但樂憶念過去諸佛所修善根行寂靜行，遠離虛妄堅守律儀。常以愛語饒益眾生，於佛法僧信重恭敬調順柔軟。依真諦門植眾德本，了空、無相、無願、無為、無生、無滅。善護口業不譏他過，善護身業不失律儀，善護意業清淨無染。所有國城聚落，男、女眷屬，金、銀、珍寶，乃至色、聲、香、味、觸等，都無所著。恒以布施、持戒、忍辱、精進、禪定、智慧六度之行，利樂眾生。軌範具足，善根圓滿。所生之處，有無量無數百千俱胝那由他珍寶之藏，從地湧出。攝受無量無數百千俱胝那由他眾生，發阿耨多羅三藐三菩提心。如是之行無量無邊說不能盡。
「復次，阿難！作法苾芻行菩薩行時，於諸佛所尊重恭敬，承事供養未曾間斷；為四大天王，恒詣佛所，恭敬禮拜承事供養；為忉利天王，恒詣佛所，恭敬禮拜承事供養；為夜摩天王、兜率天王、化樂天王、他化自在天王，乃至大梵天王等，恒詣佛所，恭敬禮拜承事供養。
「復次，阿難！處閻浮提，為轉輪王，受灌頂位，及大臣官族等，恒詣佛所，恭敬禮拜承事供養；為剎帝利、婆羅門等，恒詣佛所，恭敬禮拜承事供養。如是經無量無數百千萬億劫，親近諸佛植眾德本，所集阿耨多羅三藐三菩提。
「復次，阿難！作法苾芻行菩薩行時，口中常出栴檀之香，身諸毛孔出優鉢羅華香，其香普薰無量無邊不可思議那由他百千由旬；有情聞此香者，皆發阿耨多羅三藐三菩提心。
「復次，阿難！作法苾芻行菩薩行時，色相端嚴，三十二相、八十種好，悉皆具足。復以一切珍寶莊嚴兩臂，手中恒出一切衣服，一切飲食，一切幢幡，一切傘蓋，一切音樂，乃至一切最上所須之物，利樂一切眾生，令發阿耨多羅三藐三菩提心。」
爾時，阿難聞佛說彼作法苾芻菩薩之行，白世尊言：「作法苾芻，為是過去佛耶？未來佛耶？現在佛耶？」
世尊告言：「彼佛如來，來無所來，去無所去；無生無滅，非過、現、未來。但以酬願度生，現在西方；去閻浮提百千俱胝那由他佛剎，有世界名曰極樂，佛名無量壽，成佛已來於今十劫。有無量無數菩薩摩訶薩，及無量無數聲聞之眾，恭敬圍繞而為說法。彼佛光明，照於東方恒河沙數百千俱胝那由他不可稱量佛剎；如是南、西、北方，四維、上、下，亦復如是。
「復次，阿難！彼佛無量壽，若化圓光，或一由旬、二由旬、三由旬，或百由旬、千由旬、百千由旬，或俱胝那由他百千由旬，乃至遍滿無量無邊無數佛剎。
「復次，阿難！今此光明，名無量光、無礙光、常照光、不空光、利益光、愛樂光、安隱光、解脫光、無等光、不思議光、過日月光、奪一切世間光、無垢清淨光，如是光明，普照十方一切世界。天、龍、藥叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人、非人等，見此光明發菩提心，獲利樂故。」
佛告阿難：「我住一劫，說此光明功德利益，亦不能盡。
「復次，阿難！無量壽如來，有如是百、千、萬、十萬、百萬，一俱胝、百俱胝、千俱胝，緊迦囉數，頻婆囉數，那由他數，阿由他數，毘婆訶數，嚩娑那數，穰伽數，阿僧祇數，十阿僧祇數，百阿僧祇數，千阿僧祇數，百千阿僧祇數，阿摩儞野數，不可思議數，如是無量無數聲聞之眾，譬喻算數數不能及。
「阿難！彼大目乾連神通第一，三千大千世界所有一切童男、童女，於一晝夜悉知其數。假使百千俱胝聲聞，神通之力皆如大目乾連，又一一聲聞，壽百千俱胝那由他歲，盡其壽命數彼聲聞，百分之中不及一分。
「復次，阿難！譬如大海，深八萬四千由旬，廣闊無邊。假使有人出身一毛，碎為百俱胝細如微塵，以一一塵投海出水，水在塵上形量亦爾。如是投盡毛塵，於意云何？毛塵水多？海中水多？」
阿難白佛言：「世尊！毛塵出水未及半合，海水無量。」
佛言：「阿難！彼目乾連等聲聞之眾，盡其形壽，數知數者如毛塵之水，數未盡者如海中水。如是彼佛，有如是無量不可算數聲聞弟子。又彼佛國土大富無量，唯受快樂無有眾苦；無地獄、餓鬼、畜生、焰魔羅界及八難之報。唯有清淨菩薩摩訶薩及聲聞之眾。
「復次，阿難！彼佛國土，有種種寶柱，皆以百千珍寶，而用莊嚴。所謂金柱、銀柱、瑠璃柱、頗梨柱、真珠柱、硨磲柱、瑪瑙柱，復有金、銀二寶柱，金、銀、瑠璃三寶柱，金、銀、瑠璃、頗梨四寶柱，金、銀、瑠璃、頗梨、真珠五寶柱，金、銀、瑠璃、頗梨、真珠、硨磲六寶柱，金、銀、瑠璃、頗梨、真珠、硨磲、瑪瑙七寶柱。
「復次，阿難！彼佛國土，復有種種寶樹，根、莖、枝幹黃金所成，華、葉、菓實白銀化作。亦有寶樹，根、莖、枝幹白銀所成，花、葉、菓實瑠璃化作。亦有寶樹，根、莖、枝幹瑠璃所成，華、葉、菓實頗梨化作。亦有寶樹，根、莖、枝、葉頗梨所成，華、葉、菓實真珠化作。亦有寶樹，根、莖、枝幹真珠所成，華、葉、菓實硨磲化作。亦有寶樹，根、莖、枝幹硨磲所成，花、葉、菓實、瑪瑙化作。亦有寶樹，根、莖、枝幹瑪瑙所成，花、葉、菓實黃金化作。亦有寶樹，黃金為根，白銀為身，瑠璃為枝，頗梨為梢，真珠為葉，硨磲為花，瑪瑙為菓。亦有寶樹，白銀為根，瑠璃為身，頗梨為枝，真珠為梢，硨磲為葉，瑪瑙為花，黃金為菓。亦有寶樹，瑠璃為根，頗梨為身，真珠為枝，硨磲為梢，瑪瑙為葉，黃金為花，白銀為菓。亦有寶樹，頗梨為根，真珠為身，硨磲為枝，瑪瑙為梢，黃金為葉，白銀為花，瑠璃為菓。亦有寶樹，真珠為根，硨磲為身，瑪瑙為枝，黃金為梢，白銀為葉，瑠璃為花，頗梨為菓。亦有寶樹，硨磲為根，瑪瑙為身，黃金為枝，白銀為梢，瑠璃為葉，頗梨為花，真珠為菓。亦有寶樹，瑪瑙為根，黃金為身，白銀為枝，瑠璃為梢，頗梨為葉，真珠為花，硨磲為菓。如是極樂世界七寶行樹。
「復次，阿難！彼佛國土清淨嚴飾寬廣平正，無有丘陵、坑坎、荊棘、沙礫、土石等山；黑山、雪山、寶山、金山、須彌山、鐵圍山、大鐵圍山。唯以黃金為地。」
爾時，阿難聞是語已，白世尊言：「四大王天、忉利天，依須彌山王住；夜摩天等當依何住？」
佛告阿難：「夜摩、兜率乃至色、無色界一切諸天，皆依空界而住。」
阿難白言：「空界無礙，云何依住？業因果報不可思議。」
佛告阿難：「汝身果報亦不可思議，眾生業報亦不可思議，諸佛聖力不可思議。彼佛國土雖無大海，而有泉河處處交流；其水或闊十由旬、二十由旬、三十由旬，乃至百千由旬；深十二由旬。其水清淨具八功德；出微妙聲，譬如百千萬種音樂之聲，遍諸佛剎，一切眾生聞者適悅，得大快樂。又水兩岸，復有無數栴檀香樹，吉祥菓樹，花卉恒芳，光明照耀。若彼眾生過此水時，要至足者、要至膝者，乃至要至項者；或要冷者、溫者、急流者、慢流者；其水一一隨眾生意令受快樂。又於水中出種種聲，佛聲、法聲、僧聲、止息聲、無性聲、波羅蜜聲、力聲、無畏聲、通達聲、無行聲、無生聲、無滅聲、寂靜聲、大慈聲、大悲聲、喜捨聲、灌頂聲，出如是種種微妙音聲。眾生聞已，發清淨心，無諸分別，正直平等，成熟善根，永不退於阿耨多羅三藐三菩提心。又彼佛剎其中生者，不聞地獄聲、餓鬼聲、畜生聲、夜叉聲、鬪諍聲、惡口聲、兩舌聲、殺生聲、偷盜聲、一切惡聲。而彼眾生，色相端嚴，福德無量，智慧明了，神通自在。宮殿、樓閣、園林、池沼、衣服、臥具，如他化自在天，最上快樂之具，一切豐足。
「復次，阿難！彼土眾生，思香花等欲供諸佛，作是念時，花香、瓔珞、塗香、末香、幢幡、傘蓋，及諸伎樂，隨意即至滿佛剎中。若思飲食、湯藥、衣服、臥具、頭冠、耳環、真珠、羅網等，隨念即至亦遍佛剎。又復思念摩尼寶等，莊嚴宮殿、樓閣、堂宇、房閤，或大、或小、或高、或下；如是念時，隨意現前無不具足。
「復次，阿難！譬如有人少有財寶，對受灌頂位剎帝利王，所有威勢悉皆不現。又剎帝利對天帝釋前，所有威勢悉皆不現。又天帝釋對他化自在天，所有威勢悉皆不現。又他化自在天等，及色、無色界一切威勢，對無量壽如來極樂國土，悉皆不現。如是彼土功德莊嚴不可思議。
「復次，阿難！彼佛國土每於食時，香風自起吹動寶樹，樹相掁觸出微妙音，演說苦、空、無常、無我、諸波羅蜜。復吹樹花落於地上，周遍佛剎高七人量，平正莊嚴，柔軟光潔。行人往來足躡其地深四指量，如迦隣那觸身安樂。過食時後，是諸寶花隱地不現。經須臾間復有風生，吹樹落花布地面上，如前無異。初夜、後夜亦復如是。
「復次，阿難！彼佛國土無其黑闇，無其星曜，無其日、月，無其晝、夜，無其取、捨，無其分別，純一無雜；唯受清淨最上快樂。若有善男子、善女人，若已生、若當生，是人決定證於阿耨多羅三藐三菩提。於意云何？彼佛剎中無三種失：一、心無虛妄，二、位無退轉，三、善無唐捐。
「復次，阿難！東方有恒河沙數世界，諸佛如來出廣長舌相，放無量光說誠實言，稱讚無量壽佛不可思議功德。南方亦有恒河沙數世界，諸佛如來出廣長舌相，放無量光說誠實言，稱讚無量壽佛不可思議功德。西方亦有恒河沙數世界，諸佛如來出廣長舌相，放無量光說誠實言，稱讚無量壽佛不可思議功德。北方亦有恒河沙數世界，諸佛如來出廣長舌相，放無量光說誠實言，稱讚無量壽佛不可思議功德。如是四維、上、下恒河沙數世界，諸佛如來出廣長舌相，放無量光說誠實言，稱讚無量壽佛不可思議功德。阿難！於意云何？欲令眾生聞彼佛名，發清淨心憶念受持，歸依供養求生彼土。是人命終，皆得往生極樂世界，不退轉於阿耨多羅三藐三菩提。
「復次，阿難！若有善男子、善女人，聞此經典，受持、讀誦、書寫、供養，晝、夜相續，求生彼剎。是人臨終，無量壽如來與諸聖眾現在其前，經須臾間，即得往生極樂世界，不退轉於阿耨多羅三藐三菩提。
「復次，阿難！若有善男子、善女人，發菩提心已，持諸禁戒堅守不犯，饒益有情，所作善根悉施與之，令得安樂，憶念西方無量壽如來及彼國土。是人命終，如佛色相種種莊嚴，生寶剎中賢聖圍繞，速得聞法，永不退轉於阿耨多羅三藐三菩提。
「復次，阿難！若有善男子、善女人，發十種心，所謂：一、不偷盜，二、不殺生，三、不婬欲，四、不妄言，五、不綺語，六、不惡口，七、不兩舌，八、不貪，九、不瞋，十、不癡。如是晝、夜思惟極樂世界無量壽佛，種種功德種種莊嚴，志心歸依頂禮供養。是人臨終，不驚、不怖、心不顛倒，即得往生彼佛國土。有無量無數諸佛世尊，稱讚無量壽佛功德名號，聞是法已，永不退於阿耨多羅三藐三菩提。
佛說大乘無量壽莊嚴經卷中
佛說大乘無量壽莊嚴經卷下
[＊]西天譯經三藏朝散大夫試光祿卿明教大師[＊]臣法賢奉　詔譯
「復次，阿難！東方恒河沙數佛剎，一一剎中，有無量無數菩薩摩訶薩，及無量無數聲聞之眾，以諸香花、幢幡、寶蓋，持用供養極樂世界無量壽佛。南方恒河沙數佛剎，一一剎中，亦有無量無數菩薩摩訶薩，及無量無數聲聞之眾，以諸香花、幢幡、寶蓋，持用供養極樂世界無量壽佛。西方恒河沙數世界，一一佛剎，亦有無量無數菩薩摩訶薩，及無量無數聲聞之眾，以諸香花、幢幡、寶蓋，持用供養極樂世界無量壽佛。北方恒河沙數佛剎，一一佛剎，亦有無量無數菩薩摩訶薩，及無量無數聲聞之眾，以諸香花、幢幡、寶蓋，持用供養極樂世界無量壽佛。四維、上、下亦復如是，各禮佛足，稱讚佛土功德莊嚴。」
爾時，世尊即說頌曰：
「東方世界恒河沙，  	一一剎中無數量，
菩薩聲聞發勝心，  	各以香花寶蓋等，
持至莊嚴佛剎中，  	供養如來無量壽；
供已禮足而稱讚，  	最上希有大福田。
如是西、南及北方，  	四維、上、下恒沙界，
聲聞、菩薩數亦然；  	皆以香花伸供養。
禮足旋繞懷敬愛，  	復讚如來宿願深，
積集功德普莊嚴，  	無量無邊極樂國；
諸佛國界雖嚴飾，  	難比如來寶剎中。
復以天花供養佛，  	花散虛空為傘蓋，
縱廣量等百由旬，  	色相莊嚴無有比；
遍覆如來寶剎中，  	互相慶慰生歡喜。
曾於過去百千劫，  	積集無量眾善根；
捨彼輪迴三有身，  	今至解脫清淨剎。
爾時彼佛無量壽，  	化導他方菩薩心，
密用神通化大光，  	其光從彼面門出，
三十六億那由他，  	普照俱胝千佛剎，
如是人、天普照已，  	即入如來頂髻中。
時會一切諸眾生，  	敬歎佛光未曾有，
各各俱發菩提心，  	願出塵勞登彼岸。」
爾時，世尊說此偈已，會中有觀自在菩薩，即從座起合掌向佛，而作是言：「世尊！以何因緣，無量壽佛於其面門，放無量光照諸佛剎？唯願世尊方便解說，令諸眾生及他方菩薩，聞是語已生希有心，於佛菩提志樂趣求入不退位。」
爾時，世尊告觀自在菩薩言：「汝今諦聽！吾為汝說。彼佛如來，於過去無量無邊阿僧祇劫前，為菩薩時發大誓言：『我於未來成正覺時，若有十方世界無量眾生，聞我名號，或頂禮憶念、或稱讚歸依、或香花供養等。如是眾生速生我剎，見此光明即得解脫。若諸菩薩見此光明，即得受記證不退位，手持香花及諸供具，往十方界無邊淨剎，供養諸佛而作佛事增益功德，經須臾間復還本土受諸快樂，是故光明而入佛頂。』
「復次，阿難！無量壽佛、應、正等覺，所有菩提之樹，高一千六百由旬，四布枝葉八百由旬，根入土際五百由旬，花菓敷榮，作無量百千珍寶之色。於其樹上，復以月光摩尼寶、帝釋摩尼寶、如意摩尼寶、持海摩尼寶、大綠寶、莎悉帝迦寶、愛寶瓔珞、大綠寶瓔珞、紅真珠瓔珞、青真珠瓔珞、及金銀寶網等種種莊嚴。
「復次，阿難！每於辰時香風自起吹此寶樹，樹相揨觸出微妙音，其聲普聞無量世界。眾生聞者無其耳病，乃至成就阿耨多羅三藐三菩提。若有眾生見此樹者，乃至成佛，於其中間不生眼病。若有眾生聞樹香者，乃至成佛，於其中間不生鼻病。若有眾生食樹菓者，乃至成佛，於其中間舌亦無病。若有眾生樹光照者，乃至成佛，於其中間身亦無病。若有眾生觀想樹者，乃至成佛，於其中間心得清淨，遠離貪等煩惱之病。」
佛告阿難：「如是佛剎花菓樹木，與諸眾生而作佛事，皆是彼佛過去大願之所攝受。
「復次，阿難！彼佛剎中所有現在及未來生一切菩薩摩訶薩，一生令得阿耨多羅三藐三菩提。若有菩薩，以宿願故入生死界作師子吼利益有情，我令隨意而作佛事。
「復次，阿難！彼佛剎中，一切菩薩及諸聲聞，身相端嚴圓光熾盛，周迴照耀百千由旬。有二菩薩，身光遠照三千大千世界。」
阿難白言：「此二菩薩有大身光，其名云何？」
佛告阿難：「二菩薩者：一名、觀自在。二名、大精進。現居此界作大利樂，命終之後當生彼國。
「復次，阿難！彼佛剎中一切菩薩，容貌柔和相好具足，禪定、智慧通達無礙，神通威德無不圓滿。深入法門得無生忍，諸佛祕藏究竟明了。調伏諸根身心柔軟，安住寂靜大乘涅盤。深入正慧無復餘習，依佛所行七覺聖道。修行五眼照真達俗，辯才總持自在無礙；善解世間無邊方便。所言誠諦深入義味，度諸有情演說正法。三界平等離諸分別，無相、無為、無因、無果、無取、無捨、無縛、無脫，遠離顛倒，堅固不動如須彌山。智慧明了如日、月朗；廣大如海出功德寶；熾盛如火燒煩惱薪；忍辱如地一切平等；清淨如水洗諸塵垢，如虛空無邊，不障一切故；如蓮花出水，離一切染故；如雷震響，出法音故；如雲靉靆，降法雨故；如風動樹，發菩提芽故；如牛王聲，異眾牛故；如龍象威，難可測故；如良馬行，乘無失故；如師子坐，離怖畏故；如尼拘樹，覆蔭大故；如須彌山，八風不動故；如金剛杵，破邪山故；如梵王身，生梵眾故；如金翅鳥，食毒龍故；如空中禽，無住處故；如慈氏觀，法界等故。如是菩薩遍滿佛剎，吹法螺、豎法幢、擊法鼓、然法燈，離過清淨，無迷、無失。手中出生花鬘、瓔珞、塗香、粖香一切供具，持往百千俱胝那由他佛剎，供養諸佛。復於手中別出寶花，散虛空中化成寶蓋廣十由旬，或二十由旬，乃至百千由旬，遍諸佛剎。經須臾間還來本國，無愛無著，無取無捨，身心寂靜。」
佛告阿難：「此諸菩薩，我土五濁之所無有，經百千俱胝劫說不能盡。」
佛告阿難：「吾今此土，所有菩薩摩訶薩，已曾供養無量諸佛植眾德本；命終之後，皆得生於極樂世界。阿難！汝起合掌面西頂禮。」
爾時，阿難即從座起，合掌面西，頂禮之間忽然得見極樂世界無量壽佛，容顏廣大色相端嚴如黃金山。又聞十方世界諸佛如來，稱揚讚歎無量壽佛種種功德。阿難白言：「彼佛淨剎得未曾有，我亦願樂生於彼土。」
世尊告言：「其中生者菩薩摩訶薩，已曾親近無量諸佛植眾德本。汝欲生彼，應當一心歸依瞻仰。」作是語時，無量壽佛於手掌中，放無量光照于東方百千俱胝那由他佛剎。於此世界，所有黑山、雪山、金山、寶山、目真隣陀山、摩訶目真隣陀山、須彌山、鐵圍山、大鐵圍山，大海、江河、叢林、樹木，及天人宮殿，一切境界無不照見，譬如日出明照世間，亦復如是。爾時會中，苾芻、苾芻尼、優婆塞、優婆夷、天、龍、藥叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，皆見極樂世界種種莊嚴，及見無量壽如來，聲聞、菩薩圍繞恭敬，譬如須彌山王出于大海。爾時，極樂世界，過於西方百千俱胝那由他國，以佛威力如對目前。又見彼土清淨平正，譬如海面無有丘陵、山嶮、草木、雜穢，唯是眾寶莊嚴，聖賢共住。
「復次，阿難！又彼無量壽佛，與諸菩薩、聲聞之眾，亦皆得見我身及娑婆世界菩薩、聲聞，人天之眾。」
爾時，世尊告慈氏菩薩言：「汝見極樂世界功德莊嚴，宮殿、樓閣、園林、臺觀、流泉、浴池不？慈氏！汝見欲界諸天，上至色究竟天，雨種種香花遍滿佛剎，作莊嚴不？汝見菩薩、聲聞淨行之眾，而作佛聲演說妙法，一切佛剎皆得聞聲，獲利樂不？汝見百千俱胝眾生，游處虛空宮殿隨身不？」
慈氏菩薩白佛言：「世尊！如佛所說一一皆見。」慈氏白言：「云何此界一類眾生，雖亦修善而不求生？」
佛告慈氏：「此等眾生，智慧微淺，分別西方不及天界，是以非樂不求生彼。」
慈氏白言：「此等眾生虛妄分別，不求佛剎何免輪迴？」
佛言：「慈氏！極樂國中有胎生不？」
慈氏白言：「不也！世尊！其中生者，譬如欲界諸天，居五百由旬宮殿，自在遊戲，何有胎生？世尊！此界眾生，何因何緣而處胎生？」
佛言：「慈氏！此等眾生，所種善根不能離相，不求佛慧妄生分別。深著世樂人間福報，是故胎生。若有眾生，以無相智慧植眾德本，身心清淨遠離分別，求生淨剎趣佛菩提。是人命終，剎那之間於佛淨土坐寶蓮花身相具足。何有胎生？慈氏！汝見愚癡之人，不種善根，但以世智聰辯，妄生分別增益邪心，云何出離生死大難？復有眾生，雖種善根供養三寶作大福田，取相分別情執深重，求出輪迴終不能得。」
佛告慈氏：「譬如受灌頂位剎帝利王，置一大獄，於其獄內，安置殿堂、樓閣、鉤欄、窓牖、床榻座具，皆以珍寶嚴飾；所須衣服、飲食無不豐足。爾時灌頂王，驅逐太子禁閉獄中，復與錢財、珍寶、羅紈、匹帛，恣意受用。」
佛告慈氏：「於意云何？彼太子得快樂不？」
慈氏白言：「不也！世尊！彼中雖有堂殿、樓閣、飲食、衣服、錢帛、金寶隨意受用，身閉牢獄心不自在，唯求出離。」
佛告慈氏：「若灌頂王不捨其過，彼諸大臣、長者、居士等，可令太子免禁獄不？」
慈氏白言：「王既不捨，云何得出？」
佛言：「如是，如是！彼諸眾生，雖復修福供養三寶，虛妄分別求人天果。得報之時，所居器界、宮殿、樓閣，衣服、臥具、飲食、湯藥，一切所須悉皆豐足，而未能出三界獄中，常處輪迴而不自在。假使父母、妻子、男、女眷屬欲相救免，終不能出邪見業王無能捨離。若諸眾生斷妄分別，植諸善本無相、無著，當生佛剎永得解脫。」
慈氏菩薩白佛言：「世尊！今此娑婆世界及諸佛剎，有幾多菩薩摩訶薩，得生極樂世界，見無量壽佛，成就阿耨多羅三藐三菩提？」
佛言：「慈氏！我此娑婆世界，有七十二俱胝那由他菩薩摩訶薩，已曾供養無量諸佛植眾德本，當生彼國親近供養無量壽佛，成就阿耨多羅三藐三菩提。
「復次，阿難！難忍佛剎，有十八俱胝那由他菩薩摩訶薩，生彼國土。寶藏佛剎，有九十俱胝那由他菩薩摩訶薩，生彼國土。火光佛剎，有二十二俱胝那由他菩薩摩訶薩，生彼國土。無量光佛剎，有二十五俱胝那由他菩薩摩訶薩，生彼國土。世燈佛剎，有六十俱胝那由他菩薩摩訶薩，生彼國土。龍樹佛剎，有一千四百菩薩摩訶薩，生彼國土。無垢光佛剎，有二十五俱胝那由他菩薩摩訶薩，生彼國土。師子佛剎，有一千八百菩薩摩訶薩，生彼國土。吉祥峯佛剎，有二千一百俱胝那由他菩薩摩訶薩，生彼國土。仁王佛剎，有一千俱胝那由他菩薩摩訶薩，生彼國土。花幢佛剎，有一俱胝菩薩摩訶薩，生彼國土。光明王佛剎，有十二俱胝菩薩摩訶薩，生彼國土。得無畏佛剎，有六十九俱胝那由他菩薩摩訶薩，生彼國土。悉皆親近供養無量壽佛，不久當成阿耨多羅三藐三菩提。」
佛言：「慈氏！如是功德莊嚴極樂國土，滿彼算數無量之劫，說不能盡。若有善男子、善女人，得聞無量壽佛名號，發一念信心，歸依瞻禮。當知此人非是小乘，於我法中得名第一弟子。」
佛告慈氏：「若有苾芻、苾芻尼、優婆塞、優婆夷、天、龍、藥叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，於此經典書寫、供養、受持、讀誦、為他演說，乃至於一晝夜，思惟彼剎及佛身功德，此人命終速得生彼，成就阿耨多羅三藐三菩提。
「復次，慈氏！今此經典甚深微妙，廣利眾生。若有眾生，於此正法受持、讀誦、書寫、供養。彼人臨終，假使三千大千世界滿中大火，亦能超過生彼國土。是人已曾值過去佛受菩提記，一切如來同所稱讚，無上菩提隨意成就。」
佛言：「慈氏！佛世難值，正法難聞，如來所行亦應隨行。於此經典作大守護，為諸有情長夜利益，莫令眾生墮在五趣莊嚴獄中；令諸有情種修福善，求生淨剎。」
爾時世尊而說頌曰：
「若不往昔修福慧，  	於此正法不能聞；
已曾供養諸如來，  	是故汝等聞斯義。
聞已受持及書寫，  	讀誦、讚演并供養，
如是一心求淨方，  	決定往生極樂國。
假使大火滿三千，  	及彼莊嚴諸牢獄；
如是諸難悉能超，  	皆是如來威德力。
彼佛利樂諸功德，  	唯佛與佛乃能知；
聲聞、緣覺滿世間，  	盡其神力莫能測。
假使長壽諸有情，  	命住無數俱胝劫，
稱讚如來功德身，  	盡其形壽讚無盡。
大聖法王所說法，  	利益一切諸群生；
若有受持恭敬者，  	佛說此人真善友。」
爾時，世尊說此法時，有十二俱胝那由他人，遠塵離垢得法眼淨。八百苾芻，漏盡意解心得解脫。天人眾中，有二十二俱胝那由他人，證阿那含果。復有二十五俱胝人，得法忍不退。復有四十俱胝百千那由他人，發阿耨多羅三藐三菩提心，種諸善根，皆願往生極樂世界，見無量壽佛。復有十方佛剎，若現在生及未來生，見無量壽佛者，各有八萬俱胝那由他人，得然燈佛記，名妙音如來，當得阿耨多羅三藐三菩提。彼諸有情，皆是無量壽佛宿願因緣，俱得往生極樂世界。
佛說是語時，三千大千世界六種震動，雨諸香花積至于膝。復有諸天於虛空中，作妙音樂出隨喜聲；乃至色界諸天，悉皆得聞歎未曾有。爾時，尊者阿難及慈氏菩薩等，并天龍八部一切大眾，聞佛所說，皆大歡喜，信受奉行。
佛說大乘無量壽莊嚴經卷下
佛說無量清淨平等覺經卷第一
後漢月支國三藏支婁迦讖譯
佛在王舍國靈鷲山中，與大弟子眾千二百五十人、菩薩七十二那術、比丘尼五百人、清信士七千人、清信女五百人、欲天子八十萬、色天子七十萬、遍淨天子六十那術、梵天一億，皆隨佛住。
神通飛化弟子，名曰：知本際賢者、馬師賢者、大力賢者、安詳賢者、能讚賢者、滿願臂賢者、無塵賢者、氏聚迦葉賢者、牛呞賢者、上時迦葉賢者、治恒迦葉賢者、金杵坦迦葉賢者、舍利弗賢者、大目揵連賢者、大迦葉賢者、大迦旃延賢者、多睡賢者、大賈師賢者、大瘦短賢者、盈辯了賢者、不爭有無賢者、知宿命賢者、了深定賢者、善來賢者、離越賢者、癡王賢者、氏戒聚賢者、類親賢者、氏梵經賢者、多欲賢者、王宮生賢者、告來賢者、氏黑山賢者、經剎利賢者、博聞賢者。
其女弟子，名曰：大欽姓比丘尼、幻者比丘尼、蓮華色比丘尼、生地動比丘尼、生地擔比丘尼、生則侍者頭痛比丘尼、安豐殖比丘尼、體柔軟比丘尼、勇生行比丘尼、自淨比丘尼。
清信士，名曰：給飯孤獨長者、安念眾長者、快臂長者、火英長者、善容長者、具足寶長者、名遠聞長者、香辟疫長者、安吉長者、施寶盈長者、欣讚長者、胎施殷長者、供異道長者、勇降怨長者、寶珥長者、寶結長者。
清信女，名曰生僂、名曰黑哲、名曰信法、名曰軟善、名曰樂涼、名曰忍苦樂、名曰樂愛優婆夷。
如此之人皆一種類——消盡諸垢勇淨者也——無數之眾悉共大會。
於時佛坐，思念正道，面有九色光，數千百變，光甚大明。賢者阿難即從座起，更正衣服，稽首佛足，長跪叉手，前白佛言：「今佛面目光色，何以時時更變明乃爾乎？今佛面目光精數百千色，上下明徹好乃如是。我侍佛已來，未曾見佛身體光曜巍巍重明乃爾，我未曾見至真、等正覺光明威神有如今日明好不妄，會當念諸過去、當來若他方佛國今現在佛。」
佛告阿難：「有諸天來教汝、諸佛教汝，令問我耶？若自從智出乎？」
阿難白佛言：「亦無諸天、無諸佛教，我今問佛者，自從意出來白佛耳。每佛坐起，若行出入有所至到，所當作為、所當教勅，我輒知佛意。今佛獨當展轉相思，故使面色光明乃如此耳。」
佛言：「善哉，阿難！若所問者甚深快善，多所度脫。若問佛者，勝於供養一天下阿羅漢、辟支佛，布施諸天、人民及蜎飛蠕動之類累劫，百千萬億倍矣。」
佛言：「阿難！今諸天、帝王、人民、及蜎飛蠕動之類，汝皆度脫之。」
佛言：「佛威神甚重難當，若所問者大深，汝乃慈心，於佛所哀諸天人民。若比丘、比丘尼、優婆塞、優婆夷大善當爾爾，皆過度之。」
佛語阿難：「如世間有優曇鉢樹，但有實、無有華，天下有佛乃有華出耳。世間有佛甚難得值，今我作佛出於天下，若有大德聰明善心豫知佛意，若不妄在佛邊侍佛也。若今所問，善聽諦聽。」
佛語阿難：「前已過去劫，大眾多不可計，無邊幅不可議。及爾時有過去佛，名定光如來。復次，有佛名曰曜光。復次，有佛名日月香。復次，有佛名安明山。復次，有佛名日月面。復次，有佛名無塵垢。復次，有佛名無沾污。復次，有佛名曰如龍無所不伏。復次，有佛名曰日光。復次，有佛名大音王。復次，有佛名寶潔明。復次，有佛名曰金藏。復次，有佛名焰寶光。復次，有佛名曰有舉地。復次，有佛名曰琉璃光。復次，有佛名日月光。復次，有佛名曰日音聲。復次，有佛名光明華。復次，有佛名神通遊持意如海。復次，有佛名嗟歎光。復次，有佛名具足寶潔。復次，有佛名光開化。復次，有佛名曰大香聞。復次，有佛名曰降棄恚嫉。復次，有佛名妙琉璃紫磨金焰。復次，有佛名心持道華無能過者。復次，有佛名積眾華。復次，有佛名水月光。復次，有佛名除眾冥。復次，有佛名日光蓋。復次，有佛名溫和如來。復次，有佛名曰法意。復次，有佛名師子威象王步。復次，有佛名曰世豪。復次，有佛名曰淨音。復次，有佛名不可勝。復次，有佛名樓夷亘羅，在中教授四十二劫，皆已過去乃爾劫時作佛。
「天上、天下人中之雄，經道法中勇猛之將，佛為諸天及世人民說經講道莫能過者。
「世饒王聞經道，歡喜開解，便棄國位行作比丘，名曇摩迦留。發菩薩意，為人高才，智慧勇猛，無能踰者，與世絕異。
「到世饒王佛所，稽首為禮，長跪叉手，稱讚佛言：
「『無量之光曜，  	威神無有極，
如是之焰明，  	無能與等者。
若以日摩尼、  	火、月、水之形，
其景不可及，  	其色亦難比。
顏色難稱量，  	一切世之最，
如是大音聲，  	遍諸無數剎。
或以三昧定、  	精進及智慧，
威德無有輩，  	殊勝亦希有。
深微諦善念，  	從是得佛法，
持覺若如海，  	其限無有底。
瞋恚及愚癡，  	世尊之所無，
嗟歎佛世雄，  	終始無厭足。
佛如好花樹，  	莫不愛樂者，
處處人民見，  	一切皆歡喜。
令我作佛時，  	願使如法王，
過度於生死，  	無不解脫者。
檀施調伏意、  	戒忍及精進，
如是三昧定，  	智慧為上最。
吾誓得佛者，  	普逮得此事，
一切諸恐懼，  	我為獲大安。
假令有百千、  	億萬那術佛，
如是佛之數，  	使如恒水沙，
計以沙等佛，  	一切皆供養，
不如求正道，  	堅勇而不怯。
譬如恒水中，  	流沙之世界，
復倍不可計，  	無數之剎土。
光焰一切炤，  	遍此諸數國，
如是精進力，  	威神難可量。
令我為世雄，  	國土最第一，
其眾殊妙好，  	道場踰諸剎。
國如泥洹界，  	而無有等雙，
我當常愍哀，  	度脫一切人。
十方往生者，  	其心悅清淨，
已來到我國，  	快樂喜安隱。
幸佛見信明，  	是我第一證，
發願在於彼，  	精進力所欲。
十方諸世尊，  	皆有無礙慧，
常念此尊雄，  	知我心所行，
令我身止住，  	於諸苦毒中，
我行精進力，  	忍之終不悔。』
「法寶藏比丘說此唱讚世饒王如來、至真、等正覺已，發意欲求無上正真道最正覺：『我立是願：如多陀竭佛所有者，願悉得之；拔人勤苦生死根本，悉令如佛。
「『唯為說經，所可施行，令疾得決，我作佛時令無及者。
「『願佛為我說諸佛國功德，我當奉持、當即中住，取願作佛國亦如是。』」
佛語阿難：「其世饒王佛知其高明所願快善，即為法寶藏菩薩說經言：『譬如大海水，一人升量之，一劫不止尚可枯盡，令海空竭得其底泥。人至心求道，何而當不可得乎？求索精進不休止者，會得心中所欲願耳。』
「法寶藏菩薩聞世饒王佛說經如是，則大歡喜踊躍。其佛則為選擇二百一十億佛國中諸天人民善惡國土之好醜，為選心中所願用與之。
「世饒王佛說經竟，法寶藏菩薩便壹其心，則得天眼徹視，悉自見二百一十億諸佛國中諸天人民之善惡國土之好醜，則選心所欲願，便結得是二十四願經，則奉行之，精進勇猛，勤苦求索。如是無央數劫所師事供養諸佛已，過去佛亦無央數，其法寶藏菩薩至其然後自致得作佛，名無量清淨覺最尊，智慧勇猛，光明無比。今現在所居國甚快善，在他方異佛國教授八方上下無央數諸天、人民及蜎飛蠕動之類，莫不得過度解脫憂苦者。
「無量清淨佛為菩薩時，常奉行是二十四願，珍寶愛重，保持恭順，精進禪行之。與眾超絕，卓然有異，皆無有能及者。」
佛言：「何等為二十四願者？
「一、我作佛時，令我國中無有地獄、禽獸、餓鬼、蜎飛蠕動之類，得是願乃作佛；不得從是願終不作佛。
「二、我作佛時，令我國中人民有來生我國者，從我國去，不復更地獄、餓鬼、禽獸蠕動；有生其中者，我不作佛。
「三、我作佛時，人民有來生我國者，不一色類金色者，我不作佛。
「四、我作佛時，人民有來生我國者，天人、世間人有異者，我不作佛。
「五、我作佛時，人民有來生我國者，皆自推所從來生本末、所從來十億劫宿命；不悉知念所從來生，我不作佛。
「六、我作佛時，人民有來生我國者，不悉徹視，我不作佛。
「七、我作佛時，人民有來生我國者，不悉知他人心中所念者，我不作佛。
「八、我作佛時，我國中人民不悉飛者，我不作佛。
「九、我作佛時，我國中人民不悉徹聽者，我不作佛。
「十、我作佛時，我國中人民有愛欲者，我不作佛。
「十一、我作佛時，我國中人民住止盡般泥洹；不爾者，我不作佛。
「十二、我作佛時，我國諸弟子，令八方上下各千億佛國中諸天、人民、蠕動之類作緣一覺大弟子，皆禪一心，共數我國中諸弟子，住至百億劫無能數者；不爾者，我不作佛。
「十三、我作佛時，令我光明勝於日月、諸佛之明百億萬倍，炤無數天下窈冥之處皆常大明，諸天、人民、蠕動之類見我光明，莫不慈心作善來生我國；不爾者，我不作佛。
「十四、我作佛時，令八方上下無數佛國諸天、人民、蠕動之類令得緣一覺果證弟子，坐禪一心，欲共計知我年壽幾千萬億劫，令無能知壽涯底者；不爾者，我不作佛。
「十五、我作佛時，人民有來生我國者，除我國中人民所願，餘人民壽命無有能計者；不爾者，我不作佛。
「十六、我作佛時，國中人民皆使莫有惡心；不爾者，我不作佛。
「十七、我作佛時，令我名聞八方上下無數佛國，諸佛各於弟子眾中歎我功德國土之善，諸天、人民、蠕動之類聞我名字，皆悉踊躍來生我國；不爾者，我不作佛。
「十八、我作佛時，諸佛國人民有作菩薩道者，常念我淨潔心，壽終時，我與不可計比丘眾飛行迎之，共在前立，即還生我國作阿惟越致；不爾者，我不作佛。
「十九、我作佛時，他方佛國人民前世為惡，聞我名字及正為道欲來生我國，壽終皆令不復更三惡道，則生我國在心所願；不爾者，我不作佛。
「二十、我作佛時，我國諸菩薩不一生等，置是餘願功德；不爾者，我不作佛。
「二十一、我作佛時，我國諸菩薩不悉三十二相者，我不作佛。
「二十二、我作佛時，我國諸菩薩欲共供養八方上下無數諸佛，皆令飛行，欲得萬種自然之物，則皆在前，持用供養諸佛悉遍已，後日未中則還我國；不爾者，我不作佛。
「二十三、我作佛時，我國諸菩薩欲飯時，則七寶鉢中生自然百味飲食在前，食已，鉢皆自然去；不爾者，我不作佛。
「二十四、我作佛時，我國諸菩薩說經行道不如佛者，我不作佛。」
佛告阿難：「無量清淨佛為菩薩時，常奉行是二十四願，分檀布施，不犯道禁，忍辱精進，一心智慧。志願常勇猛，不毀經法，求索不懈。每獨棄國捐王，絕去財色，精明求願，無所適莫。積功累德無央數劫，自致作佛悉皆得之，不忘其功也。」
佛言：「無量清淨佛光明最尊第一無比，諸佛光明皆所不及也。八方上下無央數諸佛中，有佛項中光明照七丈、中有佛項中光照一里、中有佛項中光明照五里、中有佛項中光明照二十里、中有佛項中光明照四十里、中有佛項中光明照八十里、中有佛項中光明照百六十里、中有佛項中光明照三百二十里、中有佛項中光明照六百四十里、中有佛項中光明照千三百里、中有佛項中光明照二千六百里、中有佛項中光明照五千二百里、中有佛項中光明照萬四百里、中有佛項中光明照二萬一千里、中有佛項中光明照四萬二千里、中有佛項中光明照八萬四千里、中有佛項中光明照十七萬里、中有佛項中光明照三十五萬里、中有佛項中光明照七十萬里、中有佛項中光明照百五十萬里、中有佛項中光明照三百萬里、中有佛項中光明照六百萬里、中有佛項中光明照千二百萬里。
「中有佛項中光明照一佛國、中有佛項中光明照兩佛國、中有佛項中光明照四佛國、中有佛項中光明照八佛國、中有佛項中光明照十五佛國、中有佛項中光明照三十佛國、中有佛項中光明照六十佛國、中有佛項中光明照百二十佛國、中有佛項中光明照五百佛國、中有佛項中光明照千佛國、中有佛項中光明照二千佛國、中有佛項中光明照四千佛國、中有佛項中光明照八千佛國、中有佛項中光明照萬六千佛國、中有佛項中光明照三萬二千佛國、中有佛項中光明照六萬四千佛國、中有佛項中光明照十三萬佛國、中有佛項中光明照二十六萬佛國、中有佛項中光明照五十萬佛國、中有佛項中光明照百萬佛國、中有佛項中光明照二百萬佛國。」
佛言：「八方上下無央數諸佛，其項中光明所照皆如是也；無量清淨佛項中光明焰照千萬佛國。所以諸佛光明所照有遠近者何？本前世宿命求道為菩薩時，所願功德各自有大小，至其然後作佛時，悉各自得之，是故令光明轉不同等。諸佛威神同等耳，自在意所欲作為不豫計。無量清淨佛光明所照最大，諸佛光明皆所不能及也。」
佛稱譽無量清淨佛光明：「無量清淨佛光明極善，善中明好甚快無比，絕殊無極也。無量清淨佛光明殊好，勝於日月之明百億萬倍也。無量清淨佛光明，諸佛光明中之極明也；無量清淨佛光明，諸佛光明中之極好也；無量清淨佛光明，諸佛光明中之極雄傑也；無量清淨佛光明，諸佛光明中之快善也；無量清淨佛光明，諸佛光明中之王也；無量清淨佛光明，諸佛光明中之最極尊也；無量清淨佛光明，諸佛光明中之壽明無極。
「無量清淨佛光明焰照諸無央數天下幽冥之處皆常明，諸有人民、蜎飛蠕動之類，莫不見無量清淨佛光明，見無量清淨佛光明莫不慈心歡喜者。世間諸有婬妷、瞋怒、愚癡，見無量清淨佛光明莫不作善者。諸泥犁、禽獸、薜荔考掠勤苦之處，見無量清淨佛光明至，皆休止不得復治，死後莫不得解脫憂苦者也。
「無量清淨佛光明，名聞八方上下無窮無極無央數佛國，諸天人民莫不聞知，聞知者莫不得過度者。」
佛言：「我不獨稱譽無量清淨佛光明也，八方上下無央數諸佛、辟支佛、菩薩、阿羅漢，所稱譽皆如是。」
佛言：「其有人民——善男子、善女人——聞無量清淨佛聲，稱譽光明。如是朝暮常稱譽其光明明好，至心不斷絕，在心所欲願往生無量清淨佛國，可得為諸菩薩、阿羅漢所尊敬，智慧勇猛。若其然後作佛者，亦當復為八方上下無央數辟支佛、菩薩、阿羅漢所稱譽光明，亦當復如是。則眾比丘僧、諸菩薩、阿羅漢、諸天、帝王、人民聞之，皆歡喜踊躍，莫不讚歎者。」
佛言：「我道無量清淨佛光明姝好，巍巍稱譽快善，晝夜一劫尚未竟也，我但為若曹小說之耳。」
佛說無量清淨為菩薩，求索得是二十四願。時阿闍世王太子與五百大長者迦羅越子，各持一金華蓋，前上佛已，悉却坐一面聽經。
阿闍世王太子及五百長者子，聞無量清淨佛二十四願，皆大歡喜踊躍，心中俱願言：「令我等後作佛時，皆如無量清淨佛。」
佛則知之，告諸比丘僧：「是阿闍世王太子及五百長者子，却後無央數劫皆當作佛，如無量清淨佛。」
佛言：「是阿闍世王太子、五百長者子，作菩薩道已來無央數劫，皆各供養四百億佛已，今復來供養我。是阿闍世王太子及五百人等，皆前世迦葉佛時為我作弟子，今皆復會是共相值也。」則諸比丘僧聞佛言，皆心踊躍，莫不歡喜者。
佛告阿難：「無量清淨佛作佛已來凡十八劫，所居國名須摩提，正在西方，去是閻浮利地界千億萬須彌山佛國。
「其國地皆自然七寶：其一寶者名白銀，二寶者名黃金，三寶者水精，四寶者琉璃，五寶者珊瑚，六寶者虎珀，七寶者車𤦲。是七寶皆以自共為地，曠蕩甚大無極；皆自相參轉相入中，各自焜煌參光極明，自然軟甚姝好無比。
「如其七寶地，諸八方上下眾寶中精，都自然之，合會共化生耳，其寶比如第六天上之七寶也。
「其國中無有須彌山，其日、月、星辰、第一四天王、第二忉利天，皆在虛空中。
「其國土無有大海水、亦無小海水，無江河恒水也，亦無山林溪谷，無有幽冥之處。
「其國七寶地皆平正，無有泥犁、禽獸、餓鬼、蜎飛蠕動之類也，無阿須倫、諸龍、鬼神也。
「終無有大雨時，亦無春、夏、秋、冬也；亦無有大寒亦不大熱，常和調中，適甚快善無比。
「皆有萬種自然之物、百味飲食，意欲有所得則自然在前，意不用者則自然化去。比如第六天上自然之物，恣若自然則皆隨意。
「其國中悉諸菩薩、阿羅漢，無有婦女，壽命極壽，壽亦無央數劫。女人往生者則化生，皆作男子。
「但有菩薩、阿羅漢無央數，悉皆洞視徹聽——悉遙相見、遙相瞻望、遙相聞語聲——悉皆求道善者，同一種類無有異人也。其諸菩薩、阿羅漢，面目皆端正，清潔絕好，悉同一色，無有偏醜惡者。諸菩薩、阿羅漢皆才猛黠慧。其所衣服，皆衣自然之衣。都心中所念常念道德，其所欲語言便皆豫相知意，其所念言道，常說正事。
「其國中諸菩薩、阿羅漢自共相與語言輒說經道，終不說他餘之惡。
「其語言音響如三百鍾聲，皆相敬愛，無有相憎者。皆自以長幼、上下先後言之，都共往會，以義而禮，轉相敬事，如兄如弟。以仁履義，不妄動作；言語而誠，轉相教令；不相違戾，轉相承受。皆心潔淨，無所貪慕，終無有婬妷、瞋怒之心、愚癡之態也。無有邪心念、婦女意也。悉智慧勇猛，和心歡樂，好喜經道。皆自知其前世所從來生、億萬劫世時宿命善惡存亡，現在却知無極。
「無量清淨佛所可教授講堂、精舍，皆復自然七寶——金、銀、水精、琉璃、白玉、虎珀、車𤦲——自共轉相成也，甚姝明好，絕姝無比。亦無有作者，亦不知所從來；亦無有持來者，亦無所從去。
「無量清淨佛所願德重，其人作善故，論經語義、說經行道，講會其中，自然化生耳。其講堂、精舍皆復有七寶樓觀欄楯，復以金、銀、水精、琉璃、白玉、虎珀、車𤦲為瓔珞，復以白珠、明月珠、摩尼珠為交絡，覆蓋其上；皆自作五音聲，音聲甚姝無比。
「無量清淨佛國諸菩薩、阿羅漢所居舍宅，皆復以七寶——金、銀、水精、琉璃、珊瑚、虎珀、車𤦲、馬瑙——化生轉共相成也。其舍宅皆悉各有七寶樓觀欄楯，復以金、銀、水精、琉璃、白玉、虎珀、車𤦲為瓔珞，復以白珠、明月珠、摩尼珠為交絡，覆蓋其上，皆各復自作五音聲。
「無量清淨佛講堂、精舍，及諸菩薩、阿羅漢所居七寶舍宅中，外內處處皆復自然流泉水浴池。其浴池者，皆復以自然七寶——七寶俱生，金、銀、水精、琉璃、珊瑚、虎珀、車𤦲——轉共相成也。水底沙皆復以七寶——金、銀、水精、琉璃、珊瑚、虎珀、車𤦲也。有純白銀池者，其底沙皆黃金也；中有純黃金池者，其水底沙皆白銀也；中有純水精池者，其水底沙皆琉璃也；中有純琉璃池者，其水底沙皆水精也；中有純珊瑚池者，其水底沙皆虎珀也；中有純虎珀池者，其水底沙皆珊瑚也；中有純車𤦲池者，其水底沙皆馬瑙也；中有純馬瑙池者，其水底沙者皆車𤦲也；中有純白玉池者，其水底沙者皆紫磨金也；中有純紫磨金池者，其水底沙者皆白玉也。
「中復有二寶共作一池者，其水底沙者皆金、銀也；中復有三寶共作一池者，其水底沙者皆金、銀、水精也；中復有四寶共作一池者，其水底沙金、銀、水精、琉璃也；中復有五寶共作一池者，其水底沙皆金、銀、水精、琉璃、珊瑚、虎珀也；中復有六寶共作一池者，其水底沙皆金、銀、水精、琉璃、珊瑚、虎珀、車𤦲也；中復有七寶共作一池者，其水底沙皆金、銀、水精、琉璃、珊瑚、虎珀、車𤦲、馬瑙也。
「其浴池中有長四十里者、中有池長八十里者、中有池長百六十里者、中有池長三百二十里者、中有池長六百四十里者、中有池長千二百八十里者、中有浴池長二千五百六十里者、中有浴池長五千一百二十里者、中有浴池長萬二百四十里者、中有浴池長二萬四百八十里者，其縱廣各適等。是浴池者，皆諸菩薩、阿羅漢常所可浴池。」
佛言：「無量清淨佛浴池長四萬八千里，廣亦四萬八千里。其浴池皆七寶轉自共相成，其池水底沙皆復以七寶、白珠、明月珠、摩尼珠也。
「無量清淨佛及諸菩薩、阿羅漢浴池中水皆清淨香潔，中皆有香華——悉自然生百種華，種種異色、異香——華皆千葉。諸華甚香無比，香不可言也。其華香者亦復非世間之華，復勝天上之華；是華香者，八方上下眾華香中精自然生耳。池中水流行，轉相灌注；池中水流亦不遲亦不駃，皆復自作五音聲。」
佛言：「八方上下無央數佛國諸天、人民、及蜎飛蠕動之類，諸生無量清淨佛國者，都皆於是七寶水池蓮華中化生，便則自然長大，亦無乳養之者，皆食自然之飲食。其身體者，亦非世間人之身體也，亦非天上人之身體也，皆積眾善之德，悉受自然虛無之身體，甚姝好無比。」
佛語阿難：「如世間貧窮乞丐人，令在帝王邊住者，其人面目形貌何等類乎？寧類帝王面目形貌顏色不？」
阿難言：「假令使子在帝王邊住者，其面目形狀甚醜惡不好，不如帝王面目形類姝好百千億萬倍也。所以者何？見乞人貧窮困極，飲食未曾有美食時也。既惡食不能得飽食，食栽支命，骨節相撐拄。無所用自給，常乏無有儲，飢餓寒凍，怔忪愁苦。但坐其前世宿命為人時，愚癡無智富益慳，有財不肯慈哀、仁賢為善、博愛施與，但欲唐得，貪惜飲食，獨食嗜美，不信施貸後得償報也。復不信作善後世得其福，蒙籠頑佷益作眾惡。如是，壽終財物盡索，素無恩德無所恃怙，入惡道中坐之適苦，然後得出解脫。今生為人，作於下賤貧家作子，強像人形，狀貌甚醜。衣被弊壞，單空獨立，不蔽形體，乞匃生活耳。飢寒困苦，面目羸劣，不類人色。坐其前世身之所作，受其殃罰，示眾見之莫誰哀者；棄捐市道，暴露痟瘦，黑醜惡極不及人耳。
「所以帝王人中獨尊最好者何？皆其前世宿命為人時作善，信愛經道，布施恩德，博愛順義，慈仁喜與。不貪飲食，與眾共之，無所遺惜，都無違諍。得其福德，壽終德隨，不更惡道。今生為人，得生王家，自然尊貴，獨王典主，攬制人民，為人雄傑。面目潔白，和顏好色，身體端正，眾共敬事。美食、好衣隨心恣意，在樂所欲自然在前，都無違諍。於人中姝好，無憂快樂，面色光澤，故乃爾耳。」◎
佛說無量清淨平等覺經卷第一
佛說無量清淨平等覺經卷第二
後漢月支國三藏支婁迦讖譯
◎佛告阿難：「若言是也。如帝王，雖於人中好無比，當令在遮迦越王邊住者，其面目形貌甚醜惡，其狀不好，比如乞人在帝王邊住耳。帝王面醜，尚復不如遮迦越王面色姝好百千億萬倍也。如遮迦越王於天下絕好無比，當令在第二忉利天帝釋邊住者，其面甚醜不好，尚復不如天帝釋面貌端正姝好百千億萬倍也。如天帝釋，令在第六天王邊住者，其面貌甚醜不好，尚復不如第六天王面貌端正姝好百千億倍也。如第六天王，令在無量清淨佛國中諸菩薩、阿羅漢邊住者，其面甚醜，尚復不如無量清淨佛國中諸菩薩、阿羅漢面貌端正姝好百千億萬倍也。」
佛言：「無量清淨佛諸菩薩、阿羅漢，面貌悉皆端正絕好無比，次於泥洹之道也。」
佛告阿難：「無量清淨佛及諸菩薩、阿羅漢，講堂、精舍、所居處舍宅、中外浴池上皆有七寶樹。中有純銀樹、中有純金樹、中有純水精樹、中有純琉璃樹、中有純白玉樹、中有純珊瑚樹、中有純虎珀樹、中有純車𤦲樹，種種各自異行。
「中復有兩寶共作一樹者：銀樹，銀根、金莖、銀枝、金葉、銀華、金實；金樹者，金根、銀莖、金枝、銀葉、金華、銀實。是兩寶樹轉共相成，各自異行。
「中復有三寶共作一樹者：銀樹，銀根、金莖、水精枝、銀葉、金華、水精實；金樹者，金根、銀莖、水精枝、金葉、銀華、水精實；水精樹者，水精根、銀莖、金枝、水精葉、銀華、金實。是三寶樹轉共相成，各自異行中。
「復有四寶共作一樹者：銀樹，銀根、金莖、水精枝、琉璃葉、銀華、金實；金樹者，金根、銀莖、水精枝、琉璃葉、金華、銀實；水精樹者，水精根、琉璃莖、銀枝、金葉、水精華、琉璃實；琉璃樹者，琉璃根、水精莖、金枝、銀葉、琉璃華、水精實。是四寶樹轉共相成，各自異行中。
「復有五寶共作一樹者：銀樹，銀根、金莖、水精枝、琉璃葉、珊瑚華、金實；金樹者，金根、銀莖、水精枝、琉璃葉、珊瑚華、銀實；水精樹者，水精根、琉璃莖、珊瑚枝、銀葉、金華、琉璃實；琉璃樹者，琉璃根、珊瑚莖、水精枝、金葉、銀華、珊瑚實；珊瑚樹者，珊瑚根、琉璃莖、水精枝、金葉、銀華、琉璃實。是五寶樹轉共相成，各自異行中。
「復有六寶共作一樹者：銀樹，銀根、金莖、水精枝、琉璃葉、珊瑚華、虎珀實；金樹者，金根、銀莖、水精枝、琉璃葉、虎珀華、珊瑚實；水精樹者，水精根、琉璃莖、珊瑚枝、銀葉、虎珀華、金實；琉璃樹者，琉璃根、珊瑚莖、虎珀枝、水精葉、金華、銀實；珊瑚樹者，珊瑚根、虎珀莖、銀枝、金葉、水精華、琉璃實；虎珀樹者，虎珀根、珊瑚莖、金枝、銀葉、琉璃華、水精實。是六寶樹轉共相成，各自異行中。
「復有七寶共作一樹者：銀樹，銀根、金莖、水精節、琉璃枝、珊瑚葉、虎珀華、車𤦲實；金樹者，金根、水精莖、琉璃節、珊瑚枝、虎珀葉、車𤦲華、銀實；水精樹者，水精根、琉璃莖、珊瑚節、虎珀枝、車𤦲葉、白玉華、金實；琉璃樹者，琉璃根、珊瑚莖、虎珀節、白玉枝、車𤦲葉、水精華、銀實；珊瑚樹者，珊瑚根、虎珀莖、白玉節、銀枝、明月珠葉、金華、水精實；虎珀樹者，虎珀根、白玉莖、珊瑚節、琉璃枝、車𤦲葉、水精華、金實；白玉樹者，白玉根、車𤦲莖、琉璃節、珊瑚枝、虎珀葉、金華、摩尼珠實。
「是七寶樹轉共相成，種種各自異行，行行自相值、莖莖自相准、枝枝自相值、葉葉自相向、華華自相望，極自軟好，實實自相當。」
佛言：「無量清淨佛講堂、精舍中，外內七寶浴池繞邊上諸七寶樹，及諸菩薩、阿羅漢七寶舍宅中外，七寶浴池繞池邊七寶樹，數千百重行，皆各各如是。行行自作五音，聲甚好無比。」
佛語阿難：「如世間帝王萬種伎樂音聲，不如遮迦越王諸伎樂一音聲好百千億萬倍也。如遮迦越王萬種伎樂音聲，尚復不如第二忉利天上諸伎樂一音聲好百千億萬倍也。如忉利天上萬種伎樂之聲，尚復不如第六天上諸伎樂一音聲好百千億萬倍也。如第六天上萬種音樂之聲，尚復不如無量清淨佛國中七寶樹一音聲好百千億萬倍也。無量清淨佛國亦有萬種自然之伎樂無極也。
「無量清淨佛及諸菩薩、阿羅漢欲浴時，便各自入其七寶池中浴。諸菩薩、阿羅漢意欲令水沒足，水則沒足；意欲令水至膝，水則至膝；意欲令水至腰，水則至腰；意欲令水至腋，水則至腋；意欲令水至頸，水則至頸；意欲令水自灌身上，水則灌身上；意欲令水轉復還如故，水則轉還復如故，恣若隨意所欲好憙。」
佛言：「無量清淨佛及諸菩薩、阿羅漢皆浴已，悉自於一蓮華上坐，則四方自然亂風起。其亂風者，亦非世間之風也，亦復非天上之風也；是亂風者，都為八方上下眾風中之自然，都相合會共化生耳。其亂風亦不大寒亦不大溫，常和調中，適其涼好無比；亂風徐起，亦不遲、亦不疾，適得中宜。吹國中七寶樹，七寶樹皆復自作五音聲；亂風吹華，悉覆蓋其國中。華皆自散無量清淨佛及諸菩薩、阿羅漢上。華適墮地，華皆厚四寸，極自軟好無比。華小萎，則自然亂風吹萎華，悉自然去。則復四方復自然亂風起，吹七寶樹，七寶樹皆復自作五音聲；亂風吹華，悉復自然散無量清淨佛及諸菩薩、阿羅漢上；華墮地則自然亂風復吹萎華，悉自然去。則復四方自然亂風起，吹七寶樹、華，如是者四反。
「諸菩薩、阿羅漢中有但欲聞經者、中有但欲聞音樂聲者、中有但欲聞華香者、中有不欲聞經者、中有不欲聞五音者、中有不欲聞華香者，其所欲聞者輒則獨聞之，其所不欲聞者了獨不聞也，則皆自然隨意，在所欲憙樂，不違其心中所欲願也。
「無量清淨佛及諸菩薩、阿羅漢皆浴訖已各自去，其諸菩薩、阿羅漢各自行道，中有在地講經者、中有在地誦經者、中有在地說經者、中有在地口受經者、中有在地聽經者、中有在地念經者、中有在地思道者、中有在地坐禪一心者、中有在地經行者；中有在虛空中講經者、中有在虛空中誦經者、中有在虛空中說經者、中有在虛空中口受經者、中有在虛空中聽經者、中有在虛空中念經者、中有在虛空中思念道者、中有在虛空中坐禪一心者、中有在虛空中經行者。中有未得須陀洹道者則得須陀洹道、中有未得斯陀含道者則得斯陀含道、中有未得阿那含道者則得阿那含道、中有未得阿羅漢道者則得阿羅漢道、中有未得阿惟越致菩薩者則得阿惟越致菩薩。菩薩、阿羅漢各自說經行道，皆悉得道，莫不歡喜踊躍者。
「諸菩薩中有意欲供養八方上下無央數諸佛，即皆俱前為無量清淨佛作禮却，長跪叉手，白佛辭行：『欲供養八方上下諸無央數佛。』無量清淨佛則然可之，則使其行供養諸菩薩等，皆大歡喜。數千億萬人、無央數不可復計——皆智慧勇猛——各自翻飛等輩相追，俱共散飛則行即到八方上下無央數諸佛所，皆前為佛作禮，便則供養諸佛。
「其諸菩薩意欲得萬種自然之物在前，則自然百雜色華百種、自然雜繒幡綵百種物、自然劫波育衣、自然七寶、自然燈火、自然萬種伎樂悉皆在前。其華香萬種自然之物者，亦非世間之物也、亦復非天上之物也；是萬種之物都為八方上下眾物自然共合會化生耳。意欲得者，則自然化生在前；意不用者，便則自化去。諸菩薩便共持供養諸佛及諸菩薩、阿羅漢上，邊傍前後徊繞周匝，自在意所欲得則輒皆至。當爾之時，快樂不可言也。
「諸菩薩意各欲得四十里華，則自然四十里華在前。諸菩薩皆於虛空中共持華，則散諸佛及諸菩薩、阿羅漢上，華皆在虛空中下向，華甚香好。華適小萎便自墮地，則自然亂風吹，萎華悉自然去。
「諸菩薩意各復欲得八十里華，則自然八十里華在前。諸菩薩皆復於虛空中共持華散諸菩薩、阿羅漢上，華皆復在虛空中下向。華小萎便自墮地，則自然亂風吹萎華去。
「諸菩薩意各復欲得百六十里華，則自然百六十里華在前。諸菩薩皆復於虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華皆復於虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得三百二十里華，則自然三百二十里華在前。諸菩薩皆復於虛空共持華則散諸佛及諸菩薩、阿羅漢上，華皆復在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得六百四十里華，則自然六百四十里華在前。諸菩薩皆復於虛空中共持華散諸佛及諸菩薩、阿羅漢上，華皆復在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得千二百八十里華，則自然千二百八十里華在前。諸菩薩皆復於虛空中共持華散諸佛及諸菩薩、阿羅漢上，華皆復在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得二千五百六十里華，則自然二千五百六十里華在前。諸菩薩皆復於虛空中共持華散諸佛及諸菩薩、阿羅漢上，華皆復在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得五千一百二十里華，則自然五千一百二十里華在前。諸菩薩皆復於虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華皆復在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得萬二百四十里華，則自然萬二百四十里華在前。諸菩薩皆復於虛空中共持華散諸佛及諸菩薩、阿羅漢上，華皆復在虛空中下向。華適小萎便自墮地，則自然亂風吹，華則自然去。
「諸菩薩意各復欲得二萬四百八十里華，則自然二萬四百八十里華在前。諸菩薩皆復於虛空中持華散諸佛及諸菩薩、阿羅漢上，華皆復在虛空中下向。華適小萎便自墮地，自然亂風吹，華悉自然去。
「諸菩薩意各復欲得五萬里華，則自然五萬里華在前。諸菩薩皆復於虛空中共持華散諸佛及諸菩薩、阿羅漢上，華皆在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得十萬里華，則自然十萬里華在前。諸菩薩皆復於虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華皆在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得二十萬里華，則自然二十萬里華在前。諸菩薩皆復於虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華皆在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得四十萬里華，則自然四十萬里華在前。諸菩薩皆復於虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華皆在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得八十萬里華，則自然八十萬里華在前。諸菩薩皆復於虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華皆在虛空中下向。華適小萎便自墮地，則自然亂風吹，華則自然去。
「諸菩薩意各復欲得百六十萬里華，則自然百六十萬里華在前。諸菩薩皆復於虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華皆在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得三百萬里華，則自然三百萬里華在前。諸菩薩皆復於虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華皆在虛空中下向。華適小萎便自墮地，則自然亂風吹，華悉自然去。
「諸菩薩意各復欲得四百萬里華，則自然四百萬里華在前。諸菩薩心意俱大歡喜踊躍，皆在虛空中共持華則散諸佛及諸菩薩、阿羅漢上，華都自然合為一華，華正團圓，周匝各適等。華轉倍前極自軟好，轉勝於前華好，數百千色，色色異香，甚香不可言。諸菩薩皆大歡喜，俱於虛空中大共作眾音自然伎樂，樂佛及諸菩薩、阿羅漢。當是之時，快樂不可言。諸菩薩皆悉却坐聽經，聽經竟則悉皆諷誦通利，重知經道，益明智慧。其諸華香小萎便自墮地，則自然亂風吹華，悉皆自然去。
「則諸佛國中從第一四天王上至三十六天上，諸菩薩、阿羅漢、天人皆復於虛空中大共作眾音伎樂。諸天人前來者轉去避後來者，後來者轉復供養如前，更相開避。諸天人歡喜聽經，皆大共作音樂。當是之時，快樂無極。
「諸菩薩供養聽經訖竟，便皆起為諸佛作禮而去。則復飛到八方上下無央數諸佛所，則復供養聽經，皆各如前時悉遍。以後日未中時，諸菩薩則皆飛而去，則還其國，悉前為無量清淨佛作禮，皆却坐一面聽經。聽經竟，皆大歡喜。」◎
◎佛言：「無量清淨佛及諸菩薩、阿羅漢欲食時，則自然七寶机、自然劫波育、自然罽㲲以為座。無量清淨佛及諸菩薩、阿羅漢皆坐已，前悉有自然七寶鉢，中皆有自然百味飲食。飲食者，亦不類世間飲食之味也，亦復非天上飲食之味也；此百味飲食者，都為八方上下眾自然之飲食中精，味甚香美無有比，都自然化生耳。其飲食自在，所欲得味甜酢，鉢自在所欲得。
「諸菩薩、阿羅漢中有欲得銀鉢者、中有欲得金鉢者、中有欲得水精鉢者、中有欲得琉璃鉢者、中有欲得珊瑚鉢者、中有欲得虎珀鉢者、中有欲得白玉鉢者、中有欲得車𤦲鉢者、中有欲得瑪瑙鉢者、中有欲得明月珠鉢者、中有欲得摩尼珠鉢者、中有欲得紫磨金鉢者，皆滿其中，百味飲食自恣若隨意則至，亦無所從來，亦無有供作者，自然化生耳。
「諸菩薩、阿羅漢皆食，食亦不多、亦不少，悉自然平等。諸菩薩、阿羅漢食，亦不言美惡，亦不以美故喜。食已，諸飯具、鉢、机、坐皆自然化去；欲食時，乃復化生耳。諸菩薩、阿羅漢皆心清潔不慕飯食，但用作氣力耳，皆自然消散，糜盡化去。」
佛告阿難：「阿彌陀佛為諸菩薩、阿羅漢說法時，都悉大會講堂上。其國諸菩薩、阿羅漢及諸天、人民，無央數都不可復計，皆飛到無量清淨佛所，悉前為無量清淨佛作禮，却坐聽經。無量清淨佛便則為諸比丘僧、諸菩薩、阿羅漢、諸天、人民廣說道智大經，皆悉聞知經道，莫不歡喜踊躍、心開解者。
「則四方自然亂風起，吹國中七寶樹，七寶樹皆復作五音聲。亂風吹七寶華，華覆蓋其國，皆在虛空中下向。華甚香，極自軟好，香遍國中。華皆自散無量清淨佛及諸菩薩、阿羅漢上。華墮地皆厚四寸，華適小萎，則自然亂風吹，萎華自然去。
「則四方俱復自然亂風起吹七寶樹，七寶樹皆復自作五音聲。亂風吹七寶樹華，華復如前，皆自然散無量清淨佛及諸菩薩、阿羅漢上。華墮地復厚四寸，華小萎則自然亂風吹，萎華悉自然去。亂風吹華，如是四反。
「則第一四天王諸天人、第二忉利天上諸天人、第三天上諸天人、第四天上諸天人、第五天上諸天人、第六天上諸天人、第七梵天上諸天人，上至第十六天上諸天人，上至三十六天上諸天人，皆持天上萬種自然之物——百種雜色華、百種雜香、百種雜繒綵、百種劫波育疊衣——萬種伎樂，轉倍好相勝，各持來下，為無量清淨佛作禮，則供養無量清淨佛及諸菩薩、阿羅漢。諸天人皆復大作伎樂，樂無量清淨佛及諸菩薩、阿羅漢。當是之時，快樂不可言。諸天人前來者轉去避後來者，後來者轉復供養如前，更相開避。
「則東方無央數佛國不可復計——如恒水邊流沙，一沙一佛，其數如是——諸佛各遣諸菩薩無央數不可復計，皆飛到無量清淨佛所，則為無量清淨佛作禮，以頭面著佛足，悉却坐一面聽經。聽經竟，諸菩薩皆大歡喜，悉起為無量清淨佛作禮而去。
「則西方無央數諸佛國——復如恒水邊流沙，一沙一佛，其數如是——諸佛各復遣諸菩薩無央數都不可復計，皆飛到無量清淨佛所，則前為無量清淨佛作禮，以頭面著佛足，悉却坐一面聽經。聽經竟，諸菩薩皆大歡喜，起為無量清淨佛作禮而去。
「則北方無央數諸佛國——復如恒水邊流沙，一沙一佛，其數如是——諸佛各復遣諸菩薩無央數都不可復計，皆飛到無量清淨佛所，則前為無量清淨佛作禮，以頭面著佛足，悉却坐一面聽經。聽經竟，諸菩薩皆大歡喜，起為無量清淨佛作禮而去。
「南方無央數諸佛國——復如恒水邊流沙，一沙一佛，其數如是——諸佛各復遣諸菩薩無央數都不可復計，皆飛到無量清淨佛所，則前為無量清淨佛作禮而去。
「則復四角無央數諸佛國——各復如恒水邊流沙，一沙一佛，其數各如是——諸佛各復遣諸菩薩無央數都不可復計，皆飛到無量清淨佛所，前為無量清淨佛作禮已，頭面著佛足，悉却坐一面聽經。聽經竟，諸菩薩皆大歡喜，起為無量清淨佛作禮而去。」
佛言：「八方上下諸無央數佛，更遣諸菩薩飛到無量清淨佛所，聽經供養，轉更相開避。
「如是，則下面諸八方無央數佛國——一方者各復如恒水邊流沙，一沙一佛，其數復如是——諸佛各遣諸菩薩無央數都不可復計，皆飛到無量清淨佛所，前為阿彌陀佛作禮，以頭面著佛足，悉却坐聽經。聽經竟，諸菩薩皆大歡喜，起為無量清淨佛作禮而去。
「上方諸佛更遣諸菩薩飛到無量清淨佛所，聽經供養相開避，前來者則去避後來者，後來者供養亦復如是，終無休絕極時。
「譬若如恒沙剎，  	東方佛國如是，
各各遣諸菩薩，  	稽首禮無量覺；
西、南、北面皆爾，  	如是恒沙數土，
是諸佛遣菩薩，  	稽首禮無量覺。
此十方菩薩飛，  	皆以衣裓諸華，
天拘蠶種種具，  	往供養無量覺。
諸菩薩皆大集，  	稽首禮無際光，
遶三匝叉手住，  	歎國尊無量覺。
皆持華散佛上，  	心清淨稱無量，
於佛前住自說：  	『願使我剎如此。』
所散華止虛空，  	合成蓋百由旬，
其柄妙嚴飾好，  	悉遍覆眾會上。
諸菩薩都往至，  	諸尊剎難得值，
如是人聞佛名，  	快安隱得大利。
吾等類得是德，  	諸此剎獲所好，
計本國若如夢，  	無數劫淨此土。
見菩薩遶世尊，  	威神猛壽無極，
國覺眾甚清淨，  	無數劫難思議。
時無量世尊笑，  	三十六億那術，
此數光從口出，  	遍炤諸無數剎。
則迴光還遶佛，  	三匝已從頂入，
色霍然不復現，  	天亦人皆歡喜。
廅樓亘從坐起，  	正衣服稽首問，
白佛言：『何緣笑？  	唯世尊說是意。
願授我本空莂，  	慈護成百福相。』
聞是諸音聲者，  	一切人踊躍喜，
梵之音及雷霆，  	八種音深重聲。
佛授廅樓亘決：  	『今吾說，仁諦聽。
眾世界諸菩薩，  	到須阿提禮佛，
聞歡喜、廣奉行，  	疾得至得淨處。
已到此嚴淨國，  	便速得神足俱，
眼洞視、耳徹聽，  	亦還得知宿命。
無量覺授其決，  	我前世有本願，
一切人聞說法，  	皆疾來生我國。
吾所願皆具足，  	從眾國來生者，
皆悉來到此間，  	一生得不退轉。
若菩薩更興願，  	欲使國如我剎，
亦念度一切人，  	令各願達十方。
速疾超便可到，  	安樂國之世界，
至無量光明土，  	供養於無數佛。
其奉事億萬佛，  	飛變化遍諸國，
恭敬已歡喜去，  	便還於須摩提。』
非有是功德人，  	不得聞是經名；
唯有清淨戒者，  	乃逮聞此正法。
曾更見世尊雄，  	則得信於是事，
謙恭敬、聞奉行，  	便踊躍大歡喜。
惡驕慢、弊懈怠，  	難以信於此法；
宿世時見佛者，  	樂聽聞世尊教。
譬從生盲冥者，  	欲得行開導人，
聲聞悉惑大乘，  	何況於俗凡諸？
天中天相知意，  	聲聞不了佛行，
辟支佛亦如是，  	獨正覺乃知此。
使一切悉作佛，  	其淨慧知本空，
復過此億萬劫，  	計佛智無能及。
講議說無數劫，  	盡壽命猶不知，
佛之慧無邊幅，  	如是行清淨致。
奉我教乃信是，  	唯此人能解了，
佛所說皆能受，  	是則為第一證。
人之命希可得，  	佛在世甚難值，
有信慧不可致，  	若聞見精進求。
聞是法而不忘，  	便見敬得大慶，
則我之善親厚，  	以是故發道意。
設令滿世界火。  	過此中得聞法，
會當作世尊將，  	度一切生、老、死。」
佛語阿難：「無量清淨佛為諸菩薩、阿羅漢說經竟，諸天人民中有未得須陀洹道者則得須陀洹道、中有未得斯陀含道者則得斯陀含道、中有未得阿那含道者則得阿那含道、中有未得阿羅漢道者則得阿羅漢道、中有未得阿惟越致菩薩者則得阿惟越致菩薩。阿彌陀佛輒隨其本宿命、求道時心所喜願大小，隨意為說經輒授之，令其疾開解得道，皆悉明慧。各自好喜所願經道莫不喜樂誦習者，則各自諷誦經道，通利無厭無極也。諸菩薩、阿羅漢中有誦經者，其音如雷聲；中有說經者如疾風暴雨。時諸菩薩、阿羅漢說經行道皆各如是，盡一劫竟終無懈倦時也。皆悉智慧勇猛，身體皆輕，便終無有痛痒。極時行步坐起，皆悉才健勇猛——如師子中王在深林中當有所趣，向時無有敢當者。
「無量清淨佛國諸菩薩、阿羅漢說經行道皆勇猛，無有疑難之意，則在心所作為不豫計百千億萬倍，是猛師子中王也。如是猛師子中王百千億萬倍，尚復不如我第二弟子——摩訶目揵連——勇猛百千億萬倍也。無量清淨國諸菩薩、阿羅漢皆勝我第二弟子摩訶目揵連也。」
佛言：「如摩訶目揵連勇猛，於諸佛國、諸阿羅漢中最為無比。如摩訶目揵連飛行進止、智慧勇猛、洞視徹聽——知八方、上下、去來、現在之事——百千億萬倍都合為一智慧勇猛，當在無量清淨佛國諸阿羅漢中者，其德尚復不如無量清淨佛國一阿羅漢智慧勇猛者千億萬倍也。」
是時，坐中有一菩薩，字阿逸菩薩。阿逸菩薩則起，前長跪叉手問佛言：「阿彌陀佛國中諸阿羅漢，寧頗有般泥洹去者不？願欲聞之。」
佛告阿逸菩薩：「若欲知者，如是四天下星，若見之不？」
阿逸菩薩言：「唯然，皆見之。」
佛言：「而我第二弟子摩訶目揵連飛行四天下，一日、一夜遍數星，知有幾枚也。如是，四天下星甚眾多，不可得計，尚為百千億萬倍是四天下星也。」
佛言：「如天下大海水減去一渧水，寧能令海水為減不？」
阿逸菩薩言：「減大海水百千億萬斗石水，尚復不能令海減少也。」
佛言：「阿彌陀佛國諸阿羅漢中雖有般泥洹去者，如是大海減一小水耳，不能令諸在阿羅漢為減知少也。」
佛言：「減大海水一溪水，寧能減海水不？」
阿逸菩薩言：「減大海百千萬億溪水，尚復不能減海水令知減少也。」
佛言：「阿彌陀佛國諸阿羅漢中有般泥曰去者，如是大海減一溪水耳，不能減諸在阿羅漢為減知少也。」
佛言：「而大海減一恒水，寧能減海水不？」
阿逸菩薩言：「減大海水百千萬億恒水，尚復不能減大海水令減知少也。」
佛言：「阿彌陀佛國諸阿羅漢般泥曰去者無央數，其在者、新得阿羅漢者亦無央數，都不為增減也。」
佛言：「令天下諸水都流行入大海中，寧能令海水為增多不？」
阿逸菩薩言：「不能令海水增多也。所以者何？是大海為天下諸水眾善中王也，故能爾耳。」
佛言：「無量清淨佛國亦如是，悉令八方上下無央數佛國、無央數諸天、人民、蜎飛蠕動之類，都往生無量清淨佛國者——其輩甚大、眾多，不可復計——無量清淨佛國諸菩薩、阿羅漢、眾比丘僧，都如常一法不異為增多也。所以者何？無量清淨佛國為最快，八方上下無央數諸佛國中、眾菩薩中王也，無量清淨佛國為諸無央數佛國中之雄國也、無量清淨佛國為諸無央數佛國中之珍寶也、無量清淨佛國為諸無央數佛國中之極長久也、無量清淨佛國為諸無央數佛國之眾傑也、無量清淨佛國為諸無央數佛國中之廣大也、無量清淨佛國為諸無央數佛國中都自然之無為也、無量清淨佛國為最快明好甚樂之無極也。無量清淨佛國獨勝者何？本為菩薩求道時，所願勇猛，精進不懈，累德所致，故乃爾耳。」
阿逸菩薩則大歡喜，長跪叉手言：「佛說無量清淨佛國諸阿羅漢般泥洹去者甚眾多，無央數國土快善之極、明好最姝無比，乃獨爾乎？」
佛言：「無量清淨佛國諸菩薩、阿羅漢所居七寶舍宅中，有在虛空中居者、中有在地居者。中有意欲令舍宅最高者，舍宅則高；中有意欲令舍宅最大者，舍宅則大；中有意欲令舍宅在虛空中者，舍宅則在虛空中；皆自然隨意在所作為。中有殊不能令其舍宅隨意所作為者。所以者何？中有能者，皆是前世宿命求道時慈心精進，益作諸善，德重所能致也；中有不能致者，皆是前世宿命求道時不慈心精進，作善少德小。悉各自然得之，所衣被服飲食俱自然平等耳，是故不同，德有大小別知勇猛，令眾見耳。」
佛告阿逸菩薩：「若見是第六天上天王所居處不耶？」
阿逸菩薩言：「唯然，皆見之。」
佛言：「無量清淨佛國土講堂、舍宅，倍復勝第六天王所居處百千億萬倍也。
「無量清淨佛國其諸菩薩、阿羅漢，悉皆洞視徹聽；悉復見知八方、上下、去來、現在之事；復知諸無央數天上、天下人民、及蜎飛蠕動之類，皆悉知心意、所念善惡、口所欲言；皆知當何歲何劫中得度脫得人道、當往生無量清淨佛國；知當作菩薩道、得阿羅漢道，皆豫知之。
「無量清淨佛國諸菩薩、阿羅漢，其項中光明皆悉自有光明、所照大小。
「其諸菩薩中有最尊兩菩薩，常在無量清淨佛左右座邊坐侍政論。無量清淨佛常與是兩菩薩共對坐，議八方、上下、去來、現在之事。無量清淨佛若欲使令是兩菩薩到八方上下無央數諸佛所，是兩菩薩便飛行，則到八方上下無央數諸佛所；隨心所欲至到何方佛所，是兩菩薩則俱飛行，則到飛行駃疾如佛，勇猛無比。
「其一菩薩名廅樓亘，其一菩薩名摩訶那，光明智慧最第一。其兩菩薩項中光明，各焰照他方千須彌山佛國常大明，其諸菩薩項中光明各照千億萬里、諸阿羅漢項中光明各照七丈。」
佛言：「其世間人民——善男子、善女人——若有一急恐怖、遭縣官事者，但自歸命是廅樓亘菩薩，無所不得解脫者也。」◎
佛說無量清淨平等覺經卷第二
佛說無量清淨平等覺經卷第三
後漢月氏國三藏支婁迦讖譯
◎佛告阿逸菩薩：「無量清淨佛[＊]項中光明極大明，其日、月、星辰皆在虛空中住止，亦不復迴轉運行、亦無有精光，其明皆蔽不復現。無量清淨佛光明照國中及焰照他方佛國常大明，終無有當冥時也。
「其國中無有一日、二日也，無有十五日、一月也，無有五月、十月也，無有五歲、十歲也，無有百歲、千歲也，無有萬歲、億歲、億萬歲、十億萬歲也，無有百千億萬歲也、無有千億億萬歲也。無有一劫、十劫也，無有百劫、千劫也，無有萬劫、十萬劫也，無有千萬劫也，無有百千億萬劫也。」
佛言：「無量清淨佛光明，光明無極。無量清淨佛光明却後無數劫、無數劫、重復無數劫、無數劫、不可復計劫，劫無央數，終無有當冥時也。
「無量清淨國土及諸天，終無有壞敗時也。所以者何？無量清淨佛壽命極長，國土甚好，故能爾耳。」
佛言：「無量清淨佛尊壽劫後無數劫常無央，無般泥洹時也。
「無量清淨佛於世間教授，意欲適度八方上下諸無央數佛國諸天、人民、及蜎飛蠕動之類，皆欲使往生其國悉令得泥洹之道；其諸有作菩薩者皆欲令悉作佛，作已悉令轉。復教授八方上下諸天、人民及蜎飛蠕動之類，皆復欲令悉得作佛；作佛時復教授無央數諸天、人民、蠕動之類，皆令得泥洹道去。諸所可教授弟子者展轉復相教授，轉相度脫，至令得須陀洹、斯陀含、阿那含、阿羅漢、辟支佛道。轉相度脫皆得泥洹之道悉如是，無量清淨佛常未欲般泥曰也。無量清淨佛所脫度展轉如是，復住無數劫、無數劫、不可復計劫，終無有般泥洹時也。八方上下無央數諸天、人民、蜎飛、蠕動之類其生無量清淨佛國者不可復勝數；諸作阿羅漢得泥洹之道者亦無央數，都不可復計也。
「無量清淨佛恩德、諸所布施八方上下無窮無極，甚深大無量，快善不可言也。無量清淨佛智慧教授所出經道，布告八方上下諸無央數，天上、天下甚多不原，其經卷數甚大眾不可復計，都無極也。」
佛告阿逸菩薩：「若欲知無量清淨佛壽命無極時不也？」
阿逸菩薩言：「願皆欲聞知之。」
佛言：「明聽。悉令八方上下諸無央數佛國中諸天、人民、蜎飛蠕動之類皆使得人道，悉令作辟支佛、阿羅漢，共坐禪一心，都合其智慧為一勇猛，共欲計知無量清淨佛壽命、知壽幾千億萬劫歲數，皆無有能計知極無量清淨佛壽者也。」
佛言：「復令他方面各千須彌山佛國中諸天、人民及蜎飛蠕動之類皆復得人道，悉令作辟支佛、阿羅漢，皆令坐禪一心，共合其智慧都為一勇猛，共欲數無量清淨佛國中諸菩薩、阿羅漢計千億萬人，皆無有能數者也。」
佛言：「無量清淨佛年壽甚長久浩浩，浩浩照明善甚深，無極無底。誰當能信知其者乎？獨佛自知耳。」
阿逸菩薩聞佛言即大歡喜，長跪叉手言：「佛說無量清淨佛壽命甚長，威神大，智慧光明，巍巍快善。乃獨如是乎？」
佛言：「無量清淨佛至其然後般泥洹者，其廅樓亘菩薩便當作佛，總領道智，典主教授世間八方上下，所過度諸天、人民、蜎飛蠕動之類，皆令得佛泥洹之道。其善福德當得復如大師無量清淨佛，住止無央數劫、無央數劫、不可復計劫、不可復計劫，准法大師，爾乃般泥曰。
「其次摩訶那鉢菩薩當復作佛，典主智慧，都總教授，所過度福德當復如大師無量清淨佛，止住無央數劫，常復不般泥洹。展轉相承，受經道甚明，國土極善，其法如是，終無有斷絕，不可極也。」
阿難長跪叉手問佛言：「佛說無量清淨佛國中無有須彌山者，其第一四天王、第二忉利天皆依因何等住止乎？願欲聞之。」
佛告阿難：「若有疑意於佛所耶？八方上下無窮無極、無有邊幅，其諸天下大海水，一人升量之尚可枯盡得其底；佛智亦如是，八方上下無窮無極、無有邊幅。」
佛言：「我智慧所知見，諸已過去佛如我名字釋迦文佛者，復如恒水邊流沙，一沙一佛。甫始諸來欲求作佛者，如我名字釋迦文佛者，復如恒水邊流沙，一沙一佛。佛正坐直南向，視見南方今現在佛如我名字釋迦文佛者，復如恒水邊流沙，一沙一佛。八方、上下，去來、現在諸佛如我名字釋迦文佛者，各如十恒水邊流沙，一沙一佛。其數如是，佛皆悉豫見知之。」
佛言：「往昔過去無央數劫已來，一劫、十劫、百劫、千劫、萬劫、億劫、萬億劫、億萬劫，劫中有佛。諸已過去佛，一佛、十佛、百佛、千佛、萬佛、億佛、億萬佛，中有佛，佛各各自有名字，名字不相同類，無有如我名字者。甫始當來劫，諸當來佛，一劫、十劫、百劫、千劫、萬劫、億劫、萬億劫、億萬劫，劫中有一佛、十佛、百佛、千佛、萬佛、萬億佛、億萬佛，中有佛，佛各自有名字，名字各異，不同諸佛名字，時乃有一佛如我名字釋迦文佛耳。諸八方、上下無央數佛國今現在佛，次他方異佛國，一佛國、十佛國、百佛國、千佛國、萬佛國、億佛國、萬億佛國、億萬佛國，佛國中有佛，各各自有名字，名字各異多多，復不可同，無有如我名字者。八方、上下無央數諸佛中，時時乃有如我名字釋迦文佛耳。八方、上下，去來、現在，其中間曠絕甚遠悠悠，無窮無極。佛智亘然甚明，採古知今，前知無窮、却覩未然、豫知無極，都不可復計甚無央數佛，威神尊明皆悉知之。佛智慧、道德合明，都無有能問佛經道窮極者，佛智慧終不可斗量盡也。」
阿難聞佛言則大恐怖衣毛皆起，阿難白佛言：「我不敢有疑意於佛所也。所以問佛者，他方佛國皆有須彌山，其第一四王天、第二忉利天皆依因之住止。我恐佛般泥曰後，儻有諸天、人民、若比丘僧、比丘尼、優婆塞、優婆夷來問我，無量清淨佛國何以獨無須彌山？其第一四王天、第二忉利天皆依因何等住止乎？我當應答之。今我不問佛者，佛去後我當持何等語答報之乎？獨佛自知之耳，其餘人無有能為解之者。以是故，問佛耳。」
佛言阿難：「若言是也。第三焰天、第四兜率天、上至第七梵天，皆依因何等住止乎？」
阿難言：「是諸天皆自然在虛空中住止，無所依因也。」
佛言：「無量清淨佛國無有須彌山者亦如是，第一四王天、第二忉利天皆自然在虛空中住止，無所依因也。」
佛言：「佛威神甚重，自在所欲作為，意欲有所作不豫計也。是諸天皆常自然在虛空中住止，何況佛威神尊重自在所欲作為乎？」
阿難聞佛言則大歡喜，長跪叉手言：「佛智慧知八方上下、去來現在之事，無窮無極、無有邊幅，甚高大妙絕，快善極明，好甚無比，威神尊重不可當也。」
佛告阿逸菩薩：「其世間人民——若善男子、善女人——欲願往生無量清淨佛國者有三輩，作功德有大小，轉不能相及。」
佛言：「何等為三輩？
「其最上第一輩者，當去家、捨妻子、斷愛欲，行作沙門就無為道，當作菩薩道，奉行六波羅蜜經者。作沙門不當虧失經戒，慈心精進，不當瞋怒，不當與女人交通。齋戒清淨，心無所貪慕，至精願欲生無量清淨佛國，當念至心不斷絕者。其人便今世求道時，則自於其臥睡中夢見無量清淨佛及諸菩薩、阿羅漢。其人壽命欲終時，無量清淨佛則自與諸菩薩、阿羅漢共翻飛行迎之，則往生無量清淨佛國，便於七寶水池蓮華中化生，則自然受身長大。則作阿惟越致菩薩，便則與諸菩薩共番輩飛行，供養八方上下諸無央數佛。則智慧勇猛，樂聽經道其心歡樂，所居七寶舍宅在虛空中，恣隨其意在所欲作為，去無量清淨佛近。」
佛言：「諸欲往生無量清淨佛國者，精進持經戒、奉行如是上法者，往生無量清淨佛國者，可得為眾所尊敬，是為上第一輩。」
佛言：「其中輩者，其人願欲往生無量清淨佛國，雖不能去家、捨妻子、斷愛欲、行作沙門者，當持經戒無得虧失，益作分檀布施，常信受佛語，深當作至誠忠信。飯食沙門，而作佛寺、起塔、燒香、散華、然燈、懸雜繒綵如是法者。無所適貪，不當瞋怒，齋戒清淨，慈心精進，斷欲念。欲往生無量清淨佛國一日一夜不斷絕者，其人於今世亦復於臥睡夢中見無量清淨佛。其人壽欲盡時，無量清淨佛則化令其人自見無量清淨佛及國土，往生無量清淨佛國者可得智慧勇猛。」
佛言：「其人奉行施與如是者，若其然後中復悔，心中狐疑，不信分檀布施作諸善後世得其福、不信有無量清淨佛國、不信往生其國中，雖爾其人續念不絕，暫信、暫不信，意志猶豫，無所專據，續結其善願，名本續得往生。其人壽命病欲終時，無量清淨佛則自化作形像，令其人目自見之，口不能復言，便心中歡喜踊躍，意念言：『我悔不知益齋作善，今當生無量清淨佛國。』其人則心中悔過，悔過者過差少，無所須及。其人壽命終盡則生無量清淨佛國，不能得前至無量清淨佛所，便道見無量清淨佛國界邊自然七寶城，心中便大歡喜。道止其城中，則於七寶水池蓮華中化生，則受身自然長大，在城中於是間五百歲。其城廣縱各二千里，城中亦有七寶舍宅，舍宅中自然內外皆有七寶浴池，浴池中亦有自然華繞，浴池上亦有七寶樹重行，皆復作五音聲。其飲食時，前亦有自然食，具百味食，在所欲得。
「其人於城中快樂，其城中比如第二忉利天上自然之物，其人於城中不能得出，復不能得見無量清淨佛，但見其光明，心中自悔責、踊躍喜耳。亦復不能得聞經、亦復不能得見諸比丘僧，亦復不能得見知無量清淨佛國中諸菩薩、阿羅漢狀貌何等類。其人若如是比而小適耳，佛亦不使爾。身諸所作自然得之，皆心自趣向道入其城中。其人本宿命求道時心口各異，言念無誠，狐疑佛經，復不信向之，當自然入惡道中。無量清淨佛哀愍，威神引之去耳。
「其人於城中五百歲乃得出，往至無量清淨佛所聞經，心不開解，亦復不得在諸菩薩、阿羅漢、比丘僧中聽經。以去所居處舍宅在地，不能令舍宅隨意高大、在虛空中；復去無量清淨佛甚大遠，不能得近附無量清淨佛。其人智慧不明，知經復少，心不歡樂、意不開解。其人久久亦自當智慧開解[＊]知經，明健勇猛心當歡樂，次當復如上第一輩。所以者何？其人但坐其前世宿命求道時不大持齋戒，虧失經法，心意狐疑，不信佛語、不信佛經深、不信分檀布施作善後世當得其福，復坐中悔，不信往生無量清淨佛國，作德不至心，用是故為第二中輩。」
佛言：「其三輩者，其人願欲生無量清淨佛國，若無所用分檀布施，亦不能燒香、散華、然燈、懸繒綵、作佛寺、起塔、飲食沙門者，當斷愛欲、無所貪慕、慈心精進、不當瞋怒、齋戒清淨。如是清淨者，當一心念欲生無量清淨佛國，晝夜十日不斷絕者，壽終則往生無量清淨佛國，可復尊極，智慧勇猛。」
佛言：「其人作是已後，若復中作悔心，意用狐疑，不信作善後世當得其福、不信往生無量清淨佛國，其人雖爾續得往生。其人壽命病欲終時，無量清淨佛則令其人於臥睡夢中見無量清淨佛國土，其人心中歡喜，意自念言：『我悔不知益作善，今當生無量清淨佛國。』其人但心念是，口不能復言，則自悔過。悔過者過差減少，悔者無所復及。其人命終則生無量清淨佛國，不能得前至，便道見二千里七寶城，心中獨歡喜，便止其中。復於七寶水池蓮華中化生，則自然長大。其城亦復如前城法，比第二忉利天上自然之物。其人亦復於城中五百歲，五百歲竟乃得出，至無量清淨佛所，心中大歡喜。其人聽聞經心不開解、意不歡喜、智慧不明，知經復少。所居舍宅在地，不能令舍宅隨意高大、在虛空中，復去無量清淨佛亦復如是。
「第二輩狐疑者，其人久久亦當智慧開解知經，勇猛心當歡樂，次如上第一輩也。所以者何？皆坐前世宿命求道時中悔狐疑，暫信、暫不信，不信作善後得其福德，皆自然得之耳。隨其功德有鉉、不鉉各自然趣向，說經行道卓德萬殊超不相及。」
佛言：「其欲求作菩薩道生無量清淨佛國者，其然後皆當得阿惟越致菩薩。阿惟越致菩薩者，皆當有三十二相紫磨金色、八十種好；皆當作佛，隨心所願在欲於何方佛國作佛，終不更泥犁、禽獸、薜荔。隨其精進求道，早晚之事事同等耳；求道不休會當得之，不失其所欲願也。」
佛告阿逸菩薩等諸天、帝王、人民：「我皆語若曹，諸欲生無量清淨佛國，雖不能大精進禪、持經戒者，大要當作善。一者、不得殺生，二者、不得盜竊，三者、不得婬妷犯愛他人婦女，四者、不得調欺，五者、不得飲酒，六者、不得兩舌，七者、不得惡口，八者、不得妄言，九者、不得嫉妬，十者、不得貪欲，不得心有所慳惜、不得瞋怒、不得愚癡、不得隨心嗜欲、不得心中中悔、不得狐疑。當作孝順、當作至誠忠信、當作受佛經語深、當信作善後世得其福。奉持如是其法不虧失者，在心所願可得往生無量清淨佛國。至要當齋戒，一心清淨，晝夜常念欲往生無量清淨佛國，十日十夜不斷絕。我皆慈愍之，悉令生無量清淨佛國。」
佛言：「世間人欲以慕及賢明、居家修善為道者，與妻子共居，在恩好愛欲之中憂念。若多家事怱務，不暇大齋戒、一心清淨，雖不能得離家，有空閑時自端正心、意念諸善、專精行道，十日十夜。殊使不能爾，自思惟熟計：『欲度脫身者，下當絕念去憂，勿念家事、莫與女人同床，自端正身心、斷愛欲，一心齋戒清淨，至意念生無量清淨佛國。』一日一夜不斷絕者，壽終皆得往生其國，在七寶浴池蓮華中化生，可得智慧勇猛。所居七寶舍宅，自在其意所欲作為，可次如上第一輩。」
佛語阿逸菩薩言：「諸八方上下無央數諸天、人民、比丘僧、比丘尼、優婆塞、優婆夷，其往生無量清淨佛國，眾等大會皆共於七寶浴池中，都共人人悉自於一大蓮華上坐，皆自陳道德善。人人各自說其前世宿命求道時持經戒、所作善法、所從來生本末、其所好喜經道、知經智慧、所施行功德，從上次下轉皆遍。以知經有明、不明，有深淺、大小，德有優劣、厚薄，自然之道別知才能智慧猛健；眾相觀照禮義和順，皆自歡喜踊躍，智慧有勇猛，各不相屬逮。」
佛言：「其人殊不豫益作德，為善輕虧，不信之然，徙倚懈怠，為用可爾。至時都集說經行道，自然迫促，應答遲晚。道智卓殊超絕，才妙高猛，獨於邊羸。臨事乃悔，悔者已出，其後當復何益？但心中悷𢝋慕及等耳。」◎
◎佛言：「無量清淨佛國諸菩薩、阿羅漢眾等，大道聚會自都集，拘心制意，端身正行，遊戲洞達，俱相隨飛行幡輩出入，供養無極，歡心喜樂。樂共觀經行道，和好文習，才猛智慧，志若虛空。精進求願，心終不復中迴意、終不復轉、終無有懈極時。雖求道外若遲緩，內獨駃急疾，容容虛空中適得其中，中表相應，自然嚴整。撿斂端直，身心淨潔，無有愛欲，有所適貪，無有眾惡瑕穢，其志願皆安定殊好，無增缺減。求道和正，不誤傾邪，准望道法，隨經約令，不敢違失蹉跌。若於繩墨遊於八方上下，無有邊幅，自在所欲，至到無窮無極。咸然為道，恢廓慕及曠蕩，念道無他之念、無有憂思。自然無為，虛無空立，淡安無欲，作德善願。盡心求索，含哀慈愍，精進中表，禮義都合。通洞無違，和順副稱，苞羅表裏，過度解脫。敢昇入於泥洹，長與道德合明，自然相保守，快意之滋滋，真真了潔白，志願高無上；清淨定安靜，樂之無有極。善好無有比，巍巍之燿照照。一旦開達明徹，自然中自然相，自然之有根本。自然成五光至九色，五光至九色參迴轉，數百千更變，最勝之自然。自然成七寶，橫攬成萬物，光精參明俱出好，甚姝無有極。其國土甚姝好若此，何不力為善？`)