jsonp(5,{"name":"dc","start":7569},`^cb#56b19爾時妙音菩薩摩訶薩供^lb養釋迦牟尼佛及多寶佛塔已，還歸本土，所^lb經諸國，六種震動，雨寶蓮華，作百千萬億種^lb種伎樂。
既到本國，與八萬四千菩薩、圍繞至^lb淨華宿王智佛所，白佛言：
「世尊！我到娑婆世^lb界饒益眾生，見釋迦牟尼佛，及見多寶佛塔，^pb21禮拜、供養；又見文殊師利法王子菩薩，及見^lb藥王菩薩、得勤精進力菩薩、勇施菩薩等，亦^lb令是八萬四千菩薩得現一切色身三昧。
說^lb是妙音菩薩來往品時，四萬二千天子得無^lb生法忍，華德菩薩得法華三昧。」
^lb^ck25〔觀世音菩薩普門品第二十五〕
^pb22^cb#56c03爾時，無盡意菩薩即從座起，偏袒右肩，合掌^lb向佛，而作是言：「世尊！觀世音菩薩，以何因緣^lb名觀世音？」
^cb#56c05佛告無盡意菩薩：「善男子！若有無^lb量百千萬億眾生受諸苦惱，聞是觀世音菩^lb薩，一心稱名，觀世音菩薩即時觀其音聲，皆^lb得解脫。
若有持是觀世音菩薩名者，設入大^pb23火，火不能燒，由是菩薩威神力故。
若為大水^lb所漂，稱其名號，即得淺處。若有百千萬億眾^lb生，為求金、銀、琉璃、車璩、馬瑙、珊瑚、虎珀、真珠^lb等寶，入於大海，假使黑風吹其船舫，飄墮羅^lb剎鬼國，其中若有，乃至一人，稱觀世音菩薩^lb名者，是諸人等皆得解脫羅剎之難。以是因^pb24緣，名觀世音。
若復有人臨當被害，稱觀世音^lb菩薩名者，彼所執刀杖尋段段壞，而得解脫。
^lb若三千大千國土，滿中夜叉、羅剎，欲來惱人，^lb聞其稱觀世音菩薩名者，是諸惡鬼，尚不能^lb以惡眼視之，況復加害。
設復有人，若有罪、若^lb無罪，杻械、枷鎖檢繫其身，稱觀世音菩薩名^pb25者，皆悉斷壞，即得解脫。
若三千大千國土，滿^lb中怨賊，有一商主，將諸商人，齎持重寶、經過^lb險路，其中一人作是唱言：『諸善男子！勿得恐^lb怖，汝等應當一心稱觀世音菩薩名號。
是菩^lb薩能以無畏施於眾生，汝等若稱名者，於此^lb怨賊當得解脫。』眾商人聞，俱發聲言：『南無觀^pb26世音菩薩。』稱其名故，即得解脫。
^cb#56c29「無盡意！觀世^lb音菩薩摩訶薩，威神之力巍巍如是。
若有眾^lb生多於婬欲，常念恭敬觀世音菩薩，便得離^lb欲。
若多瞋恚，常念恭敬觀世音菩薩，便得離^lb瞋。若多愚癡，常念恭敬觀世音菩薩，便得離^lb癡。
^cb#57a05「無盡意！觀世音菩薩有如是等大威神力，^pb27多所饒益，是故眾生常應心念。
若有女人，設^lb欲求男，禮拜供養觀世音菩薩，便生福德智^lb慧之男；設欲求女，便生端正有相之女。宿殖^lb德本，眾人愛敬。
^cb#57a09「無盡意！觀世音菩薩有如是^lb力，若有眾生，恭敬禮拜觀世音菩薩，福不唐^lb捐，是故眾生皆應受持觀世音菩薩名號。
^cb#57a12「無^pb28盡意！若有人受持六十二億恒河沙菩薩名^lb字，復盡形供養飲食、衣服、臥具、醫藥。
於汝意^lb云何？是善男子、善女人，功德多不？」
^cb#57a15無盡意言：^lb「甚多，世尊！」
^cb#57a16佛言：「若復有人受持觀世音菩薩^lb名號，乃至一時禮拜、供養，是二人福，正等無^lb異，於百千萬億劫不可窮盡。
無盡意！受持觀^pb29世音菩薩名號，得如是無量無邊福德之利。」
^lb^cb#57a20無盡意菩薩白佛言：「世尊！觀世音菩薩，云何^lb遊此娑婆世界？云何而為眾生說法？方便之^lb力，其事云何？」
^cb#57a22佛告無盡意菩薩：「善男子！若有^lb國土眾生，
應以佛身得度者，觀世音菩薩即^lb現佛身而為說法；
應以辟支佛身得度者，即^pb30現辟支佛身而為說法；
應以聲聞身得度者，^lb即現聲聞身而為說法；
應以梵王身得度者，^lb即現梵王身而為說法；
應以帝釋身得度者，^lb即現帝釋身而為說法；
應以自在天身得度^lb者，即現自在天身而為說法；
應以大自在天^lb身得度者，即現大自在天身而為說法；
應以^pb31天大將軍身得度者，即現天大將軍身而為^lb說法；
應以毘沙門身得度者，即現毘沙門身^lb而為說法；
應以小王身得度者，即現小王身^lb而為說法；
應以長者身得度者，即現長者身^lb而為說法；
應以居士身得度者，即現居士身^lb而為說法；
應以宰官身得度者，即現宰官身^pb32而為說法；
應以婆羅^lb門身得度者，即現婆羅門身而為說法；
應以比丘、比丘尼、優婆塞、優^lb婆夷身得度者，即現比丘、比丘尼、優婆塞、優^lb婆夷身而為說法；
應以長者、居士、宰官、婆羅^lb門婦女身得度者，即現婦女身而為說法；
應^lb以童男、童女身得度者，即現童男、童女身而^pb33為說法；
應以天、龍、夜叉、乾闥婆、阿修羅、迦樓^lb羅、緊那羅、摩睺羅伽、人非人等身得度者，即^lb皆現之而為說法；
應以執金剛身得度者，即^lb現執金剛身而為說法。
^cb#57b19「無盡意！是觀世音菩^lb薩成就如是功德，以種種形，遊諸國土，度脫^lb眾生。
是故汝等，應當一心供養觀世音菩薩。^pb34是觀世音菩薩摩訶薩，於怖畏急難之中能^lb施無畏，是故此娑婆世界，皆號之為施無畏^lb者。」
^cb#57b24無盡意菩薩白佛言：「世尊！我今當供養觀^lb世音菩薩。」即解頸眾寶珠、瓔珞，價直百千兩^lb金，而以與之，作是言：「仁者！受此法施珍寶瓔^lb珞。」時觀世音菩薩不肯受之。無盡意復白觀^pb35世音菩薩言：「仁者！愍我等故，受此瓔珞。」
^cb#57c01爾時^lb佛告觀世音菩薩：「當愍此無盡意菩薩及四^lb眾，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、^lb摩睺羅伽、人非人等故，受是瓔珞。」
^cb#57c03即時觀世^lb音菩薩愍諸四眾，及於天、龍、人非人等，受其^lb瓔珞，分作二分，一分奉釋迦牟尼佛，一分奉^lb多寶佛塔。
^cb#57c06「無盡意，觀世音菩薩有如是自在^lb神力，遊於娑婆世界。」
^cb#57c07爾時無盡意菩薩以偈^lb問曰：
^pb36^gatha「世尊妙相具，　　我今重問彼，
　佛子何因緣，　　^lb名為觀世音？
　具足妙相尊，　　偈答無盡意：
^lb『汝聽觀音行，　　善應諸方所，
　弘誓深如海，　　^pb37歷劫不思議，
　侍多千億佛，　　發大清淨願。
　^lb我為汝略說，　　聞名及見身，
　心念不空過，　　^lb能滅諸有苦。
　假使興害意，　　推落大火坑，
　^lb念彼觀音力，　　火坑變成池。
　或漂流巨海，　　^lb龍魚諸鬼難，
　念彼觀音力，　　波浪不能沒。
　^lb或在須彌峯，　　為人所推墮，
　念彼觀音力，　　^pb38如日虛空住。
　或被惡人逐，　　墮落金剛山，
　^lb念彼觀音力，　　不能損一毛。
　或值怨賊繞，　　^lb各執刀加害，
　念彼觀音力，　　咸即起慈心。
　^lb或遭王難苦，　　臨刑欲壽終，
　念彼觀音力，　　^lb刀尋段段壞。
　或囚禁枷鎖，　　手足被杻械，
　^lb念彼觀音力，　　釋然得解脫。
　呪詛諸毒藥，　　^pb39所欲害身者，
　念彼觀音力，　　還著於本人。
　^lb或遇惡羅剎、　　毒龍諸鬼等，
　念彼觀音力，　　^lb時悉不敢害。
　若惡獸圍遶，　　利牙爪可怖，
　^lb念彼觀音力，　　疾走無邊方。
　蚖蛇及蝮蠍，　　^lb氣毒煙火燃，
　念彼觀音力，　　尋聲自迴去。
　^lb雲雷鼓掣電，　　降雹澍大雨，
　念彼觀音力，　　^pb40應時得消散。
　眾生被困厄，　　無量苦逼身，
　^lb觀音妙智力，　　能救世間苦。
　具足神通力，　　^lb廣修智方便，
　十方諸國土，　　無剎不現身。
　^lb種種諸惡趣，　　地獄鬼畜生，
　生老病死苦，　　^lb以漸悉令滅。
　真觀清淨觀，　　廣大智慧觀，
　^lb悲觀及慈觀，　　常願常瞻仰。
　無垢清淨光，　　^pb41慧日破諸闇，
　能伏災風火，　　普明照世間。
　^lb悲體戒雷震，　　慈意妙大雲，
　澍甘露法雨，　　^lb滅除煩惱焰。
　諍訟經官處，　　怖畏軍陣中，
　^lb念彼觀音力，　　眾怨悉退散。
　妙音觀世音，　　^lb梵音海潮音，
　勝彼世間音，　　是故須常念，
　^lb念念勿生疑。　　觀世音淨聖，
　於苦惱死厄，　　^pb42能為作依怙，
　具一切功德，　　慈眼視眾生，
　^lb福聚海無量，　　是故應頂禮。』」
^lb^cb#58b03爾時持地菩薩即從座起，前白佛言：「世尊！若^lb有眾生，聞是觀世音菩薩品自在之業，普門^lb示現神通力者，當知是人功德不少。」
^cb#58b05佛說是^lb普門品時，眾中八萬四千眾生，皆發無等等^pb43阿耨多羅三藐三菩提心。
^lb^ck26〔陀羅尼品第二十六〕
^lb^cb#58b09爾時，藥王菩薩即從座起，偏袒右肩，合掌向^lb佛，而白佛言：「世尊！若善男子、善女人，有能受^lb持法華經者——若讀誦通利，若書寫經卷——得幾^lb所福？」
^cb#58b12佛告藥王：「若有善男子、善女人，供養八^pb44百萬億那由他恒河沙等諸佛。
於汝意云何？^lb其所得福，寧為多不？」
^cb#58b14「甚多，世尊。」
^cb#58b15佛言：「若善男^lb子、善女人，能於是經，乃至受持一四句偈，讀^lb誦、解義、如說修行，功德甚多。」
^lb^cb#58b17爾時藥王菩薩白佛言：「世尊！我今當與說法^lb者陀羅尼呪，以守護之。」即說呪曰：
^pb45^cb#58b19「安爾(一)　曼爾(二)　摩禰(三)　摩摩禰(四)　旨隷(五)　遮^lb梨第(六)　賒咩(羊鳴音)(七)　賒履(冈雉反)多瑋(八)　羶(輸千反)^lb帝(九)　目帝(十)　目多履(十一)　娑履(十二)　阿瑋娑履(十三)　^lb桑履(十四)　娑履(十五)　叉裔(十六)　阿叉裔(十七)　阿耆膩(十八)　^lb羶帝(十九)　賒履(二十)　陀羅尼(二十一)　阿盧伽婆娑(蘇奈反)^lb簸蔗毘叉膩(二十二)　禰毘剃(二十三)　阿便哆(都餓反)邏禰履剃^pb46(廾四)　阿亶哆波隷輸地(途賣反)(二十五)　漚究隷(二十六)　^lb牟究隷(二十七)　阿羅隷(二十八)　波羅隷(二十九)　首迦差(初几反)(三十)　^lb阿三磨三履(三十一)　佛馱毘吉利袠帝(三十二)　^lb達磨波利差(猜離反)帝(三十三)　僧伽涅瞿沙禰^lb(三十四)　婆舍婆舍輸地(三十五)　曼哆邏(三十六)　曼哆^lb邏叉夜多(三十七)　郵樓哆(三十八)　郵樓哆憍舍^pb47略(來加反)(三十九)　惡叉邏(四十)　惡叉冶多冶(四十一)　阿婆^lb盧(四十二)　阿摩若(荏蔗反)那多夜(四十三)
^lb^cb#58c04「世尊！是陀羅尼神咒，六十二億恒河沙等諸^lb佛所說，若有侵毀此法師者，則為侵毀是諸^lb佛已。」
^cb#58c06時釋迦牟尼佛讚藥王菩薩言：「善哉，善^lb哉！藥王！汝愍念擁護此法師故，說是陀羅尼，^pb48於諸眾生，多所饒益。」
^cb#58c09爾時勇施菩薩白佛言：^lb「世尊！我亦為擁護讀誦受持法華經者，說陀^lb羅尼。
若此法師得是陀羅尼，若夜叉、若羅剎、^lb若富單那、若吉遮、若鳩槃茶、若餓鬼等，伺求^lb其短，無能得便。」即於佛前而說呪曰：
^lb^cb#58c14「痤(誓螺反)隷(一)摩訶痤隷(二)郁枳(三)目枳(四)^pb49阿隷(五)阿羅婆第(六)涅隷第(七)涅隷多婆第^lb(八)伊緻(猪履反)柅(女氏反)(九)韋緻柅(十)旨緻柅(十一)涅^lb隷墀柅(十二)涅犁墀婆底(十三)
^lb^cb#59a04「世尊！是陀羅尼神呪，恒河沙等諸佛所說，亦^lb皆隨喜，若有侵毀此法師者，則為侵毀是諸^lb佛已。」
^cb#59a07爾時毘沙門天王護世者白佛言：「世尊！^pb50我亦為愍念眾生、擁護此法師故，說是陀羅^lb尼。」即說呪曰：
^lb^cb#59a10「阿梨(一)那梨(二)㝹那梨(三)阿那盧(四)那履(五)^lb拘那履(六)
^lb^cb#59a12「世尊！以是神呪擁護法師，我亦自當擁護持^lb是經者，令百由旬內無諸衰患。」
^cb#59a13爾時持國天^pb51王在此會中，與千萬億那由他乾闥婆眾，恭^lb敬圍繞，前詣佛所，合掌白佛言：「世尊！我亦以^lb陀羅尼神呪，擁護持法華經者。」即說呪曰：
^lb^cb#59a18「阿伽禰(一)伽禰(二)瞿利(三)乾陀利(四)旃陀^lb利(五)摩蹬耆(六)常求利(七)浮樓莎柅(八)頞^lb(音遏)底(九)
^pb52^cb#59a20「世尊！是陀羅尼神呪，四十二億諸佛所說，若^lb有侵毀此法師者，則為侵毀是諸佛已。」
^cb#59a22爾時^lb有羅剎女等，一名藍婆，二名毘藍婆，三名曲^lb齒，四名華齒，五名黑齒，六名多髮，七名無厭^lb足，八名持瓔珞，九名睪帝，十名奪一切眾生^lb精氣，是十羅剎女，與鬼子母，并其子及眷屬，^pb53俱詣佛所，同聲白佛言：「世尊！我等亦欲擁護^lb讀誦受持法華經者，除其衰患，若有伺求法^lb師短者，令不得便。」即於佛前，而說呪曰：
^lb^cb#59b01「伊提履(一)伊提泯(二)伊提履(三)阿提履(四)伊^lb提履(五)泥履(六)泥履(七)泥履(八)泥履(九)泥履^lb(十)樓醯(十一)樓醯(十二)樓醯(十三)樓醯(十四)多醯^pb54(十五)多醯(十六)多醯(十七)兜醯(十八)㝹醯(十九)
^lb^cb#59b05「寧上我頭上，莫惱於法師。
若夜叉、若羅剎、若^lb餓鬼、若富單那、若吉遮、若毘陀羅、若犍馱、若^lb烏摩勒伽、若阿跋摩羅、若夜叉吉遮、若人吉^lb遮，若熱病若一日、若二日、若三日、若四日乃^lb至七日，若常熱病，若男形、若女形、若童男形、^pb55若童女形，乃至夢中，亦復莫惱。」即於佛前、而^lb說偈言：
^lb^gatha「若不順我呪，　　惱亂說法者，
　頭破作七分，　　^lb如阿梨樹枝。
　如殺父母罪，　　亦如壓油殃，
　^gatha斗秤欺誑人，　　調達破僧罪。
　犯此法師者，　　^lb當獲如是殃。」
^pb56^cb#59b17諸羅剎女說此偈已，白佛言：「世尊！我等亦當^lb身自擁護受持、讀誦、修行是經者，令得安隱，離諸衰患，消眾毒藥。」
^cb#59b19佛告諸羅剎女：「善哉，善^lb哉！汝等但能擁護受持法華名者，福不可量，^lb何況擁護具足受持，供養經卷——華、香、瓔珞，末^lb香、塗香、燒香，幡蓋、伎樂；燃種種燈：酥燈、油燈、^pb57諸香油燈、蘇摩那華油燈、瞻蔔華油燈、婆師^lb迦華油燈、優鉢羅華油燈，如是等百千種供^lb養者。
睪帝！汝等及眷屬，應當擁護如是法師。」
^lb^cb#59b26說是陀羅尼品時，六萬八千人、得無生法忍。
^lb^ck27〔妙莊嚴王本事品第二十七〕
^lb^cb#59b29爾時佛告諸大眾：「乃往古世，過無量無邊不^pb58可思議阿僧祇劫，有佛名雲雷音宿王華智^lb多陀阿伽度、阿羅訶、三藐三佛陀，國名光明^lb莊嚴，劫名憙見。
彼佛法中有王，名妙莊嚴，其^lb王夫人名曰淨德，有二子，一名淨藏，二名淨^lb眼。
是二子有大神力，福德智慧，久修菩薩所^lb行之道，所謂檀波羅蜜、尸羅波羅蜜、羼提波^pb59羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜、^lb方便波羅蜜，慈悲喜捨，乃至三十七品助道^lb法皆悉明了通達。
又得菩薩淨三昧、日星宿^lb三昧、淨光三昧、淨色三昧、淨照明三昧、長莊^lb嚴三昧、大威德藏三昧，於此三昧亦悉通達。
^lb^cb#59c12「爾時彼佛欲引導妙莊嚴王，及愍念眾生故，^pb60說是法華經。
時淨藏、淨眼二子到其母所，合^lb十指爪掌白言：『願母往詣雲雷音宿王華智^lb佛所，我等亦當侍從，親近、供養、禮拜。
所以者^lb何？此佛於一切天人眾中說法華經，宜應聽^lb受。』母告子言：『汝父信受外道，深著婆羅門法，^lb汝等應往白父，與共俱去。』淨藏、淨眼合十指^pb61爪掌白母：『我等是法王子，而生此邪見家。』母^lb告子言：『汝等當憂念汝父，為現神變，若得見^lb者，心必清淨，或聽我等，往至佛所。』
於是二子^lb念其父故，踊在虛空，高七多羅樹，現種種神^lb變——於虛空中行住坐臥；身上出水、^lb身下出火，身下出水、身上出火；或現大身滿虛空中，而^pb62復現小，小復現大；於空中滅，忽然在地；入地^lb如水，履水如地。
現如是等種種神變，令其父^lb王心淨信解。
時父見子神力如是，心大歡喜，^lb得未曾有，合掌向子言：『汝等，師為是誰，誰之^lb弟子？』二子白言：『大王！彼雲雷音宿王華智佛，^lb今在七寶菩提樹下法座上坐，於一切世間^pb63天人眾中廣說法華經，是我等師，我是弟子。』
^lb父語子言：『我今亦欲見汝等師，可共俱往。』於^lb是二子從空中下，到其母所，合掌白母：『父王^lb今已信解，堪任發阿耨多羅三藐三菩提心。
^lb我等為父已作佛事，願母見聽，於彼佛所出^lb家修道。』
^cb#60a20「爾時二子欲重宣其意，以偈白母：
^pb64^gatha「『願母放我等，　　出家作沙門，
　　諸佛甚難值，　　^lb我等隨佛學。
　　如優曇鉢羅，　　值佛復難是，
　　^lb脫諸難亦難，　　願聽我出家。』
^lb^cb#60a26「母即告言：『聽汝出家。所以者何？佛難值故。』
^cb#60a27「於^lb是二子白父母言：『善哉，父母！願時往詣雲雷^lb音宿王華智佛所，親近供養。
所以者何？佛難^pb65得值，如優曇鉢羅華，又如一眼之龜，值浮木^lb孔。
而我等宿福深厚，生值佛法，是故父母當^lb聽我等，令得出家。所以者何？諸佛難值，時亦^lb難遇。』
^cb#60b03「彼時妙莊嚴王後宮八萬四千人，皆悉^lb堪任受持是法華經。
淨眼菩薩，於法華三昧，^lb久已通達；淨藏菩薩，已於無量百千萬億劫^pb66通達離諸惡趣三昧，欲令一切眾生離諸惡^lb趣故。
其王夫人，得諸佛集三昧，能知諸佛祕^lb密之藏。
^cb#60b08「二子如是以方便力善化其父，令心^lb信解，好樂佛法。
於是妙莊嚴王與群臣眷屬^lb俱，淨德夫人與後宮婇女眷屬俱，其王二子^lb與四萬二千人俱，一時共詣佛所。
到已，頭面^pb67禮足，繞佛三匝，却住一面。
^cb#60b14「爾時彼佛為王說^lb法，示教利喜。王大歡悅。
爾時妙莊嚴王及其^lb夫人，解頸真珠瓔珞，價直百千，以散佛上，於^lb虛空中化成四柱寶臺，臺中有大寶床，敷百^lb千萬天衣，其上有佛結加趺坐，放大光明。
爾^lb時妙莊嚴王作是念：『佛身希有，端嚴殊特，成^pb68就第一微妙之色。』時雲雷音宿王華智佛告^lb四眾言：『汝等見是妙莊嚴王，於我前合掌立^lb不？此王於我法中作比丘，精勤修習，助佛道^lb法，當得作佛，號娑羅樹王，國名大光，劫名大^lb高王。
其娑羅樹王佛，有無量菩薩眾及無量^lb聲聞，其國平正，功德如是。』其王即時以國付^pb69弟，與夫人、二子并諸眷屬，於佛法中出家修^lb道。
^cb#60b27「王出家已，於八萬四千歲，常勤精進修行^lb妙法華經。
過是已後，得一切淨功德莊嚴三^lb昧，即昇虛空，高七多羅樹，而白佛言：『世尊！此^lb我二子，已作佛事，以神通變化轉我邪心，令^lb得安住於佛法中，得見世尊。
此二子者，是我^pb70善知識，為欲發起宿世善根，饒益我故，來生^lb我家。』
^cb#60c05「爾時，雲雷音宿王華智佛告妙莊嚴王^lb言：『如是，如是！如汝所言。
若善男子、善女人，種^lb善根故，世世得善知識，其善知識，能作佛事，^lb示教利喜，令入阿耨多羅三藐三菩提。
大王！^lb當知善知識者是大因緣，所謂化導令得見^pb71佛，發阿耨多羅三藐三菩提心。
大王！汝見此^lb二子不？此二子，已曾供養六十五百千萬億^lb那由他恒河沙諸佛，親近恭敬，於諸佛所受^lb持法華經，愍念邪見眾生，令住正見。』妙莊嚴^lb王即從虛空中下，而白佛言：
『世尊！如來甚希^lb有，以功德智慧故，頂上肉髻光明顯照，其眼^pb72長廣而紺青色，眉間毫相白如珂月，齒白齊^lb密常有光明，脣色赤好如頻婆果。』
^cb#60c18「爾時妙莊^lb嚴王，讚歎佛如是等無量百千萬億功德已，^lb於如來前，一心合掌，復白佛言：『世尊！未曾有^lb也。
如來之法，具足成就不可思議微妙功德，^lb教誡所行，安隱快善，我從今日，不復自隨心^pb73行，不生邪見、憍慢、瞋恚諸惡之心。』說是語已，^lb禮佛而出。」
^cb#60c23佛告大眾：「於意云何？妙莊嚴王，豈^lb異人乎？今華德菩薩是。
其淨德夫人，今佛前^lb光照莊嚴相菩薩是。哀愍妙莊嚴王及諸眷^lb屬故，於彼中生。其二子者，今藥王菩薩、藥上^lb菩薩是。是藥王、藥上菩薩，成就如此諸大功^pb74德，已於無量百千萬億諸佛所殖眾德本，成^lb就不可思議諸善功德。
若有人識是二菩薩^lb名字者，一切世間諸天人民亦應禮拜。」
^cb#61a02佛說^lb是妙莊嚴王本事品時，八萬四千人遠塵離^lb垢，於諸法中得法眼淨。
^lb^ck28〔普賢菩薩勸發品第二十八〕
^pb75^cb#61a06爾時普賢菩薩，以自在神通力，威德名聞，與^lb大菩薩無量無邊不可稱數，從東方來。
所經^lb諸國，普皆震動，雨寶蓮華，作無量百千萬億^lb種種伎樂。
又與無數諸天、龍、夜叉、乾闥婆、阿^lb修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，大^lb眾圍繞，各現威德神通之力，到娑婆世界耆^pb76闍崛山中，頭面禮釋迦牟尼佛，右繞七匝，白^lb佛言：
「世尊，我於寶威德上王佛國，遙聞此娑^lb婆世界說法華經，與無量無邊百千萬億諸^lb菩薩眾共來聽受，唯願世尊當為說之。
若善^lb男子、善女人，於如來滅後，云何能得是法華^lb經？」
^cb#61a17佛告普賢菩薩：「若善男子、善女人，成就四^pb77法，於如來滅後，當得是法華經：一者、為諸佛^lb護念，二者、殖眾德本，三者、入正定聚，四者、發^lb救一切眾生之心。
善男子、善女人，如是成就^lb四法，於如來滅後，必得是經。」
^cb#61a22爾時普賢菩薩^lb白佛言：「世尊！於後五百歲、濁惡世中，其有受^lb持是經典者，我當守護，除其衰患，令得安隱，^pb78使無伺求得其便者，若魔、若魔子、若魔女、若^lb魔民、若為魔所著者，若夜叉、若羅剎、若鳩槃^lb茶、若毘舍闍、若吉遮、若富單那、若韋陀羅等，^lb諸惱人者，皆不得便。
是人若行、若立、讀誦此^lb經，我爾時乘六牙白象王，與大菩薩眾俱詣^lb其所，而自現身，供養守護，安慰其心，亦為供^pb79養法華經故。
是人若坐、思惟此經，爾時我復^lb乘白象王現其人前，其人若於法華經有所^lb忘失一句一偈，我當教之，與共讀誦，還令通^lb利。
爾時受持讀誦法華經者，得見我身，甚大^lb歡喜，轉復精進，以見我故，即得三昧及陀羅^lb尼，名為旋陀羅尼、百千萬億旋陀羅尼、法音^pb80方便陀羅尼，得如是等陀羅尼。
^cb#61b09「世尊！若後世^lb後五百歲、濁惡世中，比丘、比丘尼、優婆塞、優^lb婆夷，求索者、受持者、讀誦者、書寫者，欲修習^lb是法華經，於三七日中，應一心精進。
滿三七^lb日已，我當乘六牙白象，與無量菩薩而自圍^lb繞，以一切眾生所憙見身，現其人前，而為說^pb81法，示教利喜，亦復與其陀羅尼呪，得是陀羅^lb尼故，無有非人能破壞者，亦不為女人之所^lb惑亂，我身亦自常護是人。唯願世尊聽我說^lb此陀羅尼呪。」即於佛前而說呪曰：
^lb^cb#61b19「阿檀地(途賣反)(一)檀陀婆地(二)檀陀婆帝(三)檀陀鳩^lb舍隷(四)檀陀修陀隷(五)修陀隷(六)修陀羅婆^pb82底(七)佛馱波羶禰(八)薩婆陀羅尼阿婆多尼^lb(九)薩婆婆沙阿婆多尼(十)修阿婆多尼(十一)僧^lb伽婆履叉尼(十二)僧伽涅伽陀尼(十三)阿僧祇(十四)^lb僧伽波伽地(十五)帝隷阿惰僧伽兜略(盧遮反)阿^lb羅帝婆羅帝(十六)薩婆僧伽三摩地伽蘭地^lb(十七)薩婆達磨修波利剎帝(十八)薩婆薩埵樓馱^pb83憍舍略阿㝹伽地(十九)辛阿毘吉利地帝(二十)
^lb^cb#61b28「世尊！若有菩薩得聞是陀羅尼者，當知普賢^lb神通之力，若法華經行閻浮提，有受持者，應^lb作此念：『皆是普賢威神之力。』若有受持、讀誦，^lb正憶念，解其義趣，如說修行，當知是人行^lb普賢行，於無量無邊諸佛所深種善根，為諸如^pb84來手摩其頭。
若但書寫，是人命終，當生忉利^lb天上，是時八萬四千天女作眾伎樂而來迎^lb之，其人即著七寶冠，於婇女中娛樂快樂；
何^lb況受持、讀誦，正憶念，解其義趣，如說修行。
若^lb有人受持、讀誦，解其義趣，是人命終，為千佛^lb授手，令不恐怖，不墮惡趣，即往兜率天上彌^pb85勒菩薩所。
彌勒菩薩，有三十二相大菩薩眾^lb所共圍繞，有百千萬億天女眷屬，而於中生，^lb有如是等功德利益。
是故智者，應當一心自^lb書、若使人書，受持、讀誦，正憶念，如說修行。
^cb#61c14「世^lb尊！我今以神通力故，守護是經，於如來滅後^lb閻浮提內，廣令流布，使不斷絕。」
^cb#61c16爾時釋迦牟^pb86尼佛讚言：「善哉，善哉！普賢！汝能護助是經，令^lb多所眾生安樂利益。
汝已成就不可思議功^lb德，深大慈悲，從久遠來，發阿耨多羅三藐三^lb菩提意，而能作是神通之願，守護是經。
我當^lb以神通力，守護能受持普賢菩薩名者。
^cb#61c21「普賢！^lb若有受持、讀誦，正憶念，修習、書寫是法華經^pb87者，當知是人，則見釋迦牟尼佛，如從佛口聞^lb此經典；當知是人，供養釋迦牟尼佛；當知是^lb人，佛讚善哉；當知是人，為釋迦牟尼佛手摩^lb其頭；當知是人，為釋迦牟尼佛衣之所覆。
如^lb是之人，不復貪著世樂，不好外道經書、手筆，^lb亦復不喜親近其人及諸惡者——若屠兒、若畜^pb88猪羊雞狗、若獵師、若衒賣女色——是人心意質^lb直，有正憶念，有福德力，是人不為三毒所惱，^lb亦不為嫉妬、我慢、邪慢、增上慢所惱，是人少^lb欲知足，能修普賢之行。
^cb#62a09「普賢！若如來滅後後^lb五百歲，若有人見受持、讀誦法華經者，應作^lb是念：『此人不久當詣道場，破諸魔眾，得阿耨^pb89多羅三藐三菩提，轉法輪、擊法鼓、吹法螺、雨^lb法雨，當坐天人大眾中師子法座上。』
^cb#62a13「普賢！若^lb於後世，受持、讀誦是經典者，是人不復貪著^lb衣服、臥具、飲食、資生之物，所願不虛，亦於現^lb世得其福報。
若有人輕毀之，言：『汝狂人耳，空^lb作是行，終無所獲。』如是罪報，當世世無眼；若^pb90有供養讚歎之者，當於今世得現果報。
若復^lb見受持是經者，出其過惡，若實、若不實，此人^lb現世得白癩病。
若有輕笑之者，當世世牙齒踈^lb缺，醜脣、平鼻，手腳繚戾，眼目角睞，身體臭穢，^lb惡瘡、膿血、水腹、短氣、諸惡重病。
是故，普賢！若^lb見受持是經典者，當起遠迎，當如敬佛。」
^cb#62a24說是^pb91普賢勸發品時，恒河沙等無量無邊菩薩，得^lb百千萬億旋陀羅尼；三千大千世界微塵等^lb諸菩薩，具普賢道。
^cb#62a27佛說是經時，普賢等諸菩^lb薩，舍利弗等諸聲聞，及諸天、龍、人非人等，一^lb切大會，皆大歡喜，受持佛語，作禮而去。
^lb妙法蓮華經卷第七^pb92
^folio#ssv1_ruci^bk#ssv_ruci
大寶積經卷[＊]第十七

大唐三藏菩提流志奉　詔譯

無量壽如來會第五之一

如是我聞：

一時佛住王舍城耆闍崛山中，與大比丘眾萬二千人俱，皆是諸大聲聞眾所知識，其名曰：尊者阿若憍陳如、馬勝、大名、有賢、無垢、須跋陀羅、善稱、圓滿、憍梵鉢提、優樓頻䗍迦葉、那提迦葉、伽耶迦葉、摩訶迦葉、舍利弗、大目揵連、摩訶迦旃延、摩訶劫賓那、摩訶注那、滿慈子、阿尼樓馱、離波多、上首王、住彼岸、摩俱羅、難陀、有光、善來、羅睺羅、阿難陀等，而為上首。復有菩薩摩訶薩眾，所謂普賢菩薩、文殊師利菩薩、彌勒菩薩，及賢劫中諸菩薩摩訶薩眾，前後圍繞。

又與賢護等十六丈夫眾俱，所謂善思惟義菩薩、慧辯才菩薩、觀無住菩薩、善化神通菩薩、光幢菩薩、智上菩薩、寂根菩薩、慧願菩薩、香象菩薩、寶幢菩薩等，而為上首，咸共遵修普賢之道，滿足菩薩一切行願，安住一切功德法中，到諸佛法究竟彼岸。願於一切世界之中成等正覺，又願生彼兜率陀天，於彼壽終降生右脇見行七步，放大光明，普佛世界六種震動，而自唱言：「我於一切世間最為尊貴。」釋梵諸天咸來親奉。又見習學書計曆數聲明伎巧醫方養生符印，及餘博戲擅美過人。身處王宮厭諸欲境，見老病死悟世非常，捐捨國位踰城學道。解諸纓絡及迦尸迦，被服袈裟六年苦行，能於五濁剎中作斯示見。順世間故浴尼連河行趣道場，龍王迎讚，諸菩薩眾右繞稱揚。菩薩爾時受草，自敷菩提樹下，結加趺坐。又見魔眾合圍將加危害，菩薩以定慧力降伏魔怨，成無上覺。梵王勸請轉於法輪，勇猛無畏佛音震吼，擊法鼓、吹法螺、建大法幢、然正法炬，攝受正法及諸禪定，雨大法雨澤潤含生，震大法雷開悟一切。諸佛剎土普照大光，世界之中地皆震動，魔宮摧毀驚怖波旬，破煩惱城墮諸見網，遠離黑法生諸白法。於佛施食能受能消，為調眾生宣揚妙理。或見微笑放百千光，昇灌頂階受菩提記，或成佛道見入涅槃，使無量有情皆得漏盡，成熟菩薩無邊善根。如是諸佛剎中皆能示見。譬如幻師善知幻術，而能示見男女等相，於彼相中實無可得。如是如是，諸菩薩等善學無邊幻術功德故，能示見變化相應，能善了知變化之道故，示諸佛土見大慈悲，一切群生普皆饒益。菩薩願行成就無疆，無量義門通達平等，一切善法具足修成。諸佛剎中平等趣入，常為諸佛勸進加威。一切如來識知印可，為教菩薩作阿闍梨。常習相應無邊諸行，通達一切法界所行，能善了知有情及土，亦常發趣供諸如來。見種種身猶如影像，善學因陀羅網能破魔網，壞諸見網入有情網，能超煩惱眷屬及魔侶魔人。遠出聲聞辟支佛地，入空無相無願法門，而能安住方便善巧。初不樂入二乘涅槃，得無生無滅諸三摩地，及得一切陀羅尼門，廣大諸根辯才決定，於菩薩藏法善能了知。佛華三昧隨時悟入，具一切種甚深禪定，一切諸佛皆悉見前，於一念中遍遊佛土，周旋往返不異其時。於難非難邊能了諸邊，敷演實際差別善知，得佛辯才住普賢行。善能分別眾生語言，超過世間一切之法，善知一切出世間法。得資具自在波羅蜜多，荷擔有情為不請友。能持一切如來法藏，安住不斷一切佛種。哀愍有情能開法眼，閉諸惡趣開善趣門。普觀有情能作父母兄弟之想，又觀眾生如己身想。證得一切讚歎功德，波羅蜜多能善了知，讚歎如來一切功德，及餘稱讚諸功德法。如是菩薩摩訶薩眾無量無邊皆來集會。

爾時尊者阿難從坐而起，整理衣服，偏袒右肩右膝著地，合掌向佛，白言：「大德世尊！身色諸根悉皆清淨，威光赫奕如融金聚，又如明鏡凝照光暉。從昔已來初未曾見，喜得瞻仰生希有心。世尊今者入大寂定，行如來行皆悉圓滿，善能建立大丈夫行，思惟去來現在諸佛。世尊何故住斯念耶？」

爾時佛告阿難：「汝今云何能知此義？為有諸天來告汝耶？為以見我及自知耶？」

阿難白佛言

「世尊！我見如來光瑞希有故發斯念，非因天等。」

佛告阿難：「善哉善哉！汝今快問。善能觀察微妙辯才，能問如來如是之義。汝為一切如來、應、正等覺，及安住大悲利益群生如優曇花希有大士出見世間，故問斯義。又為哀愍利樂諸眾生故，能問如來如是之義。阿難！如來、應、正等覺善能開示無量知見。何以故？如來知見無有障礙。阿難！如來、應、正等覺欲樂住世，能於念頃住無量無數百千億那由他劫，若復增過如上數量，而如來身及以諸根無有增減。何以故？如來得三昧自在到於彼岸，於一切法最勝自在。是故阿難！諦聽，善思念之，吾當為汝分別解說。」

阿難白佛言：「唯然世尊！願樂欲聞。」

爾時佛告阿難：「往昔過阿僧祇無數大劫，有佛出現，號曰然燈。於彼佛前極過數量，有苦行佛出興于世。苦行佛前復有如來，號為月面。月面佛前過於數量，有旃檀香佛。於彼佛前有蘇迷盧積佛，盧積佛前復有妙高劫佛。如是展轉，有離垢面佛、不染污佛、龍天佛、山聲王佛、蘇迷盧積佛、金藏佛、照曜光佛、光帝佛、大地種姓佛、光明熾盛琉璃金光佛、月像佛、開敷花莊嚴光佛、妙海勝覺遊戲神通佛、金剛光佛、大阿伽陀香光佛、捨離煩惱心佛、寶增長佛、勇猛積佛、勝積佛、持大功德法施神通佛、映蔽日月光佛、照曜琉璃佛、心覺花佛、月光佛、日光佛、花瓔珞色王開敷神通佛、水月光佛、破無明暗佛、真珠珊瑚蓋佛、底沙佛、勝花佛、法慧吼佛、有師子吼鵝鴈聲佛、梵音龍吼佛。如是等佛出現於世，相去劫數皆過數量。彼龍吼佛未出世前無央數劫，有世主佛。世主佛前無邊劫數有佛出世，號世間自在王如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、世尊。

「阿難！彼佛法中有一比丘名曰法處，有殊勝行願及念慧力增上，其心堅固不動，福智殊勝人相端嚴。阿難！彼法處比丘往詣世間自在王如來所，偏袒右肩頂禮佛足，向佛合掌以頌讚曰：

「『如來無量無邊光，  	舉世無光可能喻，
一切日月摩尼寶，  	佛之光威皆映蔽。
世尊能演一音聲，  	有情各各隨類解，
又能現一妙色身，  	普使眾生隨類見。
戒定慧進及多聞，  	一切有情無與等，
心流覺慧如大海，  	善能了知甚深法。
惑盡過亡應受供，  	如是聖德惟世尊，
佛有殊勝大威光，  	普照十方無量剎。
我今稱讚諸功德，  	冀希福慧等如來，
能救一切諸世間，  	生老病死眾苦惱。
願當安住三摩地，  	演說施戒諸法門，
忍辱精勤及定慧，  	庶當成佛濟群生。
為求無上大菩提，  	供養十方諸妙覺，
百千俱胝那由他，  	極彼恒沙之數量。
又願當獲大神光，  	倍照恒沙億佛剎，
及以無邊勝進力，  	感得殊勝廣淨居。
如是無等佛剎中，  	安處群生當利益，
十方最勝之大士，  	彼皆當往生喜心。
唯佛聖智能證知，  	我今希求堅固力，
縱沈無間諸地獄，  	如是願心終不退。
一切世間無礙智，  	應當了知如是心。』
「復次阿難！法處比丘讚佛德已白言：『世尊！我今發阿耨多羅三藐三菩提心，惟願如來為我演說如是等法，令於世間得無等等成大菩提，具攝清淨莊嚴佛土。』佛告比丘：『汝應自攝清淨佛國。』法處白佛言：『世尊！我無威力堪能攝受，唯願如來說餘佛土清淨莊嚴，我等聞已誓當圓滿。』爾時世尊為其廣說二十一億清淨佛土具足莊嚴，說是法時經于億歲。阿難！法處比丘於彼二十一億諸佛土中所有嚴淨之事悉皆攝受，既攝受已滿足五劫思惟修習。」

阿難白佛言：「世尊！彼世間自在王如來壽量幾何？」

世尊告曰：「彼佛壽量滿四十劫。阿難！彼二十一俱胝佛剎，法處比丘所攝佛國超過於彼。既攝受已，往詣世間自在王如來所，頂禮雙足右繞七匝，却住一面白言：『世尊！我已攝受具足功德嚴淨佛土。』佛言：『今正是時，汝應具說令眾歡喜，亦令大眾皆當攝受圓滿佛土。』

「法處白言：『唯願世尊大慈留聽，我今將說殊勝之願。

「『若我證得無上菩提，國中有地獄、餓鬼、畜生趣者，我終不取無上正覺。

「『若我成佛，國中眾生有墮三惡趣者，我終不取正覺。

「『若我成佛，國中有情若不皆同真金色者，不取正覺。

「『若我成佛，國中有情形貌差別有好醜者，不取正覺。

「『若我成佛，國中有情不得宿念，下至不知億那由他百千劫事者，不取正覺。

「『若我成佛，國中有情若無天眼，乃至不見億那由他百千佛國土者，不取正覺。

「『若我成佛，國中有情不獲天耳，乃至不聞億那由他百千踰繕那外佛說法者，不取正覺。

「『若我成佛，國中有情無他心智，乃至不知億那由他百千佛國土中有情心行者，不取正覺。

「『若我成佛，國中有情不獲神通自在波羅蜜多，於一念頃不能超過億那由他百千佛剎者，不取正覺。

「『若我成佛，國中有情起於少分我我所想者，不取菩提。

「『若我成佛，國中有情若不決定成等正覺、證大涅槃者，不取菩提。

「『若我成佛，光明有限，下至不照億那由他百千及算數佛剎者，不取菩提。

「『若我成佛，壽量有限，乃至俱胝那由他百千及算數劫者，不取菩提。

「『若我成佛，國中聲聞無有知其數者，假使三千大千世界滿中有情及諸緣覺，於百千歲盡其智算亦不能知；若有知者，不取正覺。

「『若我成佛，國中有情壽量有限齊者，不取菩提；唯除願力而受生者。

「『若我成佛，國中眾生若有不善名者，不取正覺。

「『若我成佛，彼無量剎中無數諸佛不共諮嗟稱歎我國者，不取正覺。

「『若我證得無上覺時，餘佛剎中諸有情類聞我名已，所有善根心心迴向願生我國，乃至十念若不生者，不取菩提；唯除造無間惡業、誹謗正法及諸聖人。

「『若我成佛，於他剎土有諸眾生發菩提心，及於我所起清淨念，復以善根迴向願生極樂。彼人臨命終時，我與諸比丘眾現其人前。若不爾者，不取正覺。

「『若我成佛，無量國中所有眾生聞說我名，以己善根迴向極樂。若不生者，不取菩提。

「『若我成佛，國中菩薩皆不成就三十二相者，不取菩提。

「『若我成佛，於彼國中所有菩薩，於大菩提咸悉位階一生補處。唯除大願諸菩薩等，為諸眾生被精進甲，勤行利益修大涅槃，遍諸佛國行菩薩行，供養一切諸佛如來，安立恒沙眾生住無上覺，所修諸行復勝於前，行普賢道而得出離。若不爾者，不取菩提。

「『若我成佛，國中菩薩每於晨朝供養他方乃至無量億那由他百千諸佛，以佛威力即以食前還到本國。若不爾者，不取菩提。

「『若我成佛，於彼剎中諸菩薩眾所須種種供具，於諸佛所殖諸善根，如是色類不圓滿者，不取菩提。

「『若我當成佛時，國中菩薩說諸法要不善順入一切智者，不取菩提。

「『若我成佛，彼國所生諸菩薩等若無那羅延堅固力者，不取正覺。

「『若我成佛，周遍國中諸莊嚴具，無有眾生能總演說，乃至有天眼者不能了知所有雜類形色光相。若有能知及總宣說者，不取菩提。

「『若我成佛，國中具有無量色樹高百千由旬，諸菩薩中有善根劣者若不能了知，不取正覺。

「『若我成佛，國中眾生讀誦經典教授敷演，若不獲得勝辯才者，不取菩提。

「『若我成佛，國中菩薩有不成就無邊辯才者，不取菩提。

「『若我成佛，國土光淨遍無與等，徹照無量無數不可思議諸佛世界，如明鏡中現其面像。若不爾者，不取菩提。

「『若我成佛，國界之內地及虛空有無量種香，復有百千億那由他數眾寶香鑪，香氣普熏遍虛空界，其香殊勝超過人天珍，奉如來及菩薩眾。若不爾者，不取菩提。

「『若我成佛，周遍十方無量無數不可思議無等界眾生之輩，蒙佛威光所照觸者，身心安樂超過人天。若不爾者，不取正覺。

「『若我成佛，無量不可思議無等界諸佛剎中菩薩之輩聞我名已，若不證得離生、獲陀羅尼者，不取正覺。

「『若我成佛，周遍無數不可思議無有等量諸佛國中所有女人，聞我名已得清淨信，發菩提心厭患女身。若於來世不捨女人身者，不取菩提。

「『若我成佛，無量無數不可思議無等佛剎菩薩之眾，聞我名已得離生法，若不修行殊勝梵行，乃至到於大菩提者，不取正覺。

「『若我成佛，周遍十方無有等量諸佛剎中所有菩薩，聞我名已五體投地，以清淨心修菩薩行。若諸天人不禮敬者，不取正覺。

「『若我成佛，國中眾生所須衣服隨念即至，如佛命：「善來，比丘。」法服自然在體。若不爾者，不取菩提。

「『若我成佛，諸眾生類纔生我國中，若不皆獲資具心淨安樂如得漏盡諸比丘者，不取菩提。

「『若我成佛，國中群生隨心欲見諸佛淨國殊勝莊嚴，於寶樹間悉皆出現，猶如明鏡見其面像。若不爾者，不取菩提。

「『若我成佛，餘佛剎中所有眾生聞我名已，乃至菩提諸根有闕、德用非廣者，不取菩提。

「『若我成佛，餘佛剎中所有菩薩聞我名已，若不皆善分別勝三摩地名字語言，菩薩住彼三摩地中，於一剎那言說之頃不能供養無量無數不可思議無等諸佛，又不現證六三摩地者，不取正覺。

「『若我成佛，餘佛土中有諸菩薩聞我名已，壽終之後若不得生豪貴家者，不取正覺。

「『若我成佛，餘佛剎中所有菩薩聞我名已，若不應時修菩薩行，清淨歡喜得平等住具諸善根，不取正覺。

「『若我成佛，他方菩薩聞我名已，皆得平等三摩地門，住是定中常供無量無等諸佛，乃至菩提終不退轉。若不爾者，不取正覺。

「『若我成佛，國中菩薩隨其志願，所欲聞法自然得聞。若不爾者，不取正覺。

「『若我證得無上菩提，餘佛剎中所有菩薩聞我名已，於阿耨多羅三藐三菩提有退轉者，不取正覺。

「『若我成佛，餘佛國中所有菩薩若聞我名，應時不獲一二三忍、於諸佛法不能現證不退轉者，不取菩提。』」

爾時佛告阿難：「彼法處比丘於世間自在王如來前發此願已，承佛威神而說頌曰：

「『今對如來發弘誓，  	當證無上菩提日，
若不滿足諸上願，  	不取十力無等尊。
心或不堪常行施，  	廣濟貧窮免諸苦，
利益世間使安樂，  	不成救世之法王。
我證菩提坐道場，  	名聞不遍十方界，
無量無邊異佛剎，  	不取十力世中尊。
方趣無上大菩提，  	出家為求於欲境，
於彼念慧行無有，  	不作調御天人師。
願獲如來無量光，  	普照十方諸佛土，
能滅一切貪恚癡，  	亦斷世間諸惡趣。
願得光開淨慧眼，  	於諸有中破冥暗，
除滅諸難使無餘，  	安處天人大威者。
修習本行已清淨，  	獲得無量勝威光，
日月諸天摩尼火，  	所有光暉皆映蔽。
最勝丈夫修行已，  	於彼貧窮為伏藏，
圓滿善法無等倫，  	於大眾中師子吼。
往昔供養自然智，  	多劫勤修諸苦行，
為求最勝諸慧蘊，  	滿足本願天人尊。
如來知見無所礙，  	一切有為皆能了，
願我當成無與等，  	最勝智者真導師。
我若當證大菩提，  	如斯弘誓實圓滿，
願動三千大千界，  	天眾空中皆雨花。
是時大地咸震動，  	天花鼓樂滿虛空，
并雨栴檀細末香，  	唱言未來當作佛。』」
佛告阿難：「彼法處比丘於世間自在王如來。及諸天人魔梵沙門婆羅門等前，廣發如是大弘誓願，皆已成就世間希有。發是願已，如實安住種種功德，具足莊嚴威德廣大清淨佛土。修習如是菩薩行時，經於無量無數不可思議無有等等億那由他百千劫內，初未曾起貪瞋及癡欲害恚想，不起色聲香味觸想，於諸眾生常樂愛敬猶如親屬，其性溫和易可同處。有來求者不逆其意，善言勸諭無不從心，資養所須趣支身命。少欲知足常樂虛閑，稟識聰明而無矯妄。其性調順無有暴惡，於諸有情常懷慈忍。心不詐諂亦無懈怠，善言策進求諸白法。普為群生勇猛無退，利益世間大願圓滿。奉事師長敬佛法僧，於菩薩行常被甲冑，志樂寂靜離諸染著。為令眾生常修白法，於善法中而為上首，住空無相無願、無作無生、不起不滅無有憍慢。而彼正士行菩薩道時，常護語言，不以語言害他及己，常以語業利己及人。若入王城及諸村落，雖見諸色心無所染，以清淨心不愛不恚。菩薩爾時於檀波羅蜜起自行已，又能令他行於惠施。於尸波羅蜜乃至般若波羅蜜，起前二行皆悉圓滿。由成如是諸善根故，所生之處有無量億那由他百千伏藏自然涌出，復令無量無數不可思議無等無邊諸眾生類，安住阿耨多羅三藐三菩提。如是無邊諸菩薩眾起諸妙行，供養奉事於諸世尊乃至成佛，皆不可以語言分別之所能知。或作輪王、帝釋、蘇焰摩天、兜率陀天、善化天、他化自在天、大梵天王，皆能奉事供養諸佛，及能請佛轉於法輪。若作閻浮提王及諸長者、宰官、婆羅門、剎帝利等，諸種姓中皆能尊重供養諸佛，又能演說無量法門。從此永棄世間，成無上覺。然彼菩薩能以上妙衣服臥具飲食醫藥，盡形供養一切如來得安樂住。如是種種圓滿善根，非以語言能盡邊際。口中常出栴檀妙香，其香普熏無量無數乃至億那由他百千世界，復從一切毛孔出過人天優鉢羅花上妙香氣。隨所生處，相好端嚴殊勝圓滿。又得諸資具自在波羅蜜多，一切服用周遍無乏。所謂諸寶香花幢幡繒蓋、上妙衣服飲食湯藥，及諸伏藏珍玩所須，皆從菩薩掌中自然流出，身諸毛孔流出一切人天音樂。由是因緣，能令無量無數不可思議諸眾生等，安住阿耨多羅三藐三菩提。阿難！我今已說法處菩薩本所修行。」

爾時阿難白佛言：「世尊！彼法處菩薩成菩提者，為過去耶？為未來耶？為今現在他方世界耶？」

佛告阿難：「西方去此十萬億佛剎，彼有世界名曰極樂。法處比丘在彼成佛，號無量壽，今現在說法，無量菩薩及聲聞眾恭敬圍繞。

「阿難！彼佛光明普照佛剎無量無數不可思議，我今略說，光照東方如恒河沙等國土，南西北方四維上下亦復如是，唯除諸佛本願威神所加，悉皆照燭。是諸佛光，或有加一尋者，或有加一由旬乃至億那由他百千由旬光者，或普照佛剎者。阿難，以是義故，無量壽佛復有異名，謂無量光、無邊光、無著光、無礙光、光照王端嚴光、愛光、喜光、可觀光、不思議光、無等光、不可稱量光、映蔽日光、映蔽月光、掩奪日月光。彼之光明清淨廣大，普令眾生身心悅樂，復令一切餘佛剎中天、龍、夜叉、阿修羅等皆得歡悅。阿難！我今開示彼佛光明，滿足一劫說不能盡。

「復次阿難！彼無量壽如來，諸聲聞眾不可稱量知其邊際。假使比丘滿億那由他百千數量，皆如大目揵連神通自在，於晨朝時周歷大千世界、須臾之頃還至本處，彼經億那由他百千歲數欲共計算無量壽佛初會之中諸聲聞眾，盡其神力乃至滅度，於百分中不知其一、於千分百千分乃至鄔波尼殺曇分中亦不知其一。阿難！譬如大海深八萬四千由旬，以目極觀不知邊際。若有丈夫析一毛端為五十分，以其一分於大海中霑取一滴。阿難！彼之水滴比於大海，何者為多？」

阿難白言：「假使取千由旬水，猶以為少，況以毛端一分而可方之！」

佛告阿難：「假使比丘滿億那由他百千數量，皆如大目揵連，經百千億那由他歲皆共算數彼無量壽如來初會聲聞，所知數量如彼毛端一滴之水，餘不測者猶如大海。諸菩薩摩訶薩眾亦復如是，非以算計之所能知。

「阿難！彼佛壽命無量無邊，不可知其劫數多少；聲聞、菩薩及諸天人，壽量亦爾。」

阿難白佛言：「世尊！彼佛出世于今幾時，能得如是無量壽命？」

佛告阿難：「彼佛受生，經今十劫。

「復次阿難！彼極樂界無量功德具足莊嚴，國土豐稔天人熾盛，志意和適常得安隱，無有地獄、畜生及琰魔王界。有種種香周遍芬馥，種種妙花亦皆充滿。有七寶幢周布行列，其寶幢上懸諸幡蓋及眾寶鈴，具足百千諸妙雜色。

「阿難！彼如來國多諸寶樹，或純黃金、白銀、琉璃、頗梨、赤珠、馬瑙、玉樹，唯一寶成不雜餘寶，或以二寶乃至七寶莊嚴。阿難！彼金為樹者，以金為根莖，白銀為葉及以花果。白銀之樹，銀為根莖，黃金為葉及以花果。馬瑙之樹，馬瑙根莖，美玉為葉及以花果。美玉樹者，玉為根莖，七寶為葉及諸花果。或有金樹，黃金為根，白銀為莖，琉璃為枝，頗梨為條，赤珠為葉，馬瑙為花，美玉為果。或有銀樹，以銀為根，黃金為莖，餘枝果等飾同金樹。琉璃樹者，琉璃為根，黃金為莖，白銀為枝，頗梨為條，赤珠為葉，馬瑙為花，美玉為果。頗梨、真珠、馬瑙等樹，諸寶轉飾皆若琉璃。復有玉樹，玉為其根，黃金為莖，白銀為枝，琉璃為條，頗梨為葉，赤珠為花，馬瑙為果。復有無量摩尼珠等寶莊嚴樹，周遍其國。是諸寶樹光輝赫奕世無能比，以七寶羅網而覆其上，其網柔軟如兜羅綿。

「復次阿難！無量壽佛有菩提樹，高十六億由旬，枝葉垂布八億由旬。樹本隆起高五千由旬，周圓亦爾。其條葉花果常有無量百千種種妙色，及諸珍寶殊勝莊嚴，謂月光摩尼寶、釋迦毘楞伽寶、心王摩尼寶、海乘流注摩尼寶，光輝遍照超過人天。於其樹上有諸金鎖垂寶瓔珞周遍莊嚴，謂盧遮迦寶、末瑳寶，及赤白青色真珠等寶以為瓔珞。有師子雲聚寶等以為其鎖，飾諸寶柱。又以純金真珠雜寶鈴鐸以為其網，莊嚴寶鎖彌覆其上，以頗梨萬字半月寶等互相映飾，微風吹動出種種聲，令千世界諸眾生等隨樂差別，於甚深法證無生忍。阿難！彼千世界諸有情等聞此音已，住不退轉無上菩提，及無量無數有情得無生法忍。

「復次阿難！若有眾生見菩提樹、聞聲、嗅香、嘗其果味、觸其光影、念樹功德，由此因緣乃至涅槃，五根無患心無散亂，皆於阿耨多羅三藐三菩提得不退轉。復由見彼菩提樹故獲三種忍。何等為三？一者隨聲忍，二者隨順忍，三者無生法忍。此皆無量壽佛本願威神見所加，及往修靜慮無比喻故、無缺減故、善修習故、善攝受故、善成就故。

大寶積經卷第十七

^folio#ssv2_ruci
大寶積經卷[＊]第十八
[＊]大唐[＊]三藏菩提流志奉　詔譯

無量壽會第五之二
「復次阿難！彼極樂界，無諸黑山、鐵圍山、大鐵圍山、妙高山等。」

阿難白佛言：「世尊！其四天王天、三十三天，既無諸山，依何而住？」

佛告阿難：「於汝意云何？妙高已上有夜摩天乃至他化自在天，及色界諸天等，依何而住？」

阿難白佛言：「世尊！不可思議業力所致。」

佛語阿難：「不思議業汝可知耶？」

答言：「不也。」

佛告阿難：「諸佛及眾生善根業力，汝可知耶？」

答言：「不也。世尊！我今於此法中實無所惑，為破未來疑網故發斯問。」

佛告阿難：「彼極樂界，其地無海而有諸河，河之狹者滿十由旬，水之淺者十二由旬，如是諸河深廣之量或二十、三十乃至百數，或有極深廣者至千由旬。其水清冷具八功德，濬流恒激出微妙音，譬若諸天百千伎樂，安樂世界其聲普聞。有諸名花沿流而下，和風微動出種種香。居兩岸邊多栴檀樹，修條密葉交覆於河，結實開花芳輝可玩。群生遊樂隨意往來，或有涉河濯流嬉戲，感諸天水善順物宜，深淺寒溫曲從人好。阿難！大河之下地布金砂，有諸天香世無能喻，隨風散馥，雜水流馚。天曼陀羅花、優鉢羅花、波頭摩花、拘物頭華、芬陀利花彌覆其上。

「復次阿難！彼國人眾或時遊覽同萃河濱，有不願聞激流之響，雖獲天耳終竟不聞。或有願聞，即時領悟百千萬種喜愛之聲，所謂佛法僧聲、止息之聲、無性聲、波羅蜜聲、十力四無所畏聲、神通聲、無作聲、無生無滅聲、寂靜聲、邊寂靜聲、極寂靜聲、大慈大悲聲、無生法忍聲、灌頂受位聲。得聞如是種種聲已，獲得廣大愛樂歡悅，而與觀察相應、厭離相應、滅壞相應、寂靜相應、邊寂靜相應、極寂靜相應、義味相應、佛法僧相應、力無畏相應、神通相應、止息相應、菩提相應、聲聞相應、涅槃相應。

「復次阿難！彼極樂世界，不聞諸惡趣名、邊無障礙煩惱覆蔽名、無有地獄琰摩畜生名、邊無八難名，亦無苦受不苦不樂受名，尚無假設何況實苦，是故彼國名為極樂。阿難！我今略說極樂因緣，若廣說者窮劫不盡。

「復次阿難！彼極樂世界所有眾生，或已生、或現生、或當生，皆得如是諸妙色身，形貌端正神通自在，福力具足，受用種種宮殿園林、衣服飲食、香華瓔珞，隨意所須悉皆如念，譬如他化自在諸天。

「復次阿難！彼佛國中有微細食，諸有情類嘗無噉者，如第六天隨所思念如是飲食即同食已，色力增長而無便穢。復有無量如意妙香、塗香、末香，其香普熏彼佛國界。及散花幢幡亦皆遍滿。其有欲聞香者隨願即聞，或不樂者終無所受。復有無量上妙衣服寶冠、環釧耳璫、瓔珞花鬘帶鎖，諸寶莊嚴，無量光明百千妙色悉皆具足，自然在身。復有金銀真珠妙寶之網，懸諸寶鈴周遍嚴飾。若諸有情所須宮殿樓閣等，隨所樂欲高下長短廣狹方圓，及諸床座妙衣敷上，以種種寶而嚴飾之，於眾生前自然出現，人皆自謂各處其宮。

「復次阿難！極樂國土所有眾生無差別相，順餘方俗有天人名。阿難！譬如下賤半挓迦人，對於輪王則無可諭，威光德望悉皆無有。又如帝釋方第六天，威光等類皆所不及，園苑宮殿、衣服雜飾、尊貴自在、階位神通及以變化不可為比，唯受法樂則無差別。阿難應知，彼國有情猶如他化自在天王。

「阿難！彼極樂界於晨朝時，周遍四方和風微動不逆不亂，吹諸雜花種種香氣，其香普熏周遍國界。一切有情為風觸身，安和調適猶如比丘得滅盡定。其風吹動七寶樹林，華飄成聚高七人量，種種色光照曜佛土。譬如有人以花布地手按令平，隨雜色花間錯分布。彼諸花聚亦復如是，其花微妙廣大柔軟如兜羅綿，若諸有情足蹈彼花沒深四指，隨其舉足還復如初。過晨朝已其花自然沒入於地，舊花既沒大地清淨，更雨新花還復周遍。如是中時、晡時、初中後夜，飄花成聚亦復如是。阿難！一切廣大珍奇之寶，無有不生極樂界者。

「阿難！彼佛國中有七寶蓮花，一一蓮花有無量百千億葉，其葉有無量百千珍奇異色，以百千摩尼妙寶莊嚴，覆以寶網轉相映飾。阿難！彼蓮花量或半由旬，或一二三四乃至百千由旬者。是一一花出三十六億那由他百千光明，一一光中出三十六億那由他百千諸佛，身如金色，具三十二大丈夫相、八十隨好，殊勝莊嚴，放百千光普照世界。是諸佛等，現往東方為眾說法，皆為安立無量有情於佛法中；南西北方四維上下亦復如是。

「復次阿難！極樂世界無有昏闇亦無火光，涌泉陂湖彼皆非有，亦無住著家室林苑之名，及表示之像幼童色類，亦無日月晝夜之像。於一切處標式既無亦無名號，唯除如來所加威者。

「阿難！彼國眾生若當生者，皆悉究竟無上菩提到涅槃處。何以故？若邪定聚及不定聚，不能了知建立彼因故。

「阿難！東方如恒沙界，一一界中如恒沙佛，彼諸佛等各各稱歎阿彌陀佛無量功德；南西北方四維上下諸佛稱讚亦復如是。何以故？他方佛國所有眾生聞無量壽如來名號，乃至能發一念淨信歡喜愛樂，所有善根迴向願生無量壽國者，隨願皆生，得不退轉乃至無上正等菩提，除五無間、誹毀正法及謗聖者。

「阿難！若有眾生於他佛剎發菩提心，專念無量壽佛，及恒種殖眾多善根，發心迴向願生彼國。是人臨命終時，無量壽佛與比丘眾前後圍繞現其人前，即隨如來往生彼國得不退轉，當證無上正等菩提。是故阿難！若有善男子、善女人，願生極樂世界、欲見無量壽佛者，應發無上菩提心，復當專念極樂國土，積集善根應持迴向，由此見佛生彼國中，得不退轉乃至無上菩提。阿難！若他國眾生發菩提心，雖不專念無量壽佛，亦非恒種眾多善根，隨己修行諸善功德，迴向彼佛願欲往生。此人臨命終時，無量壽佛即遣化身，與比丘眾前後圍繞，其所化佛光明相好與真無異，現其人前攝受導引。即隨化佛往生其國，得不退轉無上菩提。阿難！若有眾生住大乘者，以清淨心向無量壽如來，乃至十念念無量壽佛願生其國，聞甚深法即生信解，心無疑惑。乃至獲得一念淨心，發一念心念無量壽佛，此人臨命終時，如在夢中見無量壽佛，定生彼國得不退轉無上菩提。阿難！以此義利故，無量無數不可思議無有等等無邊世界諸佛如來，皆共稱讚無量壽佛所有功德。」

佛告阿難：「東方如恒河沙界，一一界中有如恒沙菩薩，為欲瞻禮供養無量壽佛及諸聖眾來詣佛所；南西北方四維上下亦復如是。」

爾時世尊而說頌曰：

「東方諸佛剎，  	數如恒河沙，
如是佛土中，  	恒沙菩薩眾，
皆現神通來，  	禮無量壽佛；
三方諸聖眾，  	禮覲亦同歸。
彼於沙界中，  	道光諸辯論，
住深禪定樂，  	四無所畏心。
各齎眾妙花，  	名香皆可悅，
并奏諸天樂，  	百千和雅音，
以獻天人師，  	名聞十方者。
究竟威神力，  	善學諸法門，
種種供養中，  	勤修無懈倦，
功德智慧景，  	能破諸幽冥，
咸以尊重心，  	奉諸珍妙供。
彼觀殊勝剎，  	菩薩眾無邊，
願速成菩提，  	淨界如安樂。
世尊知欲樂，  	廣大不思議，
微笑現金容，  	告成如所願。
了諸法如幻，  	佛國猶夢響，
恒發誓莊嚴，  	當成微妙土。
菩薩以願力，  	修勝菩提行，
知土如影像，  	發諸弘誓心。
若求遍清淨，  	殊勝無邊剎，
聞佛聖德名，  	願生安樂國。
若有諸菩薩，  	志求清淨土，
了知法無我，  	願生安樂國。
「復次阿難！極樂世界所有菩薩，於無上菩提皆悉安住一生補處，唯除大願能師子吼擐大甲冑摩訶薩眾為度群生修大涅槃者。

「復次阿難！彼佛剎中諸聲聞眾，皆有身光能照一尋。菩薩光照極百千尋，除二菩薩光明常照三千大千世界。」

阿難白佛言：「世尊！彼二菩薩名為何等？」

佛告阿難：「汝今諦聽。彼二菩薩，一名觀自在，二名大勢至。阿難！此二菩薩從娑婆世界捨壽量已往生彼國。

「阿難！彼極樂界所生菩薩皆具三十二相，膚體柔軟、諸根聰利、智慧善巧，於差別法無不了知，禪定神通善能遊戲，皆非薄德鈍根之流。彼菩薩中有得初忍或第二忍者無量無邊，或有證得無生法忍。

「阿難！彼國菩薩，乃至菩提不墮惡趣，生生之處能了宿命，唯除五濁剎中出現於世。

「阿難！彼國菩薩皆於晨朝供養他方無量百千諸佛，隨所希求種種花鬘、塗香、末香、幢幡、繒蓋及諸音樂，以佛神力皆現手中供養諸佛。如是供具廣大甚多，無數無邊不可思議。若復樂求種種名花，花有無量百千光色，皆現手中奉散諸佛。阿難！其所散花，即於空中變成花蓋，蓋之小者滿十由旬，若不更以新花重散，前所散花終不墮落。阿難！或有花蓋滿二十由旬，如是三十四十乃至千由旬，或等四洲或遍小千中千，乃至三千大千世界。此諸菩薩生希有心得大喜愛，於晨朝時奉事供養尊重讚歎無量百千億那由他佛，及種諸善根已，即於晨朝還到本國。此皆由無量壽佛本願加威，及曾供如來善根相續無缺減故、善修習故、善攝取故、善成就故。

「復次阿難！彼極樂界諸菩薩眾，所說語言與一切智相應，於所受用皆無攝取，遍遊佛剎無愛無厭亦無希求。不希求想，無自想、無煩惱想、無我想、無鬪諍相違怨瞋之想。何以故？彼諸菩薩於一切眾生有大慈悲利益心故，有柔軟無障礙心、不濁心、無忿恨心，有平等調伏寂靜之心、忍心、忍調伏心，有等引澄淨無散亂心、無覆蔽心、淨心、極淨心、照曜心、無塵心、大威德心、善心、廣大心、無比心、甚深心、愛法心、喜法心、善意心、捨離一切執著心、斷一切眾生煩惱心、閉一切惡趣心故，行智慧行已成就無量功德，於禪定覺分善能演說，而常遊戲無上菩提勤修敷演。肉眼發生能有簡擇，天眼出現鑒諸佛土，法眼清淨能離諸著，慧眼通達到於彼岸，佛眼成就覺悟開示，生無礙慧為他廣說。於三界中平等勤修，既自調伏亦能調伏一切有情，能令獲得勝奢摩他。於一切法證無所得，善能說法言辭巧妙，勤修供養一切諸佛，摧伏有情一切煩惱，為諸如來之所悅可，而能如是如是思惟。作是思惟時，能集能見一切諸法皆無所得，以方便智修行滅法，善知取捨理非理趣，於理趣非理趣中皆得善巧。於世語言心不愛樂，出世經典誠信勤修，善巧尋求一切諸法，求一切法增長了知。知法本無實不可得，於所行處亦無取捨，解脫老病住諸功德，從本已來安住神通勤修深法，於甚深法而無退轉，於難解法悉能通達，得一乘道無有疑惑。於佛教法不由他悟，其智宏深譬之巨海，菩提高廣喻若須彌，自身威光超於日月。凡所思擇與慧相應，猶如雪山其心潔白。光明普照無邊功德，燒煩惱薪方之於火。不為善惡之所動搖，心靜常安猶如大地。洗滌煩惑如清淨水，心無所主猶如火，不著世間猶如風，養諸有情猶如地，觀諸世界如虛空。荷載眾生猶如良乘，不染世法譬之蓮花，遠暢法音猶如雷震，雨一切法方之大雨，光蔽賢聖猶彼大仙，善能調伏如大龍象，勇猛無畏如師子王，覆護眾生如尼拘陀樹，他論不動如鐵圍山，修慈無量如彼恒河。諸善法王能為前導如大梵天，無所聚積猶如飛鳥，摧伏他論如金翅王，難遇希有如優曇花。最勝丈夫其心正直，無有懈怠能善修行，於諸見中善巧決定，柔和忍辱無嫉妬心。論法無厭求法不倦，常勤演說利益眾生。戒若琉璃內外明潔，善聞諸法而為勝寶，其所說言令眾悅伏。以智慧力建大法幢、吹大法螺、擊大法鼓，常樂勤修建諸法表。由智慧光心無迷惑，遠眾過失亦無損害。以淳淨心離諸穢染，常行惠施永捨慳貪，稟性溫和常懷慚恥。其心寂定智慧明察，作世間燈破眾生闇，堪受利養殊勝福田，為大導師周濟群物。遠離憎愛心淨無憂，勇進無怖為大法將，了知地獄調伏自他，利益有情拔諸毒箭，為世間解、為世間師，引導群生捨諸愛著。永離三垢遊戲神通，因力、緣力、願力、發起力、世俗力、出生力、善根力、三摩地力、聞力、捨力、戒力、忍力、精進力、定力、慧力、奢摩他力、毘鉢舍那力、神通力、念力、覺力、摧伏一切大魔軍力，并他論法力、能破一切煩惱怨力及殊勝大力，威福具足相好端嚴，智慧辯才善根圓滿。目淨脩廣人所愛樂，其身清潔遠離貢高。以尊重心奉事諸佛，於諸佛所植眾善本，拔除憍慢離貪瞋癡，殊勝吉祥應供中最。住勝智境赫奕慧光，心生歡喜雄猛無畏，福智具足無有滯限，但說所聞開示群物，隨所聞法皆能解了。於菩提分法勇猛勤修，空無相願而常安住，及不生不滅諸三摩地，行遍道場遠二乘境。阿難！我今略說彼極樂界所生菩薩摩訶薩眾真實功德悉皆如是。阿難！假令我身住壽百千億那由他劫，以無礙辯欲具稱揚彼諸菩薩摩訶薩等真實功德不可窮盡。阿難！彼諸菩薩摩訶薩等，盡其壽量亦不能知。」

爾時世尊告阿難言：「此是無量壽佛極樂世界。汝應從坐而起，合掌恭敬五體投地為佛作禮。彼佛名稱遍滿十方，彼一一方恒沙諸佛皆共稱讚無礙無斷。」

是時阿難即從坐起，偏袒右肩，西面合掌五體投地，白佛言：「世尊！我今欲見極樂世界無量壽如來，并供養奉事無量百千億那由他佛及菩薩眾，種諸善根。」

時無量壽佛即於掌中放大光明，遍照百千俱胝那由他剎。彼諸佛剎所有大小諸山，黑山、寶山、須彌盧山、迷盧山、大迷盧山、目真隣陀山、摩訶目真隣陀山、鐵圍山、大鐵圍山，叢薄園林及諸宮殿天人等物，以佛光明皆悉照見。譬如有人以淨天眼觀一尋地見諸所有，又如日光出現萬物斯覩。彼諸國中比丘、比丘尼、優婆塞、優婆夷，悉見無量壽如來如須彌山王照諸佛剎，時諸佛國皆悉明現如處一尋。以無量壽如來殊勝光明極清淨故，見彼高座及諸聲聞、菩薩等眾。譬如大地洪水盈滿，樹林山河皆沒不現，唯有大水。

「如是阿難！彼佛剎中無有他論及異形類，唯除一切大聲聞眾一尋光明，及彼菩薩摩訶薩踰繕那等百千尋光。」彼無量壽如來、應、正等覺光明，映蔽一切聲聞及諸菩薩，令諸有情悉皆得見。彼極樂界菩薩、聲聞、人天眾等，一切皆覩娑婆世界釋迦如來，及比丘眾圍繞說法。

爾時佛告彌勒菩薩言：「汝頗見具足清淨威德莊嚴佛剎，及見空中樹林園苑涌泉池沼不耶？汝見大地乃至色究竟天，於虛空中散花樹林以為莊嚴。復有眾鳥住虛空界出種種音，猶如佛聲普聞世界。是諸眾鳥皆是化作，非實畜生。汝見是耶？」

彌勒白佛言：「唯然已見。」

佛復告彌勒菩薩言：「汝見此諸眾生入踰繕那百千宮殿已，遊行虛空無著無礙，遍諸剎土供養諸佛，及見彼有情於晝夜分念佛相續不耶？」

彌勒白言：「唯然盡見。」

佛復告言：「汝見他化自在天與極樂諸人受用資具有差別不？」

彌勒白言：「我不見彼有少差別。」

佛告彌勒：「汝見極樂世界人住胎不？」

彌勒白言：「世尊！譬如三十三天夜摩天等，入百由旬若五百由旬宮殿之內遊戲歡樂。我見極樂世界人住胎者如夜摩天處於宮殿，又見眾生於蓮華內結加趺坐自然化生。」

時彌勒菩薩復白佛言：「世尊！何因緣故，彼國眾生有胎生者、化生者？」

佛告彌勒：「若有眾生墮於疑悔積集善根，希求佛智、普遍智、不思議智、無等智、威德智、廣大智。於自善根不能生信，以此因緣，於五百歲住宮殿中，不見佛、不聞法、不見菩薩及聲聞眾。若有眾生斷除疑悔積集善根，希求佛智乃至廣大智，信已善根。此人於蓮華內結加趺坐忽然化生，瞬息而出。譬如他國有人來至，而此菩薩亦復如是。餘國發心來生極樂，見無量壽佛奉事供養，及諸菩薩聲聞之眾。阿逸多！汝觀殊勝智者，彼因廣慧力故受彼化生，於蓮花中結加趺坐。汝觀下劣之輩，於五百歲中不見佛、不聞法、不見菩薩及聲聞眾，不知菩薩威儀法則，不能修習諸功德故，無因奉事無量壽佛。是諸人等皆為昔緣疑悔所致。譬如剎帝利王其子犯法，幽之內宮、處以花觀，層樓綺殿妙飾奇珍，寶帳金床重敷茵褥，名花布地燒大寶香，服御所資悉皆豐備，而以閻浮金鎖繫其兩足。」

佛告彌勒：「於意云何？彼王子心寧樂此不？」

答言：「不也。世尊！彼幽縶時常思解脫，求諸親識居士宰官長者近臣。王之太子雖希出離終不從心，乃至剎帝利王心生歡喜方得解脫。」

佛告彌勒：「如是如是。若有墮於疑悔，種諸善根希求佛智乃至廣大智，於自善根不能生信。由聞佛名起信心故，雖生彼國，於蓮花中不得出現。彼等眾生處花胎中，猶如園苑宮殿之想。何以故？彼中清淨無諸穢惡，一切無有不可樂者。然彼眾生於五百歲，不見佛、不聞法、不見菩薩及聲聞眾，不得供養奉事諸佛，不得問於菩薩法藏。遠離一切殊勝善根，彼等於中不生欣樂，不能出現修習善法；往昔世中過失盡已然後乃出，彼於出時，心迷上下四方之所。若五百歲無疑惑者，即當供養無量百千俱胝那由他佛，并種無量無邊善根。汝阿逸多！當知疑惑與諸菩薩為大損害。」

爾時彌勒菩薩白佛言：「世尊！於此國界不退菩薩，當生極樂國者，其數幾何？」

佛告彌勒：「此佛土中有七十二億菩薩，彼於無量億那由他百千佛所種諸善根成不退轉，當生彼國。況餘菩薩由少善根生彼國者，不可稱計。阿逸多！從難忍如來佛國，有十八億不退菩薩當生極樂世界。東北方寶藏佛國中，有九十億不退菩薩當生彼土。從無量聲如來國中，有二十二億不退菩薩當生彼土。從光明如來國中，有三十二億不退菩薩當生彼土。從龍天如來國中，有十四億不退菩薩當生彼土。從勝天力如來國中，有十二千不退菩薩當生彼土。從師子如來國中，有五百不退菩薩當生彼土。從離塵如來國中，有八十一億不退菩薩當生彼土。從世天如來國中，有六十億不退菩薩當生彼土。從勝積如來國中，有六十億不退菩薩當生彼土。從人王如來國中，有十俱胝不退菩薩當生彼土。從勝花如來國中，有五百菩薩具大精進發趣一乘，於七日中能令眾生離百千億那由他劫生死流轉，彼等亦當生極樂界。從發起精進如來國中，有六十九億不退菩薩當生彼土，到彼國已，供養禮拜無量壽如來及菩薩眾。阿逸多！我若具說諸方菩薩生極樂界，若已到、今到、當到，為供養禮拜瞻仰無量壽佛等者，但說其名窮劫不盡。

「阿逸多！汝觀彼諸菩薩摩訶薩善獲利益，若有聞彼佛名能生一念喜愛之心，當獲如上所說功德，心無下劣亦不貢高，成就善根悉皆增上。阿逸多！是故告汝及天人、世間、阿修羅等，今此法門付囑於汝。應當愛樂修習，乃至經一晝夜受持讀誦生希望心，於大眾中為他開示，當令書寫執持經卷，於此經中生導師想。

「阿逸多！是故菩薩摩訶薩，欲令無量諸眾生等速疾安住不退轉於阿耨多羅三藐三菩提，及欲見彼廣大莊嚴攝受殊勝佛剎圓滿功德者，應當起精進力聽此法門。假使經過大千世界滿中猛火，為求法故不生退屈諂偽之心，讀誦受持書寫經卷，乃至於須臾頃為他開示，勸令聽聞不生憂惱，設入大火不應疑悔。何以故？彼無量億諸菩薩等皆悉求此微妙法門，尊重聽聞不生違背。是故汝等應求此法。阿逸多！彼諸眾生獲大善利，若於來世乃至正法滅時，當有眾生殖諸善本，已曾供養無量諸佛，由彼如來加威力故，能得如是廣大法門，一切如來稱讚悅可。若於彼法攝取受持，當獲廣大一切智智，隨意所樂種諸善根。若善男子善女人等，於彼法中廣大勝解之者，當能聽聞獲大歡喜，受持讀誦廣為他說常樂修行。阿逸多！無量億數諸菩薩等求請此法不曾厭背，是故汝等諸善男子及善女人，於今來世能於是法，若已求、現求、當求者，皆獲善利。

「阿逸多！如來所應作者皆已作之。汝等應當安住無疑種諸善本，應常修學使無疑滯，不入一切種類珍寶成就牢獄。阿逸多！如是等類大威德者，能生廣大佛法異門，由於此法不聽聞故，有一億菩薩退轉阿耨多羅三藐三菩提。阿逸多！佛出世難，離八難身亦為難得。諸佛如來無上之法，十力無畏無礙無著甚深之法，及波羅蜜等菩薩之法，能說法人亦難開示。阿逸多！善說法人非易可遇，堅固深信時亦難遭。是故我今如理宣說，汝等修習應如教住。

「汝阿逸多！我以此法門及諸佛法囑累於汝，汝當修行無令滅沒。如是廣大微妙法門，一切諸佛之所稱讚。勿違佛教而棄捨之，當令汝等獲不善利，淪沒長夜備眾危苦。是故我今為大囑累，當令是法久住不滅，應勤修行隨順我教。」

爾時世尊而說頌曰：

「若於福德初未修，  	終不聞斯微妙法；
勇猛能成諸善利，  	當聞如是甚深經。
彼人曾見諸世尊，  	能作大光拯濁世，
多聞總持如巨海，  	彼獲聖賢喜愛心。
懈怠邪見下劣人，  	不信如來斯正法；
若曾於佛殖眾善，  	救世之行彼能修。
譬如盲人恒處闇，  	不能開導於他路；
聲聞於佛智亦然，  	況餘有情而悟解。
如來功德佛自知，  	唯有世尊能開示，
天龍夜叉所不及，  	二乘自絕於名言。
若諸有情當作佛，  	行超普賢登彼岸，
敷演一佛之功德，  	時逾多劫不思議，
於是中間身滅度，  	佛之勝慧莫能量。
是故具足於信聞，  	及諸善友之攝受，
得聞如是深妙法，  	當獲愛重諸聖尊。
如來勝智遍虛空，  	所說義言唯佛悟，
是故博聞諸智士，  	應信我教如實言。
人趣之身得甚難，  	如來出世遇亦難，
信慧多時方乃獲，  	是故修者應精進。
如是妙法已聽聞，  	常念諸佛而生喜，
彼人往昔真吾友，  	善能樂欲佛菩提。」
爾時世尊說是經已，天人世間有萬二千那由他億眾生遠塵離垢得法眼淨；二十億眾生得阿那含果；六千八百比丘諸漏已盡心得解脫；四十億菩薩於無上菩提住不退轉，被大甲冑當成正覺；有二十五億眾生得不退忍；有四萬億那由他百千眾生於無上菩提未曾發意，今始初發種諸善根，願生極樂世界見阿彌陀佛，皆當往生彼如來土，各於異方次第成佛同名妙音。有八萬億那由他眾生，得授記法忍成無上菩提。彼無量壽佛昔行菩薩道時成熟有情，悉皆當生極樂世界，憶念儔昔所發思願皆得成滿。

爾時三千大千世界六種震動，并現種種希有神變，放大光明普照世界。無量億那由他百千天人，同時音樂不鼓自鳴，雨天曼陀羅花沒至于膝；乃至阿迦膩吒天，皆作種種殊妙供養。

佛說經已，彌勒菩薩等及尊者阿難，一切大眾，聞佛所說，皆大歡喜。

大寶積經卷第十八
佛說無量壽經卷上

曹魏天竺三藏康僧鎧譯

我聞如是：

一時佛住王舍城耆闍崛山中，與大比丘眾萬二千人俱，一切大聖神通已達，其名曰：尊者了本際、尊者正願、尊者正語、尊者大號、尊者仁賢、尊者離垢、尊者名聞、尊者善實、尊者具足、尊者牛王、尊者優樓頻䗍迦葉、尊者伽耶迦葉、尊者那提迦葉、尊者摩訶迦葉、尊者舍利弗、尊者大目揵連、尊者劫賓那、尊者大住、尊者大淨志、尊者摩訶周那、尊者滿願子、尊者離障閡、尊者流灌、尊者堅伏、尊者面王、尊者果乘、尊者仁性、尊者喜樂、尊者善來、尊者羅云、尊者阿難，皆如斯等上首者也。

又與大乘眾菩薩俱，普賢菩薩、妙德菩薩、慈氏菩薩等，此賢劫中一切菩薩。

又賢護等十六正士：善思議菩薩、信慧菩薩、空無菩薩、神通華菩薩、光英菩薩、慧上菩薩、智幢菩薩、寂根菩薩、願慧菩薩、香象菩薩、寶英菩薩、中住菩薩、制行菩薩、解脫菩薩，皆遵普賢大士之德，具諸菩薩無量行願，安住一切功德之法，遊步十方，行權方便，入佛法藏，究竟彼岸，於無量世界現成等覺。

處兜率天弘宣正法，捨彼天宮降神母胎，從右脇生，現行七步。光明顯曜，普照十方無量佛土，六種振動，舉聲自稱：「吾當於世為無上尊，釋梵奉侍，天、人歸仰。」示現算計、文藝、射御，博綜道術，貫練群籍，遊於後園講武試藝。現處宮中色味之間，見老、病、死，悟世非常，棄國財位，入山學道，服乘、白馬、寶冠、瓔珞，遣之令還。捨珍妙衣而著法服，剃除鬚髮，端坐樹下。勤苦六年，行如所應。現五濁剎隨順群生，示有塵垢沐浴金流。天按樹枝得攀出池，靈禽翼從往詣道場，吉祥感徵表章功祚。哀受施草，敷佛樹下，加趺而坐，奮大光明使魔知之。魔率官屬而來逼試，制以智力皆令降伏，得微妙法成最正覺。釋梵祈勸請轉法輪，以佛遊步、佛吼而吼，扣法鼓、吹法螺、執法劍、建法幢、震法雷、曜法電、澍法雨、演法施，常以法音覺諸世間，光明普照無量佛土。一切世界六種震動，總攝魔界、動魔宮殿，眾魔懾怖莫不歸伏。摑裂邪網，消滅諸見，散諸塵勞，壞諸欲塹。嚴護法城，開闡法門；洗濯垢污，顯明清白；光融佛法，宣流正化。入國分衛獲諸豐饍，貯功德、示福田、欲宣法、現欣笑，以諸法藥救療三苦。顯現道意無量功德，授菩薩記成等正覺，示現滅度拯濟無極。消除諸漏，殖眾德本，具足功德微妙難量。遊諸佛國，普現道教，其所修行清淨無穢。

譬如幻師現眾異像，為男、為女無所不變，本學明了在意所為。此諸菩薩亦復如是，學一切法貫綜縷練，所住安諦靡不感化，無數佛土皆悉普現，未曾慢恣、愍傷眾生。如是之法一切具足，菩薩經典究暢要妙，名稱普至導御十方，無量諸佛咸共護念。佛所住者皆已得住、大聖所立而皆已立，如來道化各能宣布，為諸菩薩而作大師。以甚深禪慧開導眾人，通諸法性，達眾生相，明了諸國，供養諸佛。化現其身猶如電光，善學無畏曉了幻法。壞裂魔網，解諸纏縛。超越聲聞、緣覺之地，得空無相、無願三昧。善立方便，顯示三乘。於此中下而現滅度，亦無所作、亦無所有，不起、不滅得平等法。具足成就無量總持百千三昧，諸根智慧廣普寂定，深入菩薩法藏，得佛華嚴三昧。宣揚演說一切經典，住深定門，悉覩現在無量諸佛，一念之頃無不周遍。濟諸劇難諸閑不閑，分別顯示真實之際，得諸如來辯才之智。入眾言音，開化一切，超過世間諸所有法。心常諦住度世之道，於一切萬物隨意自在。為眾生類作不請之友，荷負群生為之重任。受持如來甚深法藏，護佛種性常使不絕。興大悲、愍眾生，演慈辯、授法眼、杜三趣、開善門，以不請之法施諸黎庶，猶如孝子愛敬父母。於諸眾生視之若己，一切善本皆度彼岸，悉獲諸佛無量功德，智慧聖明不可思議。

如是菩薩無量大士不可稱計，一時來會。

爾時，世尊諸根悅豫，姿色清淨，光顏巍巍。

尊者阿難承佛聖旨，即從座起，偏袒右肩，長跪合掌而白佛言：「今日世尊諸根悅豫，姿色清淨，光顏巍巍，如明鏡淨影暢表裏，威容顯耀超絕無量，未曾瞻覩殊妙如今。唯然，大聖！我心念言：『今日世尊住奇特法、今日世雄住佛所住、今日世眼住導師行、今日世英住最勝道、今日天尊行如來德。去來現在佛佛相念，得無今佛念諸佛耶？何故威神光光乃爾？』」

於是世尊告阿難曰：「云何，阿難！諸天教汝來問佛耶？自以慧見問威顏乎？」

阿難白佛：「無有諸天來教我者，自以所見問斯義耳。」

佛言：「善哉，阿難！所問甚快。發深智慧真妙辯才，愍念眾生問斯慧義。如來以無盡大悲矜哀三界，所以出興於世，光闡道教，普令群萌獲真法利。無量億劫難值難見，猶靈瑞華時時乃出。今所問者多所饒益，開化一切諸天人民。

「阿難！當知如來正覺其智難量，多所導御，慧見無礙，無能遏絕。以一喰之力，能住壽命億百千劫無數無量，復過於此。諸根悅豫不以毀損，姿色不變光顏無異。所以者何？如來定慧究暢無極，於一切法而得自在。

「阿難諦聽，今為汝說。」

對曰：「唯然，願樂欲聞。」

佛告阿難：「乃往過去久遠無量不可思議無央數劫，錠光如來興出於世，教化度脫無量眾生，皆令得道乃取滅度。次有如來名曰光遠、次名月光、次名栴檀香、次名善山王、次名須彌天冠、次名須彌等曜、次名月色、次名正念、次名離垢、次名無著、次名龍天、次名夜光、次名安明頂、次名不動地、次名琉璃妙華、次名琉璃金色、次名金藏、次名炎光、次名炎根、次名地種、次名月像、次名日音、次名解脫華、次名莊嚴光明、次名海覺神通、次名水光、次名大香、次名離塵垢、次名捨厭意、次名寶炎、次名妙頂、次名勇立、次名功德持慧、次名蔽日月光、次名日月琉璃光、次名無上琉璃光、次名最上首、次名菩提華、次名月明、次名日光、次名華色王、次名水月光、次名除癡冥、次名度蓋行、次名淨信、次名善宿、次名威神、次名法慧、次名鸞音、次名師子音、次名龍音、次名處世，如此諸佛皆悉已過。

「爾時，次有佛名世自在王如來、應供、等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。時有國王，聞佛說法心懷悅豫，尋發無上正真道意，棄國、捐王，行作沙門，號曰法藏，高才勇哲與世超異。詣世自在王如來所，稽首佛足，右遶三匝，長跪合掌以頌讚曰：

「『光顏巍巍，  	威神無極，  	如是炎明，
無與等者。  	日月摩尼，  	珠光炎耀，
皆悉隱蔽，  	猶如聚墨。  	如來容顏，
超世無倫，  	正覺大音，  	響流十方。
戒聞精進，  	三昧智慧，  	威德無侶，
殊勝希有。  	深諦善念，  	諸佛法海，
窮深盡奧，  	究其崖底。  	無明、欲、怒，
世尊永無，  	人雄師子，  	神德無量。
功德廣大，  	智慧深妙，  	光明威相，
震動大千。  	願我作佛，  	齊聖法王，
過度生死，  	靡不解脫。  	布施、調意、
戒、忍、精進，  	如是三昧，  	智慧為上。
吾誓得佛，  	普行此願，  	一切恐懼，
為作大安。  	假令有佛，  	百千億萬，
無量大聖，  	數如恒沙，  	供養一切，
斯等諸佛，  	不如求道，  	堅正不却。
譬如恒沙，  	諸佛世界，  	復不可計，
無數剎土，  	光明悉照，  	遍此諸國，
如是精進，  	威神難量。  	令我作佛，
國土第一，  	其眾奇妙，  	道場超絕。
國如泥洹，  	而無等雙，  	我當愍哀，
度脫一切。  	十方來生，  	心悅清淨，
已到我國，  	快樂安隱。  	幸佛信明，
是我真證，  	發願於彼，  	力精所欲。
十方世尊，  	智慧無礙，  	常令此尊，
知我心行。  	假令身止，  	諸苦毒中，
我行精進，  	忍終不悔。』」
佛告阿難：「法藏比丘說此頌已而白佛言：『唯然，世尊！我發無上正覺之心，願佛為我廣宣經法，我當修行，攝取佛國清淨莊嚴無量妙土，令我於世速成正覺，拔諸生死勤苦之本。』」

佛語阿難：「時世自在王佛告法藏比丘：『如所修行莊嚴佛土，汝自當知。』

「比丘白佛：『斯義弘深，非我境界。唯願世尊廣為敷演諸佛如來淨土之行。我聞此已，當如說修行成滿所願。』

「爾時，世自在王佛知其高明志願深廣，即為法藏比丘而說經言：『譬如大海，一人斗量，經歷劫數尚可窮底，得其妙寶。人有至心精進，求道不止，會當剋果，何願不得？』

「於是，世自在王佛即為廣說二百一十億諸佛剎土天人之善惡、國土之粗妙，應其心願悉現與之。

「時彼比丘聞佛所說嚴淨國土，皆悉覩見。超發無上殊勝之願，其心寂靜，志無所著，一切世間無能及者。具足五劫，思惟攝取莊嚴佛國清淨之行。」

阿難白佛：「彼佛國土壽量幾何？」

佛言：「其佛壽命四十二劫。

「時法藏比丘攝取二百一十億諸佛妙土清淨之行。如是修已，詣彼佛所，稽首禮足，遶佛三匝，合掌而住，白言：『世尊！我已攝取莊嚴佛土清淨之行。』

「佛告比丘：『汝今可說，宜知是時。發起悅可一切大眾。菩薩聞已，修行此法，緣致滿足無量大願。』

「比丘白佛：『唯垂聽察，如我所願，當具說之。

「『設我得佛，國有地獄、餓鬼、畜生者，不取正覺。

「『設我得佛，國中人天壽終之後復更三惡道者，不取正覺。

「『設我得佛，國中人天不悉真金色者，不取正覺。

「『設我得佛，國中人天形色不同有好醜者，不取正覺。

「『設我得佛，國中人天不悉識宿命，下至知百千億那由他諸劫事者，不取正覺。

「『設我得佛，國中人天不得天眼，下至見百千億那由他諸佛國者，不取正覺。

「『設我得佛，國中人天不得天耳，下至聞百千億那由他諸佛所說不悉受持者，不取正覺。

「『設我得佛，國中人天不得見他心智，下至知百千億那由他諸佛國中眾生心念者，不取正覺。

「『設我得佛，國中人天不得神足於一念頃，下至不能超過百千億那由他諸佛國者，不取正覺。

「『設我得佛，國中人天若起想念貪計身者，不取正覺。

「『設我得佛，國中人天不住定聚必至滅度者，不取正覺。

「『設我得佛，光明有能限量，下至不照百千億那由他諸佛國者，不取正覺。

「『設我得佛，壽命有能限量，下至百千億那由他劫者，不取正覺。

「『設我得佛，國中聲聞有能計量，乃至三千大千世界眾生緣覺於百千劫悉共計挍知其數者，不取正覺。

「『設我得佛，國中人天壽命無能限量——除其本願脩短自在——若不爾者，不取正覺。

「『設我得佛，國中人天乃至聞有不善名者，不取正覺。

「『設我得佛，十方世界無量諸佛不悉咨嗟稱我名者，不取正覺。

「『設我得佛，十方眾生至心信樂欲生我國，乃至十念，若不生者，不取正覺，唯除五逆、誹謗正法。

「『設我得佛，十方眾生發菩提心修諸功德，至心發願欲生我國，臨壽終時，假令不與大眾圍遶現其人前者，不取正覺。

「『設我得佛，十方眾生聞我名號、係念我國，殖諸德本、至心迴向欲生我國，不果遂者，不取正覺。

「『設我得佛，國中人天不悉成滿三十二大人相者，不取正覺。

「『設我得佛，他方佛土諸菩薩眾來生我國，究竟必至一生補處——除其本願自在所化，為眾生故，被弘誓鎧，積累德本度脫一切；遊諸佛國修菩薩行，供養十方諸佛如來；開化恒沙無量眾生，使立無上正真之道；超出常倫諸地之行，現前修習普賢之德——若不爾者，不取正覺。

「『設我得佛，國中菩薩承佛神力供養諸佛，一食之頃不能遍至無量無數億那由他諸佛國者，不取正覺。

「『設我得佛，國中菩薩在諸佛前現其德本，諸所求欲供養之具若不如意者，不取正覺。

「『設我得佛，國中菩薩不能演說一切智者，不取正覺。

「『設我得佛，國中菩薩不得金剛那羅延身者，不取正覺。

「『設我得佛，國中人、天、一切萬物嚴淨光麗，形色殊特，窮微極妙，無能稱量。其諸眾生乃至逮得天眼，有能明了辨其名數者，不取正覺。

「『設我得佛，國中菩薩乃至少功德者，不能知見其道場樹無量光色高四百萬里者，不取正覺。

「『設我得佛，國中菩薩若受讀經法，諷誦持說而不得辯才智慧者，不取正覺。

「『設我得佛，國中菩薩智慧辯才若可限量者，不取正覺。

「『設我得佛，國土清淨，皆悉照見十方一切無量無數不可思議諸佛世界，猶如明鏡覩其面像；若不爾者，不取正覺。

「『設我得佛，自地以上至于虛空，宮殿、樓觀、池流、華樹——國土所有一切萬物——皆以無量雜寶百千種香而共合成，嚴飾奇妙超諸人天，其香普薰十方世界，菩薩聞者皆修佛行；若不爾者，不取正覺。

「『設我得佛，十方無量不可思議諸佛世界眾生之類，蒙我光明觸其體者，身心柔軟超過人天；若不爾者，不取正覺。

「『設我得佛，十方無量不可思議諸佛世界眾生之類，聞我名字不得菩薩無生法忍、諸深總持者，不取正覺。

「『設我得佛，十方無量不可思議諸佛世界，其有女人聞我名字，歡喜信樂，發菩提心，厭惡女身，壽終之後復為女像者，不取正覺。

「『設我得佛，十方無量不可思議諸佛世界，諸菩薩眾聞我名字，壽終之後常修梵行至成佛道；若不爾者，不取正覺。

「『設我得佛，十方無量不可思議諸佛世界，諸天人民聞我名字，五體投地稽首作禮，歡喜信樂修菩薩行，諸天世人莫不致敬；若不爾者，不取正覺。

「『設我得佛，國中人天欲得衣服隨念即至，如佛所讚應法妙服自然在身；若有裁縫、染治、浣濯者，不取正覺。

「『設我得佛，國中人天所受快樂不如漏盡比丘者，不取正覺。

「『設我得佛，國中菩薩隨意欲見十方無量嚴淨佛土，應時如願，於寶樹中皆悉照見，猶如明鏡覩其面像；若不爾者，不取正覺。

「『設我得佛，他方國土諸菩薩眾聞我名字，至于得佛，諸根缺陋不具足者，不取正覺。

「『設我得佛，他方國土諸菩薩眾聞我名字，皆悉逮得清淨解脫三昧，住是三昧一發意頃，供養無量不可思議諸佛世尊而不失定意；若不爾者，不取正覺。

「『設我得佛，他方國土諸菩薩眾聞我名字，壽終之後生尊貴家；若不爾者，不取正覺。

「『設我得佛，他方國土諸菩薩眾聞我名字，歡喜踊躍，修菩薩行，具足德本；若不爾者，不取正覺。

「『設我得佛，他方國土諸菩薩眾聞我名字，皆悉逮得普等三昧，住是三昧至于成佛，常見無量不可思議一切如來；若不爾者，不取正覺。

「『設我得佛，國中菩薩隨其志願，所欲聞法自然得聞；若不爾者，不取正覺。

「『設我得佛，他方國土諸菩薩眾聞我名字，不即得至不退轉者，不取正覺。

「『設我得佛，他方國土諸菩薩眾聞我名字，不即得至第一、第二、第三法忍，於諸佛法不能即得不退轉者，不取正覺。』」

佛告阿難：「爾時，法藏比丘說此願已，而說頌曰：

「『我建超世願，  	必至無上道，
斯願不滿足，  	誓不成等覺。
我於無量劫，  	不為大施主，
普濟諸貧苦，  	誓不成等覺。
我至成佛道，  	名聲超十方，
究竟靡所聞，  	誓不成等覺。
離欲深正念，  	淨慧修梵行，
志求無上道，  	為諸天人師。
神力演大光，  	普照無際土，
消除三垢冥，  	明濟眾厄難。
開彼智慧眼，  	滅此昏盲闇，
閉塞諸惡道，  	通達善趣門。
功祚成滿足，  	威曜朗十方，
日月戢重暉，  	天光隱不現。
為眾開法藏，  	廣施功德寶，
常於大眾中，  	說法師子吼。
供養一切佛，  	具足眾德本，
願慧悉成滿，  	得為三界雄。
如佛無量智，  	通達靡不遍，
願我功德力，  	等此最勝尊。
斯願若剋果，  	大千應感動，
虛空諸天人，  	當雨珍妙華。』」
佛語阿難：「法藏比丘說此頌已，應時普地六種震動，天雨妙華以散其上，自然音樂空中讚言：『決定必成無上正覺。』於是法藏比丘具足修滿如是大願，誠諦不虛，超出世間深樂寂滅。

「阿難！法藏比丘於彼佛所諸天、魔、梵、龍神八部大眾之中發斯弘誓，建此願已，一向專志莊嚴妙土。所修佛國開廓廣大，超勝獨妙，建立常然，無衰、無變。於不可思議兆載永劫積殖菩薩無量德行，不生欲覺、瞋覺、害覺，不起欲想、瞋想、害想，不著色、聲、香、味、觸之法。忍力成就，不計眾苦。少欲知足，無染恚癡，三昧常寂，智慧無礙。無有虛偽諂曲之心，和顏軟語先意承問，勇猛精進志願無惓，專求清白之法。以慧利群生，恭敬三寶，奉事師長；以大莊嚴具足眾行，令諸眾生功德成就。住空、無相、無願之法，無作、無起，觀法如化。遠離麁言、自害、害彼、彼此俱害，修習善語，自利、利人、彼我兼利。棄國、捐王，絕去財色。自行六波羅蜜，教人令行。

「無央數劫積功累德，隨其生處在意所欲，無量寶藏自然發應，教化安立無數眾生。住於無上正真之道，或為長者、居士、豪姓、尊貴，或為剎利國君、轉輪聖帝，或為六欲天主乃至梵王。常以四事供養恭敬一切諸佛，如是功德不可稱說。口氣香潔如優鉢羅華，身諸毛孔出栴檀香，其香普熏無量世界；容色端正，相好殊妙，其手常出無盡之寶，衣服、飲食珍妙華香，諸蓋幢幡莊嚴之具。如是等事超諸人天，於一切法而得自在。」

阿難白佛：「法藏菩薩為已成佛而取滅度、為未成佛？為今現在？」

佛告阿難：「法藏菩薩今已成佛，現在西方，去此十萬億剎，其佛世界名曰安樂。」

阿難又問：「其佛成道已來為經幾時？」

佛言：「成佛已來凡歷十劫。其佛國土自然七寶——金、銀、琉璃、珊瑚、琥珀、車𤦲、瑪瑙——合成為地，恢廓曠蕩不可限極。悉相雜廁，轉相入間，光赫焜耀，微妙奇麗，清淨莊嚴超踰十方一切世界眾寶中精，其寶猶如第六天寶。又其國土無須彌山及金剛圍一切諸山，亦無大海、小海、溪渠、井谷。佛神力故，欲見則見。亦無地獄、餓鬼、畜生諸難之趣。亦無四時——春、秋、冬、夏——不寒、不熱，常和調適。」

爾時，阿難白佛言：「世尊！若彼國土無須彌山，其四天王及忉利天依何而住？」

佛語阿難：「第三炎天乃至色究竟天皆依何住？」

阿難白佛：「行業果報不可思議。」

佛語阿難：「行業果報不可思議，諸佛世界亦不可思議。其諸眾生功德善力住行業之地，故能爾耳。」

阿難白佛：「我不疑此法，但為將來眾生欲除其疑惑，故問斯義。」

佛告阿難：「無量壽佛威神光明最尊第一，諸佛光明所不能及。或有佛光照百佛世界、或千佛世界，取要言之，乃照東方恒沙佛剎，南、西、北方四維，上、下亦復如是。或有佛光照于七尺，或照一由旬，二、三、四、五由旬，如是轉倍乃至照一佛剎。是故，無量壽佛號無量光佛、無邊光佛、無礙光佛、無對光佛、炎王光佛、清淨光佛、歡喜光佛、智慧光佛、不斷光佛、難思光佛、無稱光佛、超日月光佛。

「其有眾生遇斯光者，三垢消滅，身意柔軟，歡喜踊躍，善心生焉。若在三塗勤苦之處，見此光明，皆得休息，無復苦惱；壽終之後皆蒙解脫。

「無量壽佛光明顯赫照曜十方諸佛國土，莫不聞知。不但我今稱其光明，一切諸佛、聲聞、緣覺、諸菩薩眾咸共歎譽，亦復如是。若有眾生聞其光明威神功德，日夜稱說至心不斷，隨意所願得生其國，為諸菩薩、聲聞大眾所共歎譽稱其功德；至其然後得佛道時，普為十方諸佛菩薩歎其光明亦如今也。」

佛言：「我說無量壽佛光明威神巍巍殊妙，晝夜一劫尚不能盡。」

佛語阿難：「無量壽佛壽命長久不可稱計，汝寧知乎？假使十方世界無量眾生皆得人身，悉令成就聲聞、緣覺，都共集會禪思一心，竭其智力於百千萬劫悉共推算，計其壽命長遠劫數，不能窮盡知其限極。聲聞、菩薩、天、人之眾，壽命長短亦復如是，非算數譬喻所能知也。又聲聞、菩薩其數難量不可稱說，神智洞達威力自在，能於掌中持一切世界。」

佛語阿難：「彼佛初會，聲聞眾數不可稱計，菩薩亦然。能如大目揵連百千萬億無量無數，於阿僧祇那由他劫乃至滅度悉共計挍，不能究了多少之數。譬如大海深廣無量，假使有人析其一毛以為百分，以一分毛沾取一渧。於意云何？其所渧者於彼大海，何所為多？」

阿難白佛：「彼所渧水比於大海多少之量，非巧歷算數、言辭譬類所能知也。」

佛語阿難：「如目連等於百千萬億那由他劫計彼初會聲聞菩薩，所知數者猶如一渧，其所不知如大海水。

「又其國土，七寶諸樹周滿世界——金樹、銀樹、琉璃樹、頗梨樹、珊瑚樹、瑪瑙樹、車𤦲樹——或有二寶、三寶乃至七寶轉共合成。或有金樹，銀葉、華、果；或有銀樹，金葉、華、果；或琉璃樹，頗梨為葉，華、果亦然；或水精樹，琉璃為葉，華、果亦然；或珊瑚樹，瑪瑙為葉，華、果亦然；或瑪瑙樹，琉璃為葉，華、果亦然；或車𤦲樹，眾寶為葉，華、果亦然。或有寶樹，紫金為本、白銀為莖、琉璃為枝、水精為條、珊瑚為葉、瑪瑙為華、車𤦲為實；或有寶樹，白銀為本、琉璃為莖、水精為枝、珊瑚為條、瑪瑙為葉、車𤦲為華、紫金為實；或有寶樹，琉璃為本、水精為莖、珊瑚為枝、瑪瑙為條、車𤦲為葉、紫金為華、白銀為實；或有寶樹，水精為本、珊瑚為莖、瑪瑙為枝、車𤦲為條、紫金為葉、白銀為華、琉璃為實；或有寶樹，珊瑚為本、瑪瑙為莖、車𤦲為枝、紫金為條、白銀為葉、琉璃為華、水精為實；或有寶樹，瑪瑙為本、車𤦲為莖、紫金為枝、白銀為條、琉璃為葉、水精為華、珊瑚為實；或有寶樹，車𤦲為本、紫金為莖、白銀為枝、琉璃為條、水精為葉、珊瑚為華、瑪瑙為實。行行相值、莖莖相望、枝枝相準、葉葉相向、華華相順、實實相當，榮色光曜不可勝視。清風時發，出五音聲，微妙宮商自然相和。

「又無量壽佛其道場樹，高四百萬里，其本周圍五千由旬，枝葉四布二十萬里。一切眾寶自然合成，以月光摩尼持海輪寶——眾寶之王——而莊嚴之。周匝條間垂寶瓔珞，百千萬色種種異變，無量光炎照曜無極。珍妙寶網羅覆其上，一切莊嚴隨應而現。微風徐動出妙法音，普流十方一切佛國。其聞音者得深法忍，住不退轉至成佛道，不遭苦患；目覩其色、耳聞其音、鼻知其香、舌甞其味、身觸其光、心以法緣，一切皆得甚深法忍，住不退轉至成佛道，六根清徹無諸惱患。

「阿難！若彼國人天見此樹者，得三法忍：一者、音響忍，二者、柔順忍，三者、無生法忍。此皆無量壽佛威神力故、本願力故、滿足願故、明了願故、堅固願故、究竟願故。」

佛告阿難：「世間帝王有百千音樂，自轉輪聖王乃至第六天上，伎樂音聲展轉相勝千億萬倍；第六天上萬種樂音，不如無量壽國諸七寶樹一種音聲千億倍也。亦有自然萬種伎樂，又其樂聲無非法音，清暢哀亮，微妙和雅，十方世界音聲之中最為第一。

「又，講堂、精舍、宮殿、樓觀皆七寶莊嚴，自然化成，復以真珠、明月摩尼眾寶以為交露，覆蓋其上。內、外、左、右有諸浴池，或十由旬，或二十、三十，乃至百千由旬，縱廣深淺各皆一等，八功德水湛然盈滿，清淨香潔味如甘露。黃金池者底白銀沙，白銀池者底黃金沙，水精池者底琉璃沙，琉璃池者底水精沙，珊瑚池者底琥珀沙，琥珀池者底珊瑚沙，車𤦲池者底瑪瑙沙，瑪瑙池者底車𤦲沙，白玉池者底紫金沙，紫金池者底白玉沙，或二寶、三寶乃至七寶轉共合成。其池岸上有栴檀樹，華葉垂布，香氣普熏。天優鉢羅華、鉢曇摩華、拘物頭華、分陀利華，雜色光茂彌覆水上。

「彼諸菩薩及聲聞眾若入寶池，意欲令水沒足，水即沒足；欲令至膝，即至于膝；欲令至腰，水即至腰；欲令至頸，水即至頸；欲令灌身，自然灌身；欲令還復，水輒還復。調和冷煖自然隨意，開神悅體蕩除心垢，清明澄潔淨若無形。寶沙映徹無深不照，微瀾迴流轉相灌注，安詳徐逝不遲不疾。波揚無量自然妙聲，隨其所應莫不聞者，或聞佛聲，或聞法聲，或聞僧聲，或寂靜聲、空無我聲、大慈悲聲、波羅蜜聲，或十力無畏不共法聲、諸通慧聲、無所作聲、不起滅聲、無生忍聲，乃至甘露灌頂眾妙法聲。如是等聲，稱其所聞歡喜無量，隨順清淨離欲寂滅真實之義、隨順三寶力無所畏不共之法、隨順通慧菩薩聲聞所行之道。無有三塗苦難之名，但有自然快樂之音，是故其國名曰極樂。

「阿難！彼佛國土諸往生者，具足如是清淨色身、諸妙音聲、神通功德，所處宮殿、衣服、飲食、眾妙華香莊嚴之具，猶第六天自然之物。若欲食時，七寶應器自然在前，金、銀、琉璃、車𤦲、瑪瑙、珊瑚、虎珀、明月真珠如是眾鉢隨意而至，百味飲食自然盈滿。雖有此食實無食者，但見色、聞香，意以為食，自然飽足，身心柔軟，無所味著。事已化去，時至復現。

「彼佛國土清淨安隱，微妙快樂，次於無為泥洹之道。其諸聲聞、菩薩、人、天，智慧高明，神通洞達。咸同一類，形無異狀，但因順餘方，故有人、天之名。顏貌端正，超世希有，容色微妙，非天、非人，皆受自然虛無之身、無極之體。」

佛告阿難：「譬如世間貧窮乞人在帝王邊，形貌容狀寧可類乎？」

阿難白佛：「假令此人在帝王邊，羸陋醜惡無以為喻，百千萬億不可計倍。所以然者？貧窮乞人底極廝下，衣不蔽形，食趣支命，飢寒困苦，人理殆盡。皆坐前世不殖德本，積財不施、富有益慳，但欲唐得、貪求無厭，不信修善、犯惡山積。如是壽終，財寶消散，苦身積聚為之憂惱，於己無益，徒為他有。無善可怙，無德可恃，是故，死墮惡趣，受此長苦。罪畢得出生為下賤，愚鄙斯極示同人類。所以世間帝王人中獨尊，皆由宿世積德所致，慈惠博施，仁愛兼濟，履信修善，無所違諍。是以壽終，福應得昇善道，上生天上享茲福樂。積善餘慶今得為人，遇生王家自然尊貴，儀容端正眾所敬事，妙衣珍膳隨心服御。宿福所追，故能致此。」

佛告阿難：「汝言是也。計如帝王，雖人中尊貴，形色端正，比之轉輪聖王，甚為鄙陋，猶彼乞人在帝王邊。轉輪聖王威相殊妙天下第一，比忉利天王，又復醜惡不得相喻萬億倍也。假令天帝比第六天王，百千億倍不相類也。設第六天王比無量壽佛國菩薩、聲聞，光顏容色不相及逮，百千萬億不可計倍。」

佛告阿難：「無量壽國其諸天人，衣服、飲食、華香、瓔珞、諸蓋幢幡、微妙音聲，所居舍宅、宮殿、樓閣，稱其形色、高下、大小，或一寶、二寶，乃至無量眾寶，隨意所欲，應念即至。又，以眾寶妙衣遍布其地，一切人天踐之而行。無量寶網彌覆佛土，皆以金縷、真珠、百千雜寶、奇妙珍異莊嚴絞飾，周匝四面垂以寶鈴，光色晃曜盡極嚴麗。自然德風徐起微動，其風調和，不寒、不暑；溫涼柔軟，不遲、不疾；吹諸羅網及眾寶樹，演發無量微妙法音，流布萬種溫雅德香。其有聞者，塵勞垢習自然不起，風觸其身皆得快樂，譬如比丘得滅盡三昧。

「又，風吹散華遍滿佛土，隨色次第而不雜亂，柔軟光澤馨香芬烈，足履其上陷下四寸，隨舉足已還復如故。華用已訖地輒開裂，以次化沒清淨無遺，隨其時節風吹散華，如是六反。

「又眾寶蓮華周滿世界，一一寶華百千億葉，其葉光明無量種色，青色青光，白色白光，玄、黃、朱、紫光色亦然，煒燁煥爛，明曜日月。一一華中出三十六百千億光；一一光中出三十六百千億佛，身色紫金，相好殊特；一一諸佛又放百千光明，普為十方說微妙法；如是諸佛各各安立無量眾生於佛正道。」

無量壽經卷上

佛說無量壽經卷下

曹魏天竺三藏康僧鎧譯

佛告阿難：「其有眾生生彼國者，皆悉住於正定之聚。所以者何？彼佛國中無諸邪聚及不定之聚，十方恒沙諸佛如來皆共讚歎無量壽佛威神功德不可思議。諸有眾生聞其名號信心歡喜，乃至一念，至心迴向願生彼國，即得往生住不退轉，唯除五逆、誹謗正法。」

佛告阿難：「十方世界諸天人民，其有至心願生彼國，凡有三輩。其上輩者，捨家棄欲而作沙門，發菩提心，一向專念無量壽佛，修諸功德願生彼國。此等眾生臨壽終時，無量壽佛與諸大眾現其人前，即隨彼佛往生其國，便於七寶華中自然化生，住不退轉，智慧勇猛，神通自在。是故，阿難！其有眾生欲於今世見無量壽佛，應發無上菩提之心，修行功德，願生彼國。」

佛語阿難：「其中輩者，十方世界諸天人民，其有至心願生彼國，雖不能行作沙門大修功德，當發無上菩提之心，一向專念無量壽佛。多少修善、奉持齋戒、起立塔像、飯食沙門、懸繒然燈、散華燒香，以此迴向願生彼國。其人臨終，無量壽佛化現其身——光明相好，具如真佛——與諸大眾現其人前，即隨化佛往生其國，住不退轉，功德智慧次如上輩者也。」

佛語阿難：「其下輩者，十方世界諸天人民，其有至心欲生彼國，假使不能作諸功德，當發無上菩提之心，一向專意乃至十念，念無量壽佛，願生其國。若聞深法歡喜信樂，不生疑惑，乃至一念念於彼佛，以至誠心願生其國。此人臨終夢見彼佛，亦得往生，功德智慧次如中輩者也。」

佛告阿難：「無量壽佛威神無極，十方世界無量無邊不可思議諸佛如來莫不稱歎。於彼東方恒沙佛國，無量無數諸菩薩眾，皆悉往詣無量壽佛所恭敬供養，及諸菩薩、聲聞大眾聽受經法，宣布道化；南、西、北方、四維，上、下亦復如是。」

爾時，世尊而說頌曰：

「東方諸佛國，  	其數如恒沙，
彼土諸菩薩，  	往覲無量覺；
南、西、北四維，  	上、下亦復然。
彼土菩薩眾，  	往覲無量覺，
一切諸菩薩，  	各齎天妙華，
寶香無價衣，  	供養無量覺；
咸然奏天樂，  	暢發和雅音，
歌歎最勝尊，  	供養無量覺。
究達神通慧，  	遊入深法門，
具足功德藏，  	妙智無等倫。
慧日照世間，  	消除生死雲，
恭敬遶三匝，  	稽首無上尊。
見彼嚴淨土，  	微妙難思議，
因發無量心，  	願我國亦然。
應時無量尊，  	動容發欣笑，
口出無數光，  	遍照十方國。
迴光圍遶身，  	三匝從頂入，
一切天、人眾，  	踊躍皆歡喜。
大士觀世音，  	整服稽首問，
白佛：『何緣笑？  	唯然願說意。』
梵聲猶雷震，  	八音暢妙響：
『當授菩薩記，  	今說仁諦聽。
十方來正士，  	吾悉知彼願，
志求嚴淨土，  	受決當作佛；
覺了一切法，  	猶如夢幻響，
滿足諸妙願，  	必成如是剎。
知法如電影，  	究竟菩薩道，
具諸功德本，  	受決當作佛；
通達諸法門，  	一切空無我，
專求淨佛土，  	必成如是剎。』
諸佛告菩薩：  	『令覲安養佛，
聞法樂受行，  	疾得清淨處。
至彼嚴淨土，  	便速得神通，
必於無量尊，  	受記成等覺。』
其佛本願力，  	聞名欲往生，
皆悉到彼國，  	自致不退轉。
菩薩興志願，  	願己國無異，
普念度一切，  	名顯達十方。
奉事億如來，  	飛化遍諸剎，
恭敬歡喜去，  	還到安養國。
若人無善本，  	不得聞此經；
清淨有戒者，  	乃獲聞正法。
曾更見世尊，  	則能信此事，
謙敬聞奉行，  	踊躍大歡喜。
憍慢弊懈怠，  	難以信此法；
宿世見諸佛，  	樂聽如是教。
聲聞或菩薩，  	莫能究聖心，
譬如從生盲，  	欲行開導人。
如來智慧海，  	深廣無崖底，
二乘非所測，  	唯佛獨明了。
假使一切人，  	具足皆得道，
淨慧如本空，  	億劫思佛智，
窮力極講說，  	盡壽猶不知。
佛慧無邊際，  	如是致清淨，
壽命甚難得，  	佛世亦難值。
人有信慧難，  	若聞精進求，
聞法能不忘，  	見敬得大慶，
則我善親友，  	是故當發意。
設滿世界火，  	必過要聞法，
會當成佛道，  	廣濟生死流。」
佛告阿難：「彼國菩薩皆當究竟一生補處——除其本願為眾生故——以弘誓功德而自莊嚴，普欲度脫一切眾生。阿難！彼佛國中諸聲聞眾身光一尋，菩薩光明照百由旬。有二菩薩最尊第一，威神光明普照三千大千世界。」

阿難白佛：「彼二菩薩其號云何？」

佛言：「一名觀世音，二名大勢至。是二菩薩於此國土修菩薩行，命終轉化生彼佛國。阿難！其有眾生生彼國者，皆悉具足三十二相，智慧成滿，深入諸法，究暢要妙，神通無礙，諸根明利。其鈍根者成就二忍，其利根者得阿僧祇無生法忍。又彼菩薩乃至成佛不更惡趣，神通自在常識宿命，除生他方五濁惡世，示現同彼如我國也。」

佛語阿難：「彼國菩薩承佛威神，一食之頃往詣十方無量世界，恭敬供養諸佛世尊，隨心所念，華香、伎樂、繒蓋、幢幡，無數無量供養之具自然化生，應念即至，珍妙殊特非世所有。轉以奉散諸佛、菩薩、聲聞大眾，在虛空中化成華蓋，光色晃耀，香氣普熏。其華周圓四百里者，如是轉倍，乃覆三千大千世界，隨其前後以次化沒。其諸菩薩僉然欣悅，於虛空中共奏天樂，以微妙音歌歎佛德，聽受經法歡喜無量。供養佛已、未食之前，忽然輕舉還其本國。」

佛語阿難：「無量壽佛為諸聲聞、菩薩大眾頒宣法時，都悉集會七寶講堂，廣宣道教，演暢妙法，莫不歡喜，心解得道。即時四方自然風起，普吹寶樹出五音聲，雨無量妙華隨風周遍，自然供養如是不絕。一切諸天皆齎天上百千華香、萬種伎樂供養其佛及諸菩薩、聲聞大眾，普散華香、奏諸音樂，前後來往更相開避。當斯之時，熙然快樂不可勝言。」

佛告阿難：「生彼佛國諸菩薩等，所可講說常宣正法，隨順智慧無違無失。於其國土所有萬物，無我所心、無染著心，去來進止情無所係，隨意自在無所適莫，無彼、無我，無競、無訟。於諸眾生得大慈悲饒益之心、柔軟調伏無忿恨心、離蓋清淨無厭怠心、等心、勝心、深心、定心、愛法樂法喜法之心、滅諸煩惱離惡趣心，究竟一切菩薩所行，具足成就無量功德，得深禪定諸通明慧，遊志七覺修心佛法，肉眼清徹靡不分了、天眼通達無量無限、法眼觀察究竟諸道、慧眼見真能度彼岸、佛眼具足覺了法性。以無礙智為人演說，等觀三界空無所有，志求佛法具諸辯才，除滅眾生煩惱之患。從如來生，解法如如，善知習滅，音聲方便。不欣世語，樂在正論，修諸善本，志崇佛道。知一切法皆悉寂滅，生身煩惱二餘俱盡。聞甚深法心不疑懼，常能修行其大悲者。深遠微妙靡不覆載，究竟一乘至于彼岸。決斷疑網，慧由心出，於佛教法該羅無外。智慧如大海、三昧如山王，慧光明淨超踰日月，清白之法具足圓滿。

「猶如雪山，照諸功德等一淨故；猶如大地，淨穢好惡無異心故；猶如淨水，洗除塵勞諸垢染故；猶如火王，燒滅一切煩惱薪故；猶如大風，行諸世界無障閡故；猶如虛空，於一切有無所著故；猶如蓮華，於諸世間無染污故；猶如大乘，運載群萌出生死故；猶如重雲，震大法雷覺未覺故；猶如大雨，雨甘露法潤眾生故；如金剛山，眾魔外道不能動故；如梵天王，於諸善法最上首故；如尼拘類樹，普覆一切故；如優曇鉢華，希有難遇故；如金翅鳥，威伏外道故；如眾遊禽，無所藏積故；猶如牛王，無能勝故；猶如象王，善調伏故；如師子王，無所畏故。

「曠若虛空，大慈等故；摧滅嫉心，不望勝故。專樂求法，心無厭足；常欲廣說，志無疲倦。擊法鼓、建法幢、曜慧日、除癡闇、修六和敬、常行法施，志勇精進，心不退弱。為世燈明、最勝福田，常為師導等無憎愛。唯樂正道無餘欣慼，拔諸欲刺以安群生，功德殊勝莫不尊敬，滅三垢障遊諸神通。因力、緣力、意力、願力、方便之力、常力、善力、定力、慧力、多聞之力、施戒、忍辱、精進、禪定、智慧之力、正念止觀諸通明力、如法調伏諸眾生力，如是等力一切具足。身色相好，功德、辯才具足莊嚴，無與等者。恭敬供養無量諸佛，常為諸佛所共稱歎。究竟菩薩諸波羅蜜，修空無相無願三昧、不生不滅諸三昧門，遠離聲聞緣覺之地。

「阿難！彼諸菩薩成就如是無量功德，我但為汝略言之耳；若廣說者，百千萬劫不能窮盡。」

佛告彌勒菩薩、諸天、人等：「無量壽國聲聞、菩薩功德智慧不可稱說，又其國土微妙安樂清淨若此，何不力為善，念道之自然，著於無上下，洞達無邊際？宜各勤精進，努力自求之，必得超絕去，往生安養國。橫截五惡趣，惡趣自然閉；昇道無窮極，易往而無人。其國不逆違，自然之所牽，何不棄世事，勤行求道德，可獲極長生，壽樂無有極？

「然世人薄俗，共諍不急之事。於此劇惡極苦之中，勤身營務以自給濟。無尊、無卑，無貧、無富，少、長、男、女共憂錢財，有無同然，憂思適等。屏營愁苦，累念積慮，為心走使，無有安時——有田憂田、有宅憂宅，牛、馬、六畜、奴婢、錢財、衣、食、什物，復共憂之——重思累息，憂念愁怖，橫為非常、水、火、盜賊、怨家、債主焚漂劫奪，消散磨滅，憂毒忪忪，無有解時。結憤心中不離憂惱，心堅意固適無縱捨，或坐摧碎身亡命終，棄捐之去莫誰隨者。

「尊貴、豪富亦有斯患，憂懼萬端，勤苦若此，結眾寒熱與痛共俱。貧窮下劣困乏常無，無田亦憂欲有田、無宅亦憂欲有宅，無牛、馬、六畜、奴婢、錢財、衣、食、什物亦憂欲有之。適有一復少一、有是少是，思有齊等；適欲具有便復糜散。如是憂苦當復求索，不能時得思想無益，身心俱勞，坐起不安，憂念相隨，勤苦若此，亦結眾寒熱與痛共俱。或時坐之終身夭命，不肯為善、行道、進德，壽終身死當獨遠去，有所趣向善惡之道，莫能知者。

「世間人民，父子、兄弟、夫婦、家室、中外親屬，當相敬愛，無相憎嫉；有無相通，無得貪惜；言色常和，莫相違戾。或時心諍有所恚怒，今世恨意微相憎嫉，後世轉劇至成大怨。所以者何？世間之事更相患害，雖不即時應急相破，然含毒畜怒結憤精神，自然剋識不得相離，皆當對生更相報復。人在世間愛欲之中，獨生、獨死，獨去、獨來，當行至趣苦樂之地，身自當之無有代者。善惡變化、殃福異處，宿豫嚴待，當獨趣入。遠到他所莫能見者，善惡自然追行所生。窈窈冥冥別離久長，道路不同會見無期，甚難甚難復得相值。何不棄眾事，各曼強健時，努力勤修善，精進願度世，可得極長生？如何不求道，安所須待，欲何樂乎？

「如是，世人不信作善得善、為道得道，不信人死更生、惠施得福，善惡之事都不信之，謂之不然終無有是。但坐此故，且自見之，更相瞻視，先後同然。轉相承受父餘教令，先人祖父素不為善、不識道德，身愚神闇，心塞意閉。死生之趣、善惡之道，自不能見，無有語者；吉凶禍福，競各作之，無一怪也。生死常道轉相嗣立，或父哭子、或子哭父，兄弟、夫婦更相哭泣，顛倒上下無常根本，皆當過去不可常保。教語開導，信之者少，是以生死流轉無有休止。

「如此之人，曚冥抵突，不信經法，心無遠慮，各欲快意；癡惑於愛欲，不達於道德；迷沒於瞋怒，貪狼於財色。坐之不得道，當更惡趣苦，生死無窮已，哀哉甚可傷。或時室家，父子、兄弟、夫婦，一死一生更相哀愍，恩愛、思慕、憂念結縛，心意痛著迭相顧戀，窮日卒歲無有解已。教語道德心不開明，思想恩好不離情欲。惛曚閉塞，愚惑所覆，不能深思熟計、心自端政、專精行道、決斷世事，便旋至竟年壽終盡不能得道，無可奈何。

「總猥憒擾皆貪愛欲，惑道者眾、悟之者寡，世間怱怱，無可聊賴。尊卑、上下、貧富、貴賤，勤苦怱務各懷殺毒，惡氣窈冥為妄興事，違逆天地不從人心，自然非惡先隨與之。恣聽所為待其罪極，其壽未盡便頓奪之。下入惡道，累世懟苦展轉其中，數千億劫無有出期。痛不可言，甚可哀愍。」

佛告彌勒菩薩、諸天人等：「我今語汝世間之事，人用是故，坐不得道。當熟思計遠離眾惡，擇其善者勤而行之。愛欲榮華不可常保，皆當別離無可樂者。曼佛在世當勤精進，其有至願生安樂國者，可得智慧明達、功德殊勝；勿得隨心所欲，虧負經戒在人後也。儻有疑意不解經者，可具問佛，當為說之。」

彌勒菩薩長跪白言：「佛威神尊重，所說快善，聽佛經者貫心思之。世人實爾如佛所言，今佛慈愍顯示大道，耳目開明長得度脫，聞佛所說莫不歡喜。諸天、人民、蠕動之類，皆蒙慈恩解脫憂苦。佛語教誡甚深甚善，智慧明見八方、上下、去來今事，莫不究暢。今我眾等所以蒙得度脫，皆佛前世求道之時謙苦所致。恩德普覆，福祿巍巍，光明徹照達空無極；開入泥洹，教授典攬威制消化，感動十方無窮無極。佛為法王尊超眾聖，普為一切天人之師，隨心所願皆令得道。今得值佛，復聞無量壽聲，靡不歡喜，心得開明。」

佛告彌勒：「汝言是也。若有慈敬於佛者，實為大善。天下久久乃復有佛，今我於此世作佛，演說經法，宣布道教，斷諸疑網；拔愛欲之本，杜眾惡之源。遊步三界無所拘閡，典攬智慧眾道之要，執持綱維昭然分明，開示五趣度未度者，決正生死泥洹之道。

「彌勒當知，汝從無數劫來修菩薩行，欲度眾生，其已久遠，從汝得道至于泥洹不可稱數。汝及十方諸天、人民一切四眾，永劫已來展轉五道，憂畏勤苦不可具言，乃至今世生死不絕，與佛相值聽受經法，又復得聞無量壽佛。快哉甚善，吾助爾喜。

「汝今亦可自厭生、死、老、病、痛苦、惡露、不淨、無可樂者，宜自決斷。端身正行，益作諸善；修己潔體，洗除心垢；言行忠信，表裏相應；人能自度，轉相拯濟；精明求願，積累善本。雖一世勤苦須臾之間，後生無量壽佛國快樂無極，長與道德合明，永拔生死根本，無復貪恚、愚癡、苦惱之患。欲壽一劫、百劫、千億萬劫，自在隨意皆可得之，無為自然次於泥洹之道。汝等宜各精進求心所願，無得疑惑中悔自為過咎，生彼邊地七寶宮殿，五百歲中受諸厄也。」

彌勒白佛：「受佛重誨，專精修學，如教奉行，不敢有疑。」

佛告彌勒：「汝等能於此世端心正意，不作眾惡，甚為至德，十方世界最無倫匹。所以者何？諸佛國土天人之類自然作善，不大為惡，易可開化。今我於此世間作佛，處於五惡、五痛、五燒之中，為最劇苦。教化群生令捨五惡、令去五痛、令離五燒；降化其意令持五善，獲其福德度世長壽泥洹之道。」

佛言：「何等為五惡？何等五痛？何等五燒？何等消化五惡、令持五善，獲其福德度世長壽泥洹之道？

「其一惡者，諸天、人民、蠕動之類。欲為眾惡莫不皆然。強者伏弱轉相剋賊，殘害殺戮迭相吞噬，不知修善惡逆無道，後受殃罰自然趣向。神明記識犯者不赦，故有貧窮、下賤、乞丐、孤獨、聾盲、瘖啞、愚癡、憋惡，至有尫狂不逮之屬。又有尊貴、豪富、高才、明達皆由宿世慈孝、修善積德所致。世有常道、王法、牢獄不肯畏慎，為惡入罪受其殃罰，求望解脫難得免出。世間有此目前現事，壽終後世尤深尤劇，入其幽冥轉生受身。譬如王法痛苦極刑，故有自然三塗無量苦惱，轉貿其身、改形易道，所受壽命或長或短，魂神精識自然趣之。當獨值向相從共生，更相報復無有止已，殃惡未盡不得相離，展轉其中無有出期，難得解脫痛不可言。天地之間自然有是，雖不即時卒暴應至，善惡之道會當歸之。是為一大惡、一痛、一燒，勤苦如是。

「譬如大火焚燒人身，人能於中一心制意、端身正行，獨作諸善、不為眾惡者，身獨度脫，獲其福德度世上天泥洹之道，是為一大善也。」

佛言：「其二惡者，世間人民——父子、兄弟、室家、夫婦——都無義理，不順法度。奢婬憍縱，各欲快意，任心自恣，更相欺惑。心口各異、言念無實、佞諂不忠、巧言諛媚、嫉賢謗善，陷入怨枉。主上不明任用臣下、臣下自在機偽多端，踐度能行知其形勢。在位不正為其所欺，妄損忠良不當天心。臣欺其君、子欺其父，兄弟、夫婦、中外知識更相欺誑，各懷貪欲、瞋恚、愚癡，欲自厚己、欲貪多有，尊卑、上下心俱同然。破家亡身不顧前後，親屬內外坐之滅族。或時室家、知識、鄉黨、市里、愚民、野人轉共從事，更相剝害，忿成怨結。富有慳惜不肯施與，愛保貪重心勞身苦，如是至竟無所恃怙，獨來獨去無一隨者。善惡、禍福追命所生，或在樂處、或入苦毒，然後乃悔，當復何及？世間人民心愚少智，見善憎謗不思慕及，但欲為惡妄作非法，常懷盜心悕望他利，消散磨盡而復求索。邪心不正，懼人有色，不豫思計，事至乃悔。今世現有王法牢獄，隨罪趣向受其殃罰。因其前世不信道德、不修善本，今復為惡，天神剋識別其名籍，壽終神逝下入惡道，故有自然三塗無量苦惱。展轉其中，世世累劫無有出期，難得解脫痛不可言，是為二大惡、二痛、二燒，勤苦如是。

「譬如大火焚燒人身，人能於中一心制意、端身正行，獨作諸善、不為眾惡者，身獨度脫，獲其福德度世上天泥洹之道，是為二大善也。」

佛言：「其三惡者，世間人民相因寄生，共居天地之間，處年壽命無能幾何。上有賢明長者、尊貴豪富，下有貧窮㒋賤、尫劣愚夫，中有不善之人常懷邪惡，但念婬妷，煩滿胸中，愛欲交亂坐起不安，貪意守惜但欲唐得。眄睞細色邪態外逸，自妻厭憎私妄出入，費損家財事為非法，交結聚會興師相伐，攻劫殺戮強奪不道。惡心在外不自修業，盜竊趣得欲擊成事，恐勢迫脅歸給妻子，恣心快意極身作樂。或於親屬不避尊卑，家室中外患而苦之，亦復不畏王法禁令。如是之惡著於人鬼，日月照見、神明記識，故有自然三塗無量苦惱。展轉其中，世世累劫無有出期，難得解脫痛不可言，是為三大惡、三痛、三燒，勤苦如是。

「譬如大火焚燒人身，人能於中一心制意、端身正行，獨作諸善、不為眾惡者，身獨度脫，獲其福德度世上天泥洹之道，是為三大善也。」

佛言：「其四惡者，世間人民不念修善，轉相教令共為眾惡。兩舌、惡口、妄言、綺語、讒賊、鬪亂，憎嫉善人、敗壞賢明，於傍快喜。不孝二親、輕慢師長，朋友無信，難得誠實。尊貴自大謂己有道，橫行威勢侵易於人，不能自知，為惡無恥，自以強健欲人敬難，不畏天地、神明、日月，不肯作善，難可降化。自用偃蹇謂可常爾，無所憂懼，常懷憍慢。如是眾惡，天神記識，賴其前世頗作福德，小善扶接營護助之；今世為惡福德盡滅，諸善神鬼各去離之，身獨空立無所復依。壽命終盡諸惡所歸，自然迫促共趣奪之。又其名籍記在神明，殃咎牽引當往趣向，罪報自然無從捨離。但得前行入於火鑊，身心摧碎、精神痛苦，當斯之時悔復何及？天道自然，不得蹉跌，故有自然三塗無量苦惱。展轉其中，世世累劫無有出期，難得解脫痛不可言，是為四大惡、四痛、四燒，勤苦如是。

「譬如大火焚燒人身，人能於中一心制意、端身正行，獨作諸善、不為眾惡，身獨度脫，獲其福德度世上天泥洹之道，是為四大善也。」

佛言：「其五惡者，世間人民徙倚懈惰，不肯作善、治身修業，家室眷屬飢寒困苦。父母教誨瞋目怒應，言令不和違戾反逆譬如怨家，不如無子。取與無節，眾共患厭，負恩違義，無有報償之心。貧窮困乏不能復得，辜較縱奪放恣遊散，串數唐得用自賑給。耽酒嗜美、飲食無度，肆心蕩逸、魯扈抵突，不識人情強欲抑制。見人有善憎嫉惡之，無義、無禮，無所顧錄。自用職當不可諫曉，六親眷屬所資有無不能憂念。不惟父母之恩、不存師友之義，心常念惡、口常言惡、身常行惡，曾無一善。不信先聖諸佛經法、不信行道可得度世、不信死後神明更生、不信作善得善為惡得惡。欲殺真人，鬪亂眾僧，欲害父母、兄弟、眷屬，六親憎惡願令其死。

「如是世人心意俱然，愚癡曚昧而自以智慧，不知生所從來、死所趣向。不仁、不順，逆惡天地，而於其中悕望僥倖，欲求長生，會當歸死。慈心教誨令其念善，開示生死善惡之趣自然有是，而不信之；苦心與語無益其人，心中閉塞意不開解。大命將終悔懼交至，不豫修善臨窮方悔，悔之於後將何及乎？天地之間五道分明，恢廓窈冥浩浩茫茫，善惡報應禍福相承，身自當之無誰代者。

「數之自然應其所行，殃咎追命無得縱捨。善人行善，從樂入樂、從明入明；惡人行惡，從苦入苦、從冥入冥。誰能知者？獨佛知耳。教語開示，信用者少，生死不休，惡道不絕。如是，世人難可具盡，故有自然三塗無量苦惱。展轉其中，世世累劫無有出期，難得解脫，痛不可言，是為五大惡、五痛、五燒，勤苦如是。

「譬如大火焚燒人身，人能於中一心制意、端身正念，言行相副、所作至誠，所語如語、心口不轉，獨作諸善、不為眾惡者，身獨度脫，獲其福德度世上天泥洹之道，是為五大善也。」

佛告彌勒：「吾語汝等，是世五惡勤苦若此，五痛、五燒展轉相生，但作眾惡不修善本，皆悉自然入諸惡趣。或其今世先被殃病，求死不得、求生不得，罪惡所招示眾見之。身死隨行入三惡道，苦毒無量自相燋然。至其久後共作怨結，從小微起遂成大惡，皆由貪著財色、不能施慧，癡欲所迫、隨心思想，煩惱結縛無有解已，厚己諍利無所省錄。富貴榮華當時快意，不能忍辱不務修善，威勢無幾隨以磨滅，身生勞苦久後大劇。天道施張自然糺舉，綱紀羅網上下相應，焭焭忪忪當入其中。古今有是，痛哉可傷！」

佛語彌勒：「世間如是，佛皆哀之。以威神力摧滅眾惡，悉令就善棄捐所思，奉持經戒、受行道法，無所違失，終得度世泥洹之道。」

佛言：「汝今諸天人民及後世人，得佛經語當熟思之，能於其中端心正行，主上為善、率化其下，轉相勅令各自端守，尊聖敬善、仁慈博愛。佛語教誨無敢虧負，當求度世拔斷生死眾惡之本，永離三塗無量憂畏苦痛之道。汝等於是廣殖德本，布恩施慧，勿犯道禁，忍辱、精進、一心、智慧轉相教化。

「為德立善，正心正意，齋戒清淨一日一夜，勝在無量壽國為善百歲。所以者何？彼佛國土無為自然，皆積眾善，無毛髮之惡，於此修善十日十夜，勝於他方諸佛國中為善千歲。所以者何？他方佛國為善者多、為惡者少，福德自然，無造惡之地。唯此間多惡無有自然，勤苦求欲轉相欺殆，心勞形困飲苦食毒，如是怱務未甞寧息。吾哀汝等天人之類，苦心誨喻教令修善，隨器開導授與經法，莫不承用，在意所願皆令得道。佛所遊履，國邑丘聚靡不蒙化，天下和順，日月清明，風雨以時，災厲不起，國豐民安，兵戈無用，崇德興仁，務修禮讓。」

佛言：「我哀愍汝等諸天人民，甚於父母念子。今吾於此世作佛，降化五惡、消除五痛、絕滅五燒，以善攻惡，拔生死之苦，令獲五德，昇無為之安。吾去世後經道漸滅，人民諂偽復為眾惡，五燒、五痛還如前法，久後轉劇不可悉說，我但為汝略言之耳。」

佛告彌勒：「汝等各善思之，轉相教誡，如佛經法，無得犯也。」

於是，彌勒菩薩合掌白言：「佛所說甚善。世人實爾，如來普慈哀愍悉令度脫，受佛重誨不敢違失。」

佛告阿難：「汝起更整衣服，合掌恭敬，禮無量壽佛。十方國土諸佛如來，常共稱揚讚歎彼佛，無著無閡。」

於是，阿難起整衣服，正身西向，恭敬合掌，五體投地禮無量壽佛。白言：「世尊！願見彼佛安樂國土及諸菩薩聲聞大眾。」

說是語已，即時無量壽佛放大光明，普照一切諸佛世界，金剛圍山、須彌山王、大小諸山，一切所有皆同一色。譬如劫水彌滿世界，其中萬物沈沒不現，滉瀁浩汗唯見大水；彼佛光明亦復如是，聲聞、菩薩一切光明皆悉隱蔽，唯見佛光明耀顯赫。

爾時，阿難即見無量壽佛，威德巍巍如須彌山王，高出一切諸世界上，相好光明靡不照耀。此會四眾一時悉見，彼見此土亦復如是。

爾時，佛告阿難及慈氏菩薩：「汝見彼國，從地已上至淨居天，其中所有微妙嚴淨自然之物，為悉見不？」

阿難對曰：「唯然，已見。」

「汝寧復聞無量壽佛大音宣布一切世界化眾生不？」

阿難對曰：「唯然，已聞。」

「彼國人民乘百千由旬七寶宮殿無所障閡，遍至十方供養諸佛，汝復見不？」

對曰：「已見。」

「彼國人民有胎生者，汝復見不？」

對曰：「已見。」

「其胎生者所處宮殿，或百由旬或五百由旬，各於其中受諸快樂，如忉利天，亦皆自然。」

爾時，慈氏菩薩白佛言：「世尊！何因何緣彼國人民胎生化生？」

佛告慈氏：「若有眾生以疑惑心修諸功德，願生彼國，不了佛智、不思議智、不可稱智、大乘廣智、無等無倫最上勝智，於此諸智疑惑不信；然猶信罪福，修習善本，願生其國。此諸眾生生彼宮殿，壽五百歲，常不見佛、不聞經法、不見菩薩聲聞聖眾，是故於彼國土謂之胎生。若有眾生明信佛智乃至勝智，作諸功德信心迴向，此諸眾生於七寶華中自然化生，加趺而坐，須臾之頃，身相光明，智慧功德如諸菩薩具足成就。

「復次，慈氏！他方諸大菩薩發心欲見無量壽佛，恭敬供養及諸菩薩聲聞之眾。彼菩薩等命終得生無量壽國，於七寶華中自然化生。彌勒當知，彼化生者智慧勝故。其胎生者皆無智慧，於五百歲中常不見佛、不聞經法、不見菩薩諸聲聞眾，無由供養於佛、不知菩薩法式、不得修習功德，當知此人宿世之時無有智慧，疑惑所致。」

佛告彌勒：「譬如轉輪聖王別有宮室，七寶莊飾，張設床帳，懸諸繒幡。若有諸小王子得罪於王，輒內彼宮中，繫以金鎖，供給飲食、衣服、床蓐、華香、伎樂，如轉輪王無所乏少。於意云何？此諸王子寧樂彼處不？」

對曰：「不也，但種種方便求諸大力欲自勉出。」

佛告彌勒：「此諸眾生亦復如是。以疑惑佛智生彼宮殿，無有刑罰乃至一念惡事，但於五百歲中不見三寶，不得供養修諸善本。以此為苦，雖有餘樂猶不樂彼處。若此眾生識其本罪，深自悔責求離彼處，即得如意，往詣無量壽佛所恭敬供養，亦得遍至無量無數諸如來所修諸功德。彌勒當知，其有菩薩生疑惑者，為失大利。是故，應當明信諸佛無上智慧。」

彌勒菩薩白佛言：「世尊！於此世界有幾所不退菩薩生彼佛國？」

佛告彌勒：「於此世界有六十七億不退菩薩往生彼國。一一菩薩已曾供養無數諸佛，次如彌勒者也；諸小行菩薩及修習少功德者不可稱計，皆當往生。」

佛告彌勒：「不但我剎諸菩薩等往生彼國，他方佛土亦復如是。其第一佛名曰遠照，彼有百八十億菩薩皆當往生。其第二佛名曰寶藏，彼有九十億菩薩皆當往生。其第三佛名曰無量音，彼有二百二十億菩薩皆當往生。其第四佛名曰甘露味，彼有二百五十億菩薩皆當往生。其第五佛名曰龍勝，彼有十四億菩薩皆當往生。其第六佛名曰勝力，彼有萬四千菩薩皆當往生。其第七佛名曰師子，彼有五百億菩薩皆當往生。其第八佛名曰離垢光，彼有八十億菩薩皆當往生。其第九佛名曰德首，彼有六十億菩薩皆當往生。其第十佛名曰妙德山，彼有六十億菩薩皆當往生。其第十一佛名曰人王，彼有十億菩薩皆當往生。其第十二佛名曰無上華，彼有無數不可稱計諸菩薩眾——皆不退轉，智慧勇猛，已曾供養無量諸佛，於七日中即能攝取百千億劫大士所修堅固之法——斯等菩薩皆當往生。其第十三佛名曰無畏，彼有七百九十億大菩薩眾、諸小菩薩及比丘等不可稱計皆當往生。」

佛語彌勒：「不但此十四佛國中諸菩薩等當往生也，十方世界無量佛國其往生者亦復如是，甚多無數。我但說十方諸佛名號及菩薩、比丘生彼國者，晝夜一劫尚未能竟，我今為汝略說之耳。」

佛語彌勒：「其有得聞彼佛名號，歡喜踊躍，乃至一念，當知此人為得大利，則是具足無上功德。是故，彌勒！設有大火充滿三千大千世界，要當過此。聞是經法，歡喜信樂，受持讀誦，如說修行。所以者何？多有菩薩欲聞此經而不能得。若有眾生聞此經者，於無上道終不退轉，是故應當專心信受持誦說行。吾今為諸眾生說此經法，令見無量壽佛及其國土一切所有，所當為者皆可求之，無得以我滅度之後復生疑惑。當來之世經道滅盡，我以慈悲哀愍特留此經止住百歲，其有眾生值斯經者，隨意所願皆可得度。」

佛語彌勒：「如來興世難值難見、諸佛經道難得難聞；菩薩勝法諸波羅蜜得聞亦難；遇善知識、聞法能行此亦為難；若聞斯經信樂受持，難中之難無過此難。是故我法，如是作、如是說、如是教，應當信順，如法修行。」

爾時，世尊說此經法，無量眾生皆發無上正覺之心，萬二千那由他人得清淨法眼，二十二億諸天人民得阿那含，八十萬比丘漏盡意解，四十億菩薩得不退轉，以弘誓功德而自莊嚴，於將來世當成正覺。爾時，三千大千世界六種震動，大光普照十方國土，百千音樂自然而作，無量妙華芬芬而降。

佛說經已，彌勒菩薩及十方來諸菩薩眾，長老阿難、諸大聲聞，一切大眾，聞佛所說靡不歡喜。

無量壽經卷下
^:<name=timestamp preload=true>vid	videohost	bookid	performer	timestamp=numbers
5C4INS3hK407OXGM0CArAwBkLfOEyEW6UDCjB_dfSrCQDnLGZhs6hH0P5HI-Yw7AaoRquHJ4jzXKsSt8uh97EEFcXpROd_PKBb0YWNJUqf7YIQ_afssYk-CUQbDOcp6uk584iL_W8W2737Am9ZmMrY88qEn7ehR3iVBLgw35152ox685wjvwySjCVoQz-IpOREVDHo

youtubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeqqyoutubeyoutube
vcpp_kumarajivapphspphsbhaisajyabhaisajyapphsvcpp_kumarajivaamtb_xuanzangvcpp_kumarajivabhaisajyapphspphspphsvcpp_kumarajivapphvcpp_kumarajivavcpp_kumarajivavcpp_kumarajiva
養德禪寺課頌寬邦漢語見仁法師法鼓山王菲張智霖法鼓山星辰王菲湛願法師寬邦日語般禪梵唱張學友心定法師王菲朗誦王菲(腾讯)蔣勳見輝法師
;'6!*;I#;t;^ =A ;-;!.@i!;_0;'!   ;">7..
^:<name=timestamp_sanskrit preload=true>vid	videohost	bookid	performer	timestamp=numbers
bDOcp6uk584bDOcp6uk584

youtubeyoutube
pphspphs
般禪梵唱般禪梵唱
;;
^pb1^folio#vcpp_kumarajiva^bk#vcpp_kumarajiva<heading=金剛經>【金剛般若波羅蜜經】^ck0【經題】^lb^gatha^au【．．．姚秦．三藏法師．鳩摩羅什譯】
^lb^ck1【法會因由】
如是我聞：
一時，
佛在舍衛國祇樹給孤獨園，
^lb與大比丘眾千二百五十人俱。
爾時，世尊食^lb時，著衣持缽，
入舍衛大城乞食。
於其城中，次^pb2第乞已，
還至本處。
飯食訖，收衣缽，洗足已，
敷^lb座而坐。

^ck2【善現啟請】
時長老須菩提，
在大眾中，
即從座起，^lb偏袒右肩，右膝著地，合掌恭敬，而白佛言：
希^lb有，世尊！
如來善護念諸菩薩，
善付囑諸菩薩。
^lb世尊！善男子、善女人，發阿耨多羅三藐三菩^pb3提心，
云何應住？云何降伏其心？
佛言：善哉、善^lb哉！須菩提，如汝所說，
如來善護念諸菩薩，
善^lb付囑諸菩薩。
汝今諦聽，
當為汝說！
善男子、善^lb女人發阿耨多羅三藐三菩提心，應如是住、^lb如是降伏其心。」 
「唯然，世尊！」願樂欲聞。
^ck3【大乘正宗】
佛告須^pb4菩提∶諸菩薩摩訶薩，應如是降伏其心，
所有^lb一切眾生之類，
若卵生、若胎生、若濕生、若化^lb生、
若有色、若無色、若有想、若無想、若非有想^lb非無想，
我皆令入無餘涅槃而滅度之；
如是^lb滅度無量無數無邊眾生，實無眾生得滅度^pb5者。

何以故？須菩提，若菩薩有我相、人相、眾生^lb相、壽者相，即非菩薩。
^ck4【妙行無住】
復次，須菩提，
菩薩於法，^lb應無所住行於布施。
所謂不住色布施，不住^lb聲、香、味、觸、法布施。
須菩提，菩薩應如是布施，^lb不住於相。
何以故？若菩薩不住相布施，其福^pb6德不可思量。
須菩提！於意云何，東方虛空，可^lb思量不？
不也，世尊！
須菩提！南西北方、四維上^lb下虛空，可思量不？
不也，世尊！
須菩提！菩薩無^lb住相布施，福德亦復如是不可思量。
須菩提，^lb菩薩但應如所教住。
^ck5【如理實見】
須菩提！於意云何，可以^pb7身相見如來不？
不也，世尊，不可以身相得見^lb如來！
何以故？如來所說身相，即非身相。
佛告^lb須菩提：
凡所有相，皆是虛妄！若見諸相、非相，^lb則見如來！
^ck6【正信希有】
須菩提白佛言：
世尊！頗有眾生，得^lb聞如是言說章句，生實信不？
佛告須菩提：莫^pb8作是說。
如來滅後，後五百歲，有持戒修福者，
^lb於此章句能生信心，以此為實。

當知是人，不^lb於一佛、二佛、三四五佛而種善根，
已於無量^lb千萬佛所種諸善根，
聞是章句，乃至一念，生^lb淨信者，
須菩提，如來悉知、悉見，是諸眾生得^pb9如是無量福德。
何以故？是諸眾生無復我相、^lb人相、眾生相、壽者相，
無法相，亦無非法相。
何^lb以故？是諸眾生若心取相，則為著我、人、眾生、^lb壽者。若取法相，即著我、人、眾生、壽者；
何以故？^lb若取非法相，即著我、人、眾生、壽者。
是故，不應^pb10取法、不應取非法！
以是義故，如來常說，汝等^lb比丘知我說法如筏喻者。法尚應捨，何況非^lb法！
^ck7【無得無說】

須菩提，於意云何，如來得阿耨多羅三藐^lb三菩提耶，如來有所說法耶？
須菩提言：
如我^lb解佛所說義，無有定法名阿耨多羅三藐三^pb11菩提，亦無有定法如來可說。
何以故？如來所^lb說法皆不可取、不可說，非法、非非法。
所以者^lb何？一切賢聖皆以無為法而有差別。
^ck8【依法出生】
須菩提，^lb於意云何，若人滿三千大千世界七寶以用^lb布施 ，是人所得福德寧為多不？
須菩提言：甚^pb12多，世尊！
何以故？是福德即非福德性，是故如^lb來說福德多。

若復有人，於此經中受持乃至^lb四句偈等，為他人說，其福勝彼。
何以故？須菩^lb提，一切諸佛，及諸佛阿耨多羅三藐三菩提^lb法，皆從此經出。
須菩提，所謂佛法者，即非佛^pb13法！
^ck9【一相無相】
須菩提，於意云何，須陀洹能作是念『我得^lb須陀洹果』不？
須菩提言：不也，世尊！何以故？須^lb陀洹，名為入流，而無所入；
不入色、聲、香、味、觸、^lb法，是名須陀洹。

須菩提，於意云何，斯陀含能^lb作是念『我得斯陀含果』不？
須菩提言：「不也，世^pb14尊！何以故？斯陀含，名一往來，而實無往來，是^lb名斯陀含。」
「須菩提，於意云何，阿那含能作是^lb念『我得阿那含果』不？」
須菩提言：「不也，世尊！何^lb以故？阿那含，名為不來，而實無來，是故名^lb阿那含。」
「須菩提，於意云何，阿羅漢能作是念^pb15『我得阿羅漢道』不？」
須菩提言：「不也，世尊！何以^lb故？實無有法名阿羅漢！
世尊，若阿羅漢作是念^lb『我得阿羅漢道』，即為著我、人、眾生、壽者。
世^lb尊！佛說我得無諍三昧，人中最為第一，是第^lb一離欲阿羅漢。我不作是念：『我是離欲阿羅^pb16漢』。
世尊，我若作是念『我得阿羅漢道』，世尊則^lb不說『須菩提是樂阿蘭那行』者！以須菩提實^lb無所行，而名須菩提是樂阿蘭那行！」
^ck10【莊嚴淨土】
佛告須^lb菩提：「於意云何，如來昔在然燈佛所，於法有^lb所得不？」
「不也，世尊，如來在然燈佛所，於法實^pb17無所得。」
「須菩提，於意云何，菩薩莊嚴佛土不？」
^lb不也，世尊！何以故？莊嚴佛土者，則非莊嚴，是^lb名莊嚴。
是故，須菩提，諸菩薩摩訶薩應如是^lb生清淨心，不應住色生心，不應住聲、香、味、觸、^lb法生心，應無所住而生其心。
「須菩提！譬如有^pb18人，身如須彌山王。於意云何，是身為大不？」
須^lb菩提言：「甚大，世尊！何以故？佛說非身，是名大^lb身。」
^ck11【無為福勝】
「須菩提，如恒河中所有沙數，如是沙等恒^lb河，於意云何，是諸恒河沙寧為多不？」 
須菩提^lb言：「甚多，世尊！但諸恒河尚多無數，何況其沙！」
^pb19「須菩提，我今實言告汝，若有善男子、善女人，^lb以七寶滿爾所恒河沙數三千大千世界，以^lb用布施，得福多不？」
須菩提言：「甚多，世尊！」
佛告^lb須菩提∶「若善男子、善女人，於此經中乃至受^lb持四句偈等，為他人說，而此福德勝前福德。
^pb20^ck12【尊重正教】
復次，須菩提，隨說是經乃至四句偈等，當知^lb此處，一切世間天、人、阿修羅皆應供養，如佛^lb塔廟。
何況有人，盡能受持、讀誦！
須菩提！當知^lb是人成就最上第一希有之法！若是經典所^lb在之處，則為有佛，若尊重弟子。」
^ck13【如法受持】
爾時，須菩提^pb21白佛言：
「世尊，當何名此經，我等云何奉持？」
佛^lb告須菩提：
「是經名為『金剛般若波羅蜜』。
以是^lb名字，汝當奉持。
所以者何？須菩提，佛說般若^lb波羅蜜，則非般若波羅蜜。」
「須菩提，於意云何，^lb如來有所說法不？」
須菩提白佛言：「世尊！如來^pb22無所說。」
「須菩提，於意云何，三千大千世界所^lb有微塵，是為多不？」
須菩提言：「甚多，世尊！」
「須菩^lb提，諸微塵如來說非微塵，是名微塵；如來說^lb世界非世界，是名世界。」
「須菩提，於意云何，可^lb以三十二相見如來不？」
「不也，世尊，不可以三^pb23十二相得見如來！
何以故？如來說三十二相^lb即是非相，是名三十二相。」
「須菩提，若有善男^lb子、善女人，以恒河沙等身命布施；
若復有人，^lb於此經中乃至受持四句偈等，為他人說，其^lb福甚多。」
^ck14【離相寂滅】
爾時，須菩提聞說是經，深解義趣，涕^pb24淚悲泣而白佛言：
「希有，世尊！佛說如是甚深^lb經典！我從昔來所得慧眼，未曾得聞如是之經！

^lb世尊，若復有人得聞是經，信心清淨，則生^lb實相，當知是人成就第一希有功德！
世尊！是^lb實相者，則是非相，是故如來說名實相。
世尊，^pb25我今得聞如是經典，信解受持，不足為難。
若^lb當來世，後五百歲，其有眾生得聞是經，信解^lb受持，是人則為第一希有！
何以故？此人無我^lb相、人相、眾生相、壽者相。
所以者何？我相即是^lb非相，人相、眾生相、壽者相，即是非相。
何以故？^pb26離一切諸相，則名諸佛。」
佛告須菩提：
「如是、如^lb是！
若復有人得聞是經，不驚、不怖、不畏，當知^lb是人甚為希有！
何以故？須菩提，如來說第一^lb波羅蜜，非第一波羅蜜，是名第一波羅蜜。
^lb須菩提，忍辱波羅蜜，如來說非忍辱波羅蜜。
^pb27何以故？須菩提，如我昔為歌利王割截身體。^lb我於爾時，無我相、無人相、無眾生相、無壽者^lb相。
何以故？我於往昔節節支解時，若有我相、^lb人相、眾生相、壽者相，應生瞋恨。
須菩提！又念^lb過去，於五百世作忍辱仙人。於爾所世，無我^pb28相、無人相、無眾生相、無壽者相。
是故，須菩提，^lb菩薩應離一切相，發阿耨多羅三藐三菩提^lb心，
不應住色生心，不應住聲、香、味、觸、法生心，^lb應生無所住心。
若心有住，則為非住！
是故佛^lb說：『菩薩心不應住色布施。』
須菩提，菩薩為利^pb29益一切眾生，應如是布施。
如來說一切諸相^lb即是非相；又說一切眾生則非眾生。

須菩提，^lb如來是真語者、實語者、如語者、不誑語者、不^lb異語者。
須菩提，如來所得法，此法無實無虛。
^lb須菩提，若菩薩心住於法而行布施，如人^pb30入闇，則無所見；
若菩薩心不住法而行布施，如^lb人有目，日光明照，見種種色。
須菩提，當來之^lb世，若有善男子、善女人，能於此經受持、讀誦，^lb則為如來以佛智慧，悉知是人、悉見是人，皆^lb得成就無量無邊功德。
^ck15【持經功德】
須菩提，若有善男子、^pb31善女人，初日分以恒河沙等身布施，
中日分^lb復以恒河沙等身布施，
後日分亦以恒河沙^lb等身布施，
如是無量百千萬億劫以身布施；
^lb若復有人聞此經典，信心不逆，其福勝彼。何^lb況書寫、受持、讀誦、為人解說！
須菩提，以要言^pb32之，是經有不可思議、不可稱量无邊功德！
如^lb來為發大乘者說、為發最上乘者說！
若有人^lb能受持、讀誦、廣為人說，如來悉知是人、悉見^lb是人！
皆得成就不可量、不可稱、無有邊、不可^lb思議功德！
如是人等，則為荷擔如來阿耨多^pb33羅三藐三菩提！
何以故？須菩提，若樂小法者，
^lb著我見、人見、眾生見、壽者見，
則於此經不能^lb聽受、讀誦、為人解說！
須菩提，在在處處若有^lb此經，一切世間天、人、阿修羅所應供養！當知^lb此處則為是塔。皆應恭敬，作禮圍繞，以諸華^pb34香而散其處！
^ck16【能淨業障】
復次，須菩提，善男子、善女人受^lb持、讀誦此經，若為人輕賤，
是人先世罪業，應^lb墮惡道，以今世人輕賤故，先世罪業則為消^lb滅，當得阿耨多羅三藐三菩提！
須菩提，我念^lb過去無量阿僧祇劫，於然燈佛前，得值八百^pb35四千萬億那由他諸佛，悉皆供養承事，無空^lb過者！
若復有人於後末世能受持、讀誦此經，
^lb所得功德於我所供養諸佛功德， 百分不及^lb一，千萬億分、乃至算數譬喻所不能及！
須菩^lb提，若善男子、善女人，於後末世，有受持、讀誦^pb36此經所得功德，我若具說者，或有人聞，心則^lb狂亂、狐疑不信！
須菩提，當知是經義不可思^lb議，果報亦不可思議！」
^ck17【究竟無我】
爾時，須菩提白佛言：「世尊，善^lb男子、善女人，發阿耨多羅三藐三菩提^lb心，云何應住、云何降伏其心？」
佛告須菩提：「善^pb37男子、善女人，發阿耨多羅三藐三菩提者，^lb當生如是心：
『我應滅度一切眾生。
滅度一切^lb眾生已，而無有一眾生實滅度者。』
何以故？須^lb菩提，若菩薩有我相、人相、眾生相、壽者相，則^lb非菩薩！
所以者何？須菩提，實無有法，發阿耨^pb38多羅三藐三菩提者！」
「須菩提，於意云何，如^lb來於然燈佛所，有法得阿耨多羅三藐三菩^lb提不？」
「不也，世尊，如我解佛所說義，佛於然燈^lb佛所，無有法得阿耨多羅三藐三菩提！」
佛言：「^lb如是、如是
須菩提，實無有法，如來得阿耨多^pb39羅三藐三菩提！
須菩提，若有法如來得阿耨^lb多羅三藐三菩提者，然燈佛則不與我受記：^lb『汝於來世，當得作佛，號釋迦牟尼。』
以實無有^lb法，得阿耨多羅三藐三菩提！是故，然燈佛與^lb我受記，作是言：『汝於來世，當得作佛，號釋迦^pb40牟尼。』
何以故？如來者，即諸法如義！




若有人言^lb『如來得阿耨多羅三藐三菩提』。須菩提，實無^lb有法，佛得阿耨多羅三藐三菩提！
須菩提，如^lb來所得阿耨多羅三藐三菩提，於是中，無實^lb無虛。
是故如來說一切法皆是佛法！
須菩提，^pb41所言一切法者，即非一切法，是故名一切法！」
^lb「須菩提，譬如人身長大。」
須菩提言：「世尊，如來^lb說人身長大，則為非大身，是名大身。」
「須菩提，^lb菩薩亦如是！若作是言『我當滅度無量眾生』，^lb則不名菩薩！
何以故？須菩提，實無有法，名為^pb42菩薩！」


是故佛說，『一切法無我、無人、無眾生、無^lb壽者』。
須菩提，若菩薩作是言：『我當莊嚴佛土』，^lb是不名菩薩！
何以故？如來說莊嚴佛土者，即^lb非莊嚴，是名莊嚴。
須菩提，若菩薩通達無我^lb法者，如來說名真是菩薩！」
^ck18【一體同觀】
「須菩提，於意云何，^pb43如來有肉眼不？」
「如是，世尊，如來有肉眼！」
「須菩^lb提，於意云何，如來有天眼不？」
「如是，世尊！如來^lb有天眼！」
「須菩提，於意云何，如來有慧眼不？」
「如^lb是，世尊！如來有慧眼！」
「須菩提，於意云何，如來^lb有法眼不？」
「如是，世尊！如來有法眼！」
「須菩提，於^pb44意云何，如來有佛眼不？」
「如是，世尊！如來有佛^lb眼！」
「須菩提，於意云何，恒河中所有沙，佛說^lb是沙不？」
「如是，世尊！如來說是沙！」
「須菩提，於意^lb云何，如一恒河中所有沙，有如是等恒河，^lb是諸恒河所有沙數佛世界，如是寧為多不？」
^pb45「甚多，世尊！」
佛告須菩提：「爾所國土中所有眾^lb生若干種心，如來悉知。
何以故？如來說諸心^lb皆為非心，是名為心！
所以者何？須菩提，過去^lb心不可得、現在心不可得、未來心不可得！」
^ck19【法界通化】
「須^lb菩提，於意云何，若有人滿三千大千世界七^pb46寶以用布施，是人以是因緣得福多不？」
「如是，^lb世尊！此人以是因緣得福甚多！」

「須菩提，若福^lb德有實，如來不說得福德多，以福德無故，如^lb來說得福德多！」
^ck20【離色離相】
「須菩提，於意云何，佛可以具^lb足色身見不？」
「不也，世尊！如來不應以具足色^pb47身見！
何以故？如來說具足色身，即非具足色^lb身，是名具足色身！」
「須菩提，於意云何，如來可^lb以具足諸相見不？」
「不也，世尊！如來不應以具^lb足諸相見！
何以故？如來說諸相具足，即非具^lb足，是名諸相具足！」
^ck21【非說所說】


「須菩提，汝勿謂如來作是^pb48念『我當有所說法』！莫作是念！何以故？若人言^lb如來有所說法，即為謗佛！不能解我所說故！
^lb須菩提，說法者，無法可說，是名說法！」
爾時，慧^lb命須菩提白佛言：
「世尊，頗有眾生，於未來世，^lb聞說是法，生信心不？」
佛言：「須菩提，彼非眾生，^pb49非不眾生！
何以故？須菩提，眾生眾生者，如來^lb說非眾生，是名眾生！」
^ck22【無法可得】

須菩提白佛言：
「世尊，佛^lb得阿耨多羅三藐三菩提，為無所得耶？」
佛言：^lb「如是、如是！須菩提，我於阿耨多羅三藐三菩^lb提，乃至無有少法可得，是名阿耨多羅三藐^pb50三菩提！
^ck23【淨心行善】
復次，須菩提，是法平等，無有高下，是^lb名阿耨多羅三藐三菩提！
以無我、無人、無眾^lb生、無壽者，
修一切善法，則得阿耨多羅三藐^lb三菩提！
須菩提，所言善法者，如來說非善^lb法，是名善法！
^ck24【福智無比】
須菩提，若三千大千世界中所^pb51有諸須彌山王，如是等七寶聚，有人持用布^lb施；
若人以此般若波羅蜜經乃至四句偈等，^lb受持、讀誦、為他人說，於前福德，百分不及一、^lb百千萬億分、乃至算數譬喻所不能及！」
^ck25【化無所化】
「須菩^lb提，於意云何？汝等勿謂如來作是念『我當度^pb52眾生』！須菩提，莫作是念！
何以故？實無有眾生^lb如來度者，
若有眾生如來度者，如來則有我、^lb人、眾生、壽者！
須菩提，如來說有我者，則非有^lb我，而凡夫之人，以為有我！
須菩提，凡夫者，如^lb來說則非凡夫！」
^ck26【法身非相】
「須菩提，於意云何，可以三十^pb53二相觀如來不？」
須菩提言：「如是、如是，以三十^lb二相觀如來。」
佛言：「須菩提，若以三十二相觀^lb如來者，轉輪聖王則是如來。」
須菩提白佛言：^lb「世尊，如我解佛所說義，不應以三十二相觀^lb如來。」
爾時，世尊而說偈言：
^pb54^gatha「若以色見我．以音聲求我．是人行邪道，^lb^gatha不能見如來。

^lb^ck27【無斷無滅】
「須菩提，汝若作是念『如來不以具足相故，得^lb阿耨多羅三藐三菩提』。
須菩提，莫作是念！
如^lb來不以具足相故，得阿耨多羅三藐三菩提！
^pb55須菩提，汝若作是念『發阿耨多羅三藐三菩^lb提心者，說諸法斷滅』，莫作是念！
何以故？發阿^lb耨多羅三藐三菩提心者，於法不說斷滅相！
^lb^ck28【不受不貪】
須菩提，若菩薩以滿恒河沙等世界七寶持^lb用布施；
若復有人知一切法無我，得成於忍，^pb56此菩薩勝前菩薩所得功德！
何以故？須菩提，^lb以諸菩薩不受福德故。」
須菩提白佛言：「世尊，^lb云何菩薩不受福德？」
「須菩提，菩薩所作福德^lb不應貪著，是故說不受福德。
^ck29【威儀寂靜】
須菩提，若有人^lb言『如來若來、若去、若坐、若臥』，是人不解我所^pb57說義！
何以故？如來者，無所從來，亦無所去，故^lb名如來！
^ck30【一合理相】
須菩提，若善男子、善女人，以三千大^lb千世界碎為微塵。於意云何，是微塵眾寧為^lb多不？」
「甚多，世尊！
何以故？若是微塵眾實有者，^lb佛則不說是微塵眾！
所以者何？佛說微塵眾，^pb58則非微塵眾，是名微塵眾！
世尊，如來所說三^lb千大千世界，則非世界，是名世界！
何以故？若^lb世界實有者，則是一合相！
如來說一合相，則^lb非一合相，是名一合相！」
「須菩提，一合相者，則^lb是不可說，
但凡夫之人，貪著其事！
^ck31【知見不生】
須菩提，若^pb59人言，『佛說我見、人見、眾生見、壽者見。』須菩提，^lb於意云何，是人解我所說義不？」
「世尊，是^lb人不解如來所說義！
何以故？世尊說我見、人^lb見、眾生見、壽者見，即非我見、人見、眾生見、壽者^lb見，是名我見、人見、眾生見、壽者見！」
「須菩提，^pb60發阿耨多羅三藐三菩提心者，於一切法，應^lb如是知、如是見、如是信解，不生法相！
須菩提，^lb所言法相者，如來說即非法相，是名法相！
^ck32【應化非真】
須^lb菩提，若有人以滿無量阿僧祇世界七寶持^lb用布施；
若有善男子、善女人，發菩薩心者，持^pb61於此經乃至四句偈等，受持、讀誦、為人演說，^lb其福勝彼！
云何為人演說？
不取於相，如如不^lb動！
何以故？^lb^gatha一切有為法．如夢幻泡影．如露亦如電．^lb^gatha應作如是觀！」
^pb62佛說是經已，長老須菩提及諸比丘、比丘尼、^lb優婆塞、優婆夷，一切世間天、人、阿修羅，聞佛^lb所說，皆大歡喜，信受奉行。
^lb金剛般若波羅蜜經
^pb1^folio#vcpp_bodhiruci^bk#vcpp_bodhiruci<heading=留支 hidden=1>【金剛般若波羅蜜經】^ck0【經題】^lb^au【元魏天竺三藏菩提留支譯】
^lb^ck1〔序分第一〕
^lb如是我聞：
一時
婆伽婆，在舍婆提城祇樹給^lb孤獨園，
與大比丘眾千二百五十人俱。
爾時，^pb2世尊食時，著衣持鉢，
入舍婆提大城乞食。
於^lb其城中，次第乞食已，
還至本處。
飯食訖，收衣^lb鉢，洗足已，
如常敷座，結加趺坐，端身而住，正^lb念不動。
^lb〔護念付囑分第二〕^pb3爾時，諸比丘來詣佛所，到已，頂禮佛足，右遶^lb三匝，退坐一面。
^ck2【善現啟請】
爾時，慧命須菩提，
在大眾中，
^lb即從座起，偏袒右肩，右膝著地，向佛合掌，恭^lb敬而立，白佛言：
「希有！世尊！
如來、應供、正遍知，^lb善護念諸菩薩，
善付囑諸菩薩。
^pb4住分第三^lb世尊！云何菩薩大乘中，發阿耨多羅三藐三^lb菩提心？
應云何住？云何修行？云何降伏其心？」
^lb爾時，佛告須菩提：「善哉，善哉！須菩提！如汝所^lb說：
『如來善護念諸菩薩，
善付囑諸菩薩。』
汝今^pb5諦聽，
當為汝說。
如菩薩大乘中，發阿耨多羅^lb三藐三菩提心，應如是住，如是修行，如是降^lb伏其心。」
須菩提白佛言：「世尊！如是。願樂欲聞。」
^ck3【大乘正宗】
^lb佛告須菩提：「諸菩薩生如是心：
『所有一切眾^lb生，眾生所攝，
若卵生、若胎生、若濕生、若化生，
^pb6若有色、若無色，若有想、若無想、若非有想非^lb無想，
所有眾生界，眾生所攝，我皆令入無餘^lb涅槃而滅度之。』
如是滅度無量無邊眾生，實^lb無眾生得滅度者。
何以故？須菩提！若菩薩有^lb眾生相，即非菩薩。
何以故非？須菩提！若菩薩^pb7起眾生相、人相、壽者相，則不名菩薩。
^lb^ck4〔如實修行分第四〕
^lb「復次，須菩提！
菩薩不住於事行於布施，無所^lb住行於布施，
不住色布施，不住聲、香、味、觸、法^lb布施。
須菩提！菩薩應如是布施，不住於相想。
^pb8何以故？若菩薩不住相布施，其福德聚不可^lb思量。
「須菩提！於汝意云何？東方虛空可思量^lb不？」
須菩提言：「不也，世尊！」
佛言：「如是，須菩提！南^lb西北方四維上下虛空，可思量不？」
須菩提言：^lb「不也，世尊！」
佛言：「如是，如是！須菩提！菩薩無住^pb9相布施，福德聚亦復如是不可思量。」
佛復告^lb須菩提：「菩薩但應如是行於布施。」
^lb^ck5〔如來非有為分第五〕
^lb「須菩提！於意云何？可以相成就見如來不？」
須^lb菩提言：「不也，世尊！不可以相成就得見如來。
^pb10何以故？如來所說相，即非相。」
佛告須菩提：
「凡^lb所有相，皆是妄語。若見諸相非相，則非妄語。^lb如是諸相非相，則見如來。」
^lb^ck6〔我空法分第六〕
^lb須菩提白佛言：
「世尊！頗有眾生，於未來世末^pb11世，得聞如是修多羅章句，生實相不？」
佛告須^lb菩提：「莫作是說：
『頗有眾生，於未來世末世，得^lb聞如是修多羅章句，生實相不？』」
佛復告須菩^lb提：「有未來世末世，有菩薩摩訶薩，法欲滅時，^lb有持戒修福德智慧者，
於此修多羅章句，能^pb12生信心，以此為實。」
佛復告須菩提：「當知彼菩^lb薩摩訶薩，非於一佛二佛三四五佛所修行^lb供養，非於一佛二佛三四五佛所而種善根。」
^lb佛復告須菩提：「已於無量百千萬諸佛所修^lb行供養，無量百千萬諸佛所種諸善根。
聞是^pb13修多羅，乃至一念能生淨信。
須菩提！如來悉^lb知是諸眾生，如來悉見是諸眾生。須菩提！是^lb諸菩薩，生如是無量福德聚，取如是無量福^lb德。
何以故？須菩提！是諸菩薩，無復我相、眾生^lb相、人相、壽者相。
「須菩提！是諸菩薩，無法相，亦^pb14非無法相。無相，亦非無相。
何以故？須菩提！是^lb諸菩薩，若取法相，則為著我、人、眾生、壽者。
須^lb菩提！若是菩薩有法相，即著我相、人相、眾生^lb相、壽者相。
何以故？須菩提！不應取法，非不取^lb法。
以是義故，如來常說栰喻法門，是法應捨，^pb15非捨法故。」
^ck7【無得無說】
復次，佛告慧命須菩提：
「須菩提！於^lb意云何？如來得阿耨多羅三藐三菩提耶？如^lb來有所說法耶？」
須菩提言：
「如我解佛所說義，^lb無有定法如來得阿耨多羅三藐三菩提，亦^lb無有定法如來可說。
何以故？如來所說法，皆^pb16不可取不可說，非法非非法。
何以故？一切聖^lb人，皆以無為法得名。」
^lb^ck8〔具足功德校量分第七〕
^lb「須菩提！於意云何？若滿三千大千世界七寶，^lb以用布施。須菩提！於意云何？是善男子、善女^pb17人，所得福德，寧為多不？」
須菩提言：「甚多，婆伽^lb婆！甚多，修伽陀！彼善男子、善女人，得福甚多。
^lb何以故？世尊！是福德聚，即非福德聚，是故如^lb來說福德聚、福德聚。」
佛言：「須菩提！若善男子、^lb善女人，以滿三千大千世界七寶，持用布施。
^pb18若復於此經中，受持乃至四句偈等，為他人^lb說，其福勝彼無量不可數。
何以故？須菩提！一^lb切諸佛阿耨多羅三藐三菩提法，皆從此經^lb出。一切諸佛如來，皆從此經生。
須菩提！所謂^lb佛法、佛法者，即非佛法。
^ck9【一相無相】
「須菩提！於^pb19意云何？須陀洹能作是念：『我得須陀洹果。』不？」
^lb須菩提言：「不也，世尊！何以故？實無有法名須^lb陀洹。
不入色聲香味觸法，是名須陀洹。」

佛言：「^lb須菩提！於意云何？斯陀含能作是念：『我得斯^lb陀含果。』不？」
須菩提言：「不也，世尊！何以故？實無^pb20有法名斯陀含。是名斯陀含。」
「須菩提！於意云^lb何？阿那含能作是念：『我得阿那含果。』不？」
須菩^lb提言：「不也，世尊！何以故？實無有法名阿那含。^lb是名阿那含。」
「須菩提！於意云何？阿羅漢能作^lb是念：『我得阿羅漢。』不？」
須菩提言：「不也，世尊！^pb21何以故？實無有法名阿羅漢。
世尊！若阿羅漢^lb作是念：『我得阿羅漢。』即為著我、人、眾生、壽者。
^lb世尊！佛說我得無諍三昧，最為第一，世尊說^lb我是離欲阿羅漢。世尊！我不作是念：『我是離^lb欲阿羅漢。』
世尊！我若作是念：『我得阿羅漢。』世^pb22尊則不說我無諍行第一。以須菩提實無所^lb行，而名須菩提無諍、無諍行。」
^ck10【莊嚴淨土】
佛告須菩提：「於^lb意云何？如來昔在燃燈佛所，得阿耨多羅三^lb藐三菩提法不？」
須菩提言：「不也，世尊！如來在^lb燃燈佛所，於法實無所得阿耨多羅三藐三^pb23菩提。」
佛告須菩提：「若菩薩作是言：『我莊嚴佛^lb國土。』
彼菩薩不實語。何以故？須菩提！如來所^lb說莊嚴佛土者，則非莊嚴，是名莊嚴佛土。
是^lb故須菩提！諸菩薩摩訶薩，應如是生清淨心，^lb而無所住，不住色生心，不住聲、香、味、觸、法生^pb24心，應無所住而生其心。
「須菩提！譬如有人，身^lb如須彌山王。須菩提！於意云何？是身為大不？」
^lb須菩提言：「甚大，世尊！何以故？佛說非身，是名^lb大身。彼身非身，是名大身。」
^ck11【無為福勝】
佛言：「須菩提！如恒^lb河中所有沙數，如是沙等恒河，於意云何？是^pb25諸恒河沙，寧為多不？」
須菩提言：「甚多，世尊！但^lb諸恒河，尚多無數，何況其沙。」
佛言：「須菩提！我^lb今實言告汝。若有善男子、善女人，以七寶滿^lb爾所恒河沙數世界，以施諸佛如來。須菩提！^lb於意云何？彼善男子、善女人，得福多不？」
須菩^pb26提言：「甚多，世尊！彼善男子、善女人，得福甚多。」
^lb佛告須菩提：「以七寶滿爾數恒河沙世界，持^lb用布施。若善男子、善女人，於此法門，乃至受^lb持四句偈等，為他人說，而此福德，勝前福德^lb無量阿僧祇。
^lb^ck12【尊重正教】
「復次，須菩提！隨所有處，說是法^pb27門，乃至四句偈等，當知此處，一切世間天人^lb阿修羅，皆應供養，如佛塔廟。
何況有人，盡能^lb受持讀誦此經。
須菩提！當知是人，成就最上^lb第一希有之法。若是經典所在之處，則為有^lb佛，若尊重似佛。」
^ck13【如法受持】
爾時，須菩提白佛言：
「世尊！當^pb28何名此法門？我等云何奉持？」
佛告須菩提：
「是^lb法門名為『金剛般若波羅蜜』。
以是名字，汝當^lb奉持。
何以故？須菩提！佛說般若波羅蜜，則非^lb般若波羅蜜。
「須菩提！於意云何？如來有所說^lb法不？」
須菩提言：「世尊！如來無所說法。」
「須菩提！^pb29於意云何？三千大千世界所有微塵，是為多^lb不？」
須菩提言：「彼微塵甚多。世尊！」
「須菩提！是諸^lb微塵，如來說非微塵，是名微塵。如來說世界，^lb非世界，是名世界。」
佛言：「須菩提！於意云何？可^lb以三十二大人相見如來不？」
須菩提言：「不也，^pb30世尊！
何以故？如來說三十二大人相，即是非^lb相，是名三十二大人相。」
佛言：「須菩提！若有善^lb男子、善女人，以恒河沙等身命布施，
若復有^lb人，於此法門中，乃至受持四句偈等，為他人^lb說，其福甚多無量阿僧祇。」
^ck14【離相寂滅】
爾時，須菩提聞說^pb31是經，深解義趣，涕淚悲泣，捫淚而白佛言：
「希^lb有，婆伽婆！希有，修伽陀！佛說如是甚深法門，^lb我從昔來所得慧眼，未曾得聞如是法門。」
「何^lb以故？須菩提！佛說般若波^lb羅蜜，即非般若波羅蜜。」
「世尊！若復有人得聞是經，信心清淨，則^pb32生實相，當知是名成就第一希有功德。
世尊！^lb是實相者則是非相。是故如來說名實相、實^lb相。
世尊！我今得聞如是法門，信解受持，不足^lb為難。
若當來世其有眾生得聞是法門信解^lb受持，是人則為第一希有。
何以故？此人無我^pb33相、人相、眾生相、壽者相。
何以故？我相，即是非^lb相；人相、眾生相、壽者相，即是非相。
何以故？離^lb一切諸相，則名諸佛。」
佛告須菩提：
「如是，如是！
^lb若復有人得聞是經，不驚不怖不畏，當知是^lb人甚為希有。
何以故？須菩提！如來說第一波^pb34羅蜜，非第一波羅蜜。如來說第一波羅蜜者，^lb彼無量諸佛亦說波羅蜜，是名第一波羅蜜。
^lb「須菩提！如來說忍辱波羅蜜，即非忍辱波羅^lb蜜。
何以故？須菩提！如我昔為歌利王割截身^lb體。我於爾時，無我相、無眾生相、無人相、無壽^pb35者相，無相，亦非無相。
何以故？須菩提！我於往^lb昔節節支解時，若有我相、眾生相、人相、壽者^lb相，應生瞋恨。
須菩提！又念過去於五百世，作^lb忍辱仙人，於爾所世，無我相、無眾生相、無人^lb相、無壽者相。`)