jsonp(6,{"name":"dc","start":8550},`「念道之自然，著於無上下，洞達無邊幅，捐志虛空中。何不各精進，努力自求索？可得超絕去，往生無量清淨阿彌陀佛國。橫截於五道，惡道自閉塞，昇道之無極，易往無有人。其國土不逆違，自然之隨牽。何不棄世事行求道德？可得極長生，壽樂無有極。何為用世事，饒共憂無有常？
「世人薄俗，共爭不急之事；共於是處劇惡極苦之中，勤身治生用相給活。無尊、無卑，無富、無貧，無老、無少，無男、無女，皆當共憂錢財，有無同然。憂思適等，屏營愁苦，累念思慮，為之走使，無有安時。有田憂田、有宅憂宅、有牛憂牛、有馬憂馬、有六畜憂六畜、有奴婢憂奴婢，衣被、錢財、金銀、寶物復共憂之。重思累息，憂念懷愁恐，橫為非常、水火、盜賊、怨家、債主所漂燒繫唐突沒溺，憂毒怔忪無有解時。結憤心中慉氣毒怒，病在胸腹憂苦不離，心堅意固適無縱捨。或坐摧藏終亡身命，棄捐之去莫誰隨者。尊貴豪富有此憂懼勤苦若此，結眾寒、熱與痛共居。
「小家貧者窮困乏無，無田亦憂欲有田、無宅亦憂欲有宅、無牛亦憂欲有牛、無馬亦憂欲有馬、無六畜亦憂欲有六畜、無奴婢亦憂欲有奴婢、無衣被、錢財、什物、飯食之屬亦憂欲有之。適有一少一、有是少是，思有齊等，適小具有便復儩盡。如是苦生當復求索，思想無益不能時得，身心俱勞坐起不安。憂念相隨，勤苦若此。焦心不離，恚恨獨怒，亦結眾寒、熱與痛共居。或時坐之，終身夭命，亦不肯作善為道。壽命盡死，皆當獨遠去，有所趣向，善惡之道莫能知者。
「或時世人父子、兄弟、夫婦、家室、中外親屬居天地之間當相敬愛，不當相憎；有無當相給與，不當有貪；言色當和，莫相違戾，或儻心爭有所恚怒。今世恨意微相嫉憎，後世轉劇至成大怨。所以者何？今世之事更欲相患害，雖不臨時應急相破，殺之愁毒結憤精神，自然剋識不得相離，皆當對相生，值更相報復。
「人在世間愛欲之中，獨來、獨去、死生，當行至趣苦樂之處，身自當之無有代者。善惡變化，殃咎異處，宿豫嚴待，當獨昇入遠到他處，莫能見者去在何所。善惡自然追逐往生，窈窈冥冥別離久長，道路不同會見無期，甚難甚難復得相值。何不棄眾事，各勱強健時努力力為善，力精進來度世，可得極長壽？殊不肯求於道，復欲何須待、欲何樂乎？
「如是，世人不信作善得善、不信為道得道、不信死後世復生、不信施與得其福德，都不信之。亦以謂之不然，言無有是，但坐是故且自見之，更相看視，前後轉相承受父餘教令。先人、祖父素不作善，本不為道，身愚神闇，心塞意閉，不見天道，殊無有能見人生死，有所趣向亦莫能知者，適無有見善惡之道。復無有語者，為用作善惡、福德、殃咎、禍罰，各自競作為之用，殊無有怪也。至於生死之道轉相續，顛倒上下，無常根本，皆當過去不可常得。教語開導，信道者少，皆當生死無有休止。如是曹人矇冥抵突，不信經語，各欲快意，心不計慮。愚癡於愛欲、不解於道德、迷惑於瞋怒、貪猥於財色。坐之不得道，當更勤苦極，在於惡處生，終不得止休息，痛之甚可傷。
「或時家室中外、父子、兄弟、夫婦，至於生死之義，更相哭淚轉相思慕，憂念憤結恩愛繞續，心意痛著對相顧思，晝夜無有解時。教示道德心不開明，恩愛情欲不離，閉塞蒙蒙交錯覆蔽，不得思計。心自端正決斷世事，專精行道便旋至竟，年壽命盡不能得道，無可奈何。總猥憒譊皆貪愛欲，如是之法不解道者多、得道者少。
「世間怱怱無可聊賴，尊卑、上下、豪貴、貧富、男女、大小各自怱務，勤苦躬身各懷殺毒，惡氣窈冥莫不惆悵。為妄作事，惡逆天地，不從仁心，道德非惡，先隨與之，恣聽所為。其壽未至便頓奪之，下入惡道，累世勤苦，展轉愁毒，數千萬億歲無有出期，痛不可言，甚可憐愍。」
佛告阿逸菩薩等諸天、帝王、人民：「我皆語若曹世間之事，人用是故坐不得道。若曹熟思惟之，惡者當縱捨遠離之，從其善者當堅持之，勿妄為非，益作諸善。大小、多少愛欲之榮皆不可常得，猶當別離無可樂者。勱佛世時，其有信愛佛經諸深、奉行道德，皆是我小弟也；其有甫欲學佛經戒者，皆是我弟子也；其有欲出身、去家捨妻子、絕去財色，欲來作沙門、為佛作比丘者，皆是我子孫。我世甚難得值，其有願欲生無量清淨佛國者，可得智慧勇猛，為眾所尊敬。勿得隨心所欲，虧負經戒。在人後儻有疑意不解經者，復前問佛，佛當為若解之。」
阿逸菩薩長跪叉手言：「佛威神尊重，所說經快善。我曹聽佛經語皆心貫思之：『世人實爾，如佛所語無有異。』今佛慈哀我曹，開視天道教語生路，耳目聰明長得度脫，若得更生；我曹聽佛經語，莫不慈心歡喜踊躍開解者。我曹及諸天、帝王、人民、蜎飛蠕動之類，皆蒙佛恩，無不得解脫憂苦者。佛諸教戒甚深，無極無底。佛智慧所見知，八方、上下、去來、現在之事無上、無邊幅。佛甚難得值、經道甚難得聞，我曹皆慈心於佛所。今我曹得度脫者，皆是佛前世求道時慊苦學問，精進所致。恩德普覆，所施行福德相祿巍巍，光明徹照，洞虛無極，開入泥洹。教授經典，制威消化，愍動八方上下，無窮無極。佛為師法尊絕，群聖都無能及佛者。佛為八方上下諸天、帝王、人民作師，隨其心所欲願，大小皆令得道。今我曹得與佛相見，得聞無量清淨佛聲，我曹甚喜，莫不得黠慧開明者。」
佛告阿逸菩薩：「若言是，實當爾。若有慈心於佛所者，大喜實當念佛，天下久久乃復有佛耳。今我於苦世作佛所出經道，教授洞達、截斷狐疑、端心正行、拔諸愛欲、絕眾惡根本、遊步無拘、典總智慧、眾道表裏、攬持維綱，昭然分明開示五道，決正生死泥洹之道。」
佛言：「若曹從無數劫以來不可復計劫，若曹作菩薩道欲過度諸天、人民及蜎飛蠕動之類以來甚久遠，人從若得道度者無央數，至得泥洹之道者亦無央數。若曹及八方上下諸天、帝王、人民，若比丘、比丘尼、優婆塞、優婆夷。若曹宿命從無數劫以來展轉是五道中，死生呼嗟，更相哭淚，轉相貪慕，憂思愁毒，痛苦不可言，至今世死生不絕；乃至今日與佛相見共會，值是乃聞無量清淨佛聲甚快。善哉，助汝曹喜，亦可自厭死生痛痒。生時甚痛、甚苦、甚極，至年長大亦苦、亦極，死時亦痛、亦苦、亦極，甚惡臭處不淨潔了，無有可者。佛故悉語，若曹亦可自決斷臭處惡露，若曹亦可端心正身益作諸善，於是常端中外、潔淨身體、洗除心垢、自相約撿、表裏相應、言行忠信。
「人能自度脫，轉相扶接，拔諸愛欲，精明至心，求願不轉，結其善道根本。雖精進苦一世，須臾間耳。今世為善，後世生無量清淨佛國，快樂甚無極，長與道合明。然善極相保守，長去離惡道痛痒之憂惱，拔勤苦諸惡根本，斷諸愛欲恩好。長生無量清淨佛國，亦無有諸痛痒、亦無復有諸惡臭處、亦無復有勤苦、亦無淫泆瞋怒愚癡、亦無有憂思愁毒。
「生於無量清淨佛國，欲壽一劫、十劫、百劫、千劫、萬億劫，自恣若意；欲住止壽無央數劫、不可復計數劫，恣汝隨意皆可得之。欲食、不食，恣若其意，都悉自然，皆可得之。次於泥洹之道，皆各自精明求索，心所欲願。勿得狐疑心中悔，欲往生者，無得坐其過失，在無量清淨佛國界邊自然七寶城中讁五百歲。」
阿逸菩薩言：「受佛嚴明重教，皆當精進一心求索，請奉行之，不敢疑怠。」◎
佛說無量清淨平等覺經卷第三
佛說無量清淨平等覺經卷第四
後漢月氏國三藏支婁迦讖譯
◎佛告阿逸菩薩等：「若曹於是世能自制心正意、身不作惡者，是為大德善，都為八方上下最無有比。所以者何？八方上下無央數佛國中，諸天人民皆自然作善、不大為惡、易教化。今我於是世間為佛，於五惡、五痛、五燒之中作佛為最劇。教語人民令絕五惡、令去五痛、令去五燒；降化其心令持五善，得其福德度世長壽泥洹之道。」
佛言：「何等為五惡？何等為五痛？何等為五燒中者？何等為消化五惡、令持五善者？何等為持五善，得其福德長壽度世泥洹之道？」
佛言：「其一惡者，諸天、人民、下至禽獸、蜎飛蠕動之類欲為眾惡。
「強者伏弱，轉相剋賊，自相殺傷，更相食噉，不知為善，惡逆不道，受其殃罰，道之自然，當往趣向。神明記識，犯之不貰，轉相承續，故有貧窮、下賤、乞丐、孤獨人，有聾、盲、瘖瘂、愚癡、弊惡，下有尫狂不及逮之屬。其有尊貴、豪富、高才明達、智慧勇猛，皆其前世宿命，為善慈孝，布恩施德。故有官事、王法、牢獄，不肯畏慎作惡入法，受其過讁重罰致劇，求望解脫難得度出。今世有是目前現在，壽終尤劇，入其窈冥，受身更生，譬若王法劇苦極刑。故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類屬貿身形，改惡易道，壽命短長，魂神命精，自然入趣。受形寄胎當獨值向，相從共生，轉相報償，當相還復。殃惡讁罰，眾事未盡終不得離。展轉其中，世世累劫無有出期，難得解脫，痛不可言。天地之間自然有是，雖不臨時卒暴至，應時恒取自然之道，皆當善惡歸之，是為一大惡、為一痛、為一燒。
「勤苦如是，愁毒呼嗟，比如劇火起燒人身。人能自於其中一心制意、端身正行、獨作諸善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為一大善。」
佛言：「其二惡者，世間帝王、長吏、人民、父子、兄弟、室家、夫婦略無義理，不從政令。轉淫奢驕慢，各欲快意，恣心自在，更相欺調，殊不懼死。心口各異，言念無實，佞諂不忠，諛媚巧辭。行不端正，更相嫉憎，轉相讒惡，陷入惡枉。主上不明，心不察照，任用臣下，臣下存在。淺度能行，知其形勢，在位不正，為其所調。妄捐忠良，不當天心，甚違道理，臣欺其君、子欺其父、弟欺其兄、婦欺其夫。室家中外知識相紹，各懷貪婬，心獨恚怒，蒙聾愚癡欲益多。有尊卑、上下，無男、無女，無大、無小，心俱同然，欲自厚己。破家、亡身，不顧念前後，家室親屬坐之破族。
「或時家中內外、知識朋友、鄉黨市里愚民轉共從事，更相利害。爭錢財鬪，忿怒成仇；轉爭勝負，慳富焦心；不肯施與，專專守惜。愛寶貪重，坐之思念，心勞身苦，如是至竟，無所恃怙，獨來獨去，無一隨者。善惡禍福，殃咎讁罰，追命所生，或在樂處、或入毒苦，然後乃悔，當復何及？
「或時世人愚心少智，見善誹謗恚之，不肯慕及。但欲為惡，妄作非法；但欲盜竊，常懷毒心；欲得他人財物，用自供給，消散摩盡，賜復求索；邪心不正，常獨恐怖，畏人有色，臨時不計，事至乃悔。今世現在，長吏牢獄，自然趣向，受其殃咎。世間貧窮、乞丐、孤獨，但坐前世宿命，不信道德、不肯為善。今世為惡，天神別籍，壽終入惡道，故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類。展轉其中，世世累劫，無有出期，難得解脫，痛不可言，是為二大惡、二痛、二燒。
「勤苦如是，比如火起燒人身。人能自於其中一心制意、端身正行、獨作眾善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為二大善。」
佛言：「其三惡者，世間人民寄生相因，共依居天地之間，處年壽命無能幾歲。至有豪貴者、賢明善人；下有貧賤、尫羸愚者；中有不良之人，但懷念毒惡，身心不正，常念婬泆，煩滿胸中；愛欲交錯，坐起不安；貪意慳惜，但欲唐得；眄睞細色，惡態婬泆。有婦厭憎，私妄出入，持家所有，相結為非，聚會飲食，自共作惡。興兵作賊，攻城格鬪，劫殺截斷，強奪不道，取人財物。偷竊趣得，不肯治生；所當求者，不肯為之；惡心在外，不能專作；欲擊成事，恐勢迫脅，持歸給家。共相生活，恣心快意，極身作樂，行亂他人婦女。或於其親屬，不避尊卑、長老，眾共憎惡，家室中外，患而苦之。亦復不畏縣官、法令無所避，錄如是之惡，自然牢獄，日月照識、神明記取、諸神攝錄。
「故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類，展轉其中，世世累劫，無有出期，難得度脫，痛不可言，是為三大惡、三痛、三燒，勤苦如是，比若火起燒人身，人能自於其中一心制意、端身正行、獨作眾善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為三大善。」
佛言：「其四惡者，諸惡人不能作善，自相壞敗，轉相教令，共作眾惡。主為傳言，但欲兩舌、惡口、罵詈、妄語，相嫉更相鬪亂。憎嫉善人，敗壞賢善，於傍快惡。復不孝順供養父母，輕易師父知識，無信難得誠實。自言尊貴有道，橫行威武，加捲力勢，侵剋易人不能自知。為惡無自羞慚，自用頗健，令人承事敬畏。復不敬畏天地、神明、日月，亦不可教令作善，不可降化，自用偃蹇，謂常當爾。亦復無憂哀心，亦不知恐懼，恣意憍慢如是，天神記識。
「賴其前世宿命頗作福德，小善扶接，營護助之。今世作惡，福德盡儩，諸善鬼神各去離之，身獨空立，無所復依。受重殃讁，壽命終身惡繞歸，自然迫促，當往追逐，不得止息。自然眾惡共趣頓乏，其有名籍在神明所，殃咎引牽當值相得，當往趣向。受過讁罰，身心摧碎，神形苦極，不得離却，但得前行，入於火鑊。當是時悔復何益？當復何及？
「天道自然，不得蹉跌，故有泥犁、禽獸、薜荔、蜎飛蠕動之屬，展轉其中，世世累劫，無有出期，難得解脫，痛不可言，是為四大惡、四痛、四燒。
「勤苦如是，比如火起燒人身。人能於其中一心制意、端身正行、獨作眾善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為四大善。」
佛言：「其五惡者，世人徙倚懈惰，不肯作善，不念治生，妻子飢寒，父母俱然。欲呵教其子，其子惡心，瞋目應怒。言令不和，違戾反逆劇於野人，比若怨家，不如無子。妄遍假貸，眾共患厭，尤無反復，無有報償之心，窮貧困乏，不能復得。辜較諧聲，放縱遊散，串數唐得，自用賑給，不畏防禁。飲食無極，喫酒嗜美，出入無有期度。魯扈抵突，不知人情，睢眄強制。見人有喜，憎嫉恚之。無義無禮，自用職當，不可諫曉。亦復不憂念父母、妻子有無，又復不念卒報父母之德，亦復不念師父之恩。心常念惡、口常言惡，日不成就。不信道德、不信有賢明先聖、不信作善為道可得度世、不信世間有佛。欲殺羅漢、鬪比丘僧，常欲殺人——欲殺父母、兄弟、妻子、宗親、朋友。父母、兄弟、妻子、宗親、朋友憎惡見之，欲使之死。不信佛經語、不信人壽命終盡死，後世復生、不信作善得善、不信作惡得惡。
「如是曹人——男子、女人——心意俱然，違戾反逆，愚癡濛澒，瞋怒嗜欲，無所識知。自用快善為大智慧，亦不知所從來、生死所趣向。不肯慈孝，惡逆天地，於其中間求望僥倖，欲得長生、躬得不死。會當歸就生死勤苦善惡之道，身所作惡，殃咎眾趣，不得度脫。亦不可降化令作善，慈心教語開導生死、善惡所趣有是，復不信之。然苦心與語欲令度脫，無益其人。心中閉塞，意不開解，大命將至，至時皆悔。其後乃悔，當復何及？不豫計善，臨窮何益？
「天地之間五道分明，恢廓窈窕，浩浩茫茫，轉相承受。善惡、毒痛，身自當之，無有代者。道之自然，隨其所行，追命所生，不得縱捨。善人行善，從善慈孝、從樂入樂、從明入明；惡人行惡，從苦入苦、從冥入冥。誰能知者？獨佛知見耳。教語人民，信用者少，生死不休，惡道不絕。
「如是，世人不可悉道，故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類，展轉其中，世世累劫，無有出期，難得解脫，痛不可言，是為五大惡、五痛、五燒。
「勤苦如是，比如火起燒人身，人能自於其中一心制意、端身正行、言行相副、所作至誠、所語如語、心口不轉、獨作眾善、不為眾惡者，身獨度脫，得其福德，可得長壽度世上天泥洹之道，是為五大善。」
佛告阿逸菩薩等：「我皆語若曹，是世五惡勤苦如是，令起五痛、令起五燒，展轉相生。世間人民不肯為善，欲作眾惡，敢有犯此諸惡事者皆悉自然，當更具歷入惡道中。或其今世先被病殃，死生不得，示眾見之。壽終趣入至極大苦，愁痛酷毒，自相焦然，轉相燒滅。至其後共作怨家，更相傷殺，從小微起至大困劇，皆從貪淫財色、不肯忍辱施與、各欲自快、無復有曲直、欲得健名、為癡欲所迫、隨心思想不能得也，結憤胸中。財色縛束無有解脫、不知厭足；厚己諍欲，無所省錄，都無義理，不隨正道。富貴榮華，當時快意，不能忍辱、不知施善，威勢無幾，隨惡名焦。身坐勞苦，久後大劇自然隨逐，無有解已。王法施張，自然糺舉，上下相應；羅網綱紀，㷀㷀忪忪，當入其中。古今有是，痛哉，可傷！」
佛語阿逸菩薩等：「若世有是佛，皆慈愍哀之，威神摧動眾惡諸事皆消化之。令得去惡就善，棄捐所思，奉持經戒，莫不承奉。施行經法，不敢違失度世無為泥洹之道，快善極樂，甚明無極。」
佛言：「若曹諸天、帝王、人民及後世人，得佛經語熟思惟之，能自於其中端心正行。其主上為善率化，撿御其下，教語人民，轉相勅令、轉共為善、轉相度脫，各自端守，慈仁愍哀，終身不殆，尊聖敬孝，通洞博愛。佛語教令無敢虧負，當憂度世泥洹之道；當憂斷截生死、痛痒，拔惡根本；當憂斷絕泥犁、禽獸、薜荔、蜎飛蠕動之類惡苦之道；當勱佛世，堅持經道，無敢失也。」
佛言：「若曹當作善者，云何第一急？當自端身、當自端心、當自端目、當自端耳、當自端鼻、當自端口、當自端手、當自端足。能自撿斂，莫妄動作，身心淨潔，俱善相應。中外約束，勿隨嗜欲，不犯諸惡。言色常和，身行當專，行步坐起不動。作事所為當先熟思慮計之，揆度才能、視瞻圓規，安定徐作為之；作事倉卒，不豫熟計，為之不諦，亡其功夫，敗悔在後，唐苦亡身。至誠忠信，得道絕去。」
佛言：「若曹於是益作諸善，布恩施德，能不絕道禁，忍辱、精進、一心、智慧，展轉復相教化，作善為德。如是經法慈心專一，齋戒清淨一日一夜者，勝於無量清淨佛國作善百歲。所以者何？無量清淨佛國皆積德眾善，無為自然，在所求索，無有諸惡大如毛髮。」
佛言：「於是作善十日十夜者，其得福勝於他方佛國中人民作善千歲。所以者何？他方佛國皆悉作善，作善者多、為惡者少，皆有自然之物，不行求作便自得之；是間為惡者多、為善者少，不行求作不能得也。人能自端制作善，至心求道，故能爾耳。是間無有自然，不能自給，當行求索，勤苦治生。轉相欺怠，調作好惡，得其財物歸給妻子。飲苦食毒，勞心苦身，如是至竟，心意不專，周旋不安。人能自安靜為善，精進作德，故能爾耳。」
佛言：「我皆哀若曹及諸天、帝王、人民，皆教令作諸善、不為眾惡，隨其所能輒授與道，教戒開導悉奉行之。則君率化為善教令臣下、父教其子、兄教其弟、夫教其婦，室家內外、親屬、朋友轉相教語，作善為道。奉經持戒，各自端守，上下相撿，無尊、無卑，無男、無女，齋戒清淨，莫不歡喜。和順義理，勸樂慈孝，自相約撿。其有得佛經語悉持思之，不當所作如犯為之則自悔過，去惡就善，棄邪為正，朝聞夕改，奉持經戒劇，如貧人得寶。
「佛所行處、所在郡國，輒授與經戒，諸天、日月、星辰、諸神、國王、傍臣、長吏、人民、諸龍、鬼神、泥犁、禽獸承奉行之，則君改化為善，齋戒精思，淨自湔洒，端心正行，居位嚴慓，教勅率眾為善，奉行道禁，令言令止；臣事其君，忠直受令，不敢違負。父子言令孝順承受，兄弟、夫婦、宗親、朋友，上下相令，順言和理，尊卑、大小轉相敬事，以禮如義不相違負，莫不改往修來，洒心易行端正中表，自然作善所願輒得。感善降化自然之道，求欲不死則可得長壽，求欲度世則可得泥洹之道。」
佛言：「佛威神尊重，消惡化善莫不度脫。今我出於天下，在是惡中於苦世作佛，慈愍哀傷，教語開道，諸天、帝王、傍臣左右、長吏、人民，隨其心所欲願樂皆令得道。佛諸所行處、所更過歷郡國、縣邑、丘聚、市里，莫不豐熟，天下太平，日月運照，倍益明好；風雨時節，人民安寧；強不凌弱，各得其所。無惡歲疾疫、無病瘦者、兵革不起、國無盜賊、無有怨抂、無有拘閉者。君臣、人民莫不歡喜，忠慈至誠，各自端守，皆自然守國，雍和孝順，莫不歡樂。有無相與布恩施德，心歡樂與皆相敬愛，推財讓義，謙讓於先。前後以禮敬事，如父、如子，如兄、如弟，莫不仁賢，和順禮節都無違諍，快善無極。」
佛言：「我哀子曹欲度脫之，劇父母念子。今八方上下諸天、帝王、人民及蜎飛蠕動之類，得佛經戒、奉行佛道，皆得明慧，心悉開解，莫不得過度脫憂苦者。今我作佛在於五惡、五痛、五燒之中，降化五惡、消盡五痛、絕滅五燒，以善攻惡拔去毒苦，令得五善明好，燒惡不起。我般泥洹去後，經道稍稍斷絕，人民諛諂淳為眾惡，不復作善，五燒復起，五痛劇苦——復如前法——自然還復，久後轉劇，不可悉說，我但為若曹小道之耳。」
佛告阿逸菩薩等：「若曹各思持之，展轉相教戒，如佛經法無敢犯也。」
阿逸菩薩長跪叉手言：「佛所說甚苦痛，世人為惡甚劇，如是如是。佛皆慈哀悉度脫之，皆言：『受佛重教，請展轉相承。』不敢犯也。」
佛告阿難：「我哀若曹，令悉見無量清淨佛及諸菩薩、阿羅漢所居國土。若欲見之不？」
阿難則大喜，長跪叉手言：「願皆欲見之。」
佛言：「若起更被袈裟西向拜——當日沒處——為無量清淨佛作禮，以頭面著地言：『南無無量清淨平等覺。』」
阿難言：「諾，受教。」則起更被袈裟西向拜——當日所沒處——為無量清淨佛作禮，以頭腦著地言：「南無無量清淨平等覺。」
阿難未起，無量清淨佛便大放光明威神，則遍八方上下諸無央數佛國，天地則皆為大震動。諸天無央數天地、須彌山羅寶、摩訶須彌大山羅寶、諸天地大界、小界，其中諸有大泥犁、小泥犁，諸山林、溪谷、幽冥之處，皆則大明，悉雨大開闢。
則阿難、諸菩薩、阿羅漢等，諸天、帝王、人民，悉皆見無量清淨佛及諸菩薩、阿羅漢、國土七寶已，心皆大歡喜踊躍，悉起為無量清淨佛作禮，以頭腦著地，皆言：「南無無量清淨三藐三佛陀。」
無量清淨佛放光明威神已，諸無央數天、人民、及蜎飛蠕動之類，皆悉見無量清淨佛光明，莫不慈心歡喜作善者。諸有泥犁、禽獸、薜荔，諸有考治勤苦之處，則皆休止不復治，莫不解脫憂苦者。諸有盲者則皆得視，諸跛躄蹇者則皆得走行，諸病者則皆愈起，諸尫者則皆強健；愚癡者則皆更黠慧，諸有婬泆瞋怒者皆悉慈心作善，諸有被毒者毒皆不行。鍾鼓、琴瑟、箜篌、樂器諸伎，不鼓皆自作音聲；婦女珠環皆自作聲；百鳥、畜獸皆自悲鳴。當是之時莫不歡喜得過度者。
則時爾日，諸佛國中諸天人，莫不持天上華香來下於虛空中，悉皆供養，散諸佛及無量清淨佛上。諸天各共大作萬種自然伎樂，樂諸佛及諸菩薩、阿羅漢。當是之時，甚快樂不可言。
佛告阿難、阿逸菩薩等：「我說無量清淨佛及諸菩薩、阿羅漢、國土自然七寶，當無有異乎？」
阿難長跪叉手言：「佛說無量清淨佛國土快善，如佛所說無有一異。」
佛言：「我說無量清淨佛功德國土快善，晝夜一劫尚復未竟，我但為若曹小說之耳。」
阿逸菩薩則長跪叉手問佛言：「今佛國從是間當有幾阿惟越致菩薩往生無量清淨佛國？願聞之。」
佛言：「若欲知者，明聽著心中。」
阿逸菩薩言：「受教。」
佛言：「從我國當有七百二十億阿惟越致菩薩皆往生無量清淨佛國——一阿惟越致菩薩者，前後供養無央數諸佛，以次如彌勒皆當作佛——及其餘諸小菩薩輩者無央數不可復計，皆當往生無量清淨佛國。」
佛告阿逸菩薩：「不但我國中諸菩薩當往生無量清淨佛國，他方異國復有佛亦復如是。第一佛名光遠炤，其國有百八十億菩薩皆當往生無量清淨佛國。他方異國第二佛，佛名寶積，其國有九十億菩薩皆當往生無量清淨佛國。他方異國第三佛，名儒無垢，有二百二十億菩薩皆當往生阿彌陀佛國。他方異國第四佛，名無極光明，其國有二百五十億菩薩皆當往生無量清淨佛國。他方異國第五佛，名於世無上，其國有六百億菩薩皆當往生無量清淨佛國。他方異國第六佛，名勇光，其國有萬四千菩薩皆當往生無量清淨佛國。他方異國第七佛，名具足交絡，其國有十四億菩薩皆當往生無量清淨佛國。他方異國第八佛，名雄慧王，其國有八菩薩皆當往生無量清淨佛國。他方異國第九佛，名多力無過者，其國有八百一十億菩薩皆當往生無量清淨佛國。他方異國第十佛，名吉良，其國有萬億菩薩皆當往生無量清淨佛國。他方異國第十一佛，名慧辯，其國有萬二千菩薩皆當往生無量清淨佛國。他方異國第十二佛，名無上華，其國有諸菩薩無央數不可復計——皆阿惟越致、皆智慧勇猛、各供養無央數諸佛，以一時俱心願欲往生——皆當生無量清淨佛國。他方異國第十三佛，名樂大妙音，其國有七百九十億菩薩皆當往生無量清淨佛國。」
佛言：「是諸菩薩——皆阿惟越致——諸比丘僧中及小菩薩輩無央數，皆當往生無量清淨佛國。不獨是十四佛國中諸菩薩當往生也，都八方上下無央數佛國諸菩薩輩各各如是，皆當往生無量清淨佛國。其無央數都共往會，無量清淨佛國大眾多不可復計，我但說八方上下無央數佛名字，晝夜一劫尚未竟。我但復說佛國諸比丘僧眾、菩薩當往生無量清淨佛國人數，說之一劫不休止尚未竟。我但為若曹總攬都小說之耳。」
佛語阿難阿逸菩薩等：「其世間帝王、人民、善男子、善女人，前世宿命行善所致相祿，迺當聞無量清淨佛聲，慈心歡喜，我代之喜。」
佛言：「其有善男子、善女人聞無量清淨佛聲，慈心歡喜，一時踊躍，心意清淨，衣毛為起拔出者，皆前世宿命作佛道——若他方佛故，菩薩、非凡人。其有人民——男子、女人——聞無量清淨佛聲，不信有佛者、不信佛經語、不信有比丘僧、心中狐疑都無所信者，皆故從惡道中來，生愚蒙不解宿命，殃惡未盡、未當得度脫，故心中狐疑不信向耳。」
佛言：「我語若曹，若曹所當作善法皆當奉行信之。無得以我般泥洹去後故，若曹及後世人無得復言：『我不信有無量清淨佛國。』我故令若曹悉見無量清淨佛國土，所當為者若自求之。我具為汝曹道說經戒順法，若曹當如佛法持之，無得毀失。
「我持是經以累汝曹，汝曹當堅持之，無得為妄增減是經法。我般泥洹去後，經道留止千歲，千歲後經道斷絕，在心所願皆可得道。」
佛言：「師開導人耳目，智慧明達，度脫人令得善，舍泥洹之道。常當慈孝，於佛如父母；常念師恩，當念不斷絕，則得道疾。」
佛言：「天下有佛者甚難得值，人有信受師法經語深者亦難得值，若有沙門、若師為人說佛經者甚難得值。」
佛說是經時，則萬二千億諸天人民皆得天眼徹視，悉一心皆為菩薩道；則二百二十億諸天人民皆得阿那含道；則八百沙門皆得阿羅漢道；則四十億菩薩皆得阿惟越致。
佛說經已，諸菩薩、阿羅漢、諸天、帝王、人民皆大歡喜，前趣為佛作禮，遶佛三匝，以頭面著佛足而去。
佛說無量清淨平等覺經卷第四
佛說無量壽經卷上
曹魏天竺三藏康僧鎧譯
我聞如是：
一時佛住王舍城耆闍崛山中，與大比丘眾萬二千人俱，一切大聖神通已達，其名曰：尊者了本際、尊者正願、尊者正語、尊者大號、尊者仁賢、尊者離垢、尊者名聞、尊者善實、尊者具足、尊者牛王、尊者優樓頻䗍迦葉、尊者伽耶迦葉、尊者那提迦葉、尊者摩訶迦葉、尊者舍利弗、尊者大目揵連、尊者劫賓那、尊者大住、尊者大淨志、尊者摩訶周那、尊者滿願子、尊者離障閡、尊者流灌、尊者堅伏、尊者面王、尊者果乘、尊者仁性、尊者喜樂、尊者善來、尊者羅云、尊者阿難，皆如斯等上首者也。
又與大乘眾菩薩俱，普賢菩薩、妙德菩薩、慈氏菩薩等，此賢劫中一切菩薩。
又賢護等十六正士：善思議菩薩、信慧菩薩、空無菩薩、神通華菩薩、光英菩薩、慧上菩薩、智幢菩薩、寂根菩薩、願慧菩薩、香象菩薩、寶英菩薩、中住菩薩、制行菩薩、解脫菩薩，皆遵普賢大士之德，具諸菩薩無量行願，安住一切功德之法，遊步十方，行權方便，入佛法藏，究竟彼岸，於無量世界現成等覺。
處兜率天弘宣正法，捨彼天宮降神母胎，從右脇生，現行七步。光明顯曜，普照十方無量佛土，六種振動，舉聲自稱：「吾當於世為無上尊，釋梵奉侍，天、人歸仰。」示現算計、文藝、射御，博綜道術，貫練群籍，遊於後園講武試藝。現處宮中色味之間，見老、病、死，悟世非常，棄國財位，入山學道，服乘、白馬、寶冠、瓔珞，遣之令還。捨珍妙衣而著法服，剃除鬚髮，端坐樹下。勤苦六年，行如所應。現五濁剎隨順群生，示有塵垢沐浴金流。天按樹枝得攀出池，靈禽翼從往詣道場，吉祥感徵表章功祚。哀受施草，敷佛樹下，加趺而坐，奮大光明使魔知之。魔率官屬而來逼試，制以智力皆令降伏，得微妙法成最正覺。釋梵祈勸請轉法輪，以佛遊步、佛吼而吼，扣法鼓、吹法螺、執法劍、建法幢、震法雷、曜法電、澍法雨、演法施，常以法音覺諸世間，光明普照無量佛土。一切世界六種震動，總攝魔界、動魔宮殿，眾魔懾怖莫不歸伏。摑裂邪網，消滅諸見，散諸塵勞，壞諸欲塹。嚴護法城，開闡法門；洗濯垢污，顯明清白；光融佛法，宣流正化。入國分衛獲諸豐饍，貯功德、示福田、欲宣法、現欣笑，以諸法藥救療三苦。顯現道意無量功德，授菩薩記成等正覺，示現滅度拯濟無極。消除諸漏，殖眾德本，具足功德微妙難量。遊諸佛國，普現道教，其所修行清淨無穢。
譬如幻師現眾異像，為男、為女無所不變，本學明了在意所為。此諸菩薩亦復如是，學一切法貫綜縷練，所住安諦靡不感化，無數佛土皆悉普現，未曾慢恣、愍傷眾生。如是之法一切具足，菩薩經典究暢要妙，名稱普至導御十方，無量諸佛咸共護念。佛所住者皆已得住、大聖所立而皆已立，如來道化各能宣布，為諸菩薩而作大師。以甚深禪慧開導眾人，通諸法性，達眾生相，明了諸國，供養諸佛。化現其身猶如電光，善學無畏曉了幻法。壞裂魔網，解諸纏縛。超越聲聞、緣覺之地，得空無相、無願三昧。善立方便，顯示三乘。於此中下而現滅度，亦無所作、亦無所有，不起、不滅得平等法。具足成就無量總持百千三昧，諸根智慧廣普寂定，深入菩薩法藏，得佛華嚴三昧。宣揚演說一切經典，住深定門，悉覩現在無量諸佛，一念之頃無不周遍。濟諸劇難諸閑不閑，分別顯示真實之際，得諸如來辯才之智。入眾言音，開化一切，超過世間諸所有法。心常諦住度世之道，於一切萬物隨意自在。為眾生類作不請之友，荷負群生為之重任。受持如來甚深法藏，護佛種性常使不絕。興大悲、愍眾生，演慈辯、授法眼、杜三趣、開善門，以不請之法施諸黎庶，猶如孝子愛敬父母。於諸眾生視之若己，一切善本皆度彼岸，悉獲諸佛無量功德，智慧聖明不可思議。
如是菩薩無量大士不可稱計，一時來會。
爾時，世尊諸根悅豫，姿色清淨，光顏巍巍。
尊者阿難承佛聖旨，即從座起，偏袒右肩，長跪合掌而白佛言：「今日世尊諸根悅豫，姿色清淨，光顏巍巍，如明鏡淨影暢表裏，威容顯耀超絕無量，未曾瞻覩殊妙如今。唯然，大聖！我心念言：『今日世尊住奇特法、今日世雄住佛所住、今日世眼住導師行、今日世英住最勝道、今日天尊行如來德。去來現在佛佛相念，得無今佛念諸佛耶？何故威神光光乃爾？』」
於是世尊告阿難曰：「云何，阿難！諸天教汝來問佛耶？自以慧見問威顏乎？」
阿難白佛：「無有諸天來教我者，自以所見問斯義耳。」
佛言：「善哉，阿難！所問甚快。發深智慧真妙辯才，愍念眾生問斯慧義。如來以無盡大悲矜哀三界，所以出興於世，光闡道教，普令群萌獲真法利。無量億劫難值難見，猶靈瑞華時時乃出。今所問者多所饒益，開化一切諸天人民。
「阿難！當知如來正覺其智難量，多所導御，慧見無礙，無能遏絕。以一喰之力，能住壽命億百千劫無數無量，復過於此。諸根悅豫不以毀損，姿色不變光顏無異。所以者何？如來定慧究暢無極，於一切法而得自在。
「阿難諦聽，今為汝說。」
對曰：「唯然，願樂欲聞。」
佛告阿難：「乃往過去久遠無量不可思議無央數劫，錠光如來興出於世，教化度脫無量眾生，皆令得道乃取滅度。次有如來名曰光遠、次名月光、次名栴檀香、次名善山王、次名須彌天冠、次名須彌等曜、次名月色、次名正念、次名離垢、次名無著、次名龍天、次名夜光、次名安明頂、次名不動地、次名琉璃妙華、次名琉璃金色、次名金藏、次名炎光、次名炎根、次名地種、次名月像、次名日音、次名解脫華、次名莊嚴光明、次名海覺神通、次名水光、次名大香、次名離塵垢、次名捨厭意、次名寶炎、次名妙頂、次名勇立、次名功德持慧、次名蔽日月光、次名日月琉璃光、次名無上琉璃光、次名最上首、次名菩提華、次名月明、次名日光、次名華色王、次名水月光、次名除癡冥、次名度蓋行、次名淨信、次名善宿、次名威神、次名法慧、次名鸞音、次名師子音、次名龍音、次名處世，如此諸佛皆悉已過。
「爾時，次有佛名世自在王如來、應供、等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。時有國王，聞佛說法心懷悅豫，尋發無上正真道意，棄國、捐王，行作沙門，號曰法藏，高才勇哲與世超異。詣世自在王如來所，稽首佛足，右遶三匝，長跪合掌以頌讚曰：
「『光顏巍巍，  	威神無極，  	如是炎明，
無與等者。  	日月摩尼，  	珠光炎耀，
皆悉隱蔽，  	猶如聚墨。  	如來容顏，
超世無倫，  	正覺大音，  	響流十方。
戒聞精進，  	三昧智慧，  	威德無侶，
殊勝希有。  	深諦善念，  	諸佛法海，
窮深盡奧，  	究其崖底。  	無明、欲、怒，
世尊永無，  	人雄師子，  	神德無量。
功德廣大，  	智慧深妙，  	光明威相，
震動大千。  	願我作佛，  	齊聖法王，
過度生死，  	靡不解脫。  	布施、調意、
戒、忍、精進，  	如是三昧，  	智慧為上。
吾誓得佛，  	普行此願，  	一切恐懼，
為作大安。  	假令有佛，  	百千億萬，
無量大聖，  	數如恒沙，  	供養一切，
斯等諸佛，  	不如求道，  	堅正不却。
譬如恒沙，  	諸佛世界，  	復不可計，
無數剎土，  	光明悉照，  	遍此諸國，
如是精進，  	威神難量。  	令我作佛，
國土第一，  	其眾奇妙，  	道場超絕。
國如泥洹，  	而無等雙，  	我當愍哀，
度脫一切。  	十方來生，  	心悅清淨，
已到我國，  	快樂安隱。  	幸佛信明，
是我真證，  	發願於彼，  	力精所欲。
十方世尊，  	智慧無礙，  	常令此尊，
知我心行。  	假令身止，  	諸苦毒中，
我行精進，  	忍終不悔。』」
佛告阿難：「法藏比丘說此頌已而白佛言：『唯然，世尊！我發無上正覺之心，願佛為我廣宣經法，我當修行，攝取佛國清淨莊嚴無量妙土，令我於世速成正覺，拔諸生死勤苦之本。』」
佛語阿難：「時世自在王佛告法藏比丘：『如所修行莊嚴佛土，汝自當知。』
「比丘白佛：『斯義弘深，非我境界。唯願世尊廣為敷演諸佛如來淨土之行。我聞此已，當如說修行成滿所願。』
「爾時，世自在王佛知其高明志願深廣，即為法藏比丘而說經言：『譬如大海，一人斗量，經歷劫數尚可窮底，得其妙寶。人有至心精進，求道不止，會當剋果，何願不得？』
「於是，世自在王佛即為廣說二百一十億諸佛剎土天人之善惡、國土之粗妙，應其心願悉現與之。
「時彼比丘聞佛所說嚴淨國土，皆悉覩見。超發無上殊勝之願，其心寂靜，志無所著，一切世間無能及者。具足五劫，思惟攝取莊嚴佛國清淨之行。」
阿難白佛：「彼佛國土壽量幾何？」
佛言：「其佛壽命四十二劫。
「時法藏比丘攝取二百一十億諸佛妙土清淨之行。如是修已，詣彼佛所，稽首禮足，遶佛三匝，合掌而住，白言：『世尊！我已攝取莊嚴佛土清淨之行。』
「佛告比丘：『汝今可說，宜知是時。發起悅可一切大眾。菩薩聞已，修行此法，緣致滿足無量大願。』
「比丘白佛：『唯垂聽察，如我所願，當具說之。
「『設我得佛，國有地獄、餓鬼、畜生者，不取正覺。
「『設我得佛，國中人天壽終之後復更三惡道者，不取正覺。
「『設我得佛，國中人天不悉真金色者，不取正覺。
「『設我得佛，國中人天形色不同有好醜者，不取正覺。
「『設我得佛，國中人天不悉識宿命，下至知百千億那由他諸劫事者，不取正覺。
「『設我得佛，國中人天不得天眼，下至見百千億那由他諸佛國者，不取正覺。
「『設我得佛，國中人天不得天耳，下至聞百千億那由他諸佛所說不悉受持者，不取正覺。
「『設我得佛，國中人天不得見他心智，下至知百千億那由他諸佛國中眾生心念者，不取正覺。
「『設我得佛，國中人天不得神足於一念頃，下至不能超過百千億那由他諸佛國者，不取正覺。
「『設我得佛，國中人天若起想念貪計身者，不取正覺。
「『設我得佛，國中人天不住定聚必至滅度者，不取正覺。
「『設我得佛，光明有能限量，下至不照百千億那由他諸佛國者，不取正覺。
「『設我得佛，壽命有能限量，下至百千億那由他劫者，不取正覺。
「『設我得佛，國中聲聞有能計量，乃至三千大千世界眾生緣覺於百千劫悉共計挍知其數者，不取正覺。
「『設我得佛，國中人天壽命無能限量——除其本願脩短自在——若不爾者，不取正覺。
「『設我得佛，國中人天乃至聞有不善名者，不取正覺。
「『設我得佛，十方世界無量諸佛不悉咨嗟稱我名者，不取正覺。
「『設我得佛，十方眾生至心信樂欲生我國，乃至十念，若不生者，不取正覺，唯除五逆、誹謗正法。
「『設我得佛，十方眾生發菩提心修諸功德，至心發願欲生我國，臨壽終時，假令不與大眾圍遶現其人前者，不取正覺。
「『設我得佛，十方眾生聞我名號、係念我國，殖諸德本、至心迴向欲生我國，不果遂者，不取正覺。
「『設我得佛，國中人天不悉成滿三十二大人相者，不取正覺。
「『設我得佛，他方佛土諸菩薩眾來生我國，究竟必至一生補處——除其本願自在所化，為眾生故，被弘誓鎧，積累德本度脫一切；遊諸佛國修菩薩行，供養十方諸佛如來；開化恒沙無量眾生，使立無上正真之道；超出常倫諸地之行，現前修習普賢之德——若不爾者，不取正覺。
「『設我得佛，國中菩薩承佛神力供養諸佛，一食之頃不能遍至無量無數億那由他諸佛國者，不取正覺。
「『設我得佛，國中菩薩在諸佛前現其德本，諸所求欲供養之具若不如意者，不取正覺。
「『設我得佛，國中菩薩不能演說一切智者，不取正覺。
「『設我得佛，國中菩薩不得金剛那羅延身者，不取正覺。
「『設我得佛，國中人、天、一切萬物嚴淨光麗，形色殊特，窮微極妙，無能稱量。其諸眾生乃至逮得天眼，有能明了辨其名數者，不取正覺。
「『設我得佛，國中菩薩乃至少功德者，不能知見其道場樹無量光色高四百萬里者，不取正覺。
「『設我得佛，國中菩薩若受讀經法，諷誦持說而不得辯才智慧者，不取正覺。
「『設我得佛，國中菩薩智慧辯才若可限量者，不取正覺。
「『設我得佛，國土清淨，皆悉照見十方一切無量無數不可思議諸佛世界，猶如明鏡覩其面像；若不爾者，不取正覺。
「『設我得佛，自地以上至于虛空，宮殿、樓觀、池流、華樹——國土所有一切萬物——皆以無量雜寶百千種香而共合成，嚴飾奇妙超諸人天，其香普薰十方世界，菩薩聞者皆修佛行；若不爾者，不取正覺。
「『設我得佛，十方無量不可思議諸佛世界眾生之類，蒙我光明觸其體者，身心柔軟超過人天；若不爾者，不取正覺。
「『設我得佛，十方無量不可思議諸佛世界眾生之類，聞我名字不得菩薩無生法忍、諸深總持者，不取正覺。
「『設我得佛，十方無量不可思議諸佛世界，其有女人聞我名字，歡喜信樂，發菩提心，厭惡女身，壽終之後復為女像者，不取正覺。
「『設我得佛，十方無量不可思議諸佛世界，諸菩薩眾聞我名字，壽終之後常修梵行至成佛道；若不爾者，不取正覺。
「『設我得佛，十方無量不可思議諸佛世界，諸天人民聞我名字，五體投地稽首作禮，歡喜信樂修菩薩行，諸天世人莫不致敬；若不爾者，不取正覺。
「『設我得佛，國中人天欲得衣服隨念即至，如佛所讚應法妙服自然在身；若有裁縫、染治、浣濯者，不取正覺。
「『設我得佛，國中人天所受快樂不如漏盡比丘者，不取正覺。
「『設我得佛，國中菩薩隨意欲見十方無量嚴淨佛土，應時如願，於寶樹中皆悉照見，猶如明鏡覩其面像；若不爾者，不取正覺。
「『設我得佛，他方國土諸菩薩眾聞我名字，至于得佛，諸根缺陋不具足者，不取正覺。
「『設我得佛，他方國土諸菩薩眾聞我名字，皆悉逮得清淨解脫三昧，住是三昧一發意頃，供養無量不可思議諸佛世尊而不失定意；若不爾者，不取正覺。
「『設我得佛，他方國土諸菩薩眾聞我名字，壽終之後生尊貴家；若不爾者，不取正覺。
「『設我得佛，他方國土諸菩薩眾聞我名字，歡喜踊躍，修菩薩行，具足德本；若不爾者，不取正覺。
「『設我得佛，他方國土諸菩薩眾聞我名字，皆悉逮得普等三昧，住是三昧至于成佛，常見無量不可思議一切如來；若不爾者，不取正覺。
「『設我得佛，國中菩薩隨其志願，所欲聞法自然得聞；若不爾者，不取正覺。
「『設我得佛，他方國土諸菩薩眾聞我名字，不即得至不退轉者，不取正覺。
「『設我得佛，他方國土諸菩薩眾聞我名字，不即得至第一、第二、第三法忍，於諸佛法不能即得不退轉者，不取正覺。』」
佛告阿難：「爾時，法藏比丘說此願已，而說頌曰：
「『我建超世願，  	必至無上道，
斯願不滿足，  	誓不成等覺。
我於無量劫，  	不為大施主，
普濟諸貧苦，  	誓不成等覺。
我至成佛道，  	名聲超十方，
究竟靡所聞，  	誓不成等覺。
離欲深正念，  	淨慧修梵行，
志求無上道，  	為諸天人師。
神力演大光，  	普照無際土，
消除三垢冥，  	明濟眾厄難。
開彼智慧眼，  	滅此昏盲闇，
閉塞諸惡道，  	通達善趣門。
功祚成滿足，  	威曜朗十方，
日月戢重暉，  	天光隱不現。
為眾開法藏，  	廣施功德寶，
常於大眾中，  	說法師子吼。
供養一切佛，  	具足眾德本，
願慧悉成滿，  	得為三界雄。
如佛無量智，  	通達靡不遍，
願我功德力，  	等此最勝尊。
斯願若剋果，  	大千應感動，
虛空諸天人，  	當雨珍妙華。』」
佛語阿難：「法藏比丘說此頌已，應時普地六種震動，天雨妙華以散其上，自然音樂空中讚言：『決定必成無上正覺。』於是法藏比丘具足修滿如是大願，誠諦不虛，超出世間深樂寂滅。
「阿難！法藏比丘於彼佛所諸天、魔、梵、龍神八部大眾之中發斯弘誓，建此願已，一向專志莊嚴妙土。所修佛國開廓廣大，超勝獨妙，建立常然，無衰、無變。於不可思議兆載永劫積殖菩薩無量德行，不生欲覺、瞋覺、害覺，不起欲想、瞋想、害想，不著色、聲、香、味、觸之法。忍力成就，不計眾苦。少欲知足，無染恚癡，三昧常寂，智慧無礙。無有虛偽諂曲之心，和顏軟語先意承問，勇猛精進志願無惓，專求清白之法。以慧利群生，恭敬三寶，奉事師長；以大莊嚴具足眾行，令諸眾生功德成就。住空、無相、無願之法，無作、無起，觀法如化。遠離麁言、自害、害彼、彼此俱害，修習善語，自利、利人、彼我兼利。棄國、捐王，絕去財色。自行六波羅蜜，教人令行。
「無央數劫積功累德，隨其生處在意所欲，無量寶藏自然發應，教化安立無數眾生。住於無上正真之道，或為長者、居士、豪姓、尊貴，或為剎利國君、轉輪聖帝，或為六欲天主乃至梵王。常以四事供養恭敬一切諸佛，如是功德不可稱說。口氣香潔如優鉢羅華，身諸毛孔出栴檀香，其香普熏無量世界；容色端正，相好殊妙，其手常出無盡之寶，衣服、飲食珍妙華香，諸蓋幢幡莊嚴之具。如是等事超諸人天，於一切法而得自在。」
阿難白佛：「法藏菩薩為已成佛而取滅度、為未成佛？為今現在？」
佛告阿難：「法藏菩薩今已成佛，現在西方，去此十萬億剎，其佛世界名曰安樂。」
阿難又問：「其佛成道已來為經幾時？」
佛言：「成佛已來凡歷十劫。其佛國土自然七寶——金、銀、琉璃、珊瑚、琥珀、車𤦲、瑪瑙——合成為地，恢廓曠蕩不可限極。悉相雜廁，轉相入間，光赫焜耀，微妙奇麗，清淨莊嚴超踰十方一切世界眾寶中精，其寶猶如第六天寶。又其國土無須彌山及金剛圍一切諸山，亦無大海、小海、溪渠、井谷。佛神力故，欲見則見。亦無地獄、餓鬼、畜生諸難之趣。亦無四時——春、秋、冬、夏——不寒、不熱，常和調適。」
爾時，阿難白佛言：「世尊！若彼國土無須彌山，其四天王及忉利天依何而住？」
佛語阿難：「第三炎天乃至色究竟天皆依何住？」
阿難白佛：「行業果報不可思議。」
佛語阿難：「行業果報不可思議，諸佛世界亦不可思議。其諸眾生功德善力住行業之地，故能爾耳。」
阿難白佛：「我不疑此法，但為將來眾生欲除其疑惑，故問斯義。」
佛告阿難：「無量壽佛威神光明最尊第一，諸佛光明所不能及。或有佛光照百佛世界、或千佛世界，取要言之，乃照東方恒沙佛剎，南、西、北方四維，上、下亦復如是。或有佛光照于七尺，或照一由旬，二、三、四、五由旬，如是轉倍乃至照一佛剎。是故，無量壽佛號無量光佛、無邊光佛、無礙光佛、無對光佛、炎王光佛、清淨光佛、歡喜光佛、智慧光佛、不斷光佛、難思光佛、無稱光佛、超日月光佛。
「其有眾生遇斯光者，三垢消滅，身意柔軟，歡喜踊躍，善心生焉。若在三塗勤苦之處，見此光明，皆得休息，無復苦惱；壽終之後皆蒙解脫。
「無量壽佛光明顯赫照曜十方諸佛國土，莫不聞知。不但我今稱其光明，一切諸佛、聲聞、緣覺、諸菩薩眾咸共歎譽，亦復如是。若有眾生聞其光明威神功德，日夜稱說至心不斷，隨意所願得生其國，為諸菩薩、聲聞大眾所共歎譽稱其功德；至其然後得佛道時，普為十方諸佛菩薩歎其光明亦如今也。」
佛言：「我說無量壽佛光明威神巍巍殊妙，晝夜一劫尚不能盡。」
佛語阿難：「無量壽佛壽命長久不可稱計，汝寧知乎？假使十方世界無量眾生皆得人身，悉令成就聲聞、緣覺，都共集會禪思一心，竭其智力於百千萬劫悉共推算，計其壽命長遠劫數，不能窮盡知其限極。聲聞、菩薩、天、人之眾，壽命長短亦復如是，非算數譬喻所能知也。又聲聞、菩薩其數難量不可稱說，神智洞達威力自在，能於掌中持一切世界。」
佛語阿難：「彼佛初會，聲聞眾數不可稱計，菩薩亦然。能如大目揵連百千萬億無量無數，於阿僧祇那由他劫乃至滅度悉共計挍，不能究了多少之數。譬如大海深廣無量，假使有人析其一毛以為百分，以一分毛沾取一渧。於意云何？其所渧者於彼大海，何所為多？」
阿難白佛：「彼所渧水比於大海多少之量，非巧歷算數、言辭譬類所能知也。」
佛語阿難：「如目連等於百千萬億那由他劫計彼初會聲聞菩薩，所知數者猶如一渧，其所不知如大海水。
「又其國土，七寶諸樹周滿世界——金樹、銀樹、琉璃樹、頗梨樹、珊瑚樹、瑪瑙樹、車𤦲樹——或有二寶、三寶乃至七寶轉共合成。或有金樹，銀葉、華、果；或有銀樹，金葉、華、果；或琉璃樹，頗梨為葉，華、果亦然；或水精樹，琉璃為葉，華、果亦然；或珊瑚樹，瑪瑙為葉，華、果亦然；或瑪瑙樹，琉璃為葉，華、果亦然；或車𤦲樹，眾寶為葉，華、果亦然。或有寶樹，紫金為本、白銀為莖、琉璃為枝、水精為條、珊瑚為葉、瑪瑙為華、車𤦲為實；或有寶樹，白銀為本、琉璃為莖、水精為枝、珊瑚為條、瑪瑙為葉、車𤦲為華、紫金為實；或有寶樹，琉璃為本、水精為莖、珊瑚為枝、瑪瑙為條、車𤦲為葉、紫金為華、白銀為實；或有寶樹，水精為本、珊瑚為莖、瑪瑙為枝、車𤦲為條、紫金為葉、白銀為華、琉璃為實；或有寶樹，珊瑚為本、瑪瑙為莖、車𤦲為枝、紫金為條、白銀為葉、琉璃為華、水精為實；或有寶樹，瑪瑙為本、車𤦲為莖、紫金為枝、白銀為條、琉璃為葉、水精為華、珊瑚為實；或有寶樹，車𤦲為本、紫金為莖、白銀為枝、琉璃為條、水精為葉、珊瑚為華、瑪瑙為實。行行相值、莖莖相望、枝枝相準、葉葉相向、華華相順、實實相當，榮色光曜不可勝視。清風時發，出五音聲，微妙宮商自然相和。
「又無量壽佛其道場樹，高四百萬里，其本周圍五千由旬，枝葉四布二十萬里。一切眾寶自然合成，以月光摩尼持海輪寶——眾寶之王——而莊嚴之。周匝條間垂寶瓔珞，百千萬色種種異變，無量光炎照曜無極。珍妙寶網羅覆其上，一切莊嚴隨應而現。微風徐動出妙法音，普流十方一切佛國。其聞音者得深法忍，住不退轉至成佛道，不遭苦患；目覩其色、耳聞其音、鼻知其香、舌甞其味、身觸其光、心以法緣，一切皆得甚深法忍，住不退轉至成佛道，六根清徹無諸惱患。
「阿難！若彼國人天見此樹者，得三法忍：一者、音響忍，二者、柔順忍，三者、無生法忍。此皆無量壽佛威神力故、本願力故、滿足願故、明了願故、堅固願故、究竟願故。」
佛告阿難：「世間帝王有百千音樂，自轉輪聖王乃至第六天上，伎樂音聲展轉相勝千億萬倍；第六天上萬種樂音，不如無量壽國諸七寶樹一種音聲千億倍也。亦有自然萬種伎樂，又其樂聲無非法音，清暢哀亮，微妙和雅，十方世界音聲之中最為第一。
「又，講堂、精舍、宮殿、樓觀皆七寶莊嚴，自然化成，復以真珠、明月摩尼眾寶以為交露，覆蓋其上。內、外、左、右有諸浴池，或十由旬，或二十、三十，乃至百千由旬，縱廣深淺各皆一等，八功德水湛然盈滿，清淨香潔味如甘露。黃金池者底白銀沙，白銀池者底黃金沙，水精池者底琉璃沙，琉璃池者底水精沙，珊瑚池者底琥珀沙，琥珀池者底珊瑚沙，車𤦲池者底瑪瑙沙，瑪瑙池者底車𤦲沙，白玉池者底紫金沙，紫金池者底白玉沙，或二寶、三寶乃至七寶轉共合成。其池岸上有栴檀樹，華葉垂布，香氣普熏。天優鉢羅華、鉢曇摩華、拘物頭華、分陀利華，雜色光茂彌覆水上。
「彼諸菩薩及聲聞眾若入寶池，意欲令水沒足，水即沒足；欲令至膝，即至于膝；欲令至腰，水即至腰；欲令至頸，水即至頸；欲令灌身，自然灌身；欲令還復，水輒還復。調和冷煖自然隨意，開神悅體蕩除心垢，清明澄潔淨若無形。寶沙映徹無深不照，微瀾迴流轉相灌注，安詳徐逝不遲不疾。波揚無量自然妙聲，隨其所應莫不聞者，或聞佛聲，或聞法聲，或聞僧聲，或寂靜聲、空無我聲、大慈悲聲、波羅蜜聲，或十力無畏不共法聲、諸通慧聲、無所作聲、不起滅聲、無生忍聲，乃至甘露灌頂眾妙法聲。如是等聲，稱其所聞歡喜無量，隨順清淨離欲寂滅真實之義、隨順三寶力無所畏不共之法、隨順通慧菩薩聲聞所行之道。無有三塗苦難之名，但有自然快樂之音，是故其國名曰極樂。
「阿難！彼佛國土諸往生者，具足如是清淨色身、諸妙音聲、神通功德，所處宮殿、衣服、飲食、眾妙華香莊嚴之具，猶第六天自然之物。若欲食時，七寶應器自然在前，金、銀、琉璃、車𤦲、瑪瑙、珊瑚、虎珀、明月真珠如是眾鉢隨意而至，百味飲食自然盈滿。雖有此食實無食者，但見色、聞香，意以為食，自然飽足，身心柔軟，無所味著。事已化去，時至復現。
「彼佛國土清淨安隱，微妙快樂，次於無為泥洹之道。其諸聲聞、菩薩、人、天，智慧高明，神通洞達。咸同一類，形無異狀，但因順餘方，故有人、天之名。顏貌端正，超世希有，容色微妙，非天、非人，皆受自然虛無之身、無極之體。」
佛告阿難：「譬如世間貧窮乞人在帝王邊，形貌容狀寧可類乎？」
阿難白佛：「假令此人在帝王邊，羸陋醜惡無以為喻，百千萬億不可計倍。所以然者？貧窮乞人底極廝下，衣不蔽形，食趣支命，飢寒困苦，人理殆盡。皆坐前世不殖德本，積財不施、富有益慳，但欲唐得、貪求無厭，不信修善、犯惡山積。如是壽終，財寶消散，苦身積聚為之憂惱，於己無益，徒為他有。無善可怙，無德可恃，是故，死墮惡趣，受此長苦。罪畢得出生為下賤，愚鄙斯極示同人類。所以世間帝王人中獨尊，皆由宿世積德所致，慈惠博施，仁愛兼濟，履信修善，無所違諍。是以壽終，福應得昇善道，上生天上享茲福樂。積善餘慶今得為人，遇生王家自然尊貴，儀容端正眾所敬事，妙衣珍膳隨心服御。宿福所追，故能致此。」
佛告阿難：「汝言是也。計如帝王，雖人中尊貴，形色端正，比之轉輪聖王，甚為鄙陋，猶彼乞人在帝王邊。轉輪聖王威相殊妙天下第一，比忉利天王，又復醜惡不得相喻萬億倍也。假令天帝比第六天王，百千億倍不相類也。設第六天王比無量壽佛國菩薩、聲聞，光顏容色不相及逮，百千萬億不可計倍。」
佛告阿難：「無量壽國其諸天人，衣服、飲食、華香、瓔珞、諸蓋幢幡、微妙音聲，所居舍宅、宮殿、樓閣，稱其形色、高下、大小，或一寶、二寶，乃至無量眾寶，隨意所欲，應念即至。又，以眾寶妙衣遍布其地，一切人天踐之而行。無量寶網彌覆佛土，皆以金縷、真珠、百千雜寶、奇妙珍異莊嚴絞飾，周匝四面垂以寶鈴，光色晃曜盡極嚴麗。自然德風徐起微動，其風調和，不寒、不暑；溫涼柔軟，不遲、不疾；吹諸羅網及眾寶樹，演發無量微妙法音，流布萬種溫雅德香。其有聞者，塵勞垢習自然不起，風觸其身皆得快樂，譬如比丘得滅盡三昧。
「又，風吹散華遍滿佛土，隨色次第而不雜亂，柔軟光澤馨香芬烈，足履其上陷下四寸，隨舉足已還復如故。華用已訖地輒開裂，以次化沒清淨無遺，隨其時節風吹散華，如是六反。
「又眾寶蓮華周滿世界，一一寶華百千億葉，其葉光明無量種色，青色青光，白色白光，玄、黃、朱、紫光色亦然，煒燁煥爛，明曜日月。一一華中出三十六百千億光；一一光中出三十六百千億佛，身色紫金，相好殊特；一一諸佛又放百千光明，普為十方說微妙法；如是諸佛各各安立無量眾生於佛正道。」
無量壽經卷上
佛說無量壽經卷下
曹魏天竺三藏康僧鎧譯
佛告阿難：「其有眾生生彼國者，皆悉住於正定之聚。所以者何？彼佛國中無諸邪聚及不定之聚，十方恒沙諸佛如來皆共讚歎無量壽佛威神功德不可思議。諸有眾生聞其名號信心歡喜，乃至一念，至心迴向願生彼國，即得往生住不退轉，唯除五逆、誹謗正法。」
佛告阿難：「十方世界諸天人民，其有至心願生彼國，凡有三輩。其上輩者，捨家棄欲而作沙門，發菩提心，一向專念無量壽佛，修諸功德願生彼國。此等眾生臨壽終時，無量壽佛與諸大眾現其人前，即隨彼佛往生其國，便於七寶華中自然化生，住不退轉，智慧勇猛，神通自在。是故，阿難！其有眾生欲於今世見無量壽佛，應發無上菩提之心，修行功德，願生彼國。」
佛語阿難：「其中輩者，十方世界諸天人民，其有至心願生彼國，雖不能行作沙門大修功德，當發無上菩提之心，一向專念無量壽佛。多少修善、奉持齋戒、起立塔像、飯食沙門、懸繒然燈、散華燒香，以此迴向願生彼國。其人臨終，無量壽佛化現其身——光明相好，具如真佛——與諸大眾現其人前，即隨化佛往生其國，住不退轉，功德智慧次如上輩者也。」
佛語阿難：「其下輩者，十方世界諸天人民，其有至心欲生彼國，假使不能作諸功德，當發無上菩提之心，一向專意乃至十念，念無量壽佛，願生其國。若聞深法歡喜信樂，不生疑惑，乃至一念念於彼佛，以至誠心願生其國。此人臨終夢見彼佛，亦得往生，功德智慧次如中輩者也。」
佛告阿難：「無量壽佛威神無極，十方世界無量無邊不可思議諸佛如來莫不稱歎。於彼東方恒沙佛國，無量無數諸菩薩眾，皆悉往詣無量壽佛所恭敬供養，及諸菩薩、聲聞大眾聽受經法，宣布道化；南、西、北方、四維，上、下亦復如是。」
爾時，世尊而說頌曰：
「東方諸佛國，  	其數如恒沙，
彼土諸菩薩，  	往覲無量覺；
南、西、北四維，  	上、下亦復然。
彼土菩薩眾，  	往覲無量覺，
一切諸菩薩，  	各齎天妙華，
寶香無價衣，  	供養無量覺；
咸然奏天樂，  	暢發和雅音，
歌歎最勝尊，  	供養無量覺。
究達神通慧，  	遊入深法門，
具足功德藏，  	妙智無等倫。
慧日照世間，  	消除生死雲，
恭敬遶三匝，  	稽首無上尊。
見彼嚴淨土，  	微妙難思議，
因發無量心，  	願我國亦然。
應時無量尊，  	動容發欣笑，
口出無數光，  	遍照十方國。
迴光圍遶身，  	三匝從頂入，
一切天、人眾，  	踊躍皆歡喜。
大士觀世音，  	整服稽首問，
白佛：『何緣笑？  	唯然願說意。』
梵聲猶雷震，  	八音暢妙響：
『當授菩薩記，  	今說仁諦聽。
十方來正士，  	吾悉知彼願，
志求嚴淨土，  	受決當作佛；
覺了一切法，  	猶如夢幻響，
滿足諸妙願，  	必成如是剎。
知法如電影，  	究竟菩薩道，
具諸功德本，  	受決當作佛；
通達諸法門，  	一切空無我，
專求淨佛土，  	必成如是剎。』
諸佛告菩薩：  	『令覲安養佛，
聞法樂受行，  	疾得清淨處。
至彼嚴淨土，  	便速得神通，
必於無量尊，  	受記成等覺。』
其佛本願力，  	聞名欲往生，
皆悉到彼國，  	自致不退轉。
菩薩興志願，  	願己國無異，
普念度一切，  	名顯達十方。
奉事億如來，  	飛化遍諸剎，
恭敬歡喜去，  	還到安養國。
若人無善本，  	不得聞此經；
清淨有戒者，  	乃獲聞正法。
曾更見世尊，  	則能信此事，
謙敬聞奉行，  	踊躍大歡喜。
憍慢弊懈怠，  	難以信此法；
宿世見諸佛，  	樂聽如是教。
聲聞或菩薩，  	莫能究聖心，
譬如從生盲，  	欲行開導人。
如來智慧海，  	深廣無崖底，
二乘非所測，  	唯佛獨明了。
假使一切人，  	具足皆得道，
淨慧如本空，  	億劫思佛智，
窮力極講說，  	盡壽猶不知。
佛慧無邊際，  	如是致清淨，
壽命甚難得，  	佛世亦難值。
人有信慧難，  	若聞精進求，
聞法能不忘，  	見敬得大慶，
則我善親友，  	是故當發意。
設滿世界火，  	必過要聞法，
會當成佛道，  	廣濟生死流。」
佛告阿難：「彼國菩薩皆當究竟一生補處——除其本願為眾生故——以弘誓功德而自莊嚴，普欲度脫一切眾生。阿難！彼佛國中諸聲聞眾身光一尋，菩薩光明照百由旬。有二菩薩最尊第一，威神光明普照三千大千世界。」
阿難白佛：「彼二菩薩其號云何？」
佛言：「一名觀世音，二名大勢至。是二菩薩於此國土修菩薩行，命終轉化生彼佛國。阿難！其有眾生生彼國者，皆悉具足三十二相，智慧成滿，深入諸法，究暢要妙，神通無礙，諸根明利。其鈍根者成就二忍，其利根者得阿僧祇無生法忍。又彼菩薩乃至成佛不更惡趣，神通自在常識宿命，除生他方五濁惡世，示現同彼如我國也。」
佛語阿難：「彼國菩薩承佛威神，一食之頃往詣十方無量世界，恭敬供養諸佛世尊，隨心所念，華香、伎樂、繒蓋、幢幡，無數無量供養之具自然化生，應念即至，珍妙殊特非世所有。轉以奉散諸佛、菩薩、聲聞大眾，在虛空中化成華蓋，光色晃耀，香氣普熏。其華周圓四百里者，如是轉倍，乃覆三千大千世界，隨其前後以次化沒。其諸菩薩僉然欣悅，於虛空中共奏天樂，以微妙音歌歎佛德，聽受經法歡喜無量。供養佛已、未食之前，忽然輕舉還其本國。」
佛語阿難：「無量壽佛為諸聲聞、菩薩大眾頒宣法時，都悉集會七寶講堂，廣宣道教，演暢妙法，莫不歡喜，心解得道。即時四方自然風起，普吹寶樹出五音聲，雨無量妙華隨風周遍，自然供養如是不絕。一切諸天皆齎天上百千華香、萬種伎樂供養其佛及諸菩薩、聲聞大眾，普散華香、奏諸音樂，前後來往更相開避。當斯之時，熙然快樂不可勝言。」
佛告阿難：「生彼佛國諸菩薩等，所可講說常宣正法，隨順智慧無違無失。於其國土所有萬物，無我所心、無染著心，去來進止情無所係，隨意自在無所適莫，無彼、無我，無競、無訟。於諸眾生得大慈悲饒益之心、柔軟調伏無忿恨心、離蓋清淨無厭怠心、等心、勝心、深心、定心、愛法樂法喜法之心、滅諸煩惱離惡趣心，究竟一切菩薩所行，具足成就無量功德，得深禪定諸通明慧，遊志七覺修心佛法，肉眼清徹靡不分了、天眼通達無量無限、法眼觀察究竟諸道、慧眼見真能度彼岸、佛眼具足覺了法性。以無礙智為人演說，等觀三界空無所有，志求佛法具諸辯才，除滅眾生煩惱之患。從如來生，解法如如，善知習滅，音聲方便。不欣世語，樂在正論，修諸善本，志崇佛道。知一切法皆悉寂滅，生身煩惱二餘俱盡。聞甚深法心不疑懼，常能修行其大悲者。深遠微妙靡不覆載，究竟一乘至于彼岸。決斷疑網，慧由心出，於佛教法該羅無外。智慧如大海、三昧如山王，慧光明淨超踰日月，清白之法具足圓滿。
「猶如雪山，照諸功德等一淨故；猶如大地，淨穢好惡無異心故；猶如淨水，洗除塵勞諸垢染故；猶如火王，燒滅一切煩惱薪故；猶如大風，行諸世界無障閡故；猶如虛空，於一切有無所著故；猶如蓮華，於諸世間無染污故；猶如大乘，運載群萌出生死故；猶如重雲，震大法雷覺未覺故；猶如大雨，雨甘露法潤眾生故；如金剛山，眾魔外道不能動故；如梵天王，於諸善法最上首故；如尼拘類樹，普覆一切故；如優曇鉢華，希有難遇故；如金翅鳥，威伏外道故；如眾遊禽，無所藏積故；猶如牛王，無能勝故；猶如象王，善調伏故；如師子王，無所畏故。
「曠若虛空，大慈等故；摧滅嫉心，不望勝故。專樂求法，心無厭足；常欲廣說，志無疲倦。擊法鼓、建法幢、曜慧日、除癡闇、修六和敬、常行法施，志勇精進，心不退弱。為世燈明、最勝福田，常為師導等無憎愛。唯樂正道無餘欣慼，拔諸欲刺以安群生，功德殊勝莫不尊敬，滅三垢障遊諸神通。因力、緣力、意力、願力、方便之力、常力、善力、定力、慧力、多聞之力、施戒、忍辱、精進、禪定、智慧之力、正念止觀諸通明力、如法調伏諸眾生力，如是等力一切具足。身色相好，功德、辯才具足莊嚴，無與等者。恭敬供養無量諸佛，常為諸佛所共稱歎。究竟菩薩諸波羅蜜，修空無相無願三昧、不生不滅諸三昧門，遠離聲聞緣覺之地。
「阿難！彼諸菩薩成就如是無量功德，我但為汝略言之耳；若廣說者，百千萬劫不能窮盡。」
佛告彌勒菩薩、諸天、人等：「無量壽國聲聞、菩薩功德智慧不可稱說，又其國土微妙安樂清淨若此，何不力為善，念道之自然，著於無上下，洞達無邊際？宜各勤精進，努力自求之，必得超絕去，往生安養國。橫截五惡趣，惡趣自然閉；昇道無窮極，易往而無人。其國不逆違，自然之所牽，何不棄世事，勤行求道德，可獲極長生，壽樂無有極？
「然世人薄俗，共諍不急之事。於此劇惡極苦之中，勤身營務以自給濟。無尊、無卑，無貧、無富，少、長、男、女共憂錢財，有無同然，憂思適等。屏營愁苦，累念積慮，為心走使，無有安時——有田憂田、有宅憂宅，牛、馬、六畜、奴婢、錢財、衣、食、什物，復共憂之——重思累息，憂念愁怖，橫為非常、水、火、盜賊、怨家、債主焚漂劫奪，消散磨滅，憂毒忪忪，無有解時。結憤心中不離憂惱，心堅意固適無縱捨，或坐摧碎身亡命終，棄捐之去莫誰隨者。
「尊貴、豪富亦有斯患，憂懼萬端，勤苦若此，結眾寒熱與痛共俱。貧窮下劣困乏常無，無田亦憂欲有田、無宅亦憂欲有宅，無牛、馬、六畜、奴婢、錢財、衣、食、什物亦憂欲有之。適有一復少一、有是少是，思有齊等；適欲具有便復糜散。如是憂苦當復求索，不能時得思想無益，身心俱勞，坐起不安，憂念相隨，勤苦若此，亦結眾寒熱與痛共俱。或時坐之終身夭命，不肯為善、行道、進德，壽終身死當獨遠去，有所趣向善惡之道，莫能知者。
「世間人民，父子、兄弟、夫婦、家室、中外親屬，當相敬愛，無相憎嫉；有無相通，無得貪惜；言色常和，莫相違戾。或時心諍有所恚怒，今世恨意微相憎嫉，後世轉劇至成大怨。所以者何？世間之事更相患害，雖不即時應急相破，然含毒畜怒結憤精神，自然剋識不得相離，皆當對生更相報復。人在世間愛欲之中，獨生、獨死，獨去、獨來，當行至趣苦樂之地，身自當之無有代者。善惡變化、殃福異處，宿豫嚴待，當獨趣入。遠到他所莫能見者，善惡自然追行所生。窈窈冥冥別離久長，道路不同會見無期，甚難甚難復得相值。何不棄眾事，各曼強健時，努力勤修善，精進願度世，可得極長生？如何不求道，安所須待，欲何樂乎？
「如是，世人不信作善得善、為道得道，不信人死更生、惠施得福，善惡之事都不信之，謂之不然終無有是。但坐此故，且自見之，更相瞻視，先後同然。轉相承受父餘教令，先人祖父素不為善、不識道德，身愚神闇，心塞意閉。死生之趣、善惡之道，自不能見，無有語者；吉凶禍福，競各作之，無一怪也。生死常道轉相嗣立，或父哭子、或子哭父，兄弟、夫婦更相哭泣，顛倒上下無常根本，皆當過去不可常保。教語開導，信之者少，是以生死流轉無有休止。
「如此之人，曚冥抵突，不信經法，心無遠慮，各欲快意；癡惑於愛欲，不達於道德；迷沒於瞋怒，貪狼於財色。坐之不得道，當更惡趣苦，生死無窮已，哀哉甚可傷。或時室家，父子、兄弟、夫婦，一死一生更相哀愍，恩愛、思慕、憂念結縛，心意痛著迭相顧戀，窮日卒歲無有解已。教語道德心不開明，思想恩好不離情欲。惛曚閉塞，愚惑所覆，不能深思熟計、心自端政、專精行道、決斷世事，便旋至竟年壽終盡不能得道，無可奈何。
「總猥憒擾皆貪愛欲，惑道者眾、悟之者寡，世間怱怱，無可聊賴。尊卑、上下、貧富、貴賤，勤苦怱務各懷殺毒，惡氣窈冥為妄興事，違逆天地不從人心，自然非惡先隨與之。恣聽所為待其罪極，其壽未盡便頓奪之。下入惡道，累世懟苦展轉其中，數千億劫無有出期。痛不可言，甚可哀愍。」
佛告彌勒菩薩、諸天人等：「我今語汝世間之事，人用是故，坐不得道。當熟思計遠離眾惡，擇其善者勤而行之。愛欲榮華不可常保，皆當別離無可樂者。曼佛在世當勤精進，其有至願生安樂國者，可得智慧明達、功德殊勝；勿得隨心所欲，虧負經戒在人後也。儻有疑意不解經者，可具問佛，當為說之。」
彌勒菩薩長跪白言：「佛威神尊重，所說快善，聽佛經者貫心思之。世人實爾如佛所言，今佛慈愍顯示大道，耳目開明長得度脫，聞佛所說莫不歡喜。諸天、人民、蠕動之類，皆蒙慈恩解脫憂苦。佛語教誡甚深甚善，智慧明見八方、上下、去來今事，莫不究暢。今我眾等所以蒙得度脫，皆佛前世求道之時謙苦所致。恩德普覆，福祿巍巍，光明徹照達空無極；開入泥洹，教授典攬威制消化，感動十方無窮無極。佛為法王尊超眾聖，普為一切天人之師，隨心所願皆令得道。今得值佛，復聞無量壽聲，靡不歡喜，心得開明。」
佛告彌勒：「汝言是也。若有慈敬於佛者，實為大善。天下久久乃復有佛，今我於此世作佛，演說經法，宣布道教，斷諸疑網；拔愛欲之本，杜眾惡之源。遊步三界無所拘閡，典攬智慧眾道之要，執持綱維昭然分明，開示五趣度未度者，決正生死泥洹之道。
「彌勒當知，汝從無數劫來修菩薩行，欲度眾生，其已久遠，從汝得道至于泥洹不可稱數。汝及十方諸天、人民一切四眾，永劫已來展轉五道，憂畏勤苦不可具言，乃至今世生死不絕，與佛相值聽受經法，又復得聞無量壽佛。快哉甚善，吾助爾喜。
「汝今亦可自厭生、死、老、病、痛苦、惡露、不淨、無可樂者，宜自決斷。端身正行，益作諸善；修己潔體，洗除心垢；言行忠信，表裏相應；人能自度，轉相拯濟；精明求願，積累善本。雖一世勤苦須臾之間，後生無量壽佛國快樂無極，長與道德合明，永拔生死根本，無復貪恚、愚癡、苦惱之患。欲壽一劫、百劫、千億萬劫，自在隨意皆可得之，無為自然次於泥洹之道。汝等宜各精進求心所願，無得疑惑中悔自為過咎，生彼邊地七寶宮殿，五百歲中受諸厄也。」
彌勒白佛：「受佛重誨，專精修學，如教奉行，不敢有疑。」
佛告彌勒：「汝等能於此世端心正意，不作眾惡，甚為至德，十方世界最無倫匹。所以者何？諸佛國土天人之類自然作善，不大為惡，易可開化。今我於此世間作佛，處於五惡、五痛、五燒之中，為最劇苦。教化群生令捨五惡、令去五痛、令離五燒；降化其意令持五善，獲其福德度世長壽泥洹之道。」
佛言：「何等為五惡？何等五痛？何等五燒？何等消化五惡、令持五善，獲其福德度世長壽泥洹之道？
「其一惡者，諸天、人民、蠕動之類。欲為眾惡莫不皆然。強者伏弱轉相剋賊，殘害殺戮迭相吞噬，不知修善惡逆無道，後受殃罰自然趣向。神明記識犯者不赦，故有貧窮、下賤、乞丐、孤獨、聾盲、瘖啞、愚癡、憋惡，至有尫狂不逮之屬。又有尊貴、豪富、高才、明達皆由宿世慈孝、修善積德所致。世有常道、王法、牢獄不肯畏慎，為惡入罪受其殃罰，求望解脫難得免出。世間有此目前現事，壽終後世尤深尤劇，入其幽冥轉生受身。譬如王法痛苦極刑，故有自然三塗無量苦惱，轉貿其身、改形易道，所受壽命或長或短，魂神精識自然趣之。當獨值向相從共生，更相報復無有止已，殃惡未盡不得相離，展轉其中無有出期，難得解脫痛不可言。天地之間自然有是，雖不即時卒暴應至，善惡之道會當歸之。是為一大惡、一痛、一燒，勤苦如是。
「譬如大火焚燒人身，人能於中一心制意、端身正行，獨作諸善、不為眾惡者，身獨度脫，獲其福德度世上天泥洹之道，是為一大善也。」
佛言：「其二惡者，世間人民——父子、兄弟、室家、夫婦——都無義理，不順法度。奢婬憍縱，各欲快意，任心自恣，更相欺惑。心口各異、言念無實、佞諂不忠、巧言諛媚、嫉賢謗善，陷入怨枉。主上不明任用臣下、臣下自在機偽多端，踐度能行知其形勢。在位不正為其所欺，妄損忠良不當天心。臣欺其君、子欺其父，兄弟、夫婦、中外知識更相欺誑，各懷貪欲、瞋恚、愚癡，欲自厚己、欲貪多有，尊卑、上下心俱同然。破家亡身不顧前後，親屬內外坐之滅族。或時室家、知識、鄉黨、市里、愚民、野人轉共從事，更相剝害，忿成怨結。富有慳惜不肯施與，愛保貪重心勞身苦，如是至竟無所恃怙，獨來獨去無一隨者。善惡、禍福追命所生，或在樂處、或入苦毒，然後乃悔，當復何及？世間人民心愚少智，見善憎謗不思慕及，但欲為惡妄作非法，常懷盜心悕望他利，消散磨盡而復求索。邪心不正，懼人有色，不豫思計，事至乃悔。今世現有王法牢獄，隨罪趣向受其殃罰。因其前世不信道德、不修善本，今復為惡，天神剋識別其名籍，壽終神逝下入惡道，故有自然三塗無量苦惱。展轉其中，世世累劫無有出期，難得解脫痛不可言，是為二大惡、二痛、二燒，勤苦如是。
「譬如大火焚燒人身，人能於中一心制意、端身正行，獨作諸善、不為眾惡者，身獨度脫，獲其福德度世上天泥洹之道，是為二大善也。」
佛言：「其三惡者，世間人民相因寄生，共居天地之間，處年壽命無能幾何。上有賢明長者、尊貴豪富，下有貧窮㒋賤、尫劣愚夫，中有不善之人常懷邪惡，但念婬妷，煩滿胸中，愛欲交亂坐起不安，貪意守惜但欲唐得。眄睞細色邪態外逸，自妻厭憎私妄出入，費損家財事為非法，交結聚會興師相伐，攻劫殺戮強奪不道。惡心在外不自修業，盜竊趣得欲擊成事，恐勢迫脅歸給妻子，恣心快意極身作樂。或於親屬不避尊卑，家室中外患而苦之，亦復不畏王法禁令。如是之惡著於人鬼，日月照見、神明記識，故有自然三塗無量苦惱。展轉其中，世世累劫無有出期，難得解脫痛不可言，是為三大惡、三痛、三燒，勤苦如是。
「譬如大火焚燒人身，人能於中一心制意、端身正行，獨作諸善、不為眾惡者，身獨度脫，獲其福德度世上天泥洹之道，是為三大善也。」
佛言：「其四惡者，世間人民不念修善，轉相教令共為眾惡。兩舌、惡口、妄言、綺語、讒賊、鬪亂，憎嫉善人、敗壞賢明，於傍快喜。不孝二親、輕慢師長，朋友無信，難得誠實。尊貴自大謂己有道，橫行威勢侵易於人，不能自知，為惡無恥，自以強健欲人敬難，不畏天地、神明、日月，不肯作善，難可降化。自用偃蹇謂可常爾，無所憂懼，常懷憍慢。如是眾惡，天神記識，賴其前世頗作福德，小善扶接營護助之；今世為惡福德盡滅，諸善神鬼各去離之，身獨空立無所復依。壽命終盡諸惡所歸，自然迫促共趣奪之。又其名籍記在神明，殃咎牽引當往趣向，罪報自然無從捨離。但得前行入於火鑊，身心摧碎、精神痛苦，當斯之時悔復何及？天道自然，不得蹉跌，故有自然三塗無量苦惱。展轉其中，世世累劫無有出期，難得解脫痛不可言，是為四大惡、四痛、四燒，勤苦如是。
「譬如大火焚燒人身，人能於中一心制意、端身正行，獨作諸善、不為眾惡，身獨度脫，獲其福德度世上天泥洹之道，是為四大善也。」
佛言：「其五惡者，世間人民徙倚懈惰，不肯作善、治身修業，家室眷屬飢寒困苦。父母教誨瞋目怒應，言令不和違戾反逆譬如怨家，不如無子。取與無節，眾共患厭，負恩違義，無有報償之心。貧窮困乏不能復得，辜較縱奪放恣遊散，串數唐得用自賑給。耽酒嗜美、飲食無度，肆心蕩逸、魯扈抵突，不識人情強欲抑制。見人有善憎嫉惡之，無義、無禮，無所顧錄。自用職當不可諫曉，六親眷屬所資有無不能憂念。不惟父母之恩、不存師友之義，心常念惡、口常言惡、身常行惡，曾無一善。不信先聖諸佛經法、不信行道可得度世、不信死後神明更生、不信作善得善為惡得惡。欲殺真人，鬪亂眾僧，欲害父母、兄弟、眷屬，六親憎惡願令其死。
「如是世人心意俱然，愚癡曚昧而自以智慧，不知生所從來、死所趣向。不仁、不順，逆惡天地，而於其中悕望僥倖，欲求長生，會當歸死。慈心教誨令其念善，開示生死善惡之趣自然有是，而不信之；苦心與語無益其人，心中閉塞意不開解。大命將終悔懼交至，不豫修善臨窮方悔，悔之於後將何及乎？天地之間五道分明，恢廓窈冥浩浩茫茫，善惡報應禍福相承，身自當之無誰代者。
「數之自然應其所行，殃咎追命無得縱捨。善人行善，從樂入樂、從明入明；惡人行惡，從苦入苦、從冥入冥。誰能知者？獨佛知耳。教語開示，信用者少，生死不休，惡道不絕。如是，世人難可具盡，故有自然三塗無量苦惱。展轉其中，世世累劫無有出期，難得解脫，痛不可言，是為五大惡、五痛、五燒，勤苦如是。
「譬如大火焚燒人身，人能於中一心制意、端身正念，言行相副、所作至誠，所語如語、心口不轉，獨作諸善、不為眾惡者，身獨度脫，獲其福德度世上天泥洹之道，是為五大善也。」
佛告彌勒：「吾語汝等，是世五惡勤苦若此，五痛、五燒展轉相生，但作眾惡不修善本，皆悉自然入諸惡趣。或其今世先被殃病，求死不得、求生不得，罪惡所招示眾見之。身死隨行入三惡道，苦毒無量自相燋然。至其久後共作怨結，從小微起遂成大惡，皆由貪著財色、不能施慧，癡欲所迫、隨心思想，煩惱結縛無有解已，厚己諍利無所省錄。富貴榮華當時快意，不能忍辱不務修善，威勢無幾隨以磨滅，身生勞苦久後大劇。天道施張自然糺舉，綱紀羅網上下相應，焭焭忪忪當入其中。古今有是，痛哉可傷！」
佛語彌勒：「世間如是，佛皆哀之。以威神力摧滅眾惡，悉令就善棄捐所思，奉持經戒、受行道法，無所違失，終得度世泥洹之道。」
佛言：「汝今諸天人民及後世人，得佛經語當熟思之，能於其中端心正行，主上為善、率化其下，轉相勅令各自端守，尊聖敬善、仁慈博愛。佛語教誨無敢虧負，當求度世拔斷生死眾惡之本，永離三塗無量憂畏苦痛之道。汝等於是廣殖德本，布恩施慧，勿犯道禁，忍辱、精進、一心、智慧轉相教化。
「為德立善，正心正意，齋戒清淨一日一夜，勝在無量壽國為善百歲。所以者何？彼佛國土無為自然，皆積眾善，無毛髮之惡，於此修善十日十夜，勝於他方諸佛國中為善千歲。所以者何？他方佛國為善者多、為惡者少，福德自然，無造惡之地。唯此間多惡無有自然，勤苦求欲轉相欺殆，心勞形困飲苦食毒，如是怱務未甞寧息。吾哀汝等天人之類，苦心誨喻教令修善，隨器開導授與經法，莫不承用，在意所願皆令得道。佛所遊履，國邑丘聚靡不蒙化，天下和順，日月清明，風雨以時，災厲不起，國豐民安，兵戈無用，崇德興仁，務修禮讓。」
佛言：「我哀愍汝等諸天人民，甚於父母念子。今吾於此世作佛，降化五惡、消除五痛、絕滅五燒，以善攻惡，拔生死之苦，令獲五德，昇無為之安。吾去世後經道漸滅，人民諂偽復為眾惡，五燒、五痛還如前法，久後轉劇不可悉說，我但為汝略言之耳。」
佛告彌勒：「汝等各善思之，轉相教誡，如佛經法，無得犯也。」
於是，彌勒菩薩合掌白言：「佛所說甚善。世人實爾，如來普慈哀愍悉令度脫，受佛重誨不敢違失。」
佛告阿難：「汝起更整衣服，合掌恭敬，禮無量壽佛。十方國土諸佛如來，常共稱揚讚歎彼佛，無著無閡。」
於是，阿難起整衣服，正身西向，恭敬合掌，五體投地禮無量壽佛。白言：「世尊！願見彼佛安樂國土及諸菩薩聲聞大眾。」
說是語已，即時無量壽佛放大光明，普照一切諸佛世界，金剛圍山、須彌山王、大小諸山，一切所有皆同一色。譬如劫水彌滿世界，其中萬物沈沒不現，滉瀁浩汗唯見大水；彼佛光明亦復如是，聲聞、菩薩一切光明皆悉隱蔽，唯見佛光明耀顯赫。
爾時，阿難即見無量壽佛，威德巍巍如須彌山王，高出一切諸世界上，相好光明靡不照耀。此會四眾一時悉見，彼見此土亦復如是。
爾時，佛告阿難及慈氏菩薩：「汝見彼國，從地已上至淨居天，其中所有微妙嚴淨自然之物，為悉見不？」
阿難對曰：「唯然，已見。」
「汝寧復聞無量壽佛大音宣布一切世界化眾生不？」
阿難對曰：「唯然，已聞。」
「彼國人民乘百千由旬七寶宮殿無所障閡，遍至十方供養諸佛，汝復見不？」
對曰：「已見。」
「彼國人民有胎生者，汝復見不？」
對曰：「已見。」
「其胎生者所處宮殿，或百由旬或五百由旬，各於其中受諸快樂，如忉利天，亦皆自然。」
爾時，慈氏菩薩白佛言：「世尊！何因何緣彼國人民胎生化生？」
佛告慈氏：「若有眾生以疑惑心修諸功德，願生彼國，不了佛智、不思議智、不可稱智、大乘廣智、無等無倫最上勝智，於此諸智疑惑不信；然猶信罪福，修習善本，願生其國。此諸眾生生彼宮殿，壽五百歲，常不見佛、不聞經法、不見菩薩聲聞聖眾，是故於彼國土謂之胎生。若有眾生明信佛智乃至勝智，作諸功德信心迴向，此諸眾生於七寶華中自然化生，加趺而坐，須臾之頃，身相光明，智慧功德如諸菩薩具足成就。
「復次，慈氏！他方諸大菩薩發心欲見無量壽佛，恭敬供養及諸菩薩聲聞之眾。彼菩薩等命終得生無量壽國，於七寶華中自然化生。彌勒當知，彼化生者智慧勝故。其胎生者皆無智慧，於五百歲中常不見佛、不聞經法、不見菩薩諸聲聞眾，無由供養於佛、不知菩薩法式、不得修習功德，當知此人宿世之時無有智慧，疑惑所致。」
佛告彌勒：「譬如轉輪聖王別有宮室，七寶莊飾，張設床帳，懸諸繒幡。若有諸小王子得罪於王，輒內彼宮中，繫以金鎖，供給飲食、衣服、床蓐、華香、伎樂，如轉輪王無所乏少。於意云何？此諸王子寧樂彼處不？」
對曰：「不也，但種種方便求諸大力欲自勉出。」
佛告彌勒：「此諸眾生亦復如是。以疑惑佛智生彼宮殿，無有刑罰乃至一念惡事，但於五百歲中不見三寶，不得供養修諸善本。以此為苦，雖有餘樂猶不樂彼處。若此眾生識其本罪，深自悔責求離彼處，即得如意，往詣無量壽佛所恭敬供養，亦得遍至無量無數諸如來所修諸功德。彌勒當知，其有菩薩生疑惑者，為失大利。是故，應當明信諸佛無上智慧。」
彌勒菩薩白佛言：「世尊！於此世界有幾所不退菩薩生彼佛國？」
佛告彌勒：「於此世界有六十七億不退菩薩往生彼國。一一菩薩已曾供養無數諸佛，次如彌勒者也；諸小行菩薩及修習少功德者不可稱計，皆當往生。」
佛告彌勒：「不但我剎諸菩薩等往生彼國，他方佛土亦復如是。其第一佛名曰遠照，彼有百八十億菩薩皆當往生。其第二佛名曰寶藏，彼有九十億菩薩皆當往生。其第三佛名曰無量音，彼有二百二十億菩薩皆當往生。其第四佛名曰甘露味，彼有二百五十億菩薩皆當往生。其第五佛名曰龍勝，彼有十四億菩薩皆當往生。其第六佛名曰勝力，彼有萬四千菩薩皆當往生。其第七佛名曰師子，彼有五百億菩薩皆當往生。其第八佛名曰離垢光，彼有八十億菩薩皆當往生。其第九佛名曰德首，彼有六十億菩薩皆當往生。其第十佛名曰妙德山，彼有六十億菩薩皆當往生。其第十一佛名曰人王，彼有十億菩薩皆當往生。其第十二佛名曰無上華，彼有無數不可稱計諸菩薩眾——皆不退轉，智慧勇猛，已曾供養無量諸佛，於七日中即能攝取百千億劫大士所修堅固之法——斯等菩薩皆當往生。其第十三佛名曰無畏，彼有七百九十億大菩薩眾、諸小菩薩及比丘等不可稱計皆當往生。」
佛語彌勒：「不但此十四佛國中諸菩薩等當往生也，十方世界無量佛國其往生者亦復如是，甚多無數。我但說十方諸佛名號及菩薩、比丘生彼國者，晝夜一劫尚未能竟，我今為汝略說之耳。」
佛語彌勒：「其有得聞彼佛名號，歡喜踊躍，乃至一念，當知此人為得大利，則是具足無上功德。是故，彌勒！設有大火充滿三千大千世界，要當過此。聞是經法，歡喜信樂，受持讀誦，如說修行。所以者何？多有菩薩欲聞此經而不能得。若有眾生聞此經者，於無上道終不退轉，是故應當專心信受持誦說行。吾今為諸眾生說此經法，令見無量壽佛及其國土一切所有，所當為者皆可求之，無得以我滅度之後復生疑惑。當來之世經道滅盡，我以慈悲哀愍特留此經止住百歲，其有眾生值斯經者，隨意所願皆可得度。」
佛語彌勒：「如來興世難值難見、諸佛經道難得難聞；菩薩勝法諸波羅蜜得聞亦難；遇善知識、聞法能行此亦為難；若聞斯經信樂受持，難中之難無過此難。是故我法，如是作、如是說、如是教，應當信順，如法修行。」
爾時，世尊說此經法，無量眾生皆發無上正覺之心，萬二千那由他人得清淨法眼，二十二億諸天人民得阿那含，八十萬比丘漏盡意解，四十億菩薩得不退轉，以弘誓功德而自莊嚴，於將來世當成正覺。爾時，三千大千世界六種震動，大光普照十方國土，百千音樂自然而作，無量妙華芬芬而降。
佛說經已，彌勒菩薩及十方來諸菩薩眾，長老阿難、諸大聲聞，一切大眾，聞佛所說靡不歡喜。
無量壽經卷下
佛說阿彌陀三耶三佛薩樓佛檀過度人道經卷上
吳月支國居士支謙譯
佛在羅閱祇耆闍崛山中。時有摩訶比丘僧萬二千人，皆淨潔一種類，皆阿羅漢：賢者拘隣、賢者拔智致、賢者摩訶那彌、賢者合尸、賢者須滿日、賢者維末抵、賢者不迺、賢者迦為拔抵、賢者憂為迦葉、賢者那履迦葉、賢者那翼迦葉、賢者舍利弗、賢者摩訶目揵連、賢者摩訶迦葉、賢者摩訶迦旃延、賢者摩訶揭質、賢者摩訶拘私、賢者摩訶梵提、賢者邠提文陀弗、賢者阿難律、賢者難提、賢者𮍃脾抵、賢者須楓、賢者䗍越、賢者摩訶羅倪、賢者摩訶波羅延、賢者波鳩[＊]蠡、賢者難持、賢者滿楓䗍、賢者蔡揭、賢者厲越，如是諸比丘僧甚眾多，數千億萬人，悉諸菩薩、阿羅漢，無央數不可復計；都共大會坐，皆賢者也。
時佛坐息思念正道，面有九色光，數千百變，光色甚大明。阿難即起，更被袈裟，前以頭面著佛足，即長跪叉手，問佛言：「今日佛面光色，何以時時更變明乃爾乎？今佛面光精數千百色，上下明好乃如是。我侍佛已來，未曾見佛面有如今日色者。我未曾見三耶三佛光明威神乃爾。獨當有意，願欲聞之。」
佛言：「賢者阿難！有諸天神教汝、若諸佛教汝，今問我者耶？汝自從善意出問佛耶？」
阿難白佛言：「無有諸天神教我，亦無諸佛教我令問佛也。我自從善心知佛意，問佛爾！每佛坐起行來出入，所欲至到、當所作為、諸所教勅者，我輒如佛意。今佛獨當念，諸已過去佛，諸當來佛，若他方佛國，今現在佛，獨展轉相思念故，佛面色光明乃爾耳！」
佛言：「善哉，善哉！賢者阿難！汝所問者甚深大快，多所度脫。若問佛者，勝於供養一天下阿羅漢、辟支佛，布施諸天人民及蜎飛蠕動之類，累劫百千億萬倍也。」
佛言：「阿難！今諸天世間帝王人民，及蜎飛蠕動之類，汝皆度脫之。」
佛言：「佛威神甚重難當也。汝所問者甚深，汝乃慈心於佛所，哀諸天帝王人民，若比丘僧、比丘尼、優婆塞、優婆夷，大善當爾，皆過度之。」
佛語阿難：「如世間有優曇樹，但有實無有華也。天下有佛，乃有華出耳！世間有佛，甚難得值也。今我出於天下作佛，若有大德聖明善心豫知佛意，若不妄在佛邊侍佛也。」
佛告阿難：「前已過去事，摩訶僧祇已來，其劫無央數不可復計。乃爾時有過去佛，名提惒竭羅。次復有佛，名旃陀倚，已過去。次復有佛，名須摩扶劫波薩多，已過去。次復有佛，名維末樓，已過去。次復有佛，名阿難那利，已過去。次復有佛，名那竭脾，已過去。次復有佛，名者梨俱遰波羅夜蔡，已過去。次復有佛，名彌離俱樓，已過去。次復有佛，名軷陀尼，已過去。次復有佛，名朱蹄波，已過去。次復有佛，名凡扶坻，已過去。次復有佛，名墮樓勒耶，已過去。次復有佛，名旃陀扈斯，已過去。次復有佛，名須耶惟于沙，已過去。次復有佛，名拘還彌鉢摩耆，已過去。次復有佛，名屍利滑攱，已過去。次復有佛，名摩訶那提，已過去。次復有佛，名耆頭摩提，已過去。次復有佛，名羅隣祇離，已過去。次復有佛，名俞樓俱路蔡。已過去，次復有佛，名滿呼群尼鉢賓䫛，已過去。次復有佛，名旃陀遬臾拔惒沙，已過去。次復有佛，名旃陀蔡拘岑，已過去。次復有佛，名潘波䗍頻尼，已過去。次復有佛，名軷波[＊]惒斯，已過去。次復有佛，名阿術祇陀揭䗍，已過去。次復有佛，名勿署提，已過去。次復有佛，名質夜蔡，已過去。次復有佛，名曇摩惒提，已過去。次復有佛，名篩耶維䫛質，已過去。次復有佛，名樓耶帶，已過去。次復有佛，名僧迦羅彌樓迦帶，已過去。次復有佛，名曇昧摩提阿維難提，已過去。」
佛告阿難：「次復有佛，名樓夷亘羅，在世間教授，壽四十二劫。乃爾時世有大國王，王聞佛經道，心即歡喜開解；便棄國捐王，行作沙門，字曇摩迦。作菩薩道，為人高才，智慧勇猛，與世人絕異。往到樓夷亘羅佛所，前為佛作禮，却長跪叉手，白佛言：『我欲求佛為菩薩道，令我後作佛時，於八方、上下諸無央數佛中，最尊智慧勇猛。頭中光明如佛光明，所焰照無極。所居國土，自然七寶極自軟好。令我後作佛時，教授名字，皆聞八方、上下無央數佛國，莫不聞知我名字者。諸無央數天人民，及蜎飛蠕動之類，諸來生我國者，悉皆令作菩薩、阿羅漢，無央數都勝諸佛國。如是者寧可得不？』」
佛語阿難：「其樓夷亘羅佛，知其高明所願快善，即為曇摩迦菩薩說經言：『譬如天下大海水，一人斗量之，一劫不止，尚可枯盡令空，得其底埿。人至心求道，何如當不可得乎？求索精進不休止，會當得心中所欲願爾。』曇摩迦菩薩聞樓夷亘羅佛說經如是，即大歡喜踊躍。其佛即選擇二百一十億佛國土中，諸天人民之善惡、國土之好醜，為選擇心中所欲願。夷亘羅佛說經竟，曇摩迦便一其心，即得天眼徹視，悉自見二百一十億諸佛國中諸天人民之善惡、國土之好醜。即選擇心中所願，便結得是二十四願經，則奉行之，精進勇猛勤苦求索。如是無央數劫，所師事供養諸已過去佛，亦無央數。其曇摩迦菩薩至其然後，自致得作佛，名阿彌陀佛，最尊智慧勇猛光明無比，今現在所居國土甚快善。在他方異佛國，教授八方、上下諸無央數天人民，及蜎飛蠕動之類，莫不得過度解脫憂苦。」
佛語阿難：「阿彌陀佛為菩薩時，常奉行是二十四願，珍寶愛重，保持恭慎，精禪從之，與眾超絕，卓然有異，皆無有能及者。」
佛言：「何為二十四願？
「第一願：使某作佛時，令我國中，無有泥犁、禽獸、薜荔、蜎飛蠕動之類。得是願乃作佛，不得是願終不作佛。
「第二願：使某作佛時，令我國中，無有婦人，女人欲來生我國中者即作男子；諸無央數天人民、蜎飛蠕動之類，來生我國者，皆於七寶水池蓮華中化生，長大皆作菩薩、阿羅漢都無央數。得是願乃作佛，不得是願終不作佛。
「第三願：使某作佛時，令我國土，自然七寶，廣縱甚大曠蕩無極自軟好。所居舍宅，被服飲食，都皆自然，皆如第六天王所居處。得是願乃作佛，不得是願終不作佛。
「第四願：使某作佛時，令我名字，皆聞八方、上下無央數佛國。皆令諸佛，各於比丘僧大坐中，說我功德國土之善。諸天人民、蜎飛蠕動之類，聞我名字，莫不慈心歡喜踊躍者，皆令來生我國。得是願乃作佛，不得是願終不作佛。
「第五願：使某作佛時，令八方、上下諸無央數天人民，及蜎飛蠕動之類，若前世作惡，聞我名字，欲來生我國者，即便反政自悔過，為道作善，便持經戒，願欲生我國不斷絕。壽終皆令不復泥犁、禽獸、薜荔，即生我國，在心所願。得是願乃作佛，不得是願終不作佛。
「第六願：使某作佛時，令八方、上下無央數佛國，諸天人民，若善男子、善女人，欲來生我國，用我故益作善，若分檀布施、遶塔燒香、散花然燈、懸雜繒綵、飯食沙門、起塔作寺，斷愛欲，來生我國作菩薩。得是願乃作佛，不得是願終不作佛。
「第七願：使某作佛時，令八方、上下無央數佛國，諸天人民，若善男子、善女人，有作菩薩道，奉行六波羅蜜經。若作沙門，不毀經戒，斷愛欲，齋戒清淨，一心念欲生我國，晝夜不斷絕。若其人壽欲終時，我即與諸菩薩、阿羅漢，共飛行迎之，即來生我國；則作阿惟越致菩薩，智慧勇猛。得是願乃作佛，不得是願終不作佛。
「第八願：使某作佛時，令我國中諸菩薩，欲到他方佛國生，皆令不更[＊]泥犁、禽獸、薜荔，皆令得佛道。得是願乃作佛，不得是願終不作佛。
「第九願：使某作佛時，令我國中諸菩薩、阿羅漢，面目皆端正，淨潔姝好，悉同一色，都一種類，皆如第六天人。得是願乃作佛，不得是願終不作佛。
「第十願：使某作佛時，令我國中諸菩薩、阿羅漢，皆同一心所念所欲，言者豫相知意。得是願乃作佛，不得是願終不作佛。
「第十一願：使某作佛時，令我國中諸菩薩、阿羅漢，皆無有淫泆之心；終無念婦女意，終無有瞋怒、愚癡者。得是願乃作佛，不得是願終不作佛。
「第十二願：使某作佛時，令我國中諸菩薩、阿羅漢，皆令心相敬愛，終無相嫉憎者。得是願乃作佛，不得是願終不作佛。
「第十三願：使某作佛時，令我國中諸菩薩，欲共供養八方、上、下，無央數諸佛，皆令飛行，即到欲得自然萬種之物，即皆在前，持用供養諸佛；悉皆遍已後，日未中時，即飛行還我國。得是願乃作佛，不得是願終不作佛。
「第十四願：使某作佛時，令我國中諸菩薩、阿羅漢欲飯時，即皆自然七寶鉢中，有自然百味飯食在前，食已自然去。得是願乃作佛，不得是願終不作佛。
「第十五願：使某作佛時，令我國中諸菩薩，身皆紫磨金色，三十二相、八十種好，皆令如佛。得是願乃作佛，不得是願終不作佛。
「第十六願：使某作佛時，令我國中諸菩薩、阿羅漢，語者如三百鍾聲，說經行道皆如佛。得是願乃作佛，不得是願終不作佛。
「第十七願：使某作佛時，令我洞視徹聽，飛行十倍，勝於諸佛。得是願乃作佛，不得是願終不作佛。
「第十八願：使某作佛時，令我智慧說經行道，十倍於諸佛。得是願乃作佛，不得是願終不作佛。
「第十九願：使某作佛時，令八方、上下無央數佛國，諸天人民、蜎飛蠕動之類，皆令得人道，悉作辟支佛、阿羅漢，皆坐禪一心，共欲計數，知我年壽幾千億萬劫歲數，皆令無有能極知壽者。得是願乃作佛，不得是願終不作佛。
「第二十願者：使某作佛時，令八方、上下各千億佛國中，諸天人民、蜎飛蠕動之類，皆令作辟支佛、阿羅漢，皆坐禪一心，共欲計數我國中諸菩薩、阿羅漢，知有幾千億萬人，皆令無有能知數者。得是願乃作佛，不得是願終不作佛。
「第二十一願，使某作佛時，令我國中諸菩薩、阿羅漢，壽命無央數劫。得是願乃作佛，不得是願終不作佛。
「第二十二願：使某作佛時，令我國中諸菩薩、阿羅漢，皆智慧勇猛，自知前世億萬劫時宿命，所作善惡却知無極，皆洞視徹，知十方去、來、現在之事。得是願乃作佛，不得是願終不作佛。
「第二十三願：使某作佛時，令我國中諸菩薩、阿羅漢，皆智慧勇猛，頂中皆有光明。得是願乃作佛，不得是願終不作佛。
「第二十四願：使某作佛時，令我頂中，光明絕好，勝於日月之明百千億萬倍，絕勝諸佛。光明焰照，諸無央數天下，幽冥之處皆當大明。諸天人民、蜎飛蠕動之類，見我光明，莫不慈心作善者，皆令來生我國。得是願乃作佛，不得是願終不作佛。」
佛告阿難：「阿彌陀為菩薩時，常奉行是二十四願。分檀布施，不犯道禁，忍辱、精進、一心、智慧；志願常勇猛，不毀經法。求索不懈，每獨棄國捐王，絕去財色，精明求願無所適莫，積功累德，無央數劫，今自致作佛，悉皆得之，不亡其功也。」
佛言：「阿彌陀佛，光明最尊第一無比；諸佛光明，皆所不及也。八方、上下無央數諸佛中，有佛頂中光明照七丈，有佛頂中光明照一里，有佛頂中光明照二里，有佛頂中光明照五里，有佛頂中光明照十里，有佛頂中光明照二十里，有佛頂中光明照四十里，有佛頂中光明照八十里，有佛頂中光明照百六十里，有佛頂中光明照三百二十里，有佛頂中光明照六百四十里，有佛頂中光明照千三百里，有佛頂中光明照二千六百里，有佛頂中光明照五千二百里，有佛頂中光明照萬四百里，有佛頂中光明照二萬一千里，有佛頂中光明照四萬二千里，有佛頂中光明照八萬四千里，有佛頂中光明照十七萬里，有佛頂中光明照三十五萬里，有佛頂中光明照七十萬里，有佛頂中光明照百五十萬里，有佛頂中光明照三百萬里，有佛頂中光明照六百萬里；有佛頂中光明照一佛國，有佛頂中光明照兩佛國，有佛頂中光明照四佛國，有佛頂中光明照八佛國，有佛頂中光明照十五佛國，有佛頂中光明照三十佛國，有佛頂中光明照六十佛國，有佛頂中光明照百二十佛國，有佛頂中光明照二百四十佛國，有佛頂中光明照五百佛國，有佛頂中光明照千佛國，有佛頂中光明照二千佛國，有佛頂中光明照四千佛國，有佛頂中光明照八千佛國，有佛頂中光明照萬六千佛國，有佛頂中光明照三萬二千佛國，有佛頂中光明照六萬四千佛國，有佛頂中光明照十三萬佛國，有佛頂中光明照二十六萬佛國，有佛頂中光明照五十萬佛國，有佛頂中光明照百萬佛國，有佛頂中光明照二百萬佛國。」
佛言：「諸八方、上下無央數佛，頂中光明所焰照皆如是也。阿彌陀佛頂中光明所焰照，千萬佛國。所以諸佛光明所照有近遠者何？本其前世宿命求道，為菩薩時，所願功德各自有大小；至其然後作佛時，各自得之，是故令光明轉不同等。諸佛威神同等爾，自在意所欲，作為不豫計。阿彌陀佛光明，所照最大，諸佛光明，皆所不能及也。」
佛稱譽：「阿彌陀佛光明極善！阿彌陀佛光明極善！善中明好，甚快無比，絕殊無極也。阿彌陀佛光明，清潔無瑕穢，無缺減也。阿彌陀佛光明姝好，勝於日月之明，百千億萬倍。諸佛光明中之極明也，光明中之極好也，光明中之極雄傑也，光明中之快善也，諸佛中之王也，光明中之極尊也，光明中之最明無極也。焰照諸無數天下，幽冥之處，皆常大明。諸有人民、蜎飛蠕動之類，莫不見阿彌陀佛光明也，見者莫不慈心歡喜者。世間諸有婬泆、瞋怒、愚癡者，見阿彌陀佛光明，莫不作善也。諸在泥犁、禽獸、薜荔，考掠勤苦之處，見阿彌陀佛光明至，皆休止不復治，死後莫不得解脫憂苦者也。阿彌陀佛光明，名聞八方、上下無窮無極，無央數諸佛國，諸天人民，莫不聞知；聞知者莫不度脫也。」
佛言：「不獨我稱譽阿彌陀佛光明也。八方、上下，無央數佛、辟支佛、菩薩、阿羅漢，所稱譽皆如是。」
佛言：「其有人民，善男子、善女人，聞阿彌陀佛聲，稱譽光明。朝暮常稱譽其光明好，至心不斷絕，在心所願，往生阿彌陀佛國，可得為眾菩薩、阿羅漢所尊敬。若其然後作佛者，亦當復為八方、上下諸無央數佛、辟支佛、菩薩、阿羅漢，所稱譽光明如是也。即眾比丘僧，諸菩薩、阿羅漢，諸天、帝王、人民，聞之皆歡喜踊躍，莫不讚歎者。」
佛言：「我道阿彌陀佛光明，姝好巍巍，稱譽快善，晝夜一劫，尚未竟也；我但為若曹小說之耳。」
佛說阿彌陀佛為菩薩，求索得是二十四願時，阿闍世王太子，與五百長者迦羅越子，各持一金華蓋，俱到佛所，前為作禮佛，以頭面著佛足，皆持金華蓋，前上佛已，悉却坐一面聽經。阿闍世王太子，及五百長者子，聞阿彌陀佛二十四願，皆大歡喜踊躍，心中俱願言：「令我等後作佛時，皆如阿彌陀佛。」佛即知之，告諸比丘僧：「是阿闍世王太子，及五百長者子，却後無數劫，皆當作佛，如阿彌陀佛。」
佛言：「是阿闍世王太子，及五百長者子，住菩薩道已來無央數劫，皆各供養四百億佛已，今復來供養我。阿闍世王太子，及五百長者子，皆前世迦葉佛時，為我作弟子，今皆復會是共相值也。」則諸比丘僧，聞佛言皆踊躍，莫不代之歡喜者。
佛告阿難：「阿彌陀作佛已來，凡十小劫。所居國土，名須摩題，正在西方，去是閻浮提地界千億萬須彌山佛國。其國地皆自然七寶，其一寶者白銀，二寶者黃金，三寶者水精，四寶者琉璃，五寶者珊瑚，六寶者琥珀，七寶者車渠，是為七寶。皆以自共為地，曠蕩甚大無極。皆自相參，轉相入中，各自焜煌參明，極自軟好，甚姝無比。其七寶地，諸八方、上下眾寶中精味，自然合會，其化生耳。其寶皆比第六天上之七寶也。其國中無有須彌山，其日、月、星辰、第一四天王、第二忉利天，皆在虛空中。其國土無有大海，亦無有小海水，亦無江、河、恒水也。亦無有山林、溪谷，無有幽冥之處，其國七寶地皆平正。無有泥犁、禽獸、薜荔、蜎飛蠕動之類。無有阿須倫、諸龍、鬼神。終無天雨時，亦無有春、夏、秋、冬，亦無大寒，亦無大熱，常和調中適，甚快善無比。皆有自然萬種之物，百味飯食，意欲有所得，即自然在前；所不用者，即自然去。比如第六天上自然之物，恣若自然即皆隨意。其國中悉諸菩薩、阿羅漢，無有婦女，壽命無央數劫。女人往生，即化作男子。但有諸菩薩、阿羅漢無央數，悉皆洞視、徹聽；悉遙相見，遙相瞻望，遙相聞語聲；悉皆求道善者，同一種類，無有異人。其諸菩薩、阿羅漢，面目皆端正，淨潔絕好，悉同一色，無有偏醜惡者也。諸菩薩、阿羅漢，皆才猛黠慧，皆衣自然之衣，心中所念道德，其欲語言，皆豫相知意所念；言常說正事，所語輒說經道，不說他餘之惡。其語言音響，如三百[＊]鍾聲。皆相敬愛，無相嫉憎者，皆以長幼上下先後言之。以義如禮，轉相敬事如兄、如弟。以仁履義，不妄動作言語。如誡轉相教，令不相違戾，轉相承受；皆心淨潔，無所貪慕，終無瞋怒、淫泆之心，愚癡之態。無有邪心念婦女意，悉皆智慧勇猛，和心歡樂好喜經道。自知前世所從來生億萬劫時，宿命善惡存亡；現在却知無極。
「阿彌陀佛所可教授，講堂精舍，皆復自然七寶，金、銀、水精、琉璃、白玉、虎珀、車𤦲，自共相成甚姝明，好絕無比。亦無作者，不知所從來，亦無持來者，亦無所從去；阿彌陀佛所願德重，其人作善故，論經語義，說經行道，講會其中，自然化生爾。其講堂精舍，皆復有七寶樓觀、欄楯，復以金、銀、水精、琉璃、白玉、虎珀、車𤦲為瓔珞；復以白珠、明月珠、摩尼珠為交露，覆蓋其上。皆自作五音聲，甚好無比。諸菩薩、阿羅漢所居舍宅，皆復以七寶，金、銀、水精、琉璃、珊瑚、虎珀、車𤦲、馬瑙化生，轉共相成其舍宅。悉各有七寶樓觀、欄楯，復以金、銀、水精、琉璃、白玉、虎珀、車𤦲為瓔珞；復以白珠、明月珠、摩尼珠為交露，覆蓋其上；皆各復自作五音聲。
「阿彌陀佛講堂精舍，及諸菩薩、阿羅漢所居舍宅中，內外處處，皆復有自然流泉浴池，皆與自然七寶俱生，金、銀、水精、琉璃、虎珀、車渠，轉共相成。淳金池者，其水底沙白銀也。淳白銀池者，其水底沙黃金也。淳水精池者，其水底沙琉璃也。淳琉璃池者，其水底沙水精也。淳珊瑚池者，其水底沙虎珀也。淳虎珀池者，其水底沙珊瑚也。淳車渠池者，其水底沙馬瑙也。淳馬瑙池者，其水底沙車渠也。淳白玉池者，其水底沙紫磨金也。淳紫磨金池者，其水底沙白玉也。中復有兩寶共作一池者，其水底沙金、銀也。中復有三寶共作一池者，其水底沙金、銀、水精也。中復有四寶共作一池者，其水底沙金、銀、水精、琉璃也。中有五寶共作一池者，其水底沙金、銀、水精、琉璃、珊瑚也。中有六寶共作一池者，其水底沙金、銀、水精、琉璃、珊瑚、虎珀也。中有七寶共作一池者，其水底沙金、銀、水精、琉璃、珊瑚、虎珀、車渠也。中有浴池長四十里者，有長八十里者，有長百六十里者，有長三百二十里者，有長六百四十里者，有長千二百八十里者，有長二千五百六十里者，有長五千一百二十里者，有長萬二百四十里者，有長二萬四百八十里者。其池縱廣適等，是池者皆諸菩薩、阿羅漢常所可浴池。」
佛言：「彌陀佛浴池長四萬八千里，廣亦四萬八千里，其池皆以七寶轉共相成；其水底沙白珠、明月珠、摩尼珠也。阿彌陀佛及諸菩薩、阿羅漢浴池中水，皆清香潔。池中皆有香華，悉自然生百種華，種種異色；色異香華，枝皆千葉甚香無比也，香不可言。其華者亦非世間之華，復非天上之華；此華香都八方、上下，眾華香中精也，自然化生耳。其池中水流行，轉相灌注；其水流行，亦不遲不駃，皆復作五音聲。」
佛言：「八方、上下無央數佛國，諸天人民及蜎飛蠕動之類，諸生阿彌陀佛國者，皆於七寶水池蓮華中化生，便自然長大；亦無乳養之者，皆食自然之飲食。其身體亦非世間人之身體，亦非天上人之身體，皆積眾善之德，悉受自然虛無之身，無極之體，甚姝好無比。」
佛語阿難：「如世間貧窮乞丐人，令在帝王邊住者，其面目形狀寧類帝王面目形類顏色不？」
阿難言：「假使王子在帝王邊住者，其面目形狀甚醜惡不好；不如帝王，百千億萬倍也。所以者何？乞人貧窮困極，飲食常惡，未常有美食時。既惡食不能得飽食，食纔支命，骨節相撐拄，無以自給，常乏無有儲；飢餓寒凍，怔忪愁苦。但坐前世，為人愚癡，無智慳貪，不肯慈哀、為善博愛施與；但欲唐得貪惜飲食獨食嗜美，不信施貸後得報償，復不信作善後世當得其福，蒙悾抵佷益作眾惡。如是壽終財物盡索，素無恩德無所恃怙，入惡道中坐之適苦，然後得出解脫。今生為人，作於下賤，為貧家作子。強像人形狀類甚醜，衣被弊壞單空獨立，不蔽形體乞丐生耳。飢寒困苦面目羸劣不類人色，坐其前世身之所作，受其殃罰，示眾見之，莫誰哀者。棄捐市道暴露痟瘦，黑醜惡極不及人耳。
「所以帝王人中獨尊最好者何？皆其前世為人時，作善信受經道，布恩施德，博愛順義，慈仁憙與，不貪飲食與眾共之。無所匱惜都無違爭，得其善福，壽終德隨，不更惡道。今生為人得生王家，自然尊貴獨王典主，攬制人民為其雄傑。面目潔白和顏好色，身體端正眾共敬事，美食好衣隨心恣意。若樂所欲自然在前都無違爭，於人中姝好，無憂快樂面目光澤，故乃爾耳。」
佛告阿難：「若言是也！帝王雖於人中好無比者，當令在遮迦越王邊住者，其面形類甚醜惡不好，比如乞人在帝王邊住耳。其帝王面目，尚復不如遮迦越王面色姝好，百千億萬倍。如遮迦越王於天下絕好無比，當令在第二天王邊住者，其面甚醜不好，尚復不如帝釋面類端正姝好，百千億萬倍。如天帝釋，令在第六天王邊住者，其面類甚醜不好，尚復不如第六天王面類端正姝好，百千億萬倍。如第六天王，令在阿彌陀佛國中諸菩薩、阿羅漢邊住者，其面甚醜，尚復不如阿彌陀佛國中，菩薩、阿羅漢面類端正姝好，百千億萬倍。」
佛言：「阿彌陀佛國諸菩薩、阿羅漢面類，悉皆端正絕好無比，次於泥洹之道。阿彌陀佛及諸菩薩、阿羅漢，講堂精舍所居處舍宅中，內外浴池上，皆有七寶樹。中有淳金樹，淳銀樹，淳水精樹，淳琉璃樹，淳白玉樹，淳珊瑚樹，淳琥珀樹，淳車𤦲樹，種種各自異行。中有兩寶共作一樹者：銀樹，銀根、金莖，銀枝、金葉，銀華、金實；金樹者，金根、銀莖，金枝、銀葉，金華、銀實；水精樹者，水精根、琉璃莖，水精枝、琉璃葉，水精華、琉璃實；琉璃樹者，琉璃根、水精莖，琉璃枝、水精葉，琉璃華、水精實；是二寶共作一樹。中復有四寶共作一樹者：水精樹，水精根、琉璃莖，金枝、銀葉，水精華、琉璃實；琉璃樹者，琉璃根、水精莖，金枝、銀葉，水精華、琉璃實；是四寶樹轉共相成，各自異行。中復有五寶共作一樹者：銀根、金莖，水精枝、琉璃葉，銀華、金實；金樹者，金根、銀莖，水精枝、琉璃葉，珊瑚華、銀實；水精樹者，水精根、琉璃莖，珊瑚枝、銀葉，金華、琉璃實；琉璃樹者，琉璃根、珊瑚莖，水精枝、金葉，銀華、珊瑚實；珊瑚樹者，珊瑚根、琉璃莖，水精枝、金葉，銀華、琉璃實；是五寶共作一樹，各自異行。中有六寶共作一樹者：銀樹，銀根、金莖，水精枝、琉璃葉，珊瑚華、虎珀實。金樹者，金根、銀莖，水精枝、琉璃葉，虎珀華、珊瑚實；水精樹者，水精根、琉璃莖，珊瑚枝、虎珀葉，銀華、金實；琉璃樹者，琉璃根、珊瑚莖，虎珀枝、水精葉，金華、銀實；是六寶樹轉共相成，各自異行。中復有七寶共作一樹者：銀樹，銀根、金莖，水精枝、琉璃葉，珊瑚華、虎珀實。金樹者，金根、水精莖，琉璃枝、珊瑚葉，虎珀華、銀實；水精樹者，水精根、琉璃莖，珊瑚枝、虎珀葉，車𤦲華、白玉實；珊瑚樹者，珊瑚根、虎珀莖，白玉枝、琉璃葉，車𤦲華、明月珠實；虎珀樹者，虎珀根、白玉莖，珊瑚枝、琉璃葉，水精華、金實；白玉樹者，白玉根、車𤦲莖，珊瑚枝、虎珀葉，金華、摩尼珠實。是七寶樹轉共相成，種種各自異，行行相值，莖莖自相准，枝枝自相值，葉葉自相向，華華自相望，實實自相當。」
佛言：「阿彌陀佛，當講堂精舍中，內外七寶浴池繞邊上諸七寶樹，及諸菩薩、阿羅漢，七寶舍宅中，內外七寶浴池繞池邊諸七寶樹，數千百重行，皆各如是。各自作五音聲，音聲甚好無比也。」
佛告阿難：「如世間帝王有百種伎樂音聲，不如遮迦越王諸伎樂音聲好，百千億萬倍。如遮迦越王萬種伎樂音聲，尚復不如第二忉利天上諸伎樂一音聲，百千億萬倍。如忉利天上萬種伎樂之聲，尚復不如第六天上一音聲好，百千億萬倍。如第六天上萬種音樂之聲，尚復不如阿彌陀佛國中七寶樹一音聲好，百千億萬倍。阿彌陀佛國中，亦有萬種自然伎樂，甚樂無極。阿彌陀佛及諸菩薩、阿羅漢欲浴時，便各自可入其七寶池中浴。諸菩薩、阿羅漢意欲令水沒足，水即沒足；意欲令水至膝，水即至膝；意欲令水至腰，水即至腰；意欲令水至腋，水即至腋；意欲令水至頸，水即至頸；意欲令水自灌身上，水即自灌身上；意欲令水還復如故，水即還復如故；恣若隨意所欲好喜。」
佛言：「阿彌陀及諸菩薩、阿羅漢皆浴已，悉自於一大蓮華上坐，即四方自然亂風起。其亂風者，亦非世間之風，亦非天上之風。都八方、上下眾風中精，自然合會化生耳。不寒、不熱，常和調中適，甚清涼好無比也，徐起不遲、不駃，適得中宜。吹七寶樹，皆作五音聲。以七寶樹華，悉覆其國中，皆散佛及諸菩薩、阿羅漢上。華隨墮地，皆厚四寸，極自軟好無比。即自然亂風吹萎華，悉自然去。即復四方自然亂風吹七寶樹，樹皆復作五音聲，樹華皆自然散佛及諸菩薩、阿羅漢上。華小萎墮地，即自然去。即復四方亂風起吹七寶樹；如是四反。諸菩薩、阿羅漢中有但欲聞經者，中有但欲聞音樂者，中有但欲聞華香者，有不欲聞經者，有不欲聞音樂聲者，有不欲聞華香者；其所欲聞者，輒即獨聞之；不欲聞者，則獨不聞；隨意所欲喜樂，不違其願也。浴訖各自去行道，中有在地講經者、誦經者、說經者、口受經者、聽經者、念經者、思道者、坐禪者、經行者，中有在虛空中講經者、誦經者、說經者、口受經者、聽經者、念經者、思道者、坐禪一心者、經行者。未得須陀洹道者，即得須陀洹道；未得斯陀含道者，即得斯陀含道；未得阿那含道者，即得阿那含道；未得阿羅漢道者，即得阿羅漢道；未得阿惟越致菩薩者，即得阿惟越致；各自說經行道，悉皆得道，莫不歡喜踊躍者也。
「諸菩薩中，有意欲供養八方、上下無央數諸佛，即皆俱前為佛作禮，白佛辭行，供養八方、上下無央數佛，佛即然可之，即使行。諸菩薩皆大歡喜，數千億萬人無央數不可復計，皆當智慧勇猛，各自幡輩飛相追，俱共散飛，則到八方、上下無央數諸佛所。皆前為諸佛作禮，即便供養。意欲得萬種自然之物在前，即自然百種雜色華、百種雜繒綵、百種劫波育衣、七寶燈火、萬種伎樂，悉皆在前。其華香萬種，自然之物，亦非世間之物，亦非天上之物也。是萬種物，都八方、上下眾自然合會化生耳。意欲得者，即自然化生，意不用者，即化去。諸菩薩便共持，供養諸佛及諸菩薩、阿羅漢，邊傍前後迴遶周匝，在意所欲即輒皆至。當是之時，快樂不可言也！諸菩薩意，各欲得四十里華，即自然在前，便於虛空中，共持散諸佛及菩薩、阿羅漢上；皆在虛空中下向，華甚香好，小萎墮地，即自然亂風吹，萎華悉自然去。諸菩薩意，各復欲得八十里華，即自然在前，共持散諸佛及諸菩薩、阿羅漢上；華皆復在虛空中下向，小萎墮地，即自然亂風吹，萎華悉自然去。諸菩薩意，各復欲得百六十里華，即自然在前，便於虛空中，共持散諸佛及諸菩薩、阿羅漢上；華皆復於虛空中下向，小萎墮地，即自然亂風吹，萎華悉自然去。諸菩薩意，各復欲得三百二十里華，即自然在前，復於虛空中，持散諸佛及諸菩薩、阿羅漢上；華於虛空中下向，小萎墮地，即自然亂風吹，萎華悉自然去。諸菩薩意，各復欲得六百四十里華，即自然在前，復以散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風自然吹萎華去。諸菩薩意，各復欲得千二百八十里華，即自然在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風自然吹，萎華悉自然去。諸菩薩意，各復欲得二千五百六十里華，即自然在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各復欲得五千一百二十里華，即自然在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各復欲得萬二百四十里華，即皆自然在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各復欲得二萬四百八十里華，即皆在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各復欲得五萬里華，即皆在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各復欲得十萬里華，即皆在前，諸菩薩復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各復欲得二十萬里華，即皆在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各復欲得四十萬里華，即皆在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各復欲得八十萬里華，即皆在前，復於虛空中，共持散諸佛及諸菩薩、阿羅漢上；皆在虛空中下向，小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各欲得百六十萬里華，即皆在前，共持散諸佛及諸菩薩、阿羅漢上；小萎墮地，亂風吹萎華悉自然去。諸菩薩意，各欲得三百萬里華，即皆在前，共持散諸佛及諸菩薩、阿羅漢上；小萎墮地，亂風吹萎華自然去。諸菩薩意，各欲得六百萬里華，即皆在前，共持散諸佛及諸菩薩、阿羅漢上；華都自然合為一華，華正端圓周匝各適等，華轉倍前，華極自軟好，勝於前華數千百倍，色色異，香香不可言。諸菩薩皆大歡喜，俱於虛空中，大共作眾音自然伎樂，樂諸佛及諸菩薩、阿羅漢。當此之時，快樂不可言。
「諸菩薩皆悉却坐聽經，聽經竟即悉諷誦通，重知經道，益明智慧。即諸佛國中，從第一四天上，至三十三天上，諸天人皆共持天上萬種自然之物來下，供養諸菩薩、阿羅漢。天人皆復於虛空中，大共作眾音伎樂。諸天人前來者，轉去避後來者；後來者轉復供養如前，更相開避。諸天人歡喜聽經，大共作音樂，當是時快樂無極。諸菩薩供養聽經訖竟，便皆起為佛作禮而去，即復飛到八方、上下無央數諸佛所，供養聽經，皆各如前。悉遍已後，日未中時，各飛還其國，為阿彌陀佛作禮，皆却坐聽經竟大歡喜。」
佛言：「阿彌陀佛及諸菩薩、阿羅漢欲食時，即自然七寶机，劫波育罽疊以為座。佛及菩薩皆坐前悉有自然七寶，鉢中有百味飲食。飲食者亦不類世間，亦非天上；此百味飲食，八方、上下眾自然飲食中精味，甚香美無比，自然化生耳，欲得甜酢在所欲得。諸菩薩、阿羅漢中，有欲得金鉢者，有欲得銀鉢者，有欲得水精鉢者，有欲得珊瑚鉢者，有欲得虎珀鉢者，有欲得白玉鉢者，有欲得車𤦲鉢者，有欲得馬瑙鉢者，有欲得明月珠鉢者，有欲得摩尼珠鉢者，有欲得紫磨金鉢者，隨意即至；亦無所從來，亦無供養者，自然化生耳。諸菩薩、阿羅漢皆食，食亦不多亦不少，悉平等；亦不言美惡，亦不以美故喜。食訖諸飯具鉢机座，皆自然化去，欲食時乃復化生爾。諸菩薩、阿羅漢皆心淨潔，所飲食但用作氣力爾，皆自然消散摩盡化去。」
佛告阿難：「阿彌陀佛為諸菩薩、阿羅漢說經時，都悉大會講堂上。諸菩薩、阿羅漢，及諸天人民無央數，都不可復計，皆飛到阿彌陀佛所，為佛作禮，却坐聽經。其佛廣說道智大經，皆悉聞知，莫不歡喜踊躍心開解者。即四方自然亂風起，吹七寶樹，皆作五音聲。七寶樹華，覆蓋其國，皆在虛空中下向，其華之香遍一國中，皆散阿彌陀佛，及諸菩薩、阿羅漢上。華墮地皆厚四寸，小萎即亂風吹，萎華自然去。四方亂風，吹七寶樹華，如是四反。即第一四天王，第二忉利天上，至三十二天上，諸天人皆持天上萬種自然之物，百種雜色華、百種雜香、百種雜繒綵、百種劫波育疊衣、萬種伎樂轉倍好相勝，各持來下，為阿彌陀佛作禮，供養佛及諸菩薩、阿羅漢。諸天人皆復大作伎樂，樂阿彌陀佛及諸菩薩、阿羅漢。當是時，快樂不可言。諸天更相開避，後來者轉復供養如前。即東方無央數佛國，其數不可復計；如恒水邊流沙，一沙一佛其數如是。諸佛各遣諸菩薩無央數，不可復計，皆飛到阿彌陀佛所，作禮聽經，皆大歡喜，悉起為作禮如去。西方、北方、南方、四角諸佛，其數各如恒水邊流沙，各遣諸菩薩無央數，飛到阿彌陀佛所，作禮聽經亦復如是。即下方、上方諸佛，其數各如恒水邊流沙，皆遣諸菩薩，都不可復計，飛到阿彌陀佛所，作禮聽經。更相開避，如是終無休絕時也。」
佛言：「所以諸佛以恒水邊流沙為數者，八方、上下無央數佛，甚大眾多，都各不可復計，故以恒水邊流沙為數耳。」
佛語阿難：「阿彌陀佛為諸菩薩、阿羅漢說經竟，諸天人民中有未得道者，即得道。未得須陀洹者，即得須陀洹；未得斯陀含者，即得斯陀含；未得阿那含者，即得阿那含；未得阿羅漢者，即得阿羅漢；未得阿惟越致菩薩者，即得阿惟越致菩薩。阿彌陀佛輒隨其宿命時求道心所憙願，大小隨意，為說經授與之，即令疾開解得。皆悉明慧，各自好喜，所願經道，莫不喜樂。誦習之者，自諷誦通利，無厭無極。諸菩薩、阿羅漢中，有誦經者，其音如三百鐘聲。中有說經者，如疾風暴雨時，如是盡一劫竟，終無懈倦時。皆悉智慧勇猛，身體輕便，終無痛痒。極時行步坐起，悉皆才健勇猛，如師子中王，在深山中，有所趣向，時無有敢當者。無有疑難之意，在心所作，為不可豫計，百千億萬倍。是猛師子中王，百千億萬倍，尚復不如我第二弟子摩訶目揵連勇猛，百千億萬倍。如摩訶目揵連，於諸國菩薩、阿羅漢中，最為無比。飛行進止，智慧勇猛，洞視徹聽，知八方、上下、去來現在之事，百千億萬倍。共合為一智慧，當令在阿彌陀佛國中諸羅漢邊，其德尚復不及，百千億萬倍。」
阿逸菩薩，即起前長跪叉手，問佛言：「阿彌陀佛國中，諸阿羅漢，寧頗有般泥洹去者無？願欲聞之。」
佛言：「若欲知者，如是四天下星，若見之不？」
阿逸菩薩言：「唯然見之。」
佛言：「如我第二弟子，摩訶目揵連，飛上天上一晝一夜，遍數知星有幾枚。此四天下星甚眾多，不可得計尚復百千億萬倍是星也。如天下大海水減去一渧，寧能令海水為減，知少不耶？」
對曰：「減去百千億萬斗石，尚不能令減知少也。」
佛言：「阿彌陀佛國，諸阿羅漢中，雖有般泥洹去者，如大海減一渧水爾，不能令在諸阿羅漢為減知少也。」
佛言：「大海減去一溪水，寧令減少不？」
對曰：「減去百千億萬溪水，尚不能減知少也。」
佛言：「減大海一恒水，寧能令減知少不？」
對曰：「減去百千億萬恒水，不能令減知少也。」
佛言：「阿彌陀佛國，諸阿羅漢，般泥洹去者無央數，其在者新得道者亦無央數，都不為增減也。」
佛言：「令天下諸水，都流入大海水中，寧能令海水增多不？」
對曰：「不能令增多也。所以者何？是大海為天下諸水眾善中王，故能爾耳。」
佛言：「阿彌陀佛國亦如是，悉令八方、上下無央數佛國，諸無央數天人民、蜎飛蠕動之類都往生，甚大眾多不可復計。阿彌陀佛國，諸菩薩、阿羅漢、眾比丘僧，故如常一法不異為增多。所以者何？阿彌陀佛國為最快，八方、上下無央數諸佛國中眾善之王，諸佛國中之雄，諸佛國中之寶，諸佛國中壽之極長久也，諸佛國中之眾傑也，諸佛國中之廣大也，諸佛國中之都，自然之無為，最快明好甚樂之無極。所以者何？阿彌陀佛本為菩薩時，所願勇猛，精進不懈，累德所致，故能爾耳。」
阿逸菩薩即大歡喜，長跪叉手言：「佛說阿彌陀佛國土，快善明好最姝無比，乃獨爾乎？」
佛言：「阿彌陀佛國，諸菩薩、阿羅漢所居七寶舍宅中，有在虛空中者，有在地者；中有欲令舍宅最高者，舍宅即高；中有欲令舍宅最大者，舍宅即大；中有欲令舍宅在虛空中者，舍宅即在虛空中；皆自然隨意在所作為。中有殊不能令舍宅隨意者。所以者何？中有能令舍宅隨意者，皆是前世宿命求道時，慈心精進，益作諸善，德重所致；中有殊不能者，皆是前世宿命求道時，不慈心精進，益作諸善，德薄所致。其所衣被、飯食，俱自然平等。德有大小，別知其勇猛，令眾見之耳。」
佛言：「若見第六天王所居處不？」
「唯然見之。」
佛言：「阿彌陀佛國講堂舍宅，都復勝第六天王所居處，百千億萬倍。諸菩薩、阿羅漢，悉皆洞視徹聽，見知八方、上下、去來現在之事。復無數天上、天下人民，及蜎飛蠕動之類，心意所念善、惡，口所欲言，皆知；當何歲、何劫得度脫、得人道，往生阿彌陀佛國，知當作菩薩、阿羅漢，皆豫知之。諸菩薩、阿羅漢頂中，皆悉自有光明，所照有大、小。諸菩薩中，有最尊兩菩薩，常在佛左、右坐侍正論；佛常與是兩菩薩共對坐，議八方、上下、去來現在之事。若欲使是兩菩薩，到八方、上下無央數諸佛所，即便飛行；隨心所欲至到飛行，使疾如佛，勇猛無比。其一菩薩名蓋樓亘，其一菩薩名摩訶那鉢。光明智慧最第一，頂中光明各焰照他方千須彌山佛國中常大明。其諸菩薩頂中光明各照千億萬里，諸阿羅漢頂中光明，各照七丈。」
佛言：「世間人民，若善男子、善女人，若有急恐怖縣官事者，但自歸命是蓋樓亘菩薩、摩訶那鉢菩薩所，無不得解脫者。」
佛告阿逸菩薩：「阿彌陀佛頂中光明，極大光明。其日、月、星辰，皆在虛空中住止，不可復迴轉運行，亦無有精光，其明皆蔽不復見。佛光明照國中，及焰照他方佛國常大明，終無有冥時。其國無有一日、二日，亦無五日、十日，亦無十五日、一月，亦無五月、十月、五歲、十歲，亦無百歲、千歲，亦無萬歲、億萬歲，無百千億萬歲；無有一劫、十劫、百劫、千劫，無萬劫、百萬劫，無千萬劫、百億萬劫。阿彌陀佛光明，明無有極，却後無數劫無數劫，重復無數劫無數劫，無央數，終無有當冥時。國土及諸天，終無壞敗時。所以者何？阿彌陀佛壽命極長，國土甚好，故能爾耳！其佛尊壽，却後無數劫，重復無數劫，尚未央般泥洹也。於世間教授，意欲過度八方、上下諸無央數佛國，諸天人民及蜎飛蠕動之類，皆欲使往生其國，悉令得泥洹之道。其作菩薩者，皆欲令悉作佛。作佛已，轉復教授八方、上下諸天人民及蜎飛蠕動之類，皆復欲令作佛。作佛已，復教授諸無央數天人民、蜎飛蠕動之類，皆令得泥洹道去。諸可教授弟子者，展轉復相教授，轉相度脫，至令得須陀洹、斯陀含、阿那含、阿羅漢、辟支佛道，轉相度脫，皆得泥洹之道悉如是。尚未欲般泥洹，阿彌陀佛所度脫，展轉如是。復住止無數劫無數劫，不可復計劫，終無般泥洹時。八方、上下諸無央數天人民、蜎飛蠕動之類，其生阿彌陀佛國，當作佛者，不可復勝數。諸作阿羅漢，得泥洹道者，亦無央數，都不可復計。阿彌陀佛恩德，諸所布施，八方、上下無窮無極，甚深無量，快善不可言。其智慧教授所出經道，布告八方、上下諸無央數天上、天下，甚不原也。其經卷數甚眾多，不可復計，都無有極。」
佛告阿逸菩薩：「若欲知阿彌陀佛壽命無極時不？」
對曰：「願皆欲聞知之。」
佛言：「明聽！悉令八方、上下諸無央數佛國中，諸天人民、蜎飛蠕動之類，皆使得入道，悉令作辟支佛、阿羅漢，共坐禪一心，都合其智慧為一勇猛，共欲計知阿彌陀佛壽命，幾千億萬劫歲數，皆無有能計知者。復令他方面各千須彌山佛國中，諸天人民、蜎飛蠕動之類，皆復使得入道，悉令作辟支佛、阿羅漢，皆令坐禪一心，合其智慧為一勇猛，共欲數阿彌陀佛國中，諸菩薩、阿羅漢，知有幾千億萬人，皆無有能知數者。阿彌陀年壽甚長久，浩浩照照，明善甚深，無極無底，誰當能知信其者？獨佛自信知爾！」
阿逸菩薩聞佛言大歡喜，長跪叉手言：「佛說阿彌陀佛壽命甚長，威神尊大，智慧光明巍巍快善，乃獨如是。」
佛言：「阿彌陀佛至其然後般泥洹者，其蓋樓亘菩薩，便當作佛。總領道智，典主教授，世間及八方、上下所過度諸天人民、蜎飛蠕動之類，皆令得佛泥洹之道。其善福德，當復如大師阿彌陀佛，住止無央數劫無央數劫，不可復計劫，准法大師，爾乃般泥洹。其次摩訶那鉢菩薩，當復作佛。典主智慧，總領教授，所過度福德，當復如大師阿彌陀佛。止住無央數劫，尚復不般泥洹。展轉相承受，經道甚明，國土極善。其法如是，終無有斷絕，不可極也。」
阿難長跪叉手。問佛言：「阿彌陀佛國中，無有須彌山，其第一四天、第二忉利天，皆依因何等住止？願欲聞之。」
佛告阿難：「若有疑意於佛所耶？八方、上下，無窮無極，無邊無量，諸天下大海水，一人斗量之，尚可枯盡得其底泥；佛智不如是。」
佛言：「我所見知，諸已過去佛，如我名字釋迦文佛者，復如恒水邊流沙，一沙一佛。諸當來佛，如我名字，亦如恒水邊流沙。甫始欲求作佛者，如我名字，亦如恒水邊流沙。佛正坐直南向，視見南方。今現在佛，如我名字者，復如恒水邊流沙。八方、上下，去來現在諸佛，如我名字者，各如十恒水邊流沙，一沙一佛，其數如是；佛皆悉豫見知之。」
佛言：「往昔過去無數劫已來，一劫、十劫、百劫、千劫、萬劫、億劫、億萬億劫中有佛。諸已過去佛，一佛、十佛、百佛、千佛、萬佛、億佛、億萬億佛，各自有名字不同，無有如我名字者。甫始當來劫，一劫、十劫、百劫、千劫、萬劫、億劫、億萬億劫，劫中有佛。一佛、十佛、百佛、千佛、萬佛、億佛、億萬億佛，各各自有名字不同，時時乃有一佛如我名字耳。諸八方、上下無央數佛國，今現在佛，次他方異國，一佛國、十佛國、百佛國、千佛國、萬佛國、億佛國、億萬億佛國中有佛，各自有名字，多多復不同，無如我名字者。八方、上下無央數諸佛中，時時乃有如我名字爾！八方、上下，去來現在，其中間曠絕甚遠，悠悠迢迢，無窮無極，佛智亘然甚明，探古知今，前知無窮却覩未然，豫知無極，都不可復計。甚無央數佛，威神尊明，皆悉知之。佛智慧道德合明，都無能問佛經道窮極者，佛智慧終不可稱量盡也。」
阿難聞佛言，即大恐怖衣毛皆起，白佛言：「我不敢有疑意於佛所。所以問佛者，他方佛國，皆有須彌山，第一四天、第二忉利天，皆依因之住止。我恐佛般泥洹後，儻有諸天人民，若比丘僧、比丘尼、優婆塞、優婆夷來問我：『阿彌陀佛國，何以獨無有須彌山？其第一四天王、第二忉利天，皆依因何等住止？』我當應答之。今不問佛者，佛去後，當持何等語報答之？獨佛自知之爾，餘人無有能為我解者。以是故問佛耳！」
佛言：「阿難！是第三焰天、第四兜術天，上至第七梵天，皆依因何等住止乎？」
阿難言：「是諸天皆自然在虛空中住，在虛空中住止，無所依因。」
「佛威神甚重，自然所欲作為，意欲有所作，為不豫計。是諸天皆尚在虛空中住止。何況佛威神尊重，欲有所作為耶？」
阿難聞佛言，即大歡喜，長跪叉手言：「佛智慧知八方、上下，去來現在之事，無窮無極，無有邊幅，甚高大妙絕快善，極明好甚無比，威神尊重不可當。」
阿彌陀經卷上
佛說阿彌陀經卷下
吳月支國居士支謙譯
佛告阿逸菩薩：「其世間人民，若善男子、善女人，願欲往生阿彌陀佛國者，有三輩，作德有大小，轉不相及。」
佛言：「何等為三輩？最上第一輩者，當去家捨妻子斷愛欲，行作沙門，就無為之道，當作菩薩道，奉行六波羅蜜經者。作沙門不虧經戒，慈心精進，不當瞋怒，不當與女人交通。齋戒清淨，心無所貪慕，至誠願欲往生阿彌陀佛國，常念至心不斷絕者。其人便於今世求道時，即自然於其臥止夢中，見阿彌陀佛及諸菩薩、阿羅漢。其人壽命欲終時，阿彌陀佛即自與諸菩薩、阿羅漢，共翻飛行迎之，則往生阿彌陀佛國，便於七寶水池蓮華中化生。即自然受身長大，則作阿惟越致菩薩。便即與諸菩薩，共翻輩飛行，供養八方、上下諸無央數佛。即逮智慧勇猛，樂聽經道，其心歡樂。所居七寶舍宅，在虛空中，恣隨其意。在所欲作為，去阿彌陀佛近。」
佛言：「諸欲往生阿彌陀佛國者，當精進持經戒，奉行如是上法者，則得往生阿彌陀佛國，可得為眾所尊敬。是為上第一輩。」
佛言：「其中輩者，其人願欲往生阿彌陀佛國，雖不能去家捨妻子斷愛欲，行作沙門者。當持經戒無得虧失，益作分檀布施，常信受佛經語深，當作至誠中信；飯食諸沙門，作佛寺、起塔，散華、燒香、然燈，懸雜繒綵；如是法者，無所適莫。不當瞋怒，齋戒清淨，慈心精進，斷愛欲念。欲往生阿彌陀佛國，一日一夜不斷絕者。其人便於今世，亦復於臥止夢中，見阿彌陀佛。其人壽命欲終時，阿彌陀佛即化，令其人目自見阿彌陀佛及其國土。往至阿彌陀佛國者，可得智慧勇猛。」
佛言：「其人奉行施與如是者，若其人然後復中悔，心中狐疑，不信分檀布施作諸善後世得其福，不信有彌陀佛國，不信有往生其國。雖爾者，其人續念不絕，暫信暫不信，意志猶豫無所專據。續其善願為本，故得往生。其人壽命病欲終時，阿彌陀佛即自化作形像，令其人目自見之。口不能復言，但心中歡喜踊躍，意念言：『我悔不知益齋戒作善，今當往生阿彌陀佛國。』其人即心自悔過，悔過者小差少無所復及。其人壽命終盡，即往生阿彌陀佛國。不能得前至阿彌陀佛所，便道見阿彌陀佛國界邊自然七寶城中，心便大歡喜，便止其城中。即於七寶水池蓮華中化生，則受身自然長大。在城中於是間五百歲，其城廣縱各二千里。城中亦有七寶舍宅，中外內皆有七寶浴池。浴池中亦有自然華香繞，浴池上亦有七寶樹重行；亦皆復作五音聲。其欲飯食時，前有自然食，具百味飲食；在所欲得應意皆至。其人於城中亦快樂，其城中比如第二忉利天上自然之物。雖爾，其人城中不能得出，復不能得見阿彌陀佛，但見其光明，心自悔責，踊躍喜耳。亦復不能得聞經；亦復不能得見諸比丘僧；亦復不能得見知阿彌陀佛國中諸菩薩、阿羅漢狀貌何等類。其人愁苦如是比，如小適耳。佛亦不使爾身，行所作自然得之，皆心自趣向道，入其城中。其人本宿命求道時，心口各異，言念無誠信，狐疑佛經；復不信向之，當自然入惡道中；阿彌陀佛哀愍，威神引之去爾。其人於城中，五百歲乃得出。往至阿彌陀佛所聞經，心不開解；亦復不得在諸菩薩、阿羅漢、比丘僧中聽經。以去所居處舍宅在地，不能令舍宅隨意高大在虛空中。復去阿彌陀佛甚大遠，不能得近附阿彌陀佛。其人智慧不明，知經復少，心不歡喜，意不開解。其人久久，亦自當智慧開解知經，明健勇猛，心當歡喜，次當復如上第一輩。所以者何？其人但坐前世宿命求道時，不大持齋戒，毀失經法，意志狐疑，不信佛語，不信佛經深，不信分檀布施作，善後世當得其福；復坐中悔，不信往生阿彌陀佛國，作德不至心，用是故爾。是為第二中輩。」
佛言：「其三輩者，其人願欲往生阿彌陀佛國，若無所用分檀布施，亦不能燒香、散華、然燈，懸雜繒綵，作佛寺起塔，飯食諸沙門者。當斷愛欲無所貪慕，得經疾慈心精進，不當瞋怒，齋戒清淨，如是法者。當一心念欲往生阿彌陀佛國，晝夜十日不斷絕者。壽命終即往生阿彌陀佛國，可得尊敬，智慧勇猛。」
佛言：「其人作是以後，若復中悔，心意狐疑，不信作善後世當得其福；不信往生阿彌陀佛國。其人雖爾，續得往生。其人壽命病欲終時，阿彌陀佛，即令其人，於臥止夢中見阿彌陀佛土。心中大歡喜，意自念言：『我悔不知益作諸善，今當往生阿彌陀佛國。』其人但念是，口不能復言，即自悔過，悔過者差減少悔無所復及。其人命終，即生阿彌陀佛國。不能得前至，便道見二千里七寶城中，心獨歡喜，便止其中。亦復於七寶浴池蓮華中化生，即自然受身長大。其城亦復如前城法，比如第二忉利天上自然之物。其人亦復於城中，五百歲竟乃得出。至阿彌陀佛所，心中大喜。其人聽聞經，心不開解，意不歡樂，智慧不明，知經復少。所居舍宅在地，不能令舍宅隨意高大在虛空中。復去阿彌陀佛大遠，不能得近附阿彌陀佛，亦復如是第二中輩狐疑者也。其人久久，亦當智慧開解，知經勇猛，心當歡樂，次如上第一輩也。所以者何？皆坐前世宿命求道時，中悔狐疑，暫信暫不信，不信作善得其福德，皆自然得之爾。隨其功德有所鉉不鉉，各自然趣向，說經行道，卓億萬超絕不相及。」
佛言：「其欲求作菩薩道生阿彌陀佛國者，其人然後，皆當得阿惟越致菩薩。阿惟越致菩薩者，皆當有三十二相紫磨金色、八十種好，皆當作佛。隨所願在所求欲於他方佛國作佛，終不復更泥犁、禽獸、薜荔。隨其精進求道，早晚之事同等爾。求道不休會當得之，不失其所欲願也。」
佛告阿逸菩薩等：「諸天、帝王、人民，我皆語汝曹，諸欲往生阿彌陀佛國者，雖不能大精進、禪定、持經戒者，大要當作善：一者、不得殺生。二者、不得盜竊。三者、不得婬泆姦愛他人婦女。四者、不得調欺。五者、不得飲酒。六者、不得兩舌。七者、不得惡口。八者、不得妄言。九者、不得嫉妬。十者、不得貪餮，不得心中有所慳惜，不得瞋怒，不得愚癡，不得隨心嗜欲。不得心中悔，不得狐疑。當作孝順，當作至誠忠信，當信受佛經語深，當信作善後世得其福。奉持如是，其法不虧失者，在心所願，可得往生阿彌陀佛國。至要當齋戒一心清淨，晝夜常念欲往生阿彌陀佛國，十日十夜不斷絕，我皆慈哀之，悉令生阿彌陀佛國。」佛言：「世間人以欲慕及賢明，居家修善為道者，與妻子共居在恩好愛欲之中，憂念苦多家事怱務，不暇大齋一心清淨；雖不能得去家棄欲，有空閑時，自端心意，念身作善，專精行道十日十夜者；殊使不能爾，自思惟熟挍計欲度脫身者，下當絕念去憂，勿念家事，莫與婦人同床。自端正身心斷於愛欲，一心齋戒清淨，至意念生阿彌陀佛國，一日一夜不斷絕者，壽終皆往生其國，在七寶浴池蓮華中化生，可得智慧勇猛，所居七寶舍宅，自在意所欲作為。可次如上第一輩。」
佛語阿逸菩薩言：「諸八方、上下無央數諸天人民，比丘僧、比丘尼、優婆塞、優婆夷，往生阿彌陀佛國。眾等大會，皆共於七寶浴池水中。都共人人，悉自於一大蓮華上坐，皆悉自陳道德行善，人人各自說其前世宿命求道時持戒所作善法，所從來生本末，其所好憙經道，知經智慧，所施行功德，從上次下轉皆遍。以知經有明、不明，智有深、淺、大、小，德有優、劣、厚、薄，自然之道別知。才能智慧健猛，眾相觀照，禮義和順，皆自歡喜踊躍。智慧有勇猛，各不相屬逮。」
佛言：「其人殊不豫作德，為善輕戲，不信使然。徙倚懈怠，為用可爾。至時都集說經道，自然迫促，應答遲晚。道智卓殊超絕，才能高猛，獨於邊羸。臨事乃悔，悔者已出，其後當復何益；但心中悷悢，慕及等爾。」
佛言：「阿彌陀佛國諸菩薩、阿羅漢眾等，大聚會自然都集。拘心制意，端身正行，遊戲洞達。俱相隨飛行，翻輩出入，供養無極。歡心喜樂，共觀經行道，和好久習。才猛智慧，志若虛空，精進求願。心終不復中徊，意終不復轉，終無有懈極時。雖求道，外若遲緩，內獨急疾，容容虛空，適得其中。中表相應，自然嚴整。撿斂端直，身心清潔，無有愛欲，無所適貪，無有眾惡瑕穢。其志願皆各安定姝好，無增缺減。求道和正，不誤傾邪。准望道法，隨經約令，不敢違蹉跌。若於八方、上下，無有邊幅，自在所欲，至到無窮無極，咸然為道。恢廓及曠蕩，念道無他之念。無有憂思，自然無為，虛無空立，恢安無欲。作得善願，盡心求索，含哀慈愍，精進中表，禮義都合。通洞無違，和順副稱，褒羅表裏，過度解脫；能升入泥洹，長與道德合明。自然相保守，快意之滋真，滋真了潔白。志願無上，清淨之安定，靜樂之無有極，善好無有比。巍巍之燿照，燿照亘開達明徹，自然中自然相，然之有根本，自然成五光。五光至九色，九色參徊轉，數百千更變，欝單之自然，自然成七寶。橫攬成萬物，光精參明俱出，好甚姝無有極，其國土甚若此。何不力為善？念道之自然，著於無上、下，洞達無邊幅，捐志虛空中。何不各精進？努力自求索，可得超絕去。往生阿彌陀佛國，橫截於五惡道。自然閉塞，升道之無極，易往無有人。其國土不逆違，自然之隨牽。何不棄世事？行求道德，可得極長生，壽無有極。何為著世事？譊譊共憂思無常。
「世人薄俗，共諍不急之事，共於是處劇惡極苦之中，勤身治生，用相給活，無尊、無卑，無富、無貧，無老、無少，無男、無女，皆當共憂錢財，有無同然。憂思適等，屏營愁苦，累念思慮，為心使走，無有安時。有田憂田，有宅憂宅，有牛憂牛，有馬憂馬，有六畜憂六畜，有奴婢憂奴婢，有衣、被、錢財、金、銀、寶物，復共憂之。重思累息，憂念愁恐，橫為非常——水、火、盜、賊，怨主、債家——所漂、燒繫、唐突、沒溺，憂毒忪忪無有解時。結憤胸中稸氣恚怒，病在胸腹憂苦不離，心堅意固適無縱捨，或坐摧藏終身亡命，棄捐之去莫誰隨者。尊卑、豪貴、貧富，有是憂懼，勤苦此，結眾寒熱與痛共居。小家貧者窮困苦乏，無田亦憂欲有田，無宅亦憂欲有宅，無牛亦憂欲有牛，無馬亦憂欲有馬，無六畜亦憂欲有六畜，無奴婢亦憂欲有奴婢，無衣、被、錢財、什物、飲食之屬，亦憂欲有之。適有一復少一，有是少是，思有齊等。適小具有便復賜盡，如是苦生，當復求索。思想無益不能時得，身心俱勞坐起不安，憂意相隨勤苦如此。焦心不離恚恨獨怒，亦結眾寒熱與痛同居，或時坐之終身夭命，亦不肯作善為道。壽命終盡死，皆當獨遠去，有所趣向，善惡之道莫能知之。或時世人，父子、兄弟、夫婦、家室、中外親屬，居天地之間，當相敬愛，不當相憎。有無當相給與，不當有貪惜。言色當和，莫相違戾。或儻心諍有所恚怒，今世恨意微相嫉憎，後世轉劇致成大怨。所以者何？如今之事更欲相害，雖不臨時應急相破。然之愁毒結憤精神，自然剋識不得相離，皆當對相生值，更相報復。人在世間愛欲之中，獨往、獨來、獨死、獨生，當行至苦樂之處，身自當之，無有代者。善惡變化，殃咎惡處，宿豫嚴待，當獨升入遠到他處，莫能見去在何所。善惡自然追逐行生，窈窈冥冥別離久長，道路不同會見無期，甚難得復相值。何不棄家事？各曼強健時，努力為善，力精進求度世，可得極長壽。殊不肯求於道，復欲須待欲何樂乎？
「如是世人，不信作善得善，不信為道得道，不信死後世復生，不信施與得其福德，都不信之爾。以謂不然，終無有是，但坐是故，且自見之，更相代聞，前後相續，轉相承受，父餘教令。先人祖父，素不作善，本不為道，身愚神闇，心塞意閉，不見大道，殊無有能見人死生有所趣向，亦莫能知者；適無有見善惡之道，復無語者，為用作善惡福德？殃咎禍罰，各自競作，為之用殊，無有怪也。至於死生之道，轉相續立，或子哭父，或父哭子，或弟哭兄，或兄哭弟，或婦哭夫，或夫哭婦，顛倒上下無常根本，皆當過去，不可常得。教語開導，信道者少，皆當死生，無有休止。如是曹人，矇冥抵突，不信經語，各欲快意。心不計慮，愚癡於愛欲，不解於道德，迷惑於瞋怒，貪狼於財色，坐之不得道，當更勤苦，極在惡處生，終不得止休息，痛之甚可傷。或時家室中外，父子、兄弟、夫婦，至於死生之義，更相哭泣轉相思慕，憂念憤結恩愛繞續，心意著痛對相顧戀，晝夜縛礙無有解時。教視道德心不開明，思想恩好情欲不離，閉塞矇瞑交錯覆蔽，不能思計。心自端正決斷世事，專精行道便旋至竟，壽終命盡不能得道，無可那何。總猥憒譊皆貪愛欲，如是之法，不解道者多，得道者少。世間怱怱，無可聊賴，尊卑、上下，豪貴、貧富，男女、大小，各自怱務，勤苦躬身懷殺毒，惡氣窈冥，莫不惆悵。為妄作事，惡逆天地，不從人心。道德非惡，先隨與之，恣聽所為，其壽未至，便頓奪之。下入惡道，累世勤苦，展轉愁毒，數千萬億歲，無有止期。痛不可言，甚可憐愍。」
佛告阿逸菩薩等：「諸天、帝王、人民，我皆語汝，造世間之事，人用是故坐不得道，汝曹熟思惟之！惡者當縱捨遠離之去，從其善者。當堅持勿妄為非，益作諸善，大小、多少愛欲之榮，皆不可常得，由當別離無可樂者。曼佛世時，其有信受佛經語深，奉行道德，皆是我小弟也。其欲有甫學佛經戒者，皆是我弟子。其有欲出身去家捨妻子，絕去財色，欲作沙門、為佛作比丘者，皆是我子孫。我世甚難得值，其有願欲生阿彌陀佛國者，可得智慧勇猛，為眾所尊敬，勿得隨心所欲，虧負經戒，在於人後；儻有疑意不解經者，復前問佛，為汝解之。」
阿逸菩薩長跪叉手言：「佛威神尊重，所說經快善。我曹聽經語，皆心貫之。世人實爾，如佛所語無有異。今佛慈哀我曹，開示大道教語生路，耳目聰明長得度脫，今若得更生。我曹聽佛經語，莫不慈心歡喜踊躍開解者。及諸天、帝王、人民，蜎飛蠕動之類皆蒙恩，無不解脫憂苦者。佛語教戒甚深善，無極無底。佛智慧所見知，八方、上下，去來現在之事，無上、無下，無邊、無幅，佛甚難得聞。我曹比慈心於佛所，令我曹得度脫者，皆是佛前世求道時，勤苦學問，精明所致。恩德普覆，所施行福德，相祿巍巍，光明徹照，洞虛無極。貫入泥洹，教授攬典，制威消化。改動八方、上下，無窮無極，佛為師法尊絕群聖，都無能及佛者。佛為八方、上下諸天、帝王、人民作師，隨其心所欲願，大小皆令得道。今我曹得與佛相見，得聞阿彌陀佛聲，我曹甚喜，莫不得黠慧開明者。」
佛告阿逸菩薩：「若言是，實當爾。若有慈心於佛所者大喜，實當念佛；天下久久，乃復有佛耳。今我於苦世作佛，所出經道，教授洞達，截斷狐疑。端心正行，拔諸愛欲，絕眾惡根本。遊步無拘，典總智慧。眾道表裏，攬持維綱。照然分明，開視五道，決正生死泥洹之道。」
佛言：「若曹從無數劫以來不可復計劫，若曹作菩薩道，欲過度諸天、人民及蜎飛蠕動之類，已來甚久遠。人從若得道度者無央數，至得泥洹之道者亦無央數。若曹及八方、上下，諸天、帝王、人民，若比丘、比丘尼，優婆塞、優婆夷，若曹宿命，從無數劫[＊]已來，展轉是五道中，死生呼嗟，更相哭淚，轉相貪慕，憂思愁毒，痛苦不可言。至今世死生不絕，乃今日與佛相見共會值，是乃聞阿彌陀佛聲甚快善，我助汝曹喜。亦可自厭死生痛痒，生時甚痛、甚苦、甚極，至年長大亦苦、亦極，死時亦痛、亦苦、亦極，甚惡臭處不淨，潔了無有可者。佛故悉語若曹，若曹亦可自決斷臭處惡露。若曹亦可端心正身，益作諸善。於是常端中外，潔淨身體，洗除心垢。自相約撿，表裏相應，言行忠信。人能自度脫，轉相扶接，拔諸愛欲，精明至心，求願不轉，結其善道根本，雖精苦一世，須臾間耳。今世為善，後世生阿彌陀佛國，快樂甚無極，長與道德合明。然善相保守，長去離惡道痛痒之憂惱，拔勤苦諸惡根本，斷諸愛欲恩好。長生阿彌陀佛國，亦無有諸痛痒，亦無復有諸惡臭處，亦無復有勤苦，亦無淫泆、瞋怒、愚癡，亦無有憂思愁毒。生於阿彌陀佛國，欲壽一劫、十劫、百劫、千劫、萬億劫，自恣意欲住止壽無央數劫不可復計數劫，恣汝隨意皆可得之。欲食、不食，恣若其意，都悉自然，皆可得之。次於泥洹之道，皆各自精明求索。心所欲願，勿得狐疑心中悔，欲往生者，無得坐其過失，在阿彌陀佛國界邊，自然七寶城中，讁五百歲。」
阿逸菩薩言：「受佛嚴明重教，皆當精進一心求索，請奉行之，不敢疑怠。」
佛告阿逸菩薩等：「若曹於是世，能自制心正意，身不作惡者，是為大德善。都有一輩，為八方、上下最無有比。所以者何？八方、上下無央數佛國中，諸天人民，皆自然作善，不大為惡，易教化。今我於是世間作佛，為於五惡、五痛、五燒之中作佛，為最劇，教語人民，令縱捨五惡，令去五痛，令去五燒之中，降化其心，令持五善，得其福德度世長壽泥洹之道。」
佛言：「何等為五惡？何等為五痛？何等為五燒中者？何等為消化五惡，令得五善者？何等為持五善，得其福德長壽度世泥洹之道？」
佛言：「其一惡者：天人民下至禽獸、蜎飛蠕動之屬，欲為眾惡，強者服弱轉相剋賊，自相殺傷更相食噉。不知作善，惡逆不道，受其殃罰，道之自然，當往趣向神明記識，犯之不貰轉相承續；故有貧窮、下賤、乞匃、孤獨，故有聾盲、瘖瘂、愚癡、憋惡，下有尫狂不及逮之屬。故有尊卑、豪貴、高才、明達、智慧勇猛，皆其前世宿命為善慈孝布施恩德。故有官事王法牢獄，不肯畏慎作惡入法，受其過讁重罰致劇，求望解脫難得度出。今世有是目前現在，壽終有處入其窈冥受身更生，比若王法劇苦極刑。故有自然泥犁、禽獸、薜荔、蜎飛蠕動之類，轉貿身形改惡易道，壽命短長魂神精識，自然入趣受形寄胎。當獨值向相從共生，轉相報償當相還復。殃惡禍罰，眾事未盡，終不得離。展轉其中，世世累劫無有出期，難得解脫痛不可言。天地之間自然有是，雖不臨時卒暴應時，但取自然之道，皆當善惡歸之。是為一大惡，為一痛，為一燒。勤苦如是，愁毒呼嗟，比若劇火起燒人身。人能自於其中，一心制意端身正行，獨作諸善不為眾惡者，身獨度脫得其福德，可得長壽度世上天泥洹之道，是為一大善。」
佛言：「其二惡者：世間帝王、長吏、人民，父子、兄弟、家室、夫婦略無義理，不從正令奢婬憍慢，各欲快意恣心自在，更相欺調殊不懼死。心口各異，言念無實，佞諂不忠諛媚巧辭，行不端緒更相嫉憎，轉相讒惡陷人冤枉；主上不明心不察照任用臣下，臣下存在踐度能行，知其形施在位不正，為其所調妄損忠良賢善，不當天心甚違道理。臣欺其君，子欺其父，弟欺其兄，婦欺其夫，家室中外知識相訟，各懷貪淫，心毒瞋怒，矇聾愚癡欲益。無有尊卑、上下，無男、無女、無大、無小，心俱同然欲自厚己。破家亡身不顧念前後，家室親屬坐之破族。或時家中內外知識朋友，鄉黨市里愚民野人，轉更從事共相利害。諍財鬪訟怒忿成仇轉諍勝負，慳富焦心不肯施與。祝祝守愛保貪惜，坐之思念心勞身苦。如是至竟無所恃怙，獨來獨去無一隨者。善惡福德殃禍讁罰，追命所生、或在樂處、或入毒苦，然後乃悔當復何及。或時世人愚心少智，見善誹謗恚之不肯慕及，但欲為妄作不道，但欲盜竊常懷毒心，欲得他人財物用自供給，消散靡盡賜復求索。邪心不正常獨恐怖畏人有色，臨時不計事至乃悔。今世現在長吏牢獄，自然趣向受其殃咎。世間貧窮、乞匃、孤獨，但坐前世宿命，不信道德，不肯為善，今世為惡天神別籍，壽終入惡道。故有自然泥犁、禽獸、薜荔、蜎飛蠕動之屬，展轉其中，世世累劫無有出期，難得解脫痛不可言。是為二大惡，為二痛，為二燒。勤苦如是，比若火起劇於燒人身。人能自於其中，一心制意端身正行，獨作諸善，不為眾惡者，身獨度脫得其福德，可得長壽度世上天泥洹之道，是為二大善。」
佛言：「其三惡者：諸世間人民寄生相因，共依居天地之間，處年壽命無能幾歲。至有豪貴長者賢明善人，下有貧賤尫羸愚者，中有不良之人，但懷念毒惡身心不正，常念淫泆煩滿胸中，愛欲交錯坐起不安；貪意慳惜欲橫唐得，眄睞細色惡態婬泆。有婦厭憎私妄出入，持家所有相給為非。聚會飲食專共作惡，興兵作賊攻城格鬪，劫殺截斷強奪不道。取人財物偷竊趣得，不肯治生，所當求者不肯為之。惡心在外不能專作，欲繫成事恐勢迫脅，持歸給家共相生活。恣心快意極行作樂，行亂他人婦女。或於其親屬不避尊卑長老，眾共憎惡，家室中外患而恚之。亦復不畏縣官法令，無所避錄。如是之惡自然牢獄，日月照識神明記取諸神攝錄，故有自然泥犁、禽獸、薜荔、蜎飛蠕動之屬，展轉其中，世世累劫無有出期，難得解脫痛不可言。是為三大惡，為三痛，為三燒。勤苦如是，比若火起燒人身。人能自於其中，一心制意端身正行，獨作諸善不為眾惡者，身獨度脫得其福德，可得長壽度世上天泥洹之道，是為三大善。」
佛言：「其四惡者：諸人不能作善，自相壞敗，轉相教令共作眾惡。主為傳言但欲兩舌、惡口、罵詈、妄語，相嫉更相鬪亂，憎嫉善人敗壞賢善，於旁快之。復不孝順供養父母，輕易師友知識，無信難得誠實。自大尊貴有道，橫行威武加權力勢，侵剋易人不能自知。為惡不自羞慚，自用頑健，欲令人承事畏敬之。復不畏敬天、地、神明、日、月，亦不可教令作善，不可降化，自用偃蹇常當爾。亦復無憂哀心，不知恐懼之意。憍慢如是，天神記之。賴其前世宿命頗作福德，小善扶接營護助之。今世作惡盡[＊]儩，諸善日去，見惡追之。身獨空立無所復依，受重殃讁，壽命終身眾惡繞歸，自然迫促當往追逐不得止息，自然眾惡共趣頓乏。有其名籍在神明所，殃咎引牽當值相得，自然趣向受過讁罰，身心摧碎神形苦極不得離却，但得前行入其火鑊。當是之時悔復何益，當復何及。天道自然不得蹉跌，故有自然泥犁、禽獸、薜荔、蜎飛蠕動之屬，展轉其中，世世累劫無有出期，難得解脫痛不可言。是為四大惡，為四痛，為四燒。勤苦如是，比若火起燒人身。人能自於其中，一心制意端身正行，獨作諸善不為眾惡者，身獨度脫得其福德，可得長壽度世上天泥洹之道。是為四大善。」
佛言：「其五惡者：世人徙倚懈惰，不肯作善不念治生，妻子飢寒父母俱然，欲呵教其子，其子惡心，瞋目應怒言令不從，違戾反逆劇於野人，比若怨家不如無子。妄遍假貸眾共患厭，尤無復有報償之心。窮貧困乏不能復得，辜較諧聲放縱遊散，串數唐得自用賑給不畏防禁，飲食無極喫酒嗜美，出入無有期度魯扈抵突，不知人情壯吁強制。見人有喜憎妬恚之，無義無禮自用識當不可諫曉。亦復不憂念父母妻子有無，又復不念卒報父母之德，亦復不念師之恩好。心常念惡，口常言惡，身常行惡。日不成就，不信道德，不信有賢明先聖，不信作善為道可得度世，不信世間有佛。欲殺羅漢，鬪比丘僧，常欲殺人，欲殺父、母、兄、弟、妻子、宗親、朋友。父母、兄弟、妻子、宗親、朋友，憎惡見之欲使之死。不信佛經語，不信人壽命終盡死後世復生。不信作善得善，不信作惡得惡。如是曹人男子、女人，心意俱然違戾反逆，愚癡蒙籠瞋怒嗜欲無所識知，自用快善大為智慧。亦不知所從來、生死所趣向，不肯慈孝惡逆天地，於其中間望求僥倖，欲得長生射呼不死，會當歸就生死勤苦善惡之道，身所作惡殃咎眾趣不得度脫。亦不可降化令作善，慈心教語開導死苦，善惡所趣向有是，復不信之。然苦心與語，欲令度脫，無益其人。心中閉塞意不開解，大命將至至時皆悔，其後乃悔當復何及。不豫計作善，臨窮何益。天地之間五道各明，恢曠窈窕浩浩汗汗，轉相承受善惡毒痛，身自當之無有代者。道之自然隨其所行，追命所生不得縱捨，善人行善慈孝，從樂入樂，從明入明。惡人行惡，從苦從冥。誰能知者？獨佛見知耳。教語人民，信用者少，死生不休，惡道不絕。如是世人不可悉道說，故有自然泥犁、禽獸、薜荔、蜎飛蠕動之屬，展轉其中，世世累劫無有出期，難得解脫痛不可言。是為五大惡，五痛、五燒。為勤苦如是，比若火起燒人身。人能自於其中，一心制意端身正行，言行相副所作至誠，所語如語心口不轉，獨作諸善不為眾惡者，身獨度脫得其福德，可得長壽度世上天泥洹之道。是為五大善。」
佛告阿逸菩薩等：「我皆語若曹，是世五惡勤苦如是，令起五痛，令起五燒，展轉相生。世間人民不肯為善欲作眾惡，敢欲犯此諸惡事者，皆悉自然當具更歷入惡道中。或其今世先被病殃，死生不得，示眾見之，壽終趣入至極大苦愁憂酷毒，自相焦然轉相燒滅，至其然後共作怨家更相傷殺，從小微起至大困劇，皆從貪婬財色，不肯忍辱施與，各欲自快，無復曲直欲得健名。為癡欲所迫，隨心思想不能復得，結憤胸中。財色縛束無有解脫不知厭足，厚己諍欲無所省錄。富貴榮華當時忍辱不知施善，威勢無幾隨惡名焦。身坐勞苦久後大劇，自然隨逐無有解已。王法施張，自然糺舉上下相應，羅網綱紀，㷀㷀忪忪，當入其中，古今有是痛哉可傷。都無義理，不知正道。」
佛語阿逸菩薩等：「若世有是佛，皆慈愍哀之，威神摧動，眾惡諸事皆消化之，令得去惡就善棄捐所思。奉持經戒莫不承受，施行經法不敢違失。度世無為泥洹之道，快善極樂。」
佛言：「若曹諸天、帝王、人民及後世人，得佛經語熟思惟之。能自於其中端心正行，其主上為善率化撿御其下，教眾轉相勅令，轉共為善轉相度脫。各自端守慈仁愍哀，終身不怠，尊聖敬孝通洞博愛，佛語教令無敢虧負。當憂度世泥洹之道，當憂斷截死生痛痒拔惡根本，當憂斷絕泥犁、禽獸、薜荔、蜎飛蠕動惡苦之道。當曼佛世，堅持經道無敢違失。」
佛言：「若曹當信者，云何第一急？當自端身，當自端心，當自端目，當自端耳，當自端鼻，當自端口，當自端手，當自端足，能自撿斂莫妄動作，身心淨潔，俱善相應，中外約束，勿隨嗜欲。不犯諸惡，言色當和，身行當專。行步坐起，所作當安。作事所為，當先熟思慮計之。揆度才能，視瞻圓規，安定徐作為之。作事倉卒，不豫計熟，為之不諦，亡其功夫，敗悔在後，唐苦亡身。至誠忠信，得道絕去。」
佛言：「若曹於是益作諸善，布恩施德，能不犯道禁忌，忍辱精進一心智慧，展轉復相教化作善為德。如是經法，慈心專一，齋戒清淨一日一夜者，勝於在阿彌陀佛國作善百歲。所以者何？阿彌陀佛國皆積德眾善，無為自然在所求索，無有諸惡大如毛髮。」
佛言：「於是作善十日十夜者，其德勝於他方佛國中人民作善千歲。所以者何？他方佛國皆悉作善，作善者多、為惡者少，皆有自然之物，不行求作便自得之。是間為惡者多、作善者少，不行求作，不能令得。世人能自端制作善至心求道，故能爾耳！是間無有自然，不能自給，當行求索，勤苦治生，轉相欺殆，調詐好惡，得其財物，歸給妻子，飲食毒勞心身苦。如是至竟，心意不專，𢛌恫不安。人能自安靜，為善精進德，故能爾耳！」
佛言：「我皆哀若曹及諸天、帝王、人民，皆教令作諸善，不為眾惡，隨其所能輒授與道。教戒開導悉奉行之，即君率化為善，教令臣下，父教其子，兄教其弟，夫教其婦，家室內外親屬朋友轉相教語，作善為道奉經持戒，各自端守上下相撿，無尊、無卑、無男、無女，齋戒清淨莫不歡喜，和順義理，歡樂慈孝，自相約撿。其有得佛經語，悉持思之，不當所作而犯為之，即自悔過去惡就善，棄邪為正朝聞夕改，奉持經戒劇愚得寶。佛所行處所在郡國，輒授與經戒，諸天日月星辰諸神，國王、旁臣、長吏、人民，諸龍、鬼神，泥犁、禽獸、薜荔、蜎飛蠕動之屬，莫不慈心開解者，皆悉敬事，從佛稽受經道，承奉行之。即君改化為善，齋戒精思淨自湔洗，端心正行居位嚴慄，教勅率眾為善，奉行道禁，令言令正。臣孝其君，忠直受令不敢違負。父子言令孝順承受，兄弟夫婦宗親朋友，上下相令順言和理。尊卑大小轉相敬事，以禮如義不相違負。莫不改往修來，洗心易行端正中表，自然作善所願輒得。咸善降化自然之道。求欲不死，即可得長壽；求欲度世，即可得泥洹之道。」
佛言：「佛威神尊德重，消惡化善莫不度脫。今我出於天下，在是惡中，於苦世作佛，慈愍哀傷教語開導。諸天、帝王、旁臣、左右、長吏、人民，隨其心所願樂，皆令得道。佛諸所行處、所經過歷郡國縣邑丘聚市里，莫不豐熟，天下太平，日月運照，倍益明好，風雨時節，人民安寧。強不臨弱，各得其所，無惡歲疾疫，無病瘦者。兵革不起，國無盜賊，無有冤抂，無有拘閉者。君臣人民莫不喜踊，忠慈至誠各自端守皆自守國，雍和孝順莫不歡喜。有無相與布恩施德，心歡樂與皆敬愛推讓義謙遜。前後以禮敬事，如父如子，如兄如弟，莫不仁賢。和順禮節都無違諍，快善無極。」
佛言：「我哀若曹子欲度脫之，劇父母念子，今八方、上下諸天、帝王、人民，及蜎飛蠕動之類，得佛經戒奉行佛道，皆得明慧心悉開解，莫不得過度解脫憂苦者。今我作佛，在於五惡、五痛、五燒之中，降化五惡，消盡五痛，絕滅五燒。以善攻惡拔去毒苦，令得五道，令得五善明好，燒惡不起。我般泥洹去後，經道稍斷絕，人民諛諂，稍復為眾惡，不復作善，五燒復起，五痛劇苦，復如前法，自然還復，久後轉劇不可悉說。我但為若曹小道之耳。」
佛告阿逸菩薩等：「若曹各思持之，展轉相教戒，如佛經法無敢違犯。」
阿逸菩薩長跪叉手言：「佛道記甚苦痛。世人為惡，甚劇如是。佛皆慈哀悉度脫之，皆言受佛重教，請展轉相教，不敢違犯。」
佛告阿難：「我哀若曹，令悉見阿彌陀佛，及諸菩薩、阿羅漢所居國土。若欲見之不？」
阿難即大歡喜，長跪叉手言：「願皆欲見之。」
佛言：「若起，更被袈裟西向拜，當日所沒處，為阿彌陀佛作禮，以頭腦著地言：『南無阿彌陀三耶三佛檀。』」
阿難言：「諾！受教。」即起，更被袈裟西向拜，當日所沒處，為彌陀佛作禮，以頭腦著地言：「南無阿彌陀三耶三佛檀。」
阿難未起，阿彌陀佛便大放光明威神，則遍八方、上下諸無央數佛國。諸無央數諸天地，即皆為大震動。諸無央數天地，須彌山羅寶，摩訶須彌大山羅寶，諸天地、大界、小界，其中諸大泥犁、小泥犁，諸山林溪谷幽冥之處，即皆大明，悉大開闢。即時阿難，諸菩薩、阿羅漢等，諸天、帝王、人民，悉皆見阿彌陀佛及諸菩薩、阿羅漢國土七寶已，心大歡喜踊躍，悉起，為阿彌陀佛作禮，以頭腦著地，皆言：「南無阿彌陀三耶三佛檀。」
阿彌陀佛國放光明威神以，諸無央數天人民，及蜎飛蠕動之類，皆悉見阿彌陀佛光明，莫不慈心歡喜者。諸有泥犁、禽獸、薜荔，諸有考治勤苦之處，即皆休止不復治，莫不解脫憂苦者。諸有盲者即皆得視，諸有聾者即皆得聽，諸有喑者即皆能語，諸有僂者即得申，諸跛癖蹇者即皆走行，諸有病者即皆愈起，諸尫者即皆強健，諸愚癡者即更黠慧，諸有婬者皆是梵行，諸瞋怒者悉皆慈心作善，諸有被毒者毒皆不行。鍾磬、琴瑟、箜篌、樂器諸伎，不鼓皆自作五音聲。婦女珠環皆自作聲，百鳥畜狩皆自悲鳴。當是時，莫不歡喜善樂得過度者。即爾時諸佛國中諸天人民，莫不持天上華香來下，於虛空中悉皆供養，散諸佛及阿彌陀佛上。諸天各共大作萬種自然伎樂，樂諸佛及諸菩薩、阿羅漢。當是之時，其快樂不可言。
佛告阿難、阿逸菩薩等：「我說阿彌陀佛及諸菩薩、阿羅漢國土自然七寶，儻無有異乎？」
阿難長跪叉手言：「佛說阿彌陀佛國土快善，如佛所言無有一異。」
佛言：「我說阿彌陀佛功德國土快善，晝夜盡一劫，尚復未竟。我但為若曹小說之爾。」
阿逸菩薩即長跪叉手問佛言：「今佛國土，從是間當有幾何阿惟越致菩薩，往生阿彌陀佛國？願欲聞之。」
佛言：「汝欲知者，明聽著心中。」
阿逸菩薩言：「受教。」
佛言：「從我國當有七百二十億阿惟越致菩薩，皆當往生阿彌陀佛國。一阿惟越致菩薩者，前後供養無央數諸佛。以次如彌勒皆當作佛，及其餘諸小菩薩輩者無央數，不可復計，皆當往生阿彌陀佛國。」
佛告阿逸菩薩：「不但我國中諸菩薩當往生阿彌陀佛國，他方異國復有佛，亦復如是。第一佛名頭樓和斯，其國有百八十億菩薩，皆當往生阿彌陀佛國。他方異國，第二佛，名羅隣那阿竭，其國有九十億菩薩，皆當往生阿彌陀佛國。他方異國，第三佛，名朱蹄彼會，其國有二百二十億菩薩，皆當往生阿彌陀佛國。他方異國，第四佛，名阿蜜蔡羅薩，其國有二百五十億菩薩，皆當往生阿彌陀佛國。他方異國，第五佛，名樓波黎波蔡𮜨，其國有六百億菩薩，皆當往生阿彌陀佛國。他方異國，第六佛，名那惟于蔡，其國有萬四千菩薩，皆當往生阿彌陀佛國。他方異國，第七佛，名維黎波羅潘蔡𮜨，其國有十五菩薩，皆當往生阿彌陀佛國。他方異國，第八佛，名和阿蔡，其國有八菩薩，皆當往生阿彌陀佛國。他方異國，第九佛，名尸利群蔡，其國有八百一十億菩薩，皆當往生阿彌陀佛國。他方異國，第十佛，名那他蔡，其國有萬億菩薩，皆當往生阿彌陀佛國。他方異國，第十一佛，名和羅那惟于蔡𮜨，其國有萬二千菩薩，皆當往生阿彌陀佛國。他方異國，第十二佛，名沸覇圖耶蔡，其國有諸菩薩，無央數不可復計，皆阿惟越致，皆智慧勇猛，各供養無央數諸佛，以一時俱心願欲往，皆當生阿彌陀佛國。他方異國，第十三佛，名隨呵閱祇波多蔡，其國有七百九十億菩薩，皆當往生阿彌陀佛國。」
佛言：「是諸菩薩皆阿惟越致。諸比丘僧中及小菩薩輩無央數，皆當往生阿彌陀佛國。不獨是十四佛國中諸菩薩當往生也，都八方、上下無央數佛國諸菩薩輩，各各是皆當往生阿彌陀佛國。甚無央數，都共往會阿彌陀佛國，大眾多不可計。我但說八方、上下無央數諸佛名字，晝夜一劫尚未竟。我但復說諸佛國，諸比丘僧、眾菩薩，當往生阿彌陀佛國人數，說之一劫不休止尚未竟。我但為若曹總攬，都小說之爾。」
佛語阿難、阿逸菩薩等：「其世間帝王人民，善男子、善女人，前世宿命作善所致相祿巍巍，乃當聞阿彌陀佛聲者，甚快善哉，代之喜。」
佛言：「其有善男子、善女人，聞阿彌陀佛聲，慈心歡喜，一時踊躍，心意淨潔衣毛為起，淚即出者，皆前世宿命作佛道。若他方佛故，菩薩非凡人，其有人民男子、女人，聞彌陀佛聲，不信有者，不信經佛語，不信有比丘僧，心中狐疑都無所信者，皆故從惡道中來生，愚癡不解宿命，殃惡未盡，尚未當度脫故，心中狐疑不信向爾。」
佛言：「我語若曹，若曹所當作善法，皆當奉行信之，無得疑。我般泥洹去後，汝曹及後世人，無得復言：『我不信有阿彌陀佛國。』我故令若曹悉見阿彌陀佛國土，所當為者各求之。我具為若曹道說經戒慎法，若曹當如佛法持之，無得毀失。我持是經以累若曹，若曹當堅持之，無得為妄增減是經法。我般泥洹去後，經道留止千歲。千歲後經道斷絕，我皆慈哀持留是經法，止住百歲，百歲中竟，乃休止斷絕。在心所願，皆可得道。」
佛言：「師開導人耳目，智慧明達度脫人，令得善合泥洹之道。常當孝慈於佛、父母，常當念師恩，常念不絕即得道疾。」
佛言：「天下有佛者甚難值，若有沙門、若師為人說經者甚難值。」
佛說是經時，即萬二千億諸天人民，皆得天眼徹視，悉一心皆為菩薩道。即二百億諸天人民，皆得阿那含道。即八百沙門，皆得阿羅漢道。即四十億菩薩，皆得阿惟越致。
佛說經已，諸菩薩、阿羅漢，諸天、帝王、人民，皆大歡喜，起為佛作禮遶三匝，前以頭面著佛足而去。
阿彌陀經卷下
^:<name=timestamp preload=true>vid	videohost	bookid	performer	timestamp=numbers
5C4INS3hK407OXGM0CArAwBkLfOEyEW6UDCjB_dfSrCQDnLGZhs6hH0P5HI-Yw7AaoRquHJ4jzXKsSt8uh97EEFcXpROd_PKBb0YWNJUqf7YIQ_afssYk-CUQbDOcp6uk584iL_W8W2737Am9ZmMrY88qEn7ehR3iVBLgw35152ox685wjvwySjCVoQz-IpOREVDHo

youtubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeqqyoutubeyoutube
vcpp_kumarajivapphspphsbhaisajyabhaisajyapphsvcpp_kumarajivaamtb_xuanzangvcpp_kumarajivabhaisajyapphspphspphsvcpp_kumarajivapphvcpp_kumarajivavcpp_kumarajivavcpp_kumarajiva
養德禪寺課頌寬邦漢語見仁法師法鼓山王菲張智霖法鼓山星辰王菲湛願法師寬邦日語般禪梵唱張學友心定法師王菲朗誦王菲(腾讯)蔣勳見輝法師
;'6!*;I#;t;^ =A ;-;!.@i!;_0;'!   ;">7..`)