jsonp(16,{"name":"dc","start":42048},`，不取正覺。
^ck57
「『設我得佛，
國中聲聞有^lb能計量，乃至三千大千世界眾生緣覺^lb於百千劫悉共計挍知其數者
，不取正覺。
^ck58
「『設^lb我得佛，
國中人天壽命無能限量——除其本願^lb脩短自在——
若不爾者，不取正覺。
^ck59
「『設我得佛，
國^pb39中人天乃至聞有不善名者
，不取正覺。
^ck60
「『設我^lb得佛，
十方世界無量諸佛不悉咨嗟稱我名^lb者
，不取正覺。
^ck61





^ck62
「『設我得佛，
十方眾生至心信樂^lb欲生我國，
乃至十念，若不生者，不取正覺，唯^lb除五逆、誹謗正法。

^ck63
「『設我得佛，
十方眾生發菩^pb40提心修諸功德，至心發願欲生我國，臨壽終^lb時，
假令不與大眾圍遶現其人前者，
不取正^lb覺。
^ck64
「『設我得佛，
十方眾生聞我名號、係念我國，^lb殖諸德本、至心迴向欲生我國，不果遂者，
不^lb取正覺。
^ck65
「『設我得佛，
國中人天不悉成滿三十^pb41二大人相者
，不取正覺。
^ck66
「『設我得佛，
他方佛土^lb諸菩薩眾來生我國，究竟必至一生補處——除^lb其本願自在所化，為眾生故，被弘誓鎧，積累^lb德本度脫一切；遊諸佛國修菩薩行，供養十^lb方諸佛如來；開化恒沙無量眾生，使立無上^pb42正真之道；超出常倫諸地之行，現前修習普^lb賢之德——
若不爾者，不取正覺。
^ck67
「『設我得佛，
國中^lb菩薩承佛神力供養諸佛，一食之頃不能遍^lb至無數無量億那由他諸佛國者
，不取正覺。
^ck68
^lb「『設我得佛，
國中菩薩在諸佛前現其德本，諸^pb43所求欲供養之具若不如意者

，不取正覺。
^ck69
「『設^lb我得佛，
國中菩薩不能演說一切智者，
不取^lb正覺。
^ck70





^ck71
「『設我得佛，
國中菩薩不得金剛那羅延^lb身者
，不取正覺。
^ck72
「『設我得佛，
國中人、天、一切萬^lb物嚴淨光麗，形色殊特，窮微極妙，無能稱量。^pb44其諸眾生乃至逮得天眼，有能明了辨其名^lb數者
，不取正覺。
^ck73
「『設我得佛，
國中菩薩乃至少^lb功德者，不能知見其道場樹無量光色高四^lb百萬里者
，不取正覺。
^ck74
「『設我得佛，
國中菩薩若^lb受讀經法，諷誦持說而不得辯才智慧者，
不^pb45取正覺。
^ck75
「『設我得佛，
國中菩薩智慧辯才若可^lb限量者
，不取正覺。
^ck76
「『設我得佛，
國土清淨，皆悉^lb照見十方一切無量無數不可思議諸佛世^lb界，猶如明鏡覩其面像；
若不爾者，不取正覺。
^ck77
^lb「『設我得佛，
自地以上至于虛空，宮殿、樓觀、池^pb46流、華樹——國土所有一切萬物——皆以無量雜寶^lb百千種香而共合成，嚴飾奇妙超諸人天，其^lb香普薰十方世界，菩薩聞者皆修佛行；
若不^lb如是，不取正覺。
^ck78



^ck79
「『設我得佛，
十方無量不可思^lb議諸佛世界眾生之類，
蒙我光明觸其體者，^pb47身心柔軟超過人天；
若不爾者，不取正覺。
^ck80
「『設^lb我得佛，十方無量不可思議諸佛世界眾生^lb之類，
聞我名字不得菩薩無生法忍、諸深總^lb持者
，不取正覺。
^ck81
「『設我得佛，
十方無量不可思^lb議諸佛世界，其有女人聞我名字，
歡喜信樂，發^pb48菩提心，厭惡女身，
壽終之後復為女像者，
^lb不取正覺。
^ck82
「『設我得佛，
十方無量不可思議諸^lb佛世界，
諸菩薩眾聞我名字，
壽終之後常修^lb梵行至成佛道；
若不爾者，不取正覺。
^ck83
「『設我得^lb佛，十方無量不可思議諸佛世界，
諸天人民^pb49聞我名字，五體投地稽首作禮，歡喜信樂修^lb菩薩行，諸天世人莫不致敬；
若不爾者，不取^lb正覺。
^ck84
「『設我得佛，
國中人天欲得衣服隨念即^lb至，如佛所讚應法妙服自然在身；
若有裁縫、^lb擣染、浣濯者
，不取正覺。
^ck85
「『設我得佛，
國中人天^pb50所受快樂不如漏盡比丘者
，不取正覺。
^ck86
「『設我^lb得佛，
國中菩薩隨意欲見十方無量嚴淨佛^lb土，
應時如願，於寶樹中皆悉照見，猶如明鏡^lb覩見其面像；
若不爾者，不取正覺。
^ck87
「『設我得佛，
^lb他方國土諸菩薩眾聞我名字，至于得佛，諸^pb51根缺陋不具足者
，不取正覺。
^ck88
「『設我得佛，
他方^lb國土諸菩薩眾聞我名字，皆悉逮得清淨解^lb脫三昧，
住是三昧一發意頃，
供養無量不可^lb思議諸佛世尊而不失定意；
若不爾者，不取^lb正覺。
^ck89
「『設我得佛，
他方國土諸菩薩眾聞我名^pb52字，
壽終之後生尊貴家；
若不爾者，不取正覺。
^ck90
^lb「『設我得佛，
他方國土諸菩薩眾聞我名字，
歡^lb喜踊躍，修菩薩行，具足德本；
若不爾者，不取^lb正覺。
^ck91
「『設我得佛，
他方國土諸菩薩眾聞我名^lb字，
皆悉逮得普等三昧，住是三昧至于成佛，
^pb53常見無量不可思議一切如來；
若不爾者，不^lb取正覺。
^ck92
「『設我得佛，
國中菩薩隨其志願，
所欲^lb聞法自然得聞；
若不爾者，不取正覺。
^ck93
「『設我得^lb佛，
他方國土諸菩薩眾聞我名字，
不即得至^lb不退轉者
，不取正覺。
^ck94
「『設我得佛，
他方國土諸^pb54菩薩眾聞我名字，
不即得至第一、第二、第^lb三法忍，於諸佛法不能即得不退轉者，
不取^lb正覺。』」
^ck95
佛告阿難：「爾時，法藏比丘說此願已，而說^lb偈頌曰：
^ck96
^lb「『我建超世願，
必至無上道，
斯願不滿足，
^pb55誓不成等覺。
^ck97
我於無量劫，
不為大施主，
^lb普濟諸貧苦，
誓不成等覺。
^ck98
我至成佛道，
^lb名聲超十方，
究竟靡所聞，
誓不成等覺。
^ck99
^lb離欲深正念，
淨慧修梵行，
志求無上道，
^lb為諸天人師。
^ck100
神力演大光，
普照無際土，
^pb56消除三垢冥，
明濟眾厄難。
^ck101
開彼智慧眼，
^lb滅此昏盲闇，
閉塞諸惡道，
通達善趣門。
^ck102
^lb功祚成滿足，
威曜朗十方，
日月戢重暉，
^lb天光隱不現。
^ck103
為眾開法藏，
廣施功德寶，
^lb常於大眾中，
說法師子吼。
^ck104
供養一切佛，
^pb57具足眾德本，
願慧悉成滿，
得為三界雄。
^ck105
^lb如佛無量智，
通達靡不遍，
願我功德力，
^lb等此最勝尊。
^ck106
斯願若剋果，
大千應感動，
^lb虛空諸天人，
當雨珍妙華。』」
^ck107
^lb佛語阿難：「法藏比丘說此頌已，應時普地六^pb58種震動，
天雨妙華以散其上，
自然音樂空中^lb讚言：
『決定必成無上正覺。』
^ck108
於是法藏比丘具^lb足修滿如是大願，
誠諦不虛，
超出世間深樂^lb寂滅。

^ck109
「阿難！法藏比丘於彼佛所諸天、魔、梵、龍^lb神八部大眾之中發斯弘誓，建此願已，一向^pb59專志莊嚴妙土。
所修佛國開廓廣大，超勝獨^lb妙，
建立常然，無衰、無變。於不可思議兆載永^lb劫積殖菩薩無量德行，
不生欲覺、瞋覺、害覺，
^lb不起欲想、瞋想、害想，
不著色、聲、香、味、觸之法。
^ck110
忍^lb力成就，不計眾苦。少欲知足，無染恚癡，三昧^pb60常寂，智慧無礙。
無有虛偽諂曲之心，和顏軟^lb語先意承問，勇猛精進志願無惓，專求清白^lb之法。
以慧利群生，恭敬三寶，奉事師長；以大^lb莊嚴具足眾行，令諸眾生功德成就。
住空、無^lb相、無願之法，無作、無起，觀法如化。
遠離麁言、^pb61自害、害彼、
彼此俱害，修習善語，自利、利人、彼^lb我兼利。
^ck111
棄國、捐王，絕去財色。
自行六波羅蜜，
^lb教人令行。
「無央數劫積功累德，隨其生處在^lb意所欲，無量寶藏自然發應，
^ck112
教化安立無數^lb眾生。
住於無上正真之道，
或為長者、居士、豪^pb62姓、尊貴，或為剎利國君、轉輪聖帝，
或為六欲^lb天主乃至梵王。
常以四事供養恭敬一切諸^lb佛，如是功德不可稱說。
^ck113
口氣香潔如優鉢羅^lb華，身諸毛孔出栴檀香，其香普熏無量世界；
^lb容色端正，
相好殊妙，
其手常出無盡之寶，衣^pb63服、
飲食珍妙華香，諸蓋幢幡莊嚴之具。
如是^lb等事超諸人天，於一切法而得自在。」
^ck114
阿難白^lb佛：
「法藏菩薩為已成佛而取滅度、為未成佛？^lb為今現在？」
^ck115


佛告阿難：「法藏菩薩今已成佛，現^lb在西方，去此十萬億剎，其佛世界名曰安樂。」
^ck116
^pb64阿難又問：「其佛成道已來為經幾時？」
佛言：「成^lb佛已來凡歷十劫。
其佛國土自然七寶——金、銀、^lb琉璃、珊瑚、琥珀、車𤦲、瑪瑙——合成為地，恢廓曠^lb蕩不可限極。
悉相雜廁，轉相入間，光赫焜耀，^lb微妙奇麗，清淨莊嚴超踰十方一切世界眾^pb65寶中精，其寶猶如第六天寶。

又其國土無須^lb彌山及金剛圍一切諸山，亦無大海、小海、溪^lb渠、井谷。
佛神力故，欲見則見。
亦無地獄、餓鬼、^lb畜生諸難之趣。
亦無四時——春、秋、冬、夏——不寒、不^lb熱，常和調適。」

爾時，阿難白佛言：「世尊！若彼國^pb66土無須彌山，其四天王及忉利天依何而住？」
^lb佛語阿難：「第三炎天乃至色究竟天皆依何^lb住？」
阿難白佛：「行業果報不可思議。」
佛語阿難：^lb「行業果報不可思議，諸佛世界亦不可思議。
^lb其諸眾生功德善力住行業之地，故能爾耳。」
^pb67阿難白佛：「我不疑此法，但為將來眾生欲除^lb其疑惑，故問斯義。」
^ck117
佛告阿難：「無量壽佛威神^lb光明最尊第一，諸佛光明所不能及。
或有佛光照百^lb佛世界、或千佛世界，
^ck118
取要言之，
乃照東方恒^lb沙佛剎，南、西、北方四維，上、下亦復如是。
或有^pb68佛光照于七尺，或照一由旬，二、三、四、五由旬，如^lb是轉倍乃至照一佛剎。
^ck119

是故，無量壽佛號無^lb量光佛、
無邊光佛、無礙光佛、
無對光佛、炎王^lb光佛、
清淨光佛、歡喜光佛、智慧光佛、
不斷光^lb佛、難思光佛、無稱光佛、
超日月光佛。
^ck120
「其有眾^pb69生遇斯光者，三垢消滅，身意柔軟，歡喜踊躍，^lb善心生焉。
若在三塗勤苦之處，見此光明，皆^lb得休息，無復苦惱；壽終之後皆蒙解脫。
「無量^lb壽佛光明顯赫照曜十方諸佛國土，莫不聞^lb焉。
^ck121
不但我今稱其光明，一切諸佛、聲聞、緣覺、^pb70諸菩薩眾咸共歎譽，亦復如是。
若有眾生聞^lb其光明威神功德，日夜稱說至心不斷，隨意^lb所願得生其國，為諸菩薩、聲聞大眾所共歎^lb譽稱其功德；
至其然後得佛道時，普為十方^lb諸佛菩薩歎其光明亦如今也。」
佛言：「我說無^pb71量壽佛光明威神巍巍殊妙，晝夜一劫尚不^lb能盡。」
^ck122
佛語阿難：「無量壽佛壽命長久不可^lb稱計，汝寧知乎？
假使十方世界無量眾生皆^lb得人身，悉令成就聲聞、緣覺，都共集會禪思^lb一心，
竭其智力於百千萬劫悉共推算，計其^pb72壽命長遠劫數，不能窮盡知其限極。
聲聞、菩^lb薩、天、人之眾，壽命長短亦復如是，非算數譬^lb喻所能知也。
又聲聞、菩薩其數難量不可稱^lb說，神智洞達威力自在，能於掌中持一切世^lb界。」
^ck123
佛語阿難：「彼佛初會，聲聞眾數不可稱計，^pb73菩薩亦然。
能如大目揵連百千萬億無量無數，^lb於阿僧祇那由他劫乃至滅度悉共計挍，不^lb能究了多少之數。



^ck124
譬如大海深廣無量，假使^lb有人析其一毛以為百分，以一分毛沾取一^lb渧。
於意云何？其所渧者於彼大海，何所為多？」
^ck125
^pb74阿難白佛：「彼所渧水比於大海多少之量，非^lb巧曆算數、言辭譬類所能知也。」
佛語阿難：「如^lb目連等於百千萬億那由他劫計彼初會聲^lb聞菩薩，
所知數者猶如一渧，其所不知如大^lb海水。



^ck126
pg78


pg79
^ck127





^ck128
「又其國土，七寶諸樹周滿世界——
金樹、
銀^pb75樹、
琉璃樹、
頗梨樹、珊瑚樹、
瑪瑙樹、


車𤦲樹——
^ck129
^lb或有二寶、
三寶



乃至七寶轉共合成。
^ck130
或有金^lb樹，銀葉、華、果；
或有銀樹，金葉、華、果；
或琉璃樹，^lb頗梨為葉，華、果亦然；
或水精樹，琉璃為葉，華、^lb果亦然；
或珊瑚樹，瑪瑙為葉，華、果亦然；
或瑪^pb76瑙樹，琉璃為葉，華、果亦然；


或車𤦲樹，眾寶為^lb葉，華、果亦然。
^ck131
或有寶樹，紫金為本、白銀為莖、^lb琉璃為枝、水精為條、珊瑚為葉、瑪瑙為華、車^lb𤦲為實；
或有寶樹，白銀為本、琉璃為莖、水精^lb為枝、珊瑚為條、瑪瑙為葉、車𤦲為華、紫金為^pb77實；
或有寶樹，琉璃為本、水精為莖、珊瑚為枝、^lb瑪瑙為條、車𤦲為葉、紫金為華、白銀為實；
或^lb有寶樹，水精為本、珊瑚為莖、瑪瑙為枝、車𤦲^lb為條、紫金為葉、白銀為華、琉璃為實；
或有寶^lb樹，珊瑚為本、瑪瑙為莖、車𤦲為枝、紫金為條、^pb78白銀為葉、琉璃為華、水精為實；
或有寶樹，瑪^lb瑙為本、車𤦲為莖、紫金為枝、白銀為條、琉璃^lb為葉、水精為華、珊瑚為實；


或有寶樹，車𤦲為^lb本、紫金為莖、白銀為枝、琉璃為條、水精為葉、^lb珊瑚為華、瑪瑙為實。


行行相值、莖莖相望、枝^pb79枝相準、葉葉相向、華華相順、實實相當，榮色^lb光曜不可勝視。
清風時發，出五音聲，微妙宮^lb商自然相和。
^ck132
「又無量壽佛其道場樹，高四百^lb萬里，其本周圍五千由旬，枝葉四布二十萬^lb里。
一切眾寶自然合成，以月光摩尼持海輪^pb80寶——眾寶之王——而莊嚴之。
周匝條間垂寶瓔珞，^lb百千萬色種種異變，無量光炎照曜無極。
珍^lb妙寶網羅覆其上，一切莊嚴隨應而現。
微風^lb徐動，吹諸寶樹演出無量妙法音聲，其聲流^lb布遍諸佛國。
^ck133
聞其音者得深法忍，住不退轉^pb81至成佛道，正根清徹不遭苦患；
目覩其色、耳聞其音、鼻^lb知其香、舌甞其味、身觸其光、心以法緣，皆得^lb甚深法忍，住不退轉至成佛道，六根清徹無^lb諸惱患。
「阿難！若彼國人天見此樹者，得三^lb法忍：一者、音響忍，二者、柔順忍，三者、無生法^pb82忍。
此皆無量壽佛威神力故、本願力故、滿足^lb願故、明了願故、堅固願故、究竟願故。」




^ck134


^ck135




^ck136



^ck137




^ck138



^ck139
佛告阿^lb難：「世間帝王有百千音樂，自轉輪聖王乃至^lb第六天上，伎樂音聲展轉相勝千億萬倍；
第^lb六天上萬種樂音，不如無量壽國諸七寶樹^pb83一種音聲千億倍也。
亦有自然萬種伎樂，又^lb其樂聲無非法音，清暢哀亮，微妙和雅，十方^lb世界音聲之中最為第一。
「又，講堂、精舍、宮殿、^lb樓觀皆七寶莊嚴，自然化成，復以真珠、明月^lb摩尼眾寶以為交露，覆蓋其上。
^ck140
內、外、左、右有^pb84諸浴池，或十由旬，或二十、三十，乃至百千由^lb旬，縱廣深淺各皆一等，八功德水湛然盈滿，^lb清淨香潔味如甘露。
黃金池者底白銀沙，白^lb銀池者底黃金沙，水精池者底琉璃沙，琉璃^lb池者底水精沙，珊瑚池者底琥珀沙，琥珀池^pb85者底珊瑚沙，車𤦲池者底瑪瑙沙，瑪瑙池者^lb底車𤦲沙，白玉池者底紫金沙，紫金池者底^lb白玉沙，或二寶、三寶乃至七寶轉共合成。
^lb其池岸上有栴檀樹，華葉垂布，香氣普熏。
天優^lb鉢羅華、鉢曇摩華、拘物頭華、分陀利華，雜^pb86色光茂彌覆水上。
「彼諸菩薩及聲聞眾若入^lb寶池，意欲令水沒足，水即沒足；
欲令至膝，即^lb至于膝；欲令至腰，水即至腰；欲令至頸，水即^lb至頸；欲令灌身，自然灌身；欲令還復，水輒還^lb復。


調和冷煖自然隨意，
開神悅體蕩除心垢，^pb87清明澄潔淨若無形。
寶沙映徹無深不照，微^lb瀾迴流轉相灌注，安詳徐逝不遲不疾。
^ck141





^ck142
波揚^lb無量自然妙聲，隨其所應莫不聞者，


^ck143
或聞佛^lb聲，或聞法聲，或聞僧聲，或寂靜聲、空無我聲、^lb大慈悲聲、波羅蜜聲，或十力無畏不共法聲、
^pb88諸通慧聲、無所作聲、不起滅聲、無生忍聲，
乃^lb至甘露灌頂眾妙法聲。
^ck144
如是等聲，稱其所聞^lb歡喜無量，隨順清淨離欲寂滅真實之義、隨^lb順三寶力無所畏不共之法、隨順通慧菩薩^lb聲聞所行之道。
無有三塗苦難之名，但有自^pb89然快樂之音，是故其國名曰極樂。



^ck145
「阿難！彼佛^lb國土諸往生者，具
足如是清淨色身、諸妙音^lb聲、神通功德，
所處宮殿、衣服、飲食、眾妙華香^lb莊嚴之具，
猶第六天自然之物。
^ck146
若欲食時，七^lb寶鉢器自然在前，金、銀、琉璃、車𤦲、瑪瑙、珊瑚、^pb90琥珀、
明月真珠如是眾鉢隨意而至，百味飲^lb食自然盈滿。
雖有此食實無食者，但見色、聞^lb香，
意以為食，自然飽足，身心柔軟，無所味著。
^lb事已化去，時至復現。
「彼佛國土清淨安隱，微^lb妙快樂，次於無為泥洹之道。
^ck147




^ck148


^ck149
其諸聲聞、菩薩、^pb91天、人，智慧高明，神通洞達。
咸同一類，形無異^lb狀，但因順餘方，故有人、天之名。
顏貌端正，超^lb世希有，容色微妙，非天、非人，皆受自然虛無^lb之身、無極之體。」
佛告阿難：「譬如世間貧窮乞^lb人在帝王邊，形貌容狀寧可類乎？」
阿難白佛：^pb92「假令此人在帝王邊，羸陋醜惡無以為喻，百^lb千萬億不可計倍。
所以然者？貧窮乞人底極^lb廝下，衣不蔽形，食趣支命，飢寒困苦，人理殆^lb盡。
皆坐前世不殖德本，積財不施、富有益慳，^lb但欲唐得、貪求無厭，不信修善、犯惡山積。
如^pb93是壽終，財寶消散，苦身積聚為之憂惱，於己^lb無益，徒為他有。
無善可怙，無德可恃，是故，死^lb墮惡趣，受此長苦。
罪畢得出生為下賤，愚鄙^lb斯極示同人類。
所以世間帝王人中獨尊，皆^lb由宿世積德所致，慈惠博施，仁愛兼濟，履信^pb94修善，無所違諍。
是以壽終，福應得昇善道，上^lb生天上享茲福樂。
積善餘慶今得為人，遇生^lb王家自然尊貴，儀容端正眾所敬事，妙衣珍^lb膳隨心服御。
宿福所追，故能致此。」
佛告阿難：^lb「汝言是也。
計如帝王，雖人中尊貴，形色端正，^pb95比之轉輪聖王，甚為鄙陋，猶彼乞人在帝王^lb邊。
轉輪聖王威相殊妙天下第一，比忉^lb利天王，又復醜惡不得相喻萬億倍也。
假令^lb天帝比第六天王，百千億倍不相類也。
設第^lb六天王比無量壽佛國菩薩、聲聞，光顏容色^pb96不相及逮，百千萬億不可計倍。」
佛告阿難：「無^lb量壽國其諸天人，衣服、飲食、華香、瓔珞、諸蓋^lb幢幡、微妙音聲，所居舍宅、宮殿、樓閣，稱其形^lb色、高下、大小，或一寶、二寶，乃至無量眾寶，隨^lb意所欲，應念即至。
又，以眾寶妙衣遍布其地，^pb97一切人天踐之而行。
無量寶網彌覆佛土，皆^lb以金縷、真珠、百千雜寶、奇妙珍異莊嚴絞飾，^lb周匝四面垂以寶鈴，光色晃曜盡極嚴麗。
自^lb然德風徐起微動，其風調和，不寒、不暑；
溫涼^lb柔軟，不遲、不疾；吹諸羅網及眾寶樹，演發無^pb98量微妙法音，流布萬種溫雅德香。
其有聞者，^lb塵勞垢習自然不起，風觸其身皆得快樂，譬^lb如比丘得滅盡三昧。
^ck150





^ck151
「又，風吹散華遍滿佛土，^lb隨色次第而不雜亂，柔軟光澤馨香芬烈，足^lb履其上陷下四寸，隨舉足已還復如故。
華用^pb99已訖地輒開裂，以次化沒清淨無遺
^ck152
，隨其時^lb節風吹散華，如是六反。
「又眾寶蓮華周滿世^lb界，一一寶華百千億葉，其葉光明無量種色，
^lb青色青光，白色白光，玄、黃、朱、紫光色亦然，煒^lb燁煥爛，明曜日月。
一一華中出三十六百千^pb100億光；一一光中出三十六百千億佛，身色紫^lb金，相好殊特；
一一諸佛又放百千光明，普為^lb十方說微妙法；如是諸佛各各安立無量眾^lb生於佛正道。」
^ck153






^ck154
^lb佛說無量壽經卷上
^pb1^folio#svv2佛說無量壽經卷下
^lb曹魏天竺三藏康僧鎧譯
^ck155
^lb佛告阿難：「其有眾生生彼國者，皆悉住於正^lb定之聚。
所以者何？彼佛國中無諸邪聚及不^lb定聚，


^ck156





^ck157




^ck158




^ck159




^ck160




^ck161
十方恒沙諸佛如來皆共讚歎無量壽^pb2佛威神功德不可思議。
諸有眾生聞其名號^lb信心歡喜，乃至一念，至心迴向願生彼國，即^lb得往生住不退轉，唯除五逆、誹謗正法。」


^ck162
佛告^lb阿難：「十方世界諸天人民，其有至心願生彼^lb國，凡有三輩。
其上輩者，捨家棄欲而作沙門，^pb3發菩提心，一向專念無量壽佛，修諸功德願^lb生彼國。
此等眾生臨壽終時，無量壽佛與諸^lb大眾現其人前，即隨彼佛往生其國，便於七^lb寶華中自然化生，住不退轉，智慧勇猛，神通^lb自在。
^ck163
是故，阿難！其有眾生欲於今世見無量^pb4壽佛，
應發無上菩提之心，修行功德，願生彼^lb國。」
^ck164
佛語阿難：「其中輩者，十方世界諸天人民，^lb其有至心願生彼國，雖不能行作沙門大修^lb功德，當發無上菩提之心，一向專念無量壽^lb佛。
多少修善、奉持齋戒、起立塔像、飯食沙門、^pb5懸繒然燈、散華燒香，以此迴向願生彼國。
其^lb人臨終，無量壽佛化現其身——
光明相好，具如^lb真佛——與諸大眾現其人前，
即隨化佛往生其^lb國，住不退轉，功德智慧次如上輩者也。」
^ck165
佛語^lb阿難：「其下輩者，十方世界諸天人民，其有至^pb6心欲生彼國，假使不能作諸功德，當發無上^lb菩提之心，
一向專意乃至十念，念無量壽佛，^lb願生其國。
若聞深法歡喜信樂，
不生疑惑，
乃^lb至一念念於彼佛，
以至誠心願生其國。
此人^lb臨終夢見彼佛，
亦得往生，
功德智慧次如中^pb7輩者也。」
^ck166
佛告阿難：「無量壽佛威神無極，十方^lb世界無量無邊不可思議諸佛如來莫不稱^lb歎。
於彼東方恒沙佛國，無量無數諸菩薩^lb眾，皆悉往詣無量壽佛所恭敬供養，
及諸菩^lb薩、聲聞大眾聽受經法，宣布道化；南、西、北方、^pb8四維，上、下亦復如是。」
^ck167
爾時，世尊而說頌曰：
^lb
「東方諸佛國，
其數如恒沙，
彼土諸菩薩，
^lb往覲無量覺；
^ck168




^ck169
南、西、北四維，
上、下亦復然。
^lb彼土菩薩眾，
往覲無量覺，
^ck170
一切諸菩薩，
^lb各齎天妙華，
寶香無價衣，
供養無量覺；
^ck171
^pb9咸然奏天樂，暢發和雅音，
歌歎最勝尊，^lb供養無量覺。
究達神通慧，遊入深法門，
^lb具足功德藏，妙智無等倫。
慧日照世間，^lb消除生死雲，
恭敬遶三匝，稽首無上尊。
^ck172
^lb見彼嚴淨土，
微妙難思議，
因發無量心，
^pb10願我國亦然。
^ck173




^ck174




^ck175




^ck176




^ck177
應時無量尊，
動容發欣笑，
^lb口出無數光，
遍照十方國。
^ck178
迴光圍遶身，
^lb三匝從頂入，
一切天、人眾，
踊躍皆歡喜。
^ck179
^lb大士觀世音，
整服稽首問，
白佛：『何緣笑？
^lb唯然願說意。』
^ck180




^ck181




^ck182




^ck183




^ck184




^ck185




^ck186




^ck187
梵聲猶雷震，八音暢妙響：
^pb11『當授菩薩記，今說仁諦聽。
十方來正士，^lb吾悉知彼願，
志求嚴淨土，受決當作佛；
^lb覺了一切法，猶如夢幻響，
滿足諸妙願，^lb必成如是剎。
知法如電影，究竟菩薩道，
^lb具諸功德本，受決當作佛；
通達諸法門，^pb12一切空無我，
專求淨佛土，必成如是剎。』
^lb諸佛告菩薩：『令覲安養佛，
聞法樂受行，^lb疾得清淨處。
至彼嚴淨土，便速得神通，
^lb必於無量尊，受記成等覺。』
其佛本願力，^lb聞名欲往生，
皆悉到彼國，自致不退轉。
^pb13菩薩興志願，願己國無異，
普念度一切，^lb名顯達十方。
奉事億如來，飛化遍諸剎，
^lb恭敬歡喜去，還到安養國。
若人無善本，^lb不得聞此經；
清淨有戒者，乃獲聞正法。
^lb曾更見世尊，則能信此事，
謙敬聞奉行，^pb14踊躍大歡喜。
憍慢弊懈怠，難以信此法；
^lb宿世見諸佛，樂聽如是教。
聲聞或菩薩，^lb莫能究聖心，
譬如從生盲，欲行開導人。
^lb如來智慧海，深廣無崖底，
二乘非所測，^lb唯佛獨明了。
假使一切人，具足皆得道，
^pb15淨慧如本空，億劫思佛智，
窮力極講說，^lb盡壽猶不知。
佛慧無邊際，如是致清淨，
^lb壽命甚難得，佛世亦難值。
人有信慧難，^lb若聞精進求，
聞法能不忘，見敬得大慶，
^lb則我善親友，是故當發意。
設滿世界火，^pb16必過要聞法，
會當成佛道，廣濟生死流。」
^ck188




^ck189


^ck190











^ck191





^ck192
^lb佛告阿難：
「彼國菩薩皆當究竟一生補處——
除^lb其本願為眾生故——以弘誓功德而自莊嚴，普^lb欲度脫一切眾生。
^ck193
阿難！彼佛國中諸聲聞眾^lb身光一尋，
菩薩光明照百由旬。
有二菩薩最^pb17尊第一，威神光明普照三千大千世界。」
^ck194
阿難^lb白佛：
「彼二菩薩其號云何？」
佛言：「一名觀世音，^lb二名大勢至。
是二菩薩於此國土修菩薩行，^lb命終轉化生彼佛國。
^ck195
阿難！其有眾生生彼國^lb者，皆悉具足三十二相，智慧成滿，深入諸法，^pb18究暢要妙，神通無礙，諸根明利。
其鈍根者成^lb就二忍，其利根者得阿僧祇無生法忍。
^ck196
又彼^lb菩薩乃至成佛不更惡趣，神通自在常識宿^lb命，
除生他方五濁惡世，
示現同彼如我國也。」
^ck197
^lb佛語阿難：「彼國菩薩承佛威神，
一食之頃往^pb19詣十方無量世界，恭敬供養諸佛世尊，
隨心^lb所念，
華香、伎樂、繒蓋、幢幡，無數無量供養之^lb具
自然化生，應念即至，珍妙殊特非世所有。

^ck198
^lb轉以奉散諸佛、菩薩、聲聞大眾，在虛空^lb中化成華蓋，
光色晃耀，
香氣普熏。
其華周圓^pb20四百里者，
^ck199
如是轉倍，乃覆三千大千世界，隨^lb其前後以次化沒。


^ck200
其諸菩薩僉然欣悅，於虛^lb空中共奏天樂，以微妙音歌歎佛德，聽受經^lb法歡喜無量。
供養佛已、未食之前，忽然輕舉^lb還其本國。」

^ck201
佛語阿難：「無量壽佛為諸聲聞、菩^pb21薩大眾頒宣法時，都悉集會七寶講堂，廣宣^lb道教，演暢妙法，莫不歡喜，心解得道。
即時四^lb方自然風起，普吹寶樹出五音聲，雨無量妙華^lb隨風周遍，自然供養如是不絕。
一切諸天皆^lb齎天上百千華香、萬種伎樂供養其佛及諸^pb22菩薩、聲聞大眾，普散華香、奏諸音樂，前後來^lb往更相開避。
當斯之時，熙然快樂不可勝言。」
^lb佛語阿難：「生彼佛國諸菩薩等，所可講說常^lb宣正法，隨順智慧無違無失。
於其國土所有^lb萬物，無我所心、無染著心，去來進止情無所^pb23係，隨意自在無所適莫，
^ck202

無彼、無我，無競、無訟。
^lb於諸眾生得大慈悲饒益之心、柔軟調伏無^lb忿恨心、離蓋清淨無厭怠心、等心、勝心、深心、^lb定心、
愛法樂法喜法之心、滅諸煩惱離惡趣^lb心，
究竟一切菩薩所行，具足成就無量功德，^pb24得深禪定諸通明慧，遊志七覺修心佛法，
^ck203
肉^lb眼清徹靡不分了、天眼通達無量無限、法眼^lb觀察究竟諸道、慧眼見真能度彼岸、佛眼具^lb足覺了法性。
以無礙智為人演說，
等觀三界^lb空無所有，志求佛法具諸辯才，除滅眾生煩^pb25惱之患。
從如來生，解法如如，善知習滅，音聲^lb方便。
不欣世語，樂在正論，修諸善本，志崇佛^lb道。
^ck204
知一切法皆悉寂滅，生身煩惱二餘俱盡。^lb聞甚深法心不疑懼，常能修行。
^ck205
其大悲者。深^lb遠微妙靡不覆載，究竟一乘至于彼岸。決斷^pb26疑網，慧由心出，於佛教法該羅無外。
智慧如^lb大海、三昧如山王，
慧光明淨超踰日月，清白^lb之法具足圓滿。
「猶如雪山，照諸功德等一淨^lb故；
猶如大地，淨穢好惡無異心故；
猶如淨水，^lb洗除塵勞諸垢染故；
猶如火王，燒滅一切煩^pb27惱薪故；
猶如大風，行諸世界無障閡故；
猶如^lb虛空，於一切有無所著故；
^ck206
猶如蓮華，於諸世^lb間無染污故；
猶如大乘，運載群萌出生死故；
^lb猶如重雲，震大法雷覺未覺故；
猶如大雨，雨^lb甘露法潤眾生故；
如金剛山，眾魔外道不能^pb28動故；
如梵天王，於諸善法最上首故；
如尼拘^lb類樹，普覆一切故；
如優曇鉢華，希有難遇故；
^lb如金翅鳥，威伏外道故；
如眾遊禽，無所藏積^lb故；
猶如牛王，無能勝故；
猶如象王，善調伏故；
^lb如師子王，無所畏故。


「曠若虛空，大慈等故；
摧^pb29滅嫉心，不望勝故。
^ck207
專樂求法，心無厭足；常欲^lb廣說，志無疲倦。
擊法鼓、建法幢、曜慧日、除癡^lb闇、修六和敬、常行法施，志勇精進，心不退弱。
^lb為世燈明、最勝福田，常為師導等無憎愛。
唯^lb樂正道無餘欣慼，拔諸欲刺以安群生，功德^pb30殊勝莫不尊敬，滅三垢障遊諸神通。
因力、緣^lb力、意力、願力、方便之力、常力、善力、定力、慧力、
^lb多聞之力、施戒、忍辱、精進、禪定、智慧之力、正^lb念止觀諸通明力、
如法調伏諸眾生力，如是^lb等力一切具足。
身色相好，功德、辯才具足莊^pb31嚴，無與等者。
^ck208
恭敬供養無量諸佛，常為諸佛^lb所共稱歎。
究竟菩薩諸波羅蜜，修空無相無^lb願三昧、不生不滅諸三昧門，遠離聲聞緣覺^lb之地。

^ck209
「阿難！彼諸菩薩成就如是無量功德，我^lb但為汝略言之耳；若廣說者，百千萬劫不能^pb32窮盡。」
佛告彌勒菩薩、諸天、人等：「無量壽國聲^lb聞、菩薩功德智慧不可稱說，又其國土微妙^lb安樂清淨若此，何不力為善，念道之自然，著^lb於無上下，洞達無邊際？
宜各勤精進，努力自^lb求之，必得超絕去，往生安養國。
橫截五惡趣，^pb33惡趣自然閉；昇道無窮極，易往而無人。
其國^lb不逆違，自然之所牽，何不棄世事，勤行求道^lb德，可獲極長生，壽樂無有極？
「然世人薄俗，共^lb諍不急之事。
於此劇惡極苦之中，勤身營務^lb以自給濟。
無尊、無卑，無貧、無富，少、長、男、女共^pb34憂錢財，有無同然，憂思適等。
屏營愁苦，累念^lb積慮，為心走使，無有安時——有田憂田、有宅憂^lb宅，牛、馬、六畜、奴婢、錢財、衣、食、什物，復共憂之——
^lb重思累息，憂念愁怖，橫為非常、水、火、盜賊、怨^lb家、債主焚漂劫奪，消散磨滅，憂毒忪忪，無有^pb35解時。
結憤心中不離憂惱，心堅意固適無縱^lb捨，或坐摧碎身亡命終，棄捐之去莫誰隨者。
^lb「尊貴、豪富亦有斯患，憂懼萬端，勤苦若此，結^lb眾寒熱與痛共俱。
貧窮下劣困乏常無，無田^lb亦憂欲有田、無宅亦憂欲有宅，無牛、馬、六畜、^pb36奴婢、錢財、衣、食、什物亦憂欲有之。
適有一復^lb少一、有是少是，思有齊等；適欲具有便復糜^lb散。
如是憂苦當復求索，不能時得思想無益，^lb身心俱勞，坐起不安，憂念相隨，勤苦若此，亦^lb結眾寒熱與痛共俱。
或時坐之終身夭命，不^pb37肯為善、行道、進德，壽終身死當獨遠去，有所^lb趣向善惡之道，莫能知者。
「世間人民，父子、兄^lb弟、夫婦、家室、中外親屬，當相敬愛，無相憎嫉；^lb有無相通，無得貪惜；言色常和，莫相違戾。
或^lb時心諍有所恚怒，今世恨意微相憎嫉，後世^pb38轉劇至成大怨。
所以者何？世間之事更相患^lb害，雖不即時應急相破，然含毒畜怒結憤精^lb神，自然剋識不得相離，皆當對生更相報復。
^lb人在世間愛欲之中，獨生、獨死，獨去、獨來，當^lb行至趣苦樂之地，身自當之無有代者。
善惡^pb39變化、殃福異處，宿豫嚴待，當獨趣入。
遠到他^lb所莫能見者，善惡自然追行所生。
窈窈冥冥^lb別離久長，道路不同會見無期，甚難甚難復^lb得相值。
何不棄眾事，各曼強健時，努力勤修^lb善，精進願度世，可得極長生？如何不求道，安^pb40所須待，欲何樂乎？
「如是，世人不信作善得善、^lb為道得道，不信人死更生、惠施得福，善惡之^lb事都不信之，謂之不然終無有是。
但坐此故，^lb且自見之，更相瞻視，先後同然。
轉相承受父^lb餘教令，先人祖父素不為善、不識道德，身愚^pb41神闇，心塞意閉。
死生之趣、善惡之道，自不能^lb見，無有語者；吉凶禍福，競各作之，無一怪也。
^lb生死常道轉相嗣立，或父哭子、或子哭父，兄^lb弟、夫婦更相哭泣，顛倒上下無常根本，皆當^lb過去不可常保。
教語開導，信之者少，是以生^pb42死流轉無有休止。
「如此之人，曚冥抵突，不信^lb經法，心無遠慮，各欲快意；癡惑於愛欲，不達於^lb道德；迷沒於瞋怒，貪狼於財色。
坐之不得道，^lb當更惡趣苦，生死無窮已，哀哉甚可傷。
或時^lb室家，父子、兄弟、夫婦，一死一生更相哀愍，恩^pb43愛、思慕、憂念結縛，心意痛著迭相顧戀，窮日^lb卒歲無有解已。
教語道德心不開明，思想恩^lb好不離情欲。
惛曚閉塞，愚惑所覆，不能深思^lb熟計、心自端政、專精行道、決斷世事，便旋至^lb竟年壽終盡不能得道，無可奈何。
「總猥憒擾^pb44皆貪愛欲，惑道者眾、悟之者寡，世間怱怱，無^lb可聊賴。
尊卑、上下、貧富、貴賤，勤苦怱務各懷^lb殺毒，惡氣窈冥為妄興事，違逆天地不從人^lb心，自然非惡先隨與之。
恣聽所為待其罪極，^lb其壽未盡便頓奪之。
下入惡道，累世懟苦^pb45展轉其中，數千億劫無有出期。
痛不可言，甚^lb可哀愍。」
佛告彌勒菩薩、諸天人等：「我今語汝^lb世間之事，人用是故，坐不得道。
當熟思計遠^lb離眾惡，擇其善者勤而行之。
愛欲榮華不可^lb常保，皆當別離無可樂者。
曼佛在世當勤精^pb46進，其有至願生安樂國者，可得智慧明達、功^lb德殊勝；勿得隨心所欲，虧負經戒在人後也。
^lb儻有疑意不解經者，可具問佛，當為說之。」
彌^lb勒菩薩長跪白言：「佛威神尊重，所說快善，聽^lb佛經者貫心思之。
世人實爾如佛所言，今佛^pb47慈愍顯示大道，耳目開明長得度脫，聞佛所^lb說莫不歡喜。
諸天、人民、蠕動之類，皆蒙慈恩^lb解脫憂苦。
佛語教誡甚深甚善，智慧明見八^lb方、上下、去來今事，莫不究暢。
今我眾等所以^lb蒙得度脫，皆佛前世求道之時謙苦所致。
恩^pb48德普覆，福祿巍巍，光明徹照達空無極；開入^lb泥洹，教授典攬威制消化，感動十方無窮無^lb極。
佛為法王尊超眾聖，普為一切天人之師，^lb隨心所願皆令得道。
今得值佛，復聞無量壽^lb聲，靡不歡喜，心得開明。」
佛告彌勒：「汝言是也。
^pb49若有慈敬於佛者，實為大善。
天下久久乃復^lb有佛，今我於此世作佛，演說經法，宣布道教，^lb斷諸疑網；拔愛欲之本，杜眾惡之源。
遊步三^lb界無所拘閡，典攬智慧眾道之要，執持綱維^lb昭然分明，開示五趣度未度者，決正生死泥^pb50洹之道。
「彌勒當知，汝從無數劫來修菩薩行，^lb欲度眾生，其已久遠，從汝得道至于泥洹不^lb可稱數。
汝及十方諸天、人民一切四眾，永劫^lb已來展轉五道，憂畏勤苦不可具言，乃至今^lb世生死不絕，與佛相值聽受經法，又復得聞^pb51無量壽佛。
快哉甚善，吾助爾喜。
「汝今亦可自^lb厭生、死、老、病、痛苦、惡露、不淨、無可樂者，宜自^lb決斷。
端身正行，益作諸善；修己潔體，洗除心^lb垢；言行忠信，表裏相應；人能自度，轉相拯濟；^lb精明求願，積累善本。
雖一世勤苦須臾之間，^pb52後生無量壽佛國快樂無極，長與道德合明，永^lb拔生死根本，無復貪恚、愚癡、苦惱之患。
欲壽^lb一劫、百劫、千億萬劫，自在隨意皆可得之，無^lb為自然次於泥洹之道。
汝等宜各精進求心^lb所願，無得疑惑中悔自為過咎，生彼邊地七^pb53寶宮殿，五百歲中受諸厄也。」
彌勒白佛：「受佛^lb重誨，專精修學，如教奉行，不敢有疑。」
佛告彌^lb勒：「汝等能於此世端心正意，不作眾惡，甚為^lb至德，十方世界最無倫匹。
所以者何？諸佛國^lb土天人之類自然作善，不大為惡，易可開化。
^pb54今我於此世間作佛，處於五惡、五痛、五燒之^lb中，為最劇苦。
教化群生令捨五惡、令去五痛、^lb令離五燒；降化其意令持五善，獲其福德度^lb世長壽泥洹之道。」
佛言：「何等為五惡？何等五痛？^lb何等五燒？何等消化五惡、令持五善，獲其福^pb55德度世長壽泥洹之道？
「其一惡者，諸天、人民、^lb蠕動之類。
欲為眾惡莫不皆然。
強者伏弱轉^lb相剋賊，殘害殺戮迭相吞噬，不知修善惡逆^lb無道，後受殃罰自然趣向。
神明記識犯者不^lb赦，故有貧窮、下賤、乞丐、孤獨、聾盲、瘖啞、愚癡、^pb56憋惡，至有尫狂不逮之屬。
又有尊貴、豪富、高^lb才、明達皆由宿世慈孝、修善積德所致。
世有^lb常道、王法、牢獄不肯畏慎，為惡入罪受其殃^lb罰，求望解脫難得免出。
世間有此目前現事，^lb壽終後世尤深尤劇，入其幽冥轉生受身。
譬^pb57如王法痛苦極刑，故有自然三塗無量苦惱，^lb轉貿其身、改形易道，所受壽命或長或短，魂^lb神精識自然趣之。
當獨值向相從共生，更相^lb報復無有止已，殃惡未盡不得相離，展轉其^lb中無有出期，難得解脫痛不可言。
天地之間^pb58自然有是，雖不即時卒暴應至，善惡之道會^lb當歸之。
是為一大惡、一痛、一燒，勤苦如是。
「譬^lb如大火焚燒人身，人能於中一心制意、端身^lb正行，獨作諸善、不為眾惡者，身獨度脫，獲其^lb福德度世上天泥洹之道，是為一大善也。」
佛^pb59言：「其二惡者，世間人民——父子、兄弟、室家、夫婦——^lb都無義理，不順法度。
奢婬憍縱，各欲快意，任^lb心自恣，更相欺惑。
心口各異、言念無實、佞諂^lb不忠、巧言諛媚、嫉賢謗善，陷入怨枉。
主上不^lb明任用臣下、臣下自在機偽多端，踐度能行^pb60知其形勢。
在位不正為其所欺，妄損忠良不^lb當天心。
臣欺其君、子欺其父，兄弟、夫婦、中外^lb知識更相欺誑，各懷貪欲、瞋恚、愚癡，欲自厚^lb己、欲貪多有，尊卑、上下心俱同然。
破家亡身^lb不顧前後，親屬內外坐之滅族。
或時室家、知^pb61識、鄉黨、市里、愚民、野人轉共從事，更相剝害，^lb忿成怨結。
富有慳惜不肯施與，愛保貪重心^lb勞身苦，如是至竟無所恃怙，獨來獨去無一^lb隨者。
善惡、禍福追命所生，或在樂處、或入苦^lb毒，然後乃悔，當復何及？世間人民心愚少智，^pb62見善憎謗不思慕及，但欲為惡妄作非法，常^lb懷盜心悕望他利，消散磨盡而復求索。
邪心^lb不正，懼人有色，不豫思計，事至乃悔。
今世現^lb有王法牢獄，隨罪趣向受其殃罰。
因其前世^lb不信道德、不修善本，今復為惡，天神剋識別^pb63其名籍，壽終神逝下入惡道，故有自然三塗^lb無量苦惱。
展轉其中，世世累劫無有出期，難^lb得解脫痛不可言，是為二大惡、二痛、二燒，勤^lb苦如是。
「譬如大火焚燒人身，人能於中一心^lb制意、端身正行，獨作諸善、不為眾惡者，身獨^pb64度脫，獲其福德度世上天泥洹之道，是為二^lb大善也。」
佛言：「其三惡者，世間人民相因寄生，^lb共居天地之間，處年壽命無能幾何。
上有賢^lb明長者、尊貴豪富，下有貧窮㒋賤、尫劣愚夫，^lb中有不善之人常懷邪惡，但念婬妷，煩滿胸^pb65中，愛欲交亂坐起不安，貪意守惜但欲唐得。
^lb眄睞細色邪態外逸，自妻厭憎私妄出入，費^lb損家財事為非法，交結聚會興師相伐，攻劫^lb殺戮強奪不道。
惡心在外不自修業，盜竊趣^lb得欲擊成事，恐勢迫脅歸給妻子，恣心快意^pb66極身作樂。
或於親屬不避尊卑，家室中外患^lb而苦之，亦復不畏王法禁令。
如是之惡著於^lb人鬼，日月照見、神明記識，故有自然三塗無^lb量苦惱。
展轉其中，世世累劫無有出期，難得^lb解脫痛不可言，是為三大惡、三痛、三燒，勤苦^pb67如是。
「譬如大火焚燒人身，人能於中一心制^lb意、端身正行，獨作諸善、不為眾惡者，身獨度^lb脫，獲其福德度世上天泥洹之道，是為三大^lb善也。」
佛言：「其四惡者，世間人民不念修善，轉^lb相教令共為眾惡。
兩舌、惡口、妄言、綺語、讒賊、^pb68鬪亂，憎嫉善人、敗壞賢明，於傍快喜。
不孝二^lb親、輕慢師長，朋友無信，難得誠實。
尊貴自大^lb謂己有道，橫行威勢侵易於人，不能自知，為^lb惡無恥，自以強健欲人敬難，不畏天地、神明、^lb日月，不肯作善，難可降化。
自用偃蹇謂可常^pb69爾，無所憂懼，常懷憍慢。
如是眾惡，天神記識，^lb賴其前世頗作福德，小善扶接營護助之；
今^lb世為惡福德盡滅，諸善神鬼各去離之，身獨^lb空立無所復依。
壽命終盡諸惡所歸，自然迫^lb促共趣奪之。
又其名籍記在神明，殃咎牽引^pb70當往趣向，罪報自然無從捨離。
但得前行入^lb於火鑊，身心摧碎、精神痛苦，當斯之時悔復^lb何及？
天道自然，不得蹉跌，故有自然三塗無^lb量苦惱。
展轉其中，世世累劫無有出期，難得^lb解脫痛不可言，是為四大惡、四痛、四燒，勤苦^pb71如是。
「譬如大火焚燒人身，人能於中一心制^lb意、端身正行，獨作諸善、不為眾惡，身獨度脫，^lb獲其福德度世上天泥洹之道，是為四大善^lb也。」
佛言：「其五惡者，世間人民徙倚懈惰，不肯^lb作善、治身修業，家室眷屬飢寒困苦。
父母教^pb72誨瞋目怒應，言令不和違戾反逆譬如怨家，^lb不如無子。
取與無節，眾共患厭，負恩違義，無^lb有報償之心。
貧窮困乏不能復得，辜較縱奪^lb放恣遊散，串數唐得用自賑給。
耽酒嗜美、飲^lb食無度，肆心蕩逸、魯扈抵突，不識人情強欲^pb73抑制。
見人有善憎嫉惡之，無義、無禮，無所顧^lb難。
自用職當不可諫曉，六親眷屬所資有無^lb不能憂念。
不惟父母之恩、不存師友之義，心^lb常念惡、口常言惡、身常行惡，曾無一善。
不信^lb先聖諸佛經法、不信行道可得度世、不信死^pb74後神明更生、不信作善得善為惡得惡。
欲殺^lb真人，鬪亂眾僧，欲害父母、兄弟、眷屬，六親憎^lb惡願令其死。
「如是世人心意俱然，愚癡曚昧^lb而自以智慧，不知生所從來、死所趣向。
不仁、^lb不順，逆惡天地，而於其中悕望僥倖，欲求長^pb75生，會當歸死。
慈心教誨令其念善，開示生死^lb善惡之趣自然有是，而不信之；苦心與語^lb無益其人，心中閉塞意不開解。
大命將終悔^lb懼交至，不豫修善臨窮方悔，悔之於後將何^lb及乎？
天地之間五道分明，恢廓窈冥浩浩茫^pb76茫，善惡報應禍福相承，身自當之無誰代者。
^lb「數之自然應其所行，殃咎追命無得縱捨。
善^lb人行善，從樂入樂、從明入明；惡人行惡，從苦^lb入苦、從冥入冥。
誰能知者？獨佛知耳。
教語開^lb示，信用者少，生死不休，惡道不絕。
如是，世人^pb77難可具盡，故有自然三塗無量苦惱。
展轉其^lb中，世世累劫無有出期，難得解脫，痛不可言，^lb是為五大惡、五痛、五燒，勤苦如是。
「譬如大火^lb焚燒人身，人能於中一心制意、端身正念，言^lb行相副、所作至誠，所語如語、心口不轉，獨作^pb78諸善、不為眾惡者，身獨度脫，獲其福德度世上^lb天泥洹之道，是為五大善也。」
佛告彌勒：「吾語^lb汝等，是世五惡勤苦若此，五痛、五燒展轉相^lb生，但作眾惡不修善本，皆悉自然入諸惡趣。
^lb或其今世先被殃病，求死不得、求生不得，罪^pb79惡所招示眾見之。
身死隨行入三惡道，苦毒^lb無量自相燋然。
至其久後共作怨結，從小微^lb起遂成大惡，皆由貪著財色、不能施慧，癡欲^lb所迫、隨心思想，煩惱結縛無有解已，厚己諍^lb利無所省錄。
富貴榮華當時快意，不能忍辱^pb80不務修善，威勢無幾隨以磨滅，身生勞苦久^lb後大劇。
天道施張自然糺舉，綱紀羅網上下^lb相應，焭焭忪忪當入其中。
古今有是，痛哉可^lb傷！」
佛語彌勒：「世間如是，佛皆哀之。
以威神力^lb摧滅眾惡，悉令就善棄捐所思，奉持經戒、受^pb81行道法，無所違失，終得度世泥洹之道。」
佛言：^lb「汝今諸天人民及後世人，得佛經語當熟思^lb之，能於其中端心正行，主上為善、率化其下，^lb轉相勅令各自端守，尊聖敬善、仁慈博愛。
佛^lb語教誨無敢虧負，當求度世拔斷生死眾惡^pb82之本，永離三塗無量憂畏苦痛之道。
汝等於^lb是廣殖德本，布恩施慧，勿犯道禁，忍辱、精進、^lb一心、智慧轉相教化。
「為德立善，正心正意，齋^lb戒清淨一日一夜，勝在無量壽國為善百歲。
^lb所以者何？彼佛國土無為自然，皆積眾善，無^pb83毛髮之惡，於此修善十日十夜，勝於他方諸^lb佛國中為善千歲。
所以者何？他方佛國為善^lb者多、為惡者少，福德自然，無造惡之地。
唯此^lb間多惡無有自然，勤苦求欲轉相欺殆，心勞^lb形困飲苦食毒，如是怱務未甞寧息。
吾哀汝^pb84等天人之類，苦心誨喻教令修善，隨器開導^lb授與經法，莫不承用，在意所願皆令得道。
佛^lb所遊履，國邑丘聚靡不蒙化，天下和順，日月^lb清明，風雨以時，災厲不起，國豐民安，兵戈無^lb用，崇德興仁，務修禮讓。」
佛言：「我哀愍汝等諸^pb85天人民，甚於父母念子。
今吾於此世作佛，降^lb化五惡、消除五痛、絕滅五燒，以善攻惡，拔生^lb死之苦，令獲五德，昇無為之安。
吾去世後經^lb道漸滅，人民諂偽復為眾惡，五燒、五痛還如^lb前法，久後轉劇不可悉說，我但為汝略言之^pb86耳。」
佛告彌勒：「汝等各善思之，轉相教誡，如佛^lb經法，無得犯也。」
於是，彌勒菩薩合掌白言：「佛^lb所說甚善。
世人實爾，如來普慈哀愍悉令度^lb脫，受佛重誨不敢違失。」
^ck210
佛告阿難：「汝起更整^lb衣服，合掌恭敬，禮無量壽佛。


十方國土諸佛^pb87如來，常共稱揚讚歎彼佛，無著無閡。」
^ck211
於是，阿^lb難起整衣服，正身西向，恭敬合掌，五體投地^lb禮無量壽佛。
白言：「世尊！願見彼佛安樂國土^lb及諸菩薩聲聞大眾。」
^ck212
說是語已，
即時無量壽^lb佛放大光明，普照一切諸佛世界，
金剛圍山、^pb88須彌山王、大小諸山，

一切所有皆同一色。
^ck213





^ck214
譬^lb如劫水彌滿世界，
其中萬物沈沒不現，滉瀁^lb浩汗
唯見大水；
彼佛光明亦復如是，聲聞、菩^lb薩一切光明皆悉隱蔽，唯見佛光明耀顯赫。
^lb爾時，阿難即見無量壽佛，威德巍巍如須彌^pb89山王，高出一切諸世界上，相好光明靡不照^lb耀。
此會四眾一時悉見，彼見此土亦復如是。
^ck215
^lb爾時，佛告阿難及慈氏菩薩：
「汝見彼國，從地^lb已上至淨居天，
其中所有微妙嚴淨自然之^lb物，為悉見不？」

^ck216
阿難對曰：「唯然，已見。」
「汝寧復聞^pb90無量壽佛大音宣布一切世界化眾生不？」
阿^lb難對曰：「唯然，已聞。」
「彼國人民乘百千由旬七^lb寶宮殿無所障閡，遍至十方供養諸佛，汝復^lb見不？」
對曰：「已見。」
^ck217



^ck218
「彼國人民有胎生者，汝復見^lb不？」
對曰：「已見。」
「其胎生者所處宮殿，或百由旬^pb91或五百由旬，各於其中受諸快樂，如忉利天^lb上，亦皆自然。」

^ck219
爾時，慈氏菩薩白佛言：「世尊！何^lb因何緣彼國人民胎生化生？」

^ck220
佛告慈氏：「若有^lb眾生以疑惑心修諸功德，願生彼國，
不了佛^lb智、不思議智、不可稱智、大乘廣智、無等無倫^pb92最上勝智，於此諸智疑惑不信；
然猶信罪福，^lb修習善本，願生其國。
此諸眾生生彼宮殿，壽^lb五百歲，常不見佛、不聞經法、不見菩薩聲聞^lb聖眾，是故於彼國土謂之胎生。
^ck221
若有眾生明^lb信佛智乃至勝智，作諸功德信心迴向，此諸^pb93眾生於七寶華中自然化生，
加趺而坐，須臾^lb之頃，身相光明，智慧功德如諸菩薩具足成^lb就。
「復次，慈氏！他方諸大菩薩發心欲見無量^lb壽佛，恭敬供養及諸菩薩聲聞之眾。
彼菩薩^lb等命終得生無量壽國，於七寶華中自然化^pb94生。
^ck222
彌勒當知，彼化生者智慧勝故。其胎生者皆^lb無智慧，於五百歲中常不見佛、
不聞經法、不^lb見菩薩諸聲聞眾，無由供養於佛、不知菩薩^lb法式、不得修習功德，
當知此人宿世之時無^lb有智慧，疑惑所致。」
^ck223
佛告彌勒：「譬如轉輪聖王^pb95有七寶牢獄、種種莊嚴，張設床帳，懸諸繒幡。
^ck224
^lb若有諸小王子得罪於王，輒內彼宮中，繫以^lb金鎖，
供給飲食、衣服、床蓐、華香、伎樂，

如轉輪^lb王無所乏少。


^ck225
於意云何？此諸王子寧樂彼處^lb不？」
對曰：「不也，
但種種方便求諸大力欲自勉^pb96出。」



^ck226



^ck227
佛告彌勒：「此諸眾生亦復如是。
以疑惑佛^lb智生彼宮殿，無有刑罰乃至一念惡^lb事，但於五百歲中不見三寶，不得供養修諸^lb善本。
以此為苦，雖有餘樂猶不樂彼處。


^ck228
若此^lb眾生識其本罪，深自悔責求離彼處，即得如^pb97意，往詣無量壽佛所恭敬供養，亦得遍至無量^lb無數諸如來所修諸功德。
彌勒當知，其有菩^lb薩生疑惑者，
為失大利。
^ck229
是故，應當明信諸佛^lb無上智慧。」
^ck230
彌勒菩薩白佛言：
「世尊！於此世界^lb有幾所不退菩薩生彼佛國？」
^ck231
佛告彌勒：「於此^pb98世界有六十七億不退菩薩往生彼國。
一一菩^lb薩已曾供養無數諸佛，次如彌勒者也；諸小^lb行菩薩及修習少功德者不可稱計，皆當往^lb生。」
^ck232
佛告彌勒：「不但我剎諸菩薩等往生彼國，^lb他方佛土亦復如是。
其第一佛名曰遠照，彼^pb99有百八十億菩薩皆當往生。
^ck233
其第二佛名曰^lb寶藏，
彼有九十億菩薩皆當往生。
其第三佛^lb名曰無量音，彼有二百二十億菩薩皆當往^lb生。

其第四佛名曰甘露味，彼有二百五十億^lb菩薩皆當往生。
其第五佛名曰龍勝，彼有十^pb100四億菩薩皆當往生。
其第六佛名曰勝力，彼^lb有萬四千菩薩皆當往生。
其第七佛名曰師^lb子，彼有五百億菩薩皆當往生。
其第八佛名曰^lb離垢光，彼有八十億菩薩皆當往生。
其第九^lb佛名曰德首，彼有六十億菩薩皆當往生。
其^pb101第十佛名曰妙德山，彼有六十億菩薩皆當^lb往生。
其第十一佛名曰人王，彼有十億菩薩^lb皆當往生。
其第十二佛名曰無上華，彼有無^lb數不可稱計諸菩薩眾——
皆不退轉，智慧勇猛，^lb已曾供養無量諸佛，於七日中即能攝取百^pb102千億劫大士所修堅固之法——斯等菩薩皆當^lb往生。

其第十三佛名曰無畏，彼有七百九十^lb億大菩薩眾、諸小菩薩及比丘等不可稱計^lb皆當往生。」
^ck234

^ck235
佛語彌勒：「不但此十四佛國中諸^lb菩薩等當往生也，十方世界無量佛國其往^pb103生者亦復如是，甚多無數。
我但說十方諸佛^lb名號及菩薩、比丘生彼國者，晝夜一劫尚未^lb能盡，我今為汝略說之耳。」
^ck236
佛語彌勒：「其有得^lb聞彼佛名號，歡喜踊躍，乃至一念，當知此人^lb為得大利，則是具足無上功德。

^ck237
是故，彌勒！設^pb104有大火充滿三千大千世界，要當過此。
聞是^lb經法，歡喜信樂，受持讀誦，如說修行。
所以者^lb何？多有菩薩欲聞此經而不能得。若有眾生^lb聞此經者，於無上道終不退轉，
^ck238
是故應當專^lb心信受持誦說行。




^ck239






^ck240
吾今為諸眾生說此經法，^pb105令見無量壽佛及其國土一切所有，所當為^lb者皆可求之，
無得以我滅度之後復生疑惑。
^lb當來之世經道滅盡，我以慈悲哀愍特留此^lb經止住百歲，其有眾生值斯經者，隨意所願^lb皆可得度。」
佛語彌勒：「如來興世難值難見、諸^pb106佛經道難得難聞；菩薩勝法諸波羅蜜得聞^lb亦難；
遇善知識、聞法能行此亦為難；若聞斯^lb經信樂受持，難中之難無過此難。
是故我法，^lb如是作、如是說、如是教，
應當信順，如法修行。」
^ck241



^ck242





^ck243




^ck244




^ck245




^ck246




^ck247




^ck248




^ck249




^ck250




^ck251




^ck252
^lb爾時，世尊說此經法，無量眾生皆發無上正^pb107覺之心，萬二千那由他人得清淨法眼，
二十^lb二億諸天人民得阿那含，
八十萬比丘漏^lb盡意解，
四十億菩薩得不退轉，
以弘誓功德^lb而自莊嚴，於將來世當成正覺。

^ck253




^ck254
爾時，三千大^lb千世界六種震動，
大光普照十方國土，
百千^pb108音樂自然而作，
無量妙華芬芬而降。
^ck255
佛說經^lb已，彌勒菩薩及十方來諸菩薩眾，
長老阿難、^lb諸大聲聞，一切大眾，聞佛所說靡不歡喜。
^ck256
^lb^lb佛說無量壽經卷下^pb109
^pb1^folio#svvy<lines=6>【觀無量壽經】^bk#svvy〔佛說觀無量壽佛經〕
^lb^au〔．．．．．．劉宋西域三藏法師畺良耶舍譯〕
^lb^ck1【序分】
如是我聞：
一時，佛在王舍城耆闍崛山中，與^lb大比丘眾千二百五十人俱；菩薩三萬二千，^lb文殊師利法王子而為上首。
^lb爾時王舍大城有一太子，名阿闍世，隨順調^pb2達惡友之教，
收執父王頻婆娑羅，幽閉置於^lb七重室內，制諸群臣，一不得往。
國大夫人，名^lb韋提希，恭敬大王，澡浴清淨，以酥蜜和麨，用^lb塗其身，諸瓔珞中盛葡萄漿，密以上王。
爾時^lb大王，食麨飲漿，求水漱口；
漱口畢已，合掌恭^lb敬，向耆闍崛山，遙禮世尊，而作是言：
「大目乾^pb3連是吾親友，願興慈悲，授我八戒。」
^lb時目乾連如鷹隼飛，疾至王所；日日如是，授^lb王八戒。
世尊亦遣尊者富樓那，為王說法。
如^lb是時間經三七日，王食麨蜜得聞法故，顏色^lb和悅。
^lb時阿闍世問守門人：「父王今者猶存在耶？」
時^pb4守門者白言：「大王！國大夫人身塗麨蜜，瓔珞^lb盛漿，持用上王；
沙門目連及富樓那，從空而^lb來，為王說法，不可禁制。」
時阿闍世聞此語已，^lb怒其母曰：
「我母是賊，與賊為伴；沙門惡人，幻^lb惑呪術，令此惡王多日不死。」
即執利劍欲害^lb其母。
時有一臣，名曰月光，聰明多智，及與耆^pb5婆，為王作禮。
白言：「大王！臣聞毘陀論經說：
『劫^lb初已來，有諸惡王貪國位故，殺害其父一萬^lb八千。』未曾聞有無道害母。
王今為此殺逆之^lb事，污剎利種，臣不忍聞！是栴陀羅，我等不宜^lb復住於此。」
時二大臣說此語竟，以手按劍，却^lb行而退。
時阿闍世驚怖惶懼，告耆婆言：「汝不^pb6為我耶？」
耆婆白言：「大王！慎莫害母。」
王聞此語，^lb懺悔求救，即便捨劍，止不害母，^lb勅語內官：「閉置深宮，不令復出。」
時韋提希被^lb幽閉已，愁憂憔悴；遙向耆闍崛山，為佛作禮，^lb而作是言：
「如來世尊在昔之時，恒遣阿難來^lb慰問我；我今愁憂，世尊威重，無由得見；
願遣^pb7目連、尊者阿難，與我相見。」
作是語已，悲泣雨^lb淚，遙向佛禮。
未舉頭頃，爾時世尊在耆闍崛^lb山，知韋提希心之所念，即勅大目揵連及以^lb阿難，從空而來。
佛從耆闍崛山沒，於王宮出。
^lb時韋提希禮已舉頭，見世尊釋迦牟尼佛，身^lb紫金色坐百寶蓮華。
目連侍左，阿難在右，釋^pb8梵護世諸天在虛空中，普雨天華，持用供養。
^lb時韋提希見佛世尊，自絕瓔珞，舉身投地，號^lb泣向佛。
白言：「世尊！我宿何罪，生此惡子？世尊^lb復有何等因緣，與提婆達多共為眷屬？
唯願^lb世尊，為我廣說無憂惱處，我當往生，不樂閻^lb浮提濁惡世也。
此濁惡處，地獄、餓鬼、畜生盈^pb9滿，多不善聚。
願我未來不聞惡聲，不見惡人。
^lb今向世尊五體投地，求哀懺悔。
唯願佛日教^lb我觀於清淨業處。」
^lb^ck2【明淨業】
爾時世尊放眉間光，其光金色，遍照十方無^lb量世界；
還住佛頂，化為金臺，如須彌山。
十方^lb諸佛淨妙國土，皆於中現。
或有國土七寶合^pb10成；復有國土純是蓮花；復有國土如自在天^lb宮；
復有國土如頗梨鏡；十方國土皆於中現。
^lb有如是等無量諸佛國土嚴顯可觀，令韋提^lb希見。
^lb時韋提希白佛言：「世尊！是諸佛土，雖復清淨，^lb皆有光明；我今樂生極樂世界阿彌陀佛所。
^pb11唯願世尊，教我思惟，教我正受。」
爾時世尊即^lb便微笑，有五色光，從佛口出，一一光照頻婆^lb娑羅王頂。
爾時大王雖在幽閉，心眼無障，遙^lb見世尊，頭面作禮；自然增進，成阿那含。
^lb爾時世尊告韋提希：
「汝今知不？阿彌陀佛去^lb此不遠；汝當繫念，諦觀彼國淨業成者。
我今^pb12為汝廣說眾譬，亦令未來世一切凡夫欲修^lb淨業者，得生西方極樂國土。
欲生彼國者，當^lb修三福：
一者、孝養父母，奉事師長，慈心不殺，^lb修十善業。
二者、受持三歸，具足眾戒，不犯威^lb儀。
三者、發菩提心，深信因果，讀誦大乘，勸進^lb行者。
如此三事名為淨業。」
^pb13佛告韋提希：「汝今知不？此三種業，乃是過去、^lb未來、現在三世諸佛淨業正因。」
^lb^ck3【辨妙觀】
佛告阿難及韋提希：「諦聽，諦聽！善思念之。
如^lb來今者，為未來世一切眾生為煩惱賊之所^lb害者，說清淨業。
善哉韋提希！快問此事。
阿難！^lb汝當受持，廣為多眾宣說佛語。
如來今者，教^pb14韋提希及未來世一切眾生觀於西方極樂^lb世界。
以佛力故，當得見彼清淨國土，如執明^lb鏡自見面像。
見彼國土極妙樂事，心歡喜故，^lb應時即得無生法忍。」
佛告韋提希：「汝是凡夫，^lb心想羸劣，未得天眼，不能遠觀；諸佛如來有^lb異方便，令汝得見。」
時韋提希白佛言：「世尊！如^pb15我今者，以佛力故見彼國土。
若佛滅後，諸眾^lb生等，濁惡不善，五苦所逼，云何當見阿彌陀^lb佛極樂世界？」
^lb^ck4【日觀】
佛告韋提希：「汝及眾生應當專心，繫念一處，^lb想於西方。
云何作想？凡作想者，一切眾生自^lb非生盲，有目之徒，皆見日沒。
當起想念，正坐^pb16西向，諦觀於日，欲沒之處，令心堅住，專想不^lb移。
見日欲沒，狀如懸鼓。
既見日已，閉目開目^lb皆令明了。
是為日想，名曰初觀。
^ck5【水觀】
^lb次作水想，見水澄清，亦令明了，無分散意。
既^lb見水已，當起氷想。
見氷映徹，作琉璃想。
此想^lb成已，見琉璃地，內外映徹。
下有金剛七寶金^pb17幢，擎琉璃地。
其幢八方，八楞具足，一一方面，^lb百寶所成，一一寶珠，有千光明，一一光明，
八^lb萬四千色，映琉璃地，如億千日，不可具見。
琉^lb璃地上，以黃金繩，雜廁間錯，以七寶界，分齊^lb分明，一一寶中，有五百色光。
其光如花，又似^lb星月，懸處虛空，成光明臺。
樓閣千萬，百寶合^pb18成，於臺兩邊，各有百億花幢，無量樂器，以為^lb莊嚴。
八種清風從光明出，鼓此樂器，演說苦、^lb空、無常、無我之音，是為水想，名第二觀。
^lb^ck6【地觀】
此想成時，一一觀之，極令了了。
閉目開目，不^lb令散失，唯除食時，恒憶此事。
如此想者，名為^lb粗見極樂國地。
若得三昧，見彼國地，了了分^pb19明，不可具說。
是為地想，名第三觀。」
^lb佛告阿難：「汝持佛語，為未來世一切大眾欲^lb脫苦者，說是觀地法。
若觀是地者，除八十億^lb劫生死之罪。
捨身他世，必生淨國，心得無疑。
^lb作是觀者，名為正觀。
若他觀者，名為邪觀。」
^ck7【寶樹觀】
^lb佛告阿難及韋提希：「地想成已，次觀^pb20寶樹。
觀寶樹者，一一觀之，作七重行樹想。
一一樹高^lb八千由旬，其諸寶樹，七寶花葉無不具足。
一^lb一華葉，作異寶色。
琉璃色中出金色光；
頗梨^lb色中出紅色光；
馬腦色中出車𤦲光；
車𤦲色^lb中出綠真珠光；
珊瑚琥珀一切眾寶以為映^lb飾。
妙真珠網彌覆樹上，一一樹上有七重網，^pb21一一網間有五百億妙華宮殿，如梵王宮。
諸^lb天童子自然在中，一一童子有五百億釋迦毘^lb楞伽摩尼寶以為瓔珞；
其摩尼光照百由旬，猶^lb如和合百億日月，不可具名，眾寶間錯色中^lb上者。
此諸寶樹，行行相當，葉葉相次，於眾葉^lb間生諸妙花，花上自然有七寶果。
一一樹葉，^pb22縱廣正等二十五由旬；其葉千色有百種畫，^lb如天纓珞；
有眾妙華，作閻浮檀金色；如旋火^lb輪，宛轉葉間，踊生諸果，如帝釋瓶；
有大光明，^lb化成幢幡無量寶蓋。
是寶蓋中，映現三千大^lb千世界一切佛事；十方佛國亦於中現。
見此^lb樹已，亦當次第一一觀之，觀見樹莖、枝葉、華^pb23果，皆令分明。
是為樹想，名第四觀。
^ck8【寶池觀】
^lb次當想水。欲想水者，極樂國土有八池水。
一^lb一池水七寶所成；其寶柔軟從如意珠王生，^lb分為十四支；一一支作七寶色。
黃金為渠，^lb渠下皆以雜色金剛以為底沙。
一一水中有^lb六十億七寶蓮花，一一蓮華團圓正等十二^pb24由旬。
其摩尼水流注華間，尋樹上下。
其聲微^lb妙，演說苦、空、無常、無我、諸波羅蜜，復有讚歎^lb諸佛相好者。
從如意珠王踊出金色微妙光明，^lb其光化為百寶色鳥，和鳴哀雅，常讚念佛、念^lb法、念僧，
是為八功德水想，名第五觀。
^lb^ck9【寶樓閣觀】
眾寶國土，一一界上有五百億寶樓，其樓閣^pb25中有無量諸天，作天伎樂。
又有樂器懸處虛^lb空，如天寶幢不鼓自鳴。
此眾音中，皆說念佛、^lb念法、念比丘僧。
此想成已，名為粗見極樂世^lb界寶樹、寶地、寶池，是為總觀想，名第六觀。
若^lb見此者，除無量億劫極重惡業，命終之後必^lb生彼國。
作是觀者，名為正觀。
若他觀者，名為^pb26邪觀。」
^lb^ck10【華座觀】
佛告阿難及韋提希：「諦聽，諦聽！善思念之。
吾^lb當為汝分別解說除苦惱法，汝等憶持，廣為^lb大眾分別解說。」
說是語時，無量壽佛住立空^lb中，觀世音、大勢至，是二大士侍立左右。
光明^lb熾盛不可具見，百千閻浮檀金色不可為比。
^pb27時韋提希見無量壽佛已，接足作禮，白佛言：
^lb「世尊！我今因佛力故，得見無量壽佛及二菩^lb薩，未來眾生，當云何觀無量壽佛及二菩薩？」
^lb佛告韋提希：「欲觀彼佛者，當起想念，於七寶^lb地上作蓮花想，令其蓮花一一葉作百寶^lb色。
有八萬四千脈，猶如天畫；一一脈有八萬四千^pb28光，了了分明，皆令得見。
華葉小者，縱廣二百^lb五十由旬；如是蓮華有八萬四千大葉，一一^lb葉間，有百億摩尼珠王以為映飾。
一一摩尼^lb珠放千光明，其光如蓋，七寶合成，遍覆地上。
^lb釋迦毘楞伽摩尼寶以為其臺；此蓮花臺，八萬金^lb剛甄叔迦寶，梵摩尼寶，妙真珠網，以為交飾。
^pb29於其臺上，自然而有四柱寶幢，一一寶幢如^lb百千萬億須彌山；
幢上寶縵如夜摩天宮，復^lb有五百億微妙寶珠，以為映飾。
一一寶珠有^lb八萬四千光，一一光作八萬四千異種金色，
^lb一一金色遍其寶土，處處變化，各作異相；
或^lb為金剛臺，或作真珠網，或作雜花雲，於十方^pb30面隨意變現，施作佛事，是為花座想，名第七^lb觀。」
佛告阿難：「如此妙花，是本法藏比丘願力^lb所成，若欲念彼佛者，當先作此妙花座想。
作此^lb想時不得雜觀；皆應一一觀之，一一葉，一一^lb珠，一一光，一一臺，一一幢，
皆令分明，如於鏡^lb中自見面像。
此想成者，滅除五百億劫生死^pb31之罪，必定當生極樂世界。
作是觀者，名為正^lb觀。
若他觀者，名為邪觀。」
^ck11【佛菩薩像觀】
^lb佛告阿難及韋提希：「見此事已，次當想佛。
所^lb以者何？諸佛如來是法界身，遍入一切眾生心^lb想中；是故汝等心想佛時，是心即是三十二^lb相、八十隨形好。
是心作佛，是心是佛。
諸佛正^pb32遍知海，從心想生，是故應當一心繫念，諦觀^lb彼佛、多陀阿伽度、阿羅呵、三藐三佛陀。
想彼^lb佛者，先當想像。
閉目開目，見一寶像，如閻浮^lb檀金色，坐彼華上。
像既坐已，心眼得開，了了^lb分明，見極樂國七寶莊嚴，寶地、寶池、寶樹行^lb列，
諸天寶縵彌覆樹上，眾寶羅網滿虛空中。
^pb33見如此事，極令明了，如觀掌中。
見此事已，復^lb當更作一大蓮華在佛左邊，如前蓮華等無^lb有異。
復作一大蓮華在佛右邊，想一觀世音^lb菩薩像坐左華座，亦放金光如前無異。
想一^lb大勢至菩薩像坐右華座。
此想成時，佛菩薩^lb像皆放妙光；其光金色，照諸寶樹。
一一樹下^pb34亦有三蓮華，諸蓮華上各有一佛二菩薩像，^lb遍滿彼國。
此想成時，行者當聞水流、光明及^lb諸寶樹、鳧鴈、鴛鴦皆說妙法。
出定、入定恒聞^lb妙法。
行者所聞，出定之時憶持不捨，令與修^lb多羅合。
若不合者，名為妄想，若與合者，名為^lb麁想見極樂世界。
是為想像，名第八觀。
作是^pb35觀者，除無量億劫生死之罪，於現身中得念^lb佛三昧。
^lb^ck12【佛身觀】
佛告阿難及韋提希：「此想成已，次當更觀無^lb量壽佛身相光明。
阿難當知！無量壽佛身，如^lb百千萬億夜摩天閻浮檀金色。
佛身高六十^lb萬億那由他恒河沙由旬；眉間白毫右旋宛^pb36轉，如五須彌山。
佛眼清淨如四大海水，清白分明。
^lb身諸毛孔演出光明，如須彌山。
彼佛圓光如^lb百億三千大千世界；於圓光中，有百萬億那^lb由他恒河沙化佛；
一一化佛，亦有眾多無數^lb化菩薩，以為侍者。
無量壽佛有八萬四千相；^lb一一相中，各有八萬四千隨形好；
一一好中^pb37復有八萬四千光明；一一光明遍照十方世^lb界，念佛眾生攝取不捨。
其光相好及與化佛，^lb不可具說；但當憶想令心明見。
見此事者，即^lb見十方一切諸佛，以見諸佛故名念佛三昧。
^lb作是觀者，名觀一切佛身，以觀佛身故亦見^lb佛心。
諸佛心者大慈悲是，以無緣慈攝諸眾生。
^pb38作此觀者，捨身他世，生諸佛前，得無生忍。
是^lb故智者應當繫心諦觀無量壽佛。
觀無量壽^lb佛者，從一相好入，但觀眉間白毫，極令明了。
^lb見眉間白毫相者，八萬四千相好自然當現。
^lb見無量壽佛者，即見十方無量諸佛；得見無^lb量諸佛故，諸佛現前受記。
是為遍觀一切色^pb39身相，名第九觀。
作是觀者，名為正觀。
若他觀^lb者，名為邪觀。」
^lb^ck13【觀音觀】
佛告阿難及韋提希：「見無量壽佛了了分明^lb已，次亦應觀觀世音菩薩。
此菩薩身長八十^lb萬億那由他恒河沙由旬，身紫金色，頂有肉髻，項有^lb圓光，面各百千由旬。
其圓光中有五百化佛，^pb40如釋迦牟尼。
一一化佛，有五百菩薩，無量^lb諸天，以為侍者。
舉身光中五道眾生，一切色^lb相皆於中現。
頂上毘楞伽摩尼妙寶，以為天冠。
^lb其天冠中有一立化佛，高二十五由旬。
觀世^lb音菩薩面如閻浮檀金色；眉間毫相備七寶^lb色，流出八萬四千種光明；
一一光明，有無量^pb41無數百千化佛；一一化佛，無數化菩薩以為^lb侍者，變現自在滿十方界。
臂如紅蓮花色，^lb有八十億微妙光明，以為瓔珞；其瓔珞中，普^lb現一切諸莊嚴事。
手掌作五百億雜蓮華色；^lb手十指端，一一指端有八萬四千畫，猶如印^lb文。
一一畫有八萬四千色；一一色有八萬四^pb42千光，其光柔軟普照一切，以此寶手接引眾^lb生。
舉足時，足下有千輻輪相，自然化成五百^lb億光明臺。
下足時，有金剛摩尼花，布散一切^lb莫不彌滿。
其餘身相，眾好具足，如佛無異，唯^lb頂上肉髻及無見頂相，不及世尊。
是為觀觀^lb世音菩薩真實色身相，名第十觀。」
佛告阿難：^pb43「若欲觀觀世音菩薩當作是觀。
作是觀者^lb不遇諸禍，淨除業障，除無數劫生死之罪。
如^lb此菩薩，但聞其名，獲無量福，何況諦觀！若有^lb欲觀觀世音菩薩者，當先觀頂上肉髻，次觀天^lb冠。
其餘眾相亦次第觀之，悉令明了，如觀掌^lb中。
作是觀者，名為正觀。
若他觀者，名為邪觀。」
^pb44^ck14【勢至觀】
次觀大勢至菩薩。
此菩薩身量大小亦如觀^lb世音，圓光面各二百二十五由旬，照二百五十^lb由旬。
舉身光明照十方國，作紫金色。
有緣眾^lb生皆悉得見。
但見此菩薩一毛孔光，即見十^lb方無量諸佛淨妙光明，是故號此菩薩名無^lb邊光。
以智慧光普照一切，令離三塗，得無上^pb45力，是故號此菩薩名大勢至。
此菩薩天冠有^lb五百寶蓮華；一一寶華有五百寶臺。
一一臺中，^lb十方諸佛淨妙國土廣長之相，皆於中現。
頂^lb上肉髻如鉢頭摩花。
於肉髻上有一寶瓶，盛^lb諸光明，普現佛事。
餘諸身相如觀世音，等無^lb有異。
此菩薩行時，十方世界一切震動，當地^pb46動處各有五百億寶花。
一一寶花莊嚴高顯，如^lb極樂世界。
此菩薩坐時，七寶國土一時動搖。
^lb從下方金光佛剎，乃至上方光明王佛剎，於^lb其中間無量塵數分身無量壽佛，分身觀世^lb音、大勢至，
皆悉雲集極樂國土，側塞空中坐^lb蓮華座，演說妙法，度苦眾生。
作此觀者，名為^pb47觀見大勢至菩薩；是為觀大勢至色身相。
觀^lb此菩薩者名第十一觀，除無數劫阿僧祇生^lb死之罪；作是觀者不處胞胎，常遊諸佛淨妙^lb國土。
此觀成已，名為具足觀觀世音及大勢至。
^lb^ck15【普往生觀】
見此事時當起想作心，自見生於西方極樂世界，
於^lb蓮華中結跏趺坐，作蓮華合想，作蓮華開想。
^pb48蓮華開時，有五百色光來照身想；
眼目開想，^lb見佛菩薩滿虛空中，水鳥、樹林及與諸佛，
所^lb出音聲，皆演妙法，與十二部經合。
若出定^lb時憶持不失。
見此事已，名見無量壽佛極樂^lb世界。
是為普觀想，名第十二觀。
無量壽佛化^lb身無數，與觀世音及大勢至，常來至此行人^pb49之所。
^ck16【雜明佛菩薩觀】
^lb佛告阿難及韋提希：「若欲至心生西方者，先^lb當觀於一丈六像在池水上。
如先所說，無量^lb壽佛身量無邊，非是凡夫心力所及。
然彼如^lb來宿願力故，有憶想者必得成就。
但想佛像^lb得無量福，況復觀佛具足身相！阿彌陀佛神^pb50通如意，於十方國變現自在。
或現大身滿虛^lb空中；或現小身丈六八尺。
所現之形皆真金^lb色，圓光化佛及寶蓮花，如上所說。
觀世音菩^lb薩及大勢至，於一切處身同眾生，但觀首相，^lb知是觀世音，知是大勢至，
此二菩薩助阿彌^lb陀佛，普化一切。
是為雜想觀，名第十三觀。
^pb51^ck17【上品生觀】
佛告阿難及韋提希：「
上品上生者，若有眾生^lb願生彼國者，發三種心，即便往生。
何等為三？^lb一者、至誠心。
二者、深心。
三者、迴向發願心。
具^lb三心者必生彼國。
復有三種眾生，當得往生。
^lb何等為三？一者、慈心不殺，具諸戒行。
二者、讀^lb誦大乘方等經典。
三者、修行六念，迴向發^pb52願生彼佛國。
具此功德，一日乃至七日，即得往^lb生。
生彼國時，此人精進勇猛故，阿彌陀如來^lb與觀世音及大勢至，
無數化佛，百千比丘，聲聞^lb大眾，無量諸天，七寶宮殿，
觀世音菩薩執金^lb剛臺，與大勢至菩薩至行者前。
阿彌陀佛放^lb大光明，照行者身，與諸菩薩授手迎接。
觀世^pb53音、大勢至與無數菩薩，讚歎行者，勸進其心。
^lb行者見已，歡喜踊躍。
自見其身乘金剛臺，隨^lb從佛後，如彈指頃，往生彼國。
生彼國已，見佛^lb色身眾相具足，見諸菩薩色相具足。
光明寶^lb林，演說妙法。
聞已即悟無生法忍。
經須臾間^lb歷事諸佛，遍十方界，於諸佛前次第受記。
還^pb54至本國，得無量百千陀羅尼門，是名上品上^lb生者。
「上品中生者，不必受持讀誦方等經典。
^lb善解義趣，於第一義心不驚動，深信因果，不^lb謗大乘；以此功德，迴向願求生極樂國。
行此^lb行者命欲終時，阿彌陀佛與觀世音及大勢至，^lb無量大眾，眷屬圍繞，持紫金臺至行者前，讚^pb55言：
『法子！汝行大乘，解第一義，是故我今來迎^lb接汝。』與千化佛一時授手。
行者自見坐紫金^lb臺，合掌叉手，讚歎諸佛，如一念頃，即生彼國^lb七寶池中。
此紫金臺如大寶花，經宿即開。
行^lb者身作紫磨金色，足下亦有七寶蓮華。
佛及^lb菩薩俱放光明，照行者身，目即開明。
因前宿^pb56習，普聞眾聲，純說甚深第一義諦。
即下金臺，^lb禮佛合掌讚歎世尊。
經於七日，應時即於阿^lb耨多羅三藐三菩提，得不退轉。
應時即能飛^lb行遍至十方，歷事諸佛，於諸佛所修諸三昧。
^lb經一小劫得無生法忍，現前受記，是名上品中^lb生者。
「上品下生者，亦信因果，不謗大乘，但發^pb57無上道心，以此功德，迴向願求生極樂國。
彼行^lb者命欲終時，阿彌陀佛及觀世音并大勢至，與^lb諸菩薩持金蓮華，化作五百化佛，來迎此人。
五^lb百化佛一時授手，讚言：『法子！汝今清淨，發無^lb上道心，我來迎汝。』見此事時，即自見身坐金^lb蓮花。
坐已華合，隨世尊後，即得往生七寶池^pb58中。
一日一夜蓮花乃開，七日之中乃得見佛。
^lb雖見佛身，於眾相好心不明了，於三七日後^lb乃了了見。
聞眾音聲，皆演妙法。
遊歷十方，供^lb養諸佛。
於諸佛前聞甚深法，經三小劫得百^lb法明門，住歡喜地。
是名上品下生者。
是名上^lb輩生想，名第十四觀。
^pb59^ck18【中品生觀】
佛告阿難及韋提希：「中品上生者，若有眾生^lb受持五戒，持八戒齋，修行諸戒，不造五逆，無^lb眾過患；
以此善根，迴向願求生於西方極樂^lb世界。
行者臨命終時，阿彌陀佛與諸比丘，眷屬圍^lb繞，放金色光至其人所，
演說苦、空、無常、無我，^lb讚歎出家得離眾苦。
行者見已，心大歡喜。
自^pb60見己身坐蓮花臺，長跪合掌為佛作禮。
未舉^lb頭頃即得往生極樂世界，蓮花尋開。
當華敷^lb時，聞眾音聲讚歎四諦，應時即得阿羅漢道，^lb三明、六通、具八解脫；是名中品上生者。
「中品^lb中生者，若有眾生，若一日一夜持八戒齋，若^lb一日一夜持沙彌戒，若一日一夜持具足戒，^pb61威儀無缺。
以此功德，迴向願求生極樂國。
戒^lb香薰修，如此行者命欲終時，見阿彌陀佛與^lb諸眷屬放金色光，
持七寶蓮花至行者前，行^lb者自聞空中有聲，讚言：
『善男子！如汝善人，隨^lb順三世諸佛教故，我來迎汝。』
行者自見坐蓮^lb花上，蓮花即合，生於西方極樂世界。
在寶池^pb62中，經於七日蓮花乃敷。
花既敷已，開目合掌，^lb讚歎世尊。
聞法歡喜，得須陀洹，經半劫已成^lb阿羅漢；是名中品中生者。
「中品下生者，若有^lb善男子、善女人，孝養父母，行世仁義，
此人命^lb欲終時，遇善知識為其廣說阿彌陀佛國土^lb樂事，亦說法藏比丘四十八大願。
聞此事已，尋^pb63即命終。
譬如壯士屈伸臂頃，即生西方極樂^lb世界。
生經七日，遇觀世音及大勢至，聞法歡^lb喜得須陀洹。
過一小劫，成阿羅漢。
是名中品^lb下生者。
是名中輩生想，名第十五觀。
^lb^ck19【下品生觀】
佛告阿難及韋提希：「下品上生者，或有眾生^lb作眾惡業，雖不誹謗方等經典，
如此愚人，多^pb64造惡法，無有慚愧，命欲終時遇善知識，為讚^lb大乘十二部經首題名字。
以聞如是諸經名^lb故，除却千劫極重惡業。
智者復教合掌叉手，^lb稱南無阿彌陀佛。
稱佛名故，除五十億劫生^lb死之罪。
爾時彼佛，即遣化佛，化觀世音，化大^lb勢至，至行者前，讚言：
『善哉！善男子！汝稱佛名故^pb65諸罪消滅，我來迎汝。』
作是語已，行者即見化^lb佛光明，遍滿其室，見已歡喜，即便命終。
乘寶^lb蓮花，隨化佛後，生寶池中，經七七日蓮花乃^lb敷。
當花敷時，大悲觀世音菩薩，及大勢至菩^lb薩，放大光明，住其人前，為說甚深十二部經。
^lb聞已信解，發無上道心。
經十小劫，具百法明^pb66門，得入初地；是名下品上生者；」
佛告阿難及^lb韋提希：「下品中生者，或有眾生，毀犯五戒、八^lb戒及具足戒，
如此愚人，偷僧祇物，盜現前僧^lb物，不淨說法，無有慚愧，以諸惡法而自莊嚴。
^lb如此罪人，以惡業故應墮地獄。
命欲終時，地^lb獄眾火一時俱至，遇善知識以大慈悲，即為^pb67讚說阿彌陀佛十力威德，
廣讚彼佛光明神^lb力，亦讚戒、定、慧、解脫、解脫知見。
此人聞已，除^lb八十億劫生死之罪。
地獄猛火化為涼風，^lb吹諸天華。
華上皆有化佛菩薩，迎接此人。
如^lb一念頃，即得往生七寶池中蓮花之內，經於^lb六劫，蓮花乃敷。
觀世音、大勢至，以梵音聲安^pb68慰彼人，為說大乘甚深經典。
聞此法已，應時^lb即發無上道心。
是名下品中生者。」
佛告阿難^lb及韋提希：「下品下生者，或有眾生作不善業，^lb五逆、十惡，具諸不善。
如此愚人以惡業故，應^lb墮惡道，經歷多劫，受苦無窮。
如此愚人臨命^lb終時，遇善知識，種種安慰，為說妙法，教令念^pb69佛，彼人苦逼不遑念佛。
善友告言：『汝若不能^lb念彼佛者，應稱歸命無量壽佛。』
如是至心令聲不^lb絕，具足十念，稱南無阿彌陀佛。
稱佛名故，於^lb念念中，除八十億劫生死之罪。
命終之時見^lb金蓮花，猶如日輪，住其人前，如一念頃，即得^lb往生極樂世界。
於蓮花中滿十二大劫，蓮花^pb70方開。
觀世音、大勢至以大悲音聲，即為其人廣說^lb諸法實相，除滅罪法。
聞已歡喜，應時即發菩^lb提之心；是名下品下生者。
是名下輩生想，名^lb第十六觀。」
^lb^ck20【彰利益】
說是語時，韋提希與五百侍女，聞佛所說，應^lb時即見極樂世界廣長之相，得見佛身及二^pb71菩薩。
心生歡喜，歎未曾有，豁然大悟，得無生^lb忍。
五百侍女發阿耨多羅三藐三菩提心，願^lb生彼國。
世尊悉記，皆當往生，生彼國已，獲得^lb諸佛現前三昧。
無量諸天，發無上道心。
^ck21【王宮流通】
爾時^lb阿難，即從座起，前白佛言：「世尊！當何名此經？此^lb法之要，當云何受持？」
佛告阿難：「此經名『觀極^pb72樂國土無量壽佛觀世音菩薩大勢至菩薩』，
^lb亦名『淨除業障生諸佛前』。
汝當受持，無令忘^lb失！行此三昧者，現身得見無量壽佛及二大^lb士。
若善男子及善女人，但聞佛名、二菩薩名，^lb除無量劫生死之罪，何況憶念！
若念佛者，當^lb知此人即是人中芬陀利花，觀世音菩薩、大^pb73勢至菩薩為其勝友，當坐道場，生諸佛家。」
佛^lb告阿難：「汝好持是語。
持是語者，即是持無量^lb壽佛名。」
佛說此語時，尊者目連、尊者阿難^lb及韋提希等，聞佛所說，皆大歡喜。
^lb^ck22【鷲山流通】
爾時世尊，足步虛空，還耆闍崛山。
爾時，阿難^lb廣為大眾說如上事。
無量人、天、龍、神、夜叉，聞佛^pb74所說，皆大歡喜，禮佛而退。
^lb^lb佛說觀無量壽佛經^lb^lb^pb75
^bk#svv_hbs〔白話無量壽經〕^au〔黃寶生〕^ck0【讚】

唵，向安住十方無窮無盡世界的過去、未來和現在一切佛、菩薩、聲聞和辟支佛致敬！
向無量光致敬！向無量壽致敬！向心中蘊含不可思議功德者致敬！
^ck1
我這樣聽說。
世尊曾經住在王舍城靈鷲山①，同住的有大比丘僧團，三萬二千比丘，全都是阿羅漢，
痛苦和煩惱除盡，完成修行，依靠正知，心獲解脫，斷絕一切生死束縛，達到自己的目的，獲得勝利，達到至高調伏而寂靜，
心獲解脫，慧獲解脫，個個是大勇士，
掌握六神通，修習八解脫禪，獲得十力，名聲遠揚的長老，大聲聞。
^ck2
諸如阿若慵陳如、阿說示、婆師波、摩訶南、賢勝、稱天、無垢、妙臂、
富樓那彌多羅尼子、慵梵波提、優樓頻螺迦葉、那提迦葉、賢善迦葉、鳩摩羅迦葉、摩訶迦葉、
舍利弗、摩訶目犍連、摩訶劫賓那、大月、阿尼婁陀、羅陀、難提迦、甘畢羅、
須菩提、梨波多、竭陀林士、波鳩羅、善來、不空王、波羅耶尼迦、
槃陀迦、周利槃陀迦、難陀、羅喉羅和尊者阿難。


這些和另一些名聲遠揚的長老、大聲聞。
其中唯有一位是有學聖人②，修行有待提高，他就是尊者阿難。
^ck3
還有，以彌勒為首的眾多菩薩大士。


^ck4













^ck5












^ck6















^ck7











^ck8

這時，尊者阿難從座位起身，偏袒右肩，右膝著地，向世尊合掌行禮，對世尊說道：
「世尊你諸根愉悅，臉色清凈，膚色明凈，閃耀金光。
猶如秋云，白凈，清凈，明凈，閃耀金光，
世尊諸根愉悅，臉色清凈，膚色明凈，閃耀金光。
「世尊啊，又如熟練的工匠或工匠徒弟將閻浮金子放入熔爐，精心加工后，放在白布上，極其潔凈明亮，閃耀金光，
世尊諸根愉悅，臉色清凈，膚色明凈，閃耀金光。
「世尊啊，我以前確實未曾見到如來諸根這樣愉悅，臉色膚色這樣明凈，閃耀金光。
「世尊啊，我產生這樣的想法：
啊，如來今天住于佛所住①,住于勝者②所住，住于一切智性所住。
啊，如來今天住于大勇士③所住,
憶念過去、未來和現在的如來、阿羅漢、正等覺④。」
^ck9
聞聽此言，世尊對尊者阿難說道：「很好，很好，阿難！
是諸神或者諸佛世尊告知你此事，
還是你自己運用觀察智知道此事？」
^ck10
聞聽此言，尊者阿難對世尊說道：「世尊！諸神沒有，
諸佛世尊也沒有告知我此事，
而是我自己運用觀察智，產生這樣的想法：
如來今天住于佛所住，住于勝者所住，住于一切智所住。
啊，如來今天住于大勇士所住，憶念過去、未來和現在的一切佛世尊。」
^ck11
聞聽此言，世尊對尊者阿難說道：
「很好，很好，阿難!你問得確實很好，善于觀察，富有辯才。
阿難啊，你是為了眾人的利益，為了眾人的幸福，出于憐憫世界，為了大眾，為了眾神和眾人的利益和幸福，
而覺得應該詢問如來此事。
^ck12
「正是這樣，阿難啊，可以從無量無數的如來、阿羅漢、正等覺那里汲取知見，而如來的知見不會減損。
為什么？阿難啊，因為如來的知見①無礙無損。
^ck13
「阿難啊，如果如來愿意，只要食用一餐飯，
就能生活一劫，或一百劫，一千劫，十萬劫，乃至百千千萬那由多②劫或更多劫，
而如來的諸根不會毀損，臉色不會變樣，膚色也不會受損。
為什么？阿難啊，因為如來通曉入定門。
^ck14
「阿難啊，正等覺出世難得，
猶如優曇花在這世上難得一現。
阿難啊，熱愛義理、尋求利益、大慈大悲的如來出世難得。
^ck15
「尊者阿難啊，這正是如來的威力，
為了一切世界導師能出現在眾生世界上，你覺得應該為眾菩薩大士向如來詢問此事。
因此,阿難啊，請聽！請你好好專心聽，我為你解說。
"尊者阿難回答世尊道：「好吧，世尊！」
^ck16
世尊對他說道：「阿難啊，從前，離今世無數劫、比無數劫更久遠的、不可思議的無數劫過去世，
那時候，一位名為燃燈的如來、阿羅漢、正等覺出世。
阿難啊，繼燃燈佛之后，有另一位名為光熱的如來，
之后有另一位名為放光的如來，
之后有另一位名為旃檀香的如來，
之后有另一位名為如須彌的如來。
^ck17
「就這樣，依次還有名為月面，
名為凈面，
名為無染，
名為凈光，
名為蛇勝，
名為日面，
名為山王聲，
名為須彌頂，
名為金光，
名為星辰光，
名為琉璃光，
名為梵聲，
名為月勝，
名為日音，
名為解脫花莊嚴光，
名為吉祥頂①，
名為大海妙覺游戲神通，
名為妙光，
名為大香王光，
名為離污垢障礙，
名為勇士頂，
名為舍寶，
^ck18
「名為持大功德覺神通，
名為映蔽日月，
名為炎琉璃光,
名為心流覺花綻放，
名為花叢林王綻放神通，
名為花盛開，
名為如水月，
名為破除無知黑暗，
名為世間主，
名為珍珠珊瑚華蓋①，
名為帝沙，
名為法意歡喜王，
名為獅海頂歡喜王，
名為海須彌月，
名為梵音聲歡喜，
名為開花，
^ck19
「名為得軍，
名為月光明，
名為須彌頂，
名為月光，
名為凈眼，
名為山王聲自在，
名為花光，
名為散花雨②，
名為寶華蓋，
名為蓮花叢莊嚴③，
名為多伽羅香，
名為寶光，
名為變化，
名為大莊嚴，
名為離憎恨，
名為梵聲，
名為七寶雨，
名為持大德，
名為大多摩羅樹葉旃檀泥，
名為花神通，
名為破除無知，
名為獅子，
名為珍珠華蓋,
名為金藏，
^ck20
「名為琉璃藏，
名為大幢，
名為法幢，

名為寶吉祥，
名為人主，
名為世間主，
名為慈憫，
名為世間美，
名為梵幢，
名為法意，
名為獅子，
名為獅子意。
^ck21
阿難啊，繼獅子意之后，有另一位名為世間自在王的如來、阿羅漢、正等覺出世，是明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊①。
^ck22
「在世間自在王如來、阿羅漢、正等覺說法時，有一位比丘名為法藏，
記憶力強，行為端正，聰明睿智，勇猛精進，信仰虔誠。
^ck23
「那時，阿難啊，法藏比丘從座位起身，偏袒右肩，右膝著地，
向世間自在王如來合掌行禮，向世尊行禮后，當面用這些偈頌贊美道：
^ck24
光芒無量，智慧無窮，無與倫比，
這里的其他任何光芒不再閃耀，
太陽和摩尼珠光輝，月亮的光芒，
在一切世界上不再發光和閃耀。（1）
^ck25
在眾生精英中，容貌絕妙，
同樣，佛音也是無限聲，
持戒、入定、智慧和精進，
在這世上也是無與倫比。（2）
^ck26
正法深邃、廣大又微妙，
佛陀不可思議如同大海，
因此，導師沒有任何驕慢,
已經拋棄瞋怒，到達彼岸。（3）
^ck27
優秀的佛陀威力無限，
王中王光輝遍照十方①，
我也將成為法王佛陀，
拯救眾生，擺脫老死②。(4)
^ck28
布施、調伏、持戒、安忍、精進、
靜慮、入定和智慧，
依靠這些，我發至高誓愿：
我將成佛，救護一切眾生。（5）
^ck29
百千千萬眾多佛陀，
如同恒河沙數無限，
為求吉祥殊勝菩提②，
我敬拜所有的救主。（6）
^ck30
眾多世界如同恒河沙，
其中還有無窮的國土，
我將在各處釋放光芒，
因為我有這樣的威力。（7）
^ck31
我的國土優美絕頂，
里面裝飾有殊勝道場②，
涅槃世界③其樂無窮，
我用非有性④凈化這里。（8）
^ck32
眾生從十方來到這里,
很快就獲得幸福快樂，
佛陀在這里是我的證人：
我有意愿和真實精進力。（9）
^ck33
十方世間解和無礙智②，
他們始終知道我的心，
即使永遠住在阿鼻獄③，
我的愿力也不會退轉。(10)
^ck34
「阿難啊，法藏比丘用這些偈頌當面贊美世尊世間自在王如來后，說道：
‘世尊啊，我渴望證得無上正等菩提。
我的心一次又一次轉向無上正等菩提。
^ck35
「'請世尊為我說法，讓我迅速證得無上正等菩提。
但愿我成為世上無與倫比的如來。
請世尊向我說明種種情況，我可以掌握佛土具備的所有功德莊嚴。'
^ck36
「聞聽此言，阿難啊，世尊世間自在王如來對法藏比丘說道：
'比丘啊，你可以自己掌握佛士具備的種種功德莊嚴。
'他說道：'世尊啊，我不能。
還是請世尊為我解說其他如來佛土具備的種種功德莊嚴吧！
聽取之后，我們將實現這一切。'
^ck37
「然后，阿難啊，世間自在王如來、阿羅漢、正等覺了解這位比丘的心愿。
這位世尊如來熱愛義理，尋求利益，滿懷慈悲，對眾生心生大慈悲，為了佛法①不斷絕，宣示、講解和說明八十一百千千萬那由多佛的佛土具備的種種功德莊嚴，歷時整整一千萬年。
這位世尊如來的壽命長達整整四十二劫。
^ck38
「于是，阿難啊，法藏比丘在一個佛土掌握了所有八十一百千千萬那由多佛的佛土具備的種種功德莊嚴。
他向世尊世間自在王如來俯首行觸足禮，右繞三匝后，從世尊身邊離去。
^ck39
「此后五劫，他掌握了十方一切世界尚未實行的更美好、更美妙的佛士具備的功德莊嚴，發起弘大誓愿。
^ck40
「這樣，阿難啊，他掌握了世尊世間自在王如來講述的八十一百千千萬那由多佛土的成就，進而又掌握了更加無比優美和微妙的④佛土成就。
于是，他走近這位如來，向這位世尊俯首行觸足禮，說道：
‘世尊啊，我已經掌握佛士具備的種種功德莊嚴。'
^ck41
「聞聽此言，阿難啊，世間自在王對這位比丘說道：
'那么，比丘啊，請說吧！如來贊許①。
就在這時，比丘啊，讓會眾高興，心生喜悅，請發出獅子吼吧!
眾菩薩大士聞聽后，在現在世和未來世，都會掌握這樣的成就佛土的種種誓愿。'
^ck42
「于是，阿難啊，法藏比丘就在這時對世尊說道：
'那么，世尊請聽我的殊勝誓愿：
我證得③無上正等菩提后，我的佛土將具備種種不可思議的功德莊嚴：
^ck43
一、世尊啊，如果在我的佛土中，
有地獄、畜生、餓鬼或阿修羅，
那么，我就沒有證得無上正等菩提！
^ck44
二、世尊啊，如果在我的佛土中，
眾生出生後，再次死去，或進入地獄，或成為畜生、餓鬼或阿修羅，
那么，我就沒有證得無上正等菩提！
^ck45
三、世尊啊，如果在我的佛土中，
眾生出生後，他們不是全都同一色，即金色，
那么，我就沒有證得無上正等菩提！
^ck46
四、世尊啊，如果在我的佛土中，
能感知神和人的不同，除非只是按照習慣用語說起神和人，
那么，我就沒有證得無上正等菩提！
^ck47
五、世尊啊，如果在我的佛土中，
眾生出生後，全都不能徹底通曉神通⑤自在，
乃至一念剎那瞬間越過百千千萬那由多佛土，
那么，我就沒有證得無上正等菩提！
^ck48
六、世尊啊，如果在我的佛土中，
眾生出生後，全都沒有宿命通，
乃至能回憶百千千萬那由多劫，
那么，我就沒有證得無上正等菩提！
^ck49
七、世尊啊，如果在我的佛土中，
眾生出生後，全都沒有獲得天眼通，
乃至能目睹百千千萬那由多世界，
那么，我就沒有證得無上正等菩提！
^ck50
八、世尊啊，如果在我的佛土中，
眾生出生後，全都沒有獲得天耳通，
乃至能同時聞聽百千千萬那由多佛士宣說的正法，
那么，我就沒有證得無上正等菩提！
^ck51
九、世尊啊，如果在我的佛士中，
眾生出生後，全都沒有通曉他心通，
乃至能了解出生在百千千萬那由多佛土的眾生的心思,
那么，我就沒有證得無上正等菩提！
^ck52
十、世尊啊，如果在我的佛土中，
眾生出生後，他們有任何執著的想法，乃至執著自己的身體，
那么，我就沒有證得無上正等菩提！
^ck53
十一、世尊啊，如果在我的佛土中，
眾生出生後，全都不住于正定①，乃至達到大般涅槃②，
那么，我就沒有證得無上正等菩提！
^ck54
十二、世尊啊，如果在我的佛士中，
若有任何眾生能計算我證得無上正等菩提后的聲聞數量，
乃至三千大千世界中所有成為辟支佛的眾生，用百千千萬那由多劫，而能計算出，
那么，我就沒有證得無上正等菩提！
^ck55
十三、世尊啊，如果我證得無上正等菩提后，
我的光芒只限于這個佛土，
乃至只限于百千千萬那由多佛土，
那么，我就沒有證得無上正等菩提！
^ck56
十四、世尊啊，如果在我的佛士中，我證得無上正等菩提后，
眾生的壽命有限，除了懷有誓愿者②，
那么，我就沒有證得無上正等菩提！
^ck57



^ck58
十五、世尊啊，如果我證得無上正等菩提后，
我的壽命有限①，乃至只限于百千千萬那由多劫，
那么，我就沒有證得無上正等菩提！
^ck59
十六、世尊啊，如果我證得菩提后，在這個佛土中，
眾生有被稱為不善者，
那么，我就沒有證得無上正等菩提！
^ck60
十七、世尊啊，如果我證得菩提后，
無量佛土中的無量無數佛世尊不稱揚我的名號，不贊美，不稱頌，不宣說，不共同宣說,
那么，我就沒有證得無上正等菩提！
^ck61
十八、世尊啊，如果我證得菩提后，
其他世界的眾生發起無上正等菩提①心后，
聞聽我的名號，內心愉悅，憶念我，
而如果在他們臨終時，我不由眾比丘圍繞恭敬，出現在他們面前，即讓他們心不散亂，
那么，我就沒有證得無上正等菩提！
^ck62
十九、世尊啊，如果我證得菩提后，
無量無數佛土的眾生聞聽我的名號，一心向往這里的佛土，積累善根用于求得往生，
乃至十次發起心愿，而不出生在這里的佛土，除了那些犯有五無間罪②、毀謗和阻礙正法者，
那么，我就沒有證得無上正等菩提！
^ck63




^ck64



^ck65
二十、世尊啊，如果我證得菩提后，
眾菩薩出生在這里的佛土①，而全都不具有三十二大人相②，
那么，我就沒有證得無上正等菩提！
^ck66
二十一、世尊啊，如果我證得菩提后，
眾生出生在這里的佛土，全都不成為證得無上正等菩提的一生補處③，除了那些發起殊勝誓愿的菩薩大士，他們身披大鎧甲④，為一切眾生的利益而披甲，為一切眾生的利益而盡力，盡力讓一切眾生達到涅槃，樂意在一切世界實施菩薩行，樂意供奉一切佛，讓恒河沙數的眾生安住無上正等菩提，進而他們趨向至上行，遵循普賢行⑤，
那么，我就沒有證得無上正等菩提！
^ck67
二十二、世尊啊，如果我證得菩提后，
眾菩薩出生在這個佛土，而全都不能在一頓早餐時間中，前往其他佛士，用一切舒適的用具即依靠佛陀的威力，供奉數百佛、數千佛、數十萬佛、數千萬佛，乃至百千千萬那由多佛，
那么，我就沒有證得無上正等菩提！
^ck68
二十三、世尊啊，如果我證得菩提后，
在這里的佛土，眾菩薩希望伴隨這些形相增長①善根，
即金、銀、摩尼珠、珍珠、琉璃、貝殼、玉石、珊瑚、水晶、瑪瑙、赤珠、翡翠等，或者其他一切寶石，一切花、香料、花環、油膏、香粉、衣服、傘蓋、旗幟、幢幡和燈等，一切舞蹈、歌曲和樂器等，而不能心中一想就如愿出現，
那么，我就沒有證得無上正等菩提！
^ck69
二十四、世尊啊，如果我證得菩提后，
眾生出生在這里的佛土，而全都不能談論具有一切智的法，
那么，我就沒有證得無上正等菩提！
^ck70
二十五、世尊啊，如果我證得菩提后，
在這里的佛土，眾菩薩產生這樣的心愿：
我們住在這個世界，應該用衣服、飲食、床座、治病藥物和用具，鮮花、香料、花環、油膏、香粉、衣服、傘蓋、旗幟和幢幡，各種舞蹈、歌曲、樂器和寶石雨，供奉、敬重、尊敬和崇拜無量無數佛土中的佛陀，
而那些佛世尊不心懷憐憫，接受這些心中一想就出現的禮物，
那么，我就沒有證得無上正等菩提！
^ck71
二十六、世尊啊，如果我證得菩提后，
眾菩薩出生在這個佛土，而全都不獲得堅如那羅延①的金剛身體和威力，
那么，我就沒有證得無上正等菩提！
^ck72
二十七、世尊啊，如果我證得菩提后，
在這里的佛土，有任何眾生能掌握莊嚴美色的限度，乃至能用天眼②識別各種美色，說清這個佛士有這樣多的美色，這樣多的莊嚴，
那么，我就沒有證得無上正等菩提！
^ck73
二十八、世尊啊，如果我證得菩提后，
在這里的佛土，有菩薩即使只具有少量善根，而不能感知高一千六百由旬、色彩絢麗的菩提樹，
那么，我就沒有證得無上正等菩提！
^ck74
二十九、世尊啊，如果我證得菩提后，
在這里的佛土，任何眾生都會宣說和誦習，而他們全都沒有獲得無礙慧，
那么，我就沒有證得無上正等菩提！
^ck75



^ck76
三十、世尊啊，如果我證得菩提后，
這個佛士沒有這樣的光輝，能照見周邊無量無數、不可思議、無比、無限的所有佛土，猶如明凈圓鏡照見圓臉，
那么，我就沒有證得無上正等菩提！
^ck77
三十一、世尊啊，如果我證得菩提后，在這里的佛土，
沒有數十萬各種芳香的香罐，用各種寶石制成，始終熏有香氣，盛有勝過從地上至空間的神界和人界出產的香料，天天供奉如來和菩薩①，
那么，我就沒有證得無上正等菩提！
^ck78
三十二、世尊啊，如果我證得菩提后，在這里的佛土，
不經常降下各種芳香的寶石花雨，不經常出現演奏美妙動聽音樂的樂音云，
那么，我就沒有證得無上正等菩提！
^ck79
三十三、世尊啊，如果我證得菩提后，
我的光芒遍布無量無數、不可思議、無比世界的眾生，
而他們全都不獲得勝過神和人的快樂，
那么，我就沒有證得無上正等菩提！
^ck80
三十四、世尊啊，如果我證得菩提后，周邊無量無數、不可思議、無比、無限的所有佛士中的
菩薩聞聽我的名號，憑這聞聽產生的善根，轉生后不能獲得陀羅尼，乃至不能到達菩提道場①，
那么，我就沒有證得無上正等菩提！
^ck81
三十五、世尊啊，如果我證得菩提后，周邊無量無數、不可思議、無比、無限的所有佛土中的
婦女聞聽我的名號，心生愉悅,
發起菩提心，厭棄女身，
而轉生后又都再次獲得女身，
那么，我就沒有證得無上正等菩提！
^ck82
三十六、世尊啊，如果我證得菩提后，
周邊十方無量無數、不可思議、無比、無限的所有佛士中的
菩薩聞聽我的名號，五體投地敬拜②，
而在實施菩薩行時，不受到包括天神在內的世界禮敬③，
那么，我就沒有證得無上正等菩提！
^ck83



^ck84
三十七、世尊啊，如果我證得菩提后，
有任何菩薩必須要做浣洗、晾干和縫制衣服以及為衣服染色之事，
而不感知自己始終穿有如來贊許的、心中一想就產生的嶄新寶衣，
那么，我就沒有證得無上正等菩提！
^ck85
三十八、世尊啊，如果我證得菩提后，
在這里的佛士一同出生的眾生不獲得這樣的快樂，猶如擺脫煩惱、達到第三禪③的阿羅漢比丘，
那么，我就沒有證得無上正等菩提！
^ck86
三十九、世尊啊，如果我證得菩提后，
眾菩薩出生在這里的佛土，
不能感知⑤各種寶樹產生如他們所希望的佛士功德莊嚴，
那么，我就沒有證得無上正等菩提!
^ck87
四十、世尊啊，如果我證得菩提后，
出生在其他佛士的菩薩聞聽我的名號，而根力仍有欠缺①，
那么，我就沒有證得無上正等菩提！
^ck88
四十一、世尊啊，如果我證得菩提后，
住于其他佛士的菩薩聞聽我的名號，不隨之獲得名為善分身②的入定，
菩薩處于這種入定，能一剎那間目睹無量無數、不可思議、無比、無限的佛世尊；
同時，他們的入定中斷消失，
那么，我就沒有證得無上正等菩提！
^ck89
四十二、世尊啊，如果我證得菩提后，
眾生聞聽我的名號，不能憑聞聽獲得的善根，
出生在高貴的家族，乃至到達菩提道場，
那么，我就沒有證得無上正等菩提！
^ck90
四十三、世尊啊，如果我證得菩提后，
其他佛土的眾生聞聽我的名號，全都不能憑聞聽獲得的善根，
在菩薩行中獲得伴隨有歡喜愉悅的善根，乃至達到菩提，
那么，我就沒有證得無上正等菩提!
^ck91
四十四、世尊啊，如果我證得菩提后，
其他佛士的菩薩聞聽我的名號，不獲得名為普遍①的入定，
菩薩處在這種入定，能一剎那間供奉無量無數、不可思議、無比、無限的佛世尊；
同時在達到菩提道場之前，他們的入定中斷②消失，
那么，我就沒有證得無上正等菩提！
^ck92
四十五、世尊啊，如果我證得菩提后，
眾菩薩出生在這里的佛土，希望聞聽說法，
而不能心中一想就如愿聞聽說法，
那么，我就沒有證得無上正等菩提！
^ck93
四十六、世尊啊，如果我證得菩提后，
在這里的佛土，其他佛士的菩薩聞聽我的名號，③
不能憑聞聽名號，達到安住無上正等菩提不退轉，
那么，我就沒有證得無上正等菩提！
^ck94
四十七、世尊啊，如果我證得菩提后，
在這里的佛土，菩薩聞聽我的名號，
不能憑聞聽名號，獲得第一、第二和第三忍①，不能達到安住佛法不退轉②，
那么，我就沒有證得無上正等菩提！③'"
^ck95
「阿難啊，法藏比丘宣示這些殊勝誓愿后，就在這時，依靠佛陀的威力，誦出這些偈頌：
^ck96
人主啊，如果我證得菩提，
不實現這些殊勝的誓愿①，
就不是具十力的眾生精英，
不值得接受無比的供奉。（1）
^ck97
如果在我的這個佛土中，
窮苦人不享有神奇美妙，
不獲得幸福而陷入痛苦，
我就不成為人中珍寶王。③（2）
^ck98
如果我到達菩提道場之后,
我的名號不迅速傳遍十方，
不傳遍廣大無邊的眾佛土，
我就不是具有威力的世主。①（3）
^ck99
在證得無比光輝的菩提后，
如果我仍然貪著沉迷愛欲，
而缺乏憶念、慧覺和悟力，
我就不是具有威力的導師。（4）
^ck100
世主的廣大光輝無比無限，
遍照十方的所有佛陀國土，
平息貪欲和一切癡迷瞋怒③,
平息地獄道中的炎炎烈火。（5）
^ck101
他長有明亮可愛的大眼，
驅除所有人的愚癡黑暗，
他除盡一切災難和不幸，
指引光輝無比的天國道。（6）
^ck102
空中光輝的日月不閃耀，
還有天神似火的珠寶光，
人主的光芒蓋過這一切，
已完成前期修行而純潔。（7）
^ck103
十方沒有這樣的英杰，
他是一切受苦者的寶藏，
已經圓滿完成百千善業，
在集會上發出佛獅子吼。（8）
^ck104
已供奉過去世自在勝者，
實施無數千萬苦行誓愿，
這位人中精英追求③智蘊，
這位人中俊杰充滿愿力。（9）
^ck105
世尊啊，正如人主具有
無礙慧見，知道三種有為①，
愿我也受到同樣的②供奉，
成為優秀智者，人中導師。(10)
^ck106
人主啊，在我證得菩提后，
如果這樣的誓愿獲得實現，
愿這大千世界搖晃震動，
眾天神從空中撒下花雨。」③(11)
^ck107
大地搖晃震動，花雨降下，
空中樂器奏響，數以百計，
天國可愛的旃檀香粉飄撒，
發出話音：「佛陀將出世。」(12)
^ck108
「阿難啊，這位法藏比丘，菩薩大士，具有這樣充足的誓愿。
阿難啊，很少菩薩具有這樣充足的誓愿。
這樣充足的誓愿很少在世上出現。
縱然很少，但不是全然沒有。
^ck109
「還有，阿難啊，這位法藏比丘在世尊世間自在王如來前,在包括神、人、摩羅和梵天的世界前，在包括沙門、婆羅門、神、人和阿修羅的眾生前，宣示這樣的殊勝誓愿后，如實實施誓愿。
「他要這樣造就佛土清凈，佛土偉大，佛土優美。
他奉行菩薩行，在無量無數、不可思議、不可等同、不可衡量、不可計量、不可言狀的百千千萬那由多年中，
不懷有任何愛欲、瞋怒和殺生的邪念②，
不產生任何愛欲、瞋怒和殺生的想法，
不產生任何色、聲、香、味和觸的想法。
^ck110
「他年輕，迷人，柔順，容易相處，有耐心，容易滿足,容易供養，少欲知足，隱居，
不作惡，不愚癡，不諂諛，不虛偽，不狡猾①，不虛妄，快樂，甜蜜，言談可愛，始終精進努力，追求白法②，不卸下重擔，為了一切眾生的利益，履行大誓愿。
他尊敬佛、法、僧、老師、教師和善友，始終披戴鎧甲，奉行菩薩行。
他正直，溫順，不欺瞞，不嚼舌，有品德，帶領一切眾生修行善法，安住空、無相、無愿、無為和無生。
他不驕傲，守護自己的言語。
他奉行菩薩行，摒棄害己害人的口業，而只說于己于人愉快有益的言語。
^ck111
「他就是這樣聰明睿智。他進入村莊、城鎮、國土、王國和王都，不受色、聲、香、味、觸和法牽引。
他無所障礙，奉行菩薩行。親自實行布施波羅蜜，也教他人實行；
親自實行持戒、安忍、精進、禪定和智慧波羅蜜，也教他人實行。
他積累這樣的善根。他具有這樣的善根，無論出生在哪里，那里的大地都會展現數百千千萬那由多寶藏。
^ck112
「他奉行菩薩行，讓無量無數百千千萬那由多眾生安住無上正等菩提，難以用言語算出他們的極限。
無量無數佛世尊受到供奉、敬重、尊敬和崇拜，獲得衣服、飲食、床座、治病藥物和用具，一切舒適的用品和愉快的感受。
讓那樣多的眾生出生在商主、長者、大臣①、剎帝利、婆羅門和富豪家族，難以用言語算出他們的極限。
同樣，讓他們成為瞻部洲王、轉輪王、護世天王、帝釋天、蘇夜摩天、商兜率天、善化天、自在天王②和大梵天③。
無量無數的佛世尊受到供奉、敬重、尊敬和崇拜，接受勸請④轉動法輪，難以用言語算出他們的極限。
^ck113
「他修行⑦這樣的善業，也就是他在無量無數、不可思議、不可等同、不可衡量、不可計量、不可言狀的百千千萬那由多劫中，奉行菩薩行⑧，從他口中呼出的旃檀香氣勝過天國的香氣，全身每個毛孔都散發蓮花香，令一切世界喜歡。
他端莊可愛，具有一切無與倫比的美妙容貌。
「他的身體具有一切妙相和隨好②。
從每個毛孔和手掌中產生一切寶石裝飾品，產生一切衣服和布料，產生一切鮮花、香料、花環、油膏、傘蓋、旗幟和幢幡，產生一切音樂和歌曲。
從他的手掌中也流出一切食物、飲料和可嚼、可吃、可啜的美味。
阿難啊，因為這位法藏比丘此前奉行菩薩行③，已經通曉和掌握一切生活用品。」
^ck114
聞聽此言，尊者阿難對世尊說道：
「那么，世尊啊，這位法藏菩薩大士證得無上正等菩提后，已經離去，進入涅槃，或者還沒有成為正等覺，或者現在是正等覺，如今還居住、生活、度日和說法嗎？」
^ck115
世尊說道：「阿難啊，這位如來沒有離去，也不是尚未來到。
這位如來證得無上正等菩提，如今還居住、生活、度日和說法。
在西方，與這里相隔百千千萬那由多佛士的極樂世界，名為無量光的如來、阿羅漢、正等覺，無數菩薩圍繞，無數聲聞恭敬，具有無限圓滿佛土。
^ck116
















^ck117
「他的光芒無量，難以計量出極限。
他的光芒遍照如此多的佛土，如此數百佛土，如此數千佛土，如此數十萬佛土，如此數千萬佛土，如此數百千萬佛土，如此數千千萬佛土，如此數百千千萬佛土,如此數百千千萬那由多佛土。
^ck118
「阿難啊，簡而言之，世尊無量光如來的光芒①永遠遍照東方恒河沙數的數百千千萬那由多佛土。
同樣，世尊無量光如來的光芒永遠遍照南、西、北、上、下和四維所有方位恒河沙數的數百千千萬那由多佛土。
除了那些佛世尊，憑借他們以前的誓愿威力，用一尋②光芒，一、二、三、四、五、十、二十、三十、四十由旬③光芒，一百由旬光芒，一千由旬光芒，十萬由旬光芒，乃至數百千千萬那由多由旬光芒，照耀世界。④
^ck119
「阿難啊，世尊無量光如來的光芒⑤不可比擬，不可計量。
阿難啊，由此緣故，這位如來稱為無量光，
也稱為無量光明，無量光照，無邊光，無著光，無礙光，
永放光，天珠光，無礙光王光，迷人光，
可愛光，歡喜光⑥，喜悅光，瞻仰光，
不斷光，不可思議光，無比光，蔽國王和阿修羅王光，
映蔽日月光，映蔽護世天王、帝釋天、梵天、凈居天、大自在天和一切天神光，超越一切光。
^ck120
「他的光芒純潔，廣大，令人身體快樂，內心喜悅，令天神、阿修羅、蛇、夜叉、健達縛、金翅鳥、大蛇、緊那羅、人和非人愉悅、歡喜和快樂，
也令其他無邊無沿佛土中一心向善的眾生的強健、敏捷和清澈的知覺愉悅。

^ck121

「阿難啊，由此緣故，如來①稱述無量光如來的業績，從光芒說起，說上整整一劫，也不能說盡他的光芒的功德。而這也無損于如來的無畏②。
為什么？阿難啊，因為這位世尊的光芒功德威力和如來的無上智慧辯才，兩者都無數、無邊和不可思議。

^ck122
「還有，阿難啊，無量光如來的聲聞無量無數，難以計算：
如此千萬聲聞，如此百千萬聲聞，如此千千萬聲聞，如此百千千萬聲聞，如此甄迦羅，如此頻跋羅，如此那由多，如此阿由多，如此阿婆，如此毗婆訶，如此須羅多，如此迦耶③，如此無量，如此無數，如此無計，如此無比，如此不可思議。



^ck123
「阿難啊，譬如目犍連比丘具有神通自在，
只要愿意，他可以在一日一夜，計算出三千大千世界中那樣多的各種星星的總數。
那么，如果有百千千萬那由多具有同樣神通的人，
讓他們用百千千萬那由多年，不做其他的事，計算無量光如來初次集會中的聲聞，
他們也不能算出其中的百分之一，千分之一，乃至十萬分之一，也無法比喻，無法比擬。
^ck124
「阿難啊，又如深廣八萬四千由旬的無邊大海，有人將毛發尖梢分出百分之一，從大海中沾取一滴水，
那么，阿難啊，你認為用百分之一毛發尖梢沾取的一滴水，與大海剩下的水量相比，哪個更多？」
^ck125
阿難說道：「世尊啊，一千由旬也只是大海的一小部分,更何況用毛發尖梢沾取的一滴水。」
世尊說道：「初次集會如同這一滴水，
那些與目犍連同樣的比丘用百千千萬那由多年計算，
那么，如同大海中剩余的水量，只能認為不可計算。
何必再說第二和第三次等等集會中的聲聞。
正是這樣，這位世尊的聲聞無限無邊，只能稱為'無量無數'。
^ck126
「還有，阿難啊，世尊無量光如來的壽命無量，難以計量：
如此多①的劫，如此百劫，如此千劫，如此十萬劫，如此千萬劫，如此百千萬劫，如此千千萬劫，如此百千千萬劫，如此百千千萬那由多劫。
因此，阿難啊，這位世尊的壽命無量無限。
因此，這位如來稱為'無量壽'。
^ck127
「阿難啊，按照這個世界計算劫的習慣用語，世尊無量壽如來出世和證得無上正等菩提后，至今已有十劫。
「還有，阿難啊，世尊無量光如來的世界名為極樂，富裕，繁榮，安寧，富饒，可愛，充滿天神和人。
阿難啊，在這個世界，沒有地獄，沒有畜生，沒有餓鬼，沒有阿修羅，沒有災難和不幸降臨。
在極樂世界里，也沒有在這個世界里常見的那些寶石。
「阿難啊，在這個極樂世界里，各種香氣彌漫，各種花果茂盛，裝飾有各種寶樹，還有如來幻化的各種鳥禽出沒，鳴聲婉轉動聽。
^ck128
「阿難啊，這些寶樹多姿多彩，呈現數百千種顏色：
有金制金色的寶樹，
有銀制銀色的，
有琉璃制琉璃色的，
有水晶制水晶色的，
有瑪瑙制瑪瑙色的，
有赤珠制赤珠色的，
有翡翠制翡翠色的。

^ck129
「也有一些金銀雙寶的①寶樹，
一些金、銀和琉璃三寶的，
一些金、銀、琉璃和水晶四寶的，
一些金、銀、琉璃、水晶和瑪瑙五寶的，
一些金、銀、琉璃、水晶、瑪瑙和赤珠六寶的，
一些金、銀、琉璃、水晶、瑪瑙、赤珠和翡翠七寶的。
^ck130
「阿難啊，在這里，金制的金樹，根、干、條、枝、葉和花金制，果銀制；
銀制的銀樹，根、干、條、枝、葉和花銀制，果琉璃制；
琉璃制的琉璃樹，根、干、條、枝、葉和花琉璃制，果水晶制；
水晶制的水晶樹，根、干、條、枝、葉和花水晶制，果瑪瑙制；

瑪瑙制的瑪瑙樹，根、干、條、枝、葉和花瑪瑙制，果赤珠制；
赤珠制的赤珠樹，根、干、條、枝、葉和花赤珠制，果翡翠制；
翡翠制的翡翠樹，根、干、條、枝、葉和花翡翠制，果金制。

^ck131
「阿難啊，有些樹金根、銀干、琉璃條、水晶枝、瑪瑙葉、赤珠花和翡翠果。
阿難啊，有些樹銀根、琉璃干、水晶條、瑪瑙枝、赤珠葉、翡翠花和金果。
阿難啊，有些樹琉璃根、水晶干、瑪瑙條、赤珠枝、翡翠葉、金花和銀果。
阿難啊，有些樹水晶根、瑪瑙干、赤珠條、翡翠枝、金葉、銀花和琉璃果。

「阿難啊，有些樹瑪瑙根、赤珠干、翡翠條、金枝、銀葉、琉璃花和水晶果。
阿難啊，有些樹赤珠根、翡翠干、金條、銀枝、琉璃葉、水晶花和瑪瑙果。
阿難啊，有些樹翡翠根、金干、銀條、琉璃枝、水晶葉、瑪瑙花和赤珠果。


阿難啊，有些樹七寶根、七寶干、七寶條、七寶枝、七寶葉、七寶花和七寶果。
「阿難啊，所有這些樹的根、干、條、枝、葉、花和果柔軟，觸感舒服，芳香，
遇到風兒吹拂，就會發出甜蜜可愛的聲響，悅耳迷人，百聽不厭。
^ck132
「阿難啊，這個佛士永遠遍布這樣的七寶樹，圍繞有七寶芭蕉稈，成排成排的七寶多羅樹，到處覆蓋有金網和七寶蓮花。
其中有半由旬大的蓮花，還有一由旬大的，二、三、四和五由旬大的，乃至十由旬大的。
「所有這些寶蓮花都放射三萬六千千萬道光芒。
所有這些光芒中都出現三萬六千千萬佛，個個具有金身和三十二大人相，前往東方無量無數世界，為眾生說法。
同樣，也前往南方、西方、北方、上方、下方和四維無量無數世界①，為眾生說法。
^ck133








^ck134
「還有，阿難啊，這個佛士沒有任何黑山，沒有任何寶山，沒有任何山王須彌山，沒有任何山王輪圍山和大輪圍山，也沒有任何大海。
這個佛土處處平坦，可愛，如同手掌，地面鑲嵌各種寶石。」
^ck135
聞聽此言，尊者阿難對世尊說道：「那么，世尊啊，住在須彌山的四大天王和住在須彌山頂的三十三天住在哪兒呢？」
世尊說道：「阿難啊，那你認為住在須彌山上方的夜摩天、兜率天、化自在天、他化自在天、梵眾天、梵輔天、大梵天，乃至阿迦尼吒天，他們住在哪兒呢？」
阿難說道：「世尊啊，業果和業行不可思議」。
世尊說道：「阿難啊，你覺得業果和業行不可思議。而佛世尊的佛威力并非不可思議。種植善根、積累功德的眾生的福德威力不可思議①。」
^ck136
阿難說道：「世尊啊，我對此并不懷疑，也無疑惑或猶疑。
我只是為破除未來眾生的懷疑、疑惑或猶疑，而詢問如來這個問題。」
世尊說道：「很好，很好，阿難啊，你應該這樣做。
^ck137
阿難啊，在這個極樂世界里，有各種各樣河流，
其中有一由旬寬的大河,
乃至二十、三十、四十和五十由旬寬，乃至十萬由旬寬，十二由旬深。
所有這些河流水流歡快，飄逸各種芳香，充滿裝點各種寶石的花叢,發出各種甜蜜聲響。
^ck138



^ck139
「阿難啊，這些大河發出的聲響，如同熟練的樂師演奏由百千千萬種部件組成的樂器，奏出迷人的天國樂曲。
這樣可愛的聲響深沉，可感可知，純凈，悅耳，動人心扉，可愛，美妙迷人，順耳,百聽不厭，
'無常①、寂靜和無我'之聲悅耳，傳入眾生耳中。

^ck140
「還有，阿難啊，在這些大河的兩岸，綿延各種香樹，各種枝葉花簇下垂。
這里的眾生在這些河的岸邊，想要體驗天國超凡脫俗的欲樂游戲，


進入這里的河中，水便按照他們的愿望停留在腳踝，
或者按照他們的愿望停留在膝部、臀部、脅部或頸部，天國的欲樂展現。
在這里，眾生希望水涼，水就變涼；
希望水熱，水就變熱；
希望水又涼又熱，水就變得又涼又熱，隨他們的喜歡。


^ck141
「這些大河水流充沛，散發天國多摩羅樹葉、沉水香、安息香、多伽羅香和烏洛迦娑羅旃檀香的芳香，
覆蓋天國青蓮花、紅蓮花、黃蓮花、白蓮花和香蓮花，
河邊沙灘上有如來幻化的鳥禽成群出沒,天鵝、仙鶴、輪鳥、迦蘭陀鳥、鸚鵡、句鳥鶴、杜鵑、鳩那羅鳥、迦陵頻伽鳥和孔雀鳴聲婉轉動聽①，
還裝飾有黑嘴鵝②，河沿平正，不沾污泥，遍布金沙。
這里的眾生心中希望實現什么樣的心愿，他們的正當心愿就會那樣實現。
^ck142
「阿難啊，水流傳出的聲響這樣可愛，整個佛士都能感知。
這里的眾生站在河岸邊，如果他們愿意這種聲響不傳入③耳中，就不會傳入他們即使具有天耳通的耳中。
如果他們愿意聽到這樣的聲響,他們就會聽到這樣可愛的聲響。
^ck143
「聽到諸如佛聲，法聲，僧聲，波羅蜜聲，十地①聲，十力聲，無畏聲，不共佛法②聲，神通聲，無礙慧聲，
空、無相、無愿、無為、不生、無生、無有和寂滅聲，安靜、平靜和寂靜聲，
大慈、大悲、大喜和大舍③聲，證得無生法忍和灌頂地④聲。
^ck144
「聽到這些聲響，他們滿懷愉悅和歡喜，伴隨僻靜，伴隨離欲，伴隨平靜，伴隨寂滅，伴隨法，伴隨通向菩提的善根。
「阿難啊，在極樂世界里，全然沒有不善聲，全然沒有障礙聲，全然沒有三惡道聲，全然沒有苦聲，
阿難啊，乃至沒有非苦非樂受聲，又哪里會有苦或苦聲？
「阿難啊，由此緣故，這個世界簡稱‘極樂’，無須再增添詞語。
即使劫有盡頭，而稱贊極樂世界的快樂原因，也到達不了快樂原因的盡頭。
^ck145
「還有，阿難啊，出生或將要出生在這個極樂世界的眾生
,他們全都具有這樣的美色、力量、威力、高度、寬度、控制力，
依靠積累的功德和各種神通，享用這樣的衣服、裝飾品、花園、宮殿和樓閣，這樣的色、聲、香、味和觸。
享有這一切，如同那些他化自在天。
^ck146
「還有，阿難啊，在極樂世界里，眾生不食用粗糙的食物。
他們想要什么樣的食物，就會感知攝取那樣的食物。
他們的身體和四肢愉悅，
食物不必進入他們的身體。
他們的身體愉悅，想要什么樣的香氣，這個佛士就會熏染那樣的天國香氣。
如果有人不愿意聞這種香氣，那么，他的香覺就完全不出現。
^ck147
「同樣，如果他們想要香料、花環、油膏、香粉、衣服、傘蓋、旗幟和幢幡，這個佛士就會展現這一切。
如果他們想要各種顏色的衣服，數十萬種顏色的衣服，這個佛士就會展現這一切①，他們就會感知自己穿有這種寶衣。
「如果他們想要裝飾品，諸如頭飾、耳飾、頸飾、手飾和腳飾，即頂冠、耳環、腕環、臂釧、筏蹉謖珞、盧遮迦謖珞、耳鐺、指環、金線、腰帶、金網和一切寶石鈴鐺②網，他們就會看到這個佛土展現鑲嵌數十萬寶石的裝飾品。
他們會感知自己裝飾有系于③裝飾品樹上的這些裝飾品。
^ck148
「如果他們想要宮殿，有那樣的色彩、特征和形狀，那樣的高度和寬度①，裝飾有數十萬用各種寶石制成的門扉，覆蓋有各種天國綢布，有配備各種美妙枕具的寶石床座，這樣的宮殿就會出現在他們面前。
他們住在這些依隨他們的心愿出現②的宮殿中游戲、娛樂和散步，七千天女圍繞恭敬。
^ck149
「在這個世界里，沒有神和人的區別，除了按照世俗習慣用語稱說③神和人。
阿難啊，猶如在轉輪王面前，

賤人和閹人④不發光，不發熱，不閃耀，無膽氣，無光彩，
同樣，帝釋天王在他化自在天面前，不發光，不發熱，不閃耀，
即有關花園、宮殿、衣服和裝飾品，或者掌控力、神通、神變和自在力，
還有諸法現觀和諸法受用⑤。
阿難啊，應該認為人在極樂世界里就像他化自在天。

















^ck150
「還有，阿難啊，在這個極樂世界里，上午時分，周圍四方風兒競相吹拂，
④搖晃、晃動、吹動這些美妙、可愛、色彩繽紛、散發各種天國香氣的寶樹，將大量可愛的、芳香迷人的花朵吹落在寶石地面上。
這些花朵遍布整個佛土，堆積有七人高。
如同有個能干的人在大地上鋪設花床，用雙手⑤鋪得平平整整，美妙可愛，
這個佛土上堆積的各種芳香和顏色的花朵全都呈現七人高。
^ck151
「這些花朵柔軟，觸感舒服，唯有迦鄰陀衣①可比。
足踩其上，下陷②四指；抬起足后，又上升③四指。
^ck152
上午逝去時，這些花朵全部④消失。
「這時，這個佛士寂靜，可愛，優美。不受上午的花朵擾亂。
然后，周圍四方的風兒又吹拂，像原先那樣遍撒新花。
如同上午，中午、下午、黃昏、初夜、中夜和后夜時分也是這樣。
眾生接觸這些散發各種香氣的風，感到舒適愉悅，猶如比丘達到滅盡定。
^ck153
「阿難啊，在這個佛土，全然沒有火、月、日、行星、星宿、星星和黑暗的名稱分別，
也沒有夜晚和白天的名稱分別，除了在如來的言說中。
也沒有家宅財產的想法。
^ck154
「還有，阿難啊，在這個極樂世界里，蘊含天國香水的云會及時下雨，降下天國一切顏色的鮮花、天國七寶、天國旃檀香粉、天國傘蓋、旗幟和幢幡。
有天國宮殿，天國帳篷，空中有天國華蓋和拂塵。天國樂器演奏，天女跳舞。
^ck155



^ck156
「還有，阿難啊，在這個佛土，已出生、正出生和將出生的眾生全都常住正定聚，直至涅槃。
為什么？因為這里沒有其他兩聚的位置和名稱，即不定①聚和邪定聚。
阿難啊，由此緣故，這個世界簡稱‘極樂’，無須再增添詞語。
阿難啊，即使劫有盡頭，而稱贊極樂世界的快樂原因，也到達不了快樂原因的盡頭。」
^ck157
于是，世尊就在這時誦出這些偈頌:
一切眾生全都成為善逝，
智慧純潔，通曉第一義，
歷經千萬劫或更多劫，
稱揚極樂世界的美妙。（1）
^ck158
千萬劫會流逝消失殆盡，
而極樂世界的美妙無盡頭,
愿他們的辯才不會消失，
稱揚極樂世界的種種美妙。（2）
^ck159
如果這些世界如同極微，
將它們全都碾成粉塵，
將粉塵般多或更多的世界，
全都鋪滿寶石，作為布施。（3）
^ck160
布施廣大世界獲得的功德，
與聞聽極樂世界的名號而
獲得的這種功德，實在不能
比擬于萬一，也不能比擬。（4）
^ck161
因此，信仰①勝者言說名號②,
他們就會獲得大量的功德，
因為信仰是眾生成就之根，
聞聽之后能消除一切疑惑。（5）
^ck162
「阿難啊，極樂世界具有這樣的無量功德和美妙。
還有，阿難啊，在十方每一方位，有恒河沙數佛土，恒河沙數佛世尊，他們全都稱揚世尊無量光如來的名號，
稱說他的美妙，宣揚他的名聲，贊頌他的功德。
為什么？一些眾生聞聽無量光如來的名號，聞聽后，便頓時發起心愿①，伴隨喜悅，至誠信受，全都安住無上正等菩提不退轉。
^ck163
「阿難啊，一些眾生一再專心思念①這位如來的形相，種植大量善根，心向菩提②，發愿往生這個世界。
在他們臨終時，無量光如來、阿羅漢、正等覺站立面前，眾比丘圍繞恭敬。
他們見到這位如來，心中安寧，隨即往生極樂世界。
^ck164
「阿難啊，若有善男子或善女人心想③：‘我怎樣能在現世見到無量光如來？
'那么，就應該發起無上正等菩提心，始終深心向往這個佛土，回向善根，求得往生。
^ck165
「而如果不專心思念這位如來，不持久種植大量善根，心中也不向往這個佛土，

在他們臨終時，無量光如來、阿羅漢、正等覺也會化身站立面前。
這位化身佛具有同樣的高度、寬度和美色的形體,眾比丘圍繞。
他們看到如來而保持清凈安寧，進入禪定，念念不忘,死后便往生這個佛土。
^ck166
「還有，阿難啊，眾生心中憶念這位如來十次，
就會渴望這個佛土，
聞聽深邃的法感到滿意。
他們不會受挫，不會絕望，不會消沉，
乃至專心思念這位如來一次，
就會渴望這個佛土。
他們也會在夢中看見無量光如來。
他們會往生這個極樂世界，
安住無上正等菩提不退轉。
^ck167
「阿難啊，正是看到這個緣由①，十方無量無數世界的如來稱揚這位無量光如來的名號，贊美他，贊頌他。
還有，阿難啊，十方所有方位恒河沙數的菩薩前往這個佛士拜見、禮敬、侍奉、請教無量光如來，
同時觀看這里的眾菩薩和完美殊勝的佛士功德莊嚴。」
^ck168
就在這時，世尊為了更加充分說明此事，誦出這些偈頌:
^ck169
東方佛士如此多，
數量如同恒河沙，
眾菩薩前來禮敬
無量壽佛陀導師。（1）
^ck170
他們手捧大量鮮花，
五彩繽紛，芳香迷人，
撒向人中至高導師，
神和人崇拜的無量壽。（2）
^ck171
南方、西方和北方，
十方佛士同樣多，
眾菩薩前來禮敬
無量壽佛陀導師。（3）
^ck172
他們手捧大量香料，
五彩繽紛，芳香迷人，
撒向人中至高導師，
神和人崇拜的無量壽。（4）
^ck173
眾菩薩①滿懷崇敬,
頂禮膜拜無量光，
右繞致敬，說道：
「佛土輝煌真奇妙！」（5）


^ck174
他們一齊撒下鮮花①，
興奮激動，無比喜悅，
說道：「導師啊，但愿
我們的國土也這樣。」(6)
^ck175
他們撒下一捧捧鮮花,
形成傘蓋，百由旬長，
絢麗的傘柄閃耀光芒，
覆蓋①佛陀的整個身體。（7）
^ck176
眾菩薩這樣供奉之后，
高興地交談：「這里的
眾生聞聽至上者名號，
獲得容易獲得的收獲。（8）
^ck177
「我們來到這個佛土，
也獲得容易的收獲，
請看這個佛士美如夢，
導師用數千劫造就。（9）
^ck178
「請看佛陀積累殊勝功德，
眾菩薩圍繞，光彩熠熠，
無量光光芒和威力無量，
壽命無量，僧眾也無量。」(10)
^ck179
無量壽救主展露笑容，
圓輪般面部①放出光芒，
三億六千萬那由多，
遍照千千萬的佛土。(11)
^ck180
所有的光芒又返回，
回到導師的頭頂上，
神和人看到這些光芒
又返回，心生喜悅。(12)
^ck181
名為觀自在的菩薩
聲譽卓著，起身說道：
「什么原因，什么緣由，
救世主啊，你微笑？(13)
^ck182
「你心懷慈悲，解脫眾生，
通曉第一義，請你解釋！
聞聽你的絕妙可愛的
話語，眾生會滿心歡喜。(14)
^ck183
「眾多世界菩薩來到
著名的極樂世界觀佛，
聞聽后會心生大歡喜，
迅速明了這個佛土。(15)
^ck184
「來到這個美妙佛士，
他們迅速獲得神通力，
獲得天眼通，天耳通，
宿命通，以及他心通。」(16)
^ck185
此時，無量壽佛解釋說：
「這是我以前立下的誓愿，
眾生只要聞聽我的名號，
就會迅速來到我的佛土。(17)
^ck186
「我的美好誓愿已實現，
眾多世界的這些眾生，
迅速來到了我的身邊，
來到后，終生不退轉。(18)
^ck187
今譯:「因此，若有菩薩希望:
’但愿我的國土也這樣,
通過名號、聲音和拜見,
我也能讓眾生獲得解脫。(19)
^ck188
「那就讓他迅速
前往極樂世界，
來到無量光前，
敬拜千千萬佛！（20）
^ck189
「敬拜千千萬佛之后，
憑神通力前往眾多佛士，
在眾佛陀身邊禮敬供拜，
在早餐時回到極樂世界。」(21)




































^ck190
「還有，阿難啊，世尊無量壽如來、阿羅漢、正等覺的菩提樹
高一千六百②由旬，枝葉伸展八百由旬，樹根縱橫五百由旬，始終有葉，始終有花，始終有果，
各種顏色，數百千種顏色，各種葉,各種花，各種果，裝飾有各種美妙的裝飾品③，摩尼珠寶閃耀似月光，
帝釋天佩戴的各種優美的摩尼珠寶，各種如意珠寶，海中的各種殊勝摩尼珠寶，勝過天國。
^ck191
「懸掛金線、金項鏈，寶石項鏈，金剛石項鏈，金手鐲,赤珠璞珞，藍珠理珞，數以百計優美的獅子蔓藤腰帶、寶線和寶衣,
金網、珍珠網、一切寶石網和鈴鐺網，點綴有摩竭魚、卍字、難陀越多和半月標志，裝飾有鈴鐺、摩尼珠、金子和一切寶石，符合眾生的一切心愿。
^ck192
「還有，阿難啊，這菩提樹遇到風吹，就會發出聲響，傳遍無量世界。
阿難啊，那里的眾生聞聽菩提樹的聲響后，
他們就不會再害怕耳朵得病，直至達到菩提；
無量無數、不可思議、不可衡量、不可計量、不可言狀的眾生看到菩提樹后，
他們就不會再害怕眼睛得病，直至達到菩提。
還有，阿難啊，眾生聞到菩提樹的香氣后，
他們就不會再害怕鼻子得病，直至達到菩提；
眾生品嘗菩提樹的果子后，
他們就不會再害怕舌頭得病，直至達到菩提；
眾生受到菩提樹的光芒照耀后，
他們就不會再害怕身體得病，直至到達菩提道場。
^ck193
「還有，阿難啊，眾生依法深思菩提樹，
從此①就不會害怕心中出現煩亂，直至達到菩提。
所有眾生看到菩提樹后，都會安住無上正等菩提不退轉，
獲得三法忍，即音響法忍、柔順法忍和無生法忍，
依靠這位無量壽如來以前的誓愿護持，依靠以前侍奉過去世勝者,依靠履行以前的誓愿②，認真修行，圓滿無缺完成。
^ck194
「還有，阿難啊，所有已出生、在出生或將出生的菩薩
都將成為一生補處，證得無上正等菩提。
除了那些懷有誓愿的菩薩，他們發出獅子吼，披戴大鎧甲，追求一切眾生般涅槃。
^ck195
「還有，阿難啊，在這個佛士，聲聞光照一尋，
菩薩光照百千千萬由旬。
除了兩位菩薩，他倆的光芒連續不斷，永遠遍照世界」
^ck196
這時，尊者阿難對世尊說道：
「世尊啊，這兩位賢聖菩薩大士的名號是什么？」
世尊說道：「阿難啊，一位菩薩大士名為觀自在①，另一位名為大勢至②。
阿難啊，他倆從佛土去世后，出生在這里。
^ck197
「阿難啊，眾菩薩出生在這個佛土，全都具有三十二大人相，肢體圓滿，通曉禪定神通，通曉各種智慧③，諸根銳利，守護諸根，了解諸根，諸根不低劣和不躁動，獲得法忍，功德無窮無盡。

^ck198
「還有，阿難啊，眾菩薩出生在這個佛土，全都不會失去見到佛和聞聽法的機會，品質不會墮落，直至達到菩提。
從此①，他們也不會失去宿命通。除了在這樣的濁劫，他們志愿前往以前的出生地。
那時，五濁出現，佛世尊會出世，就像我現在這樣。
^ck199
「還有，阿難啊，眾菩薩出生在這個佛土，
全都能在一頓早餐時間中前往其他世界，侍奉數百千千萬那由多佛，乃至依靠佛的威力，
一切都會依照他們的心愿產生：
想要用這樣的鮮花、燈、香料、花環、油膏、香粉、衣服、傘蓋、旗幟、幢幡、勝利旗、樂器、歌曲和音樂供奉，
所有這一切供品就會伴隨他們的心念出現手中。
他們用鮮花乃至音樂供奉這些佛世尊，由此積累無量無數善根。
^ck200
「還有，如果他們想要這樣的一捧捧鮮花出現①在手中，
那么，各種顏色、各種香氣的一捧捧天國鮮花就會伴隨他們的心念出現在手中。
他們將這樣的一捧捧鮮花連續撒向佛世尊。
他們拋撒一捧捧少量的鮮花，而在空中展現的鮮花傘蓋延伸十由旬。
^ck201
「第二次向空中拋撒時②，第一次拋撒的鮮花不墜落地面。
隨著拋撒一捧捧鮮花，空中展現的鮮花傘蓋延伸二十由旬。
繼而，空中展現的鮮花傘蓋延伸三十、四十、五十乃至十萬由旬。
^ck202
「在那里，他們心生大歡喜，心生大愉悅，種植無量無數善根。
侍奉數百千千萬那由多佛后，就在這個上午，又返回極樂世界。
這是依靠無量壽如來以前的誓愿護持，依靠以前聞聽法，依靠以前供奉勝者種植的善根，依靠以前的誓愿成就圓滿，依靠善分身①。
^ck203
「還有，阿難啊，眾菩薩出生在這個佛土，
全都能談論法，伴隨有一切智。
在這個佛土，任何眾生都沒有執著的想法。
他們③漫步或周游整個佛土，心情無喜無憂。
向前跨步就這樣跨步，無所謂有期待或無期待①，
他們完全沒有這樣的心。
^ck204
「還有，阿難啊，眾生出生在這個極樂世界，
沒有所謂'他人'⑤或‘自己’的想法，沒有所謂‘屬于我的'想法，沒有爭吵，沒有爭論，沒有對立，沒有不平等心⑥。
他們有平等心，利益心，慈悲心，柔軟心，摯愛心，勤勉心，平靜心，堅定心，無障礙心，無散亂心，無雜亂心，
一心奉行智慧波羅蜜，
進入持心知覺，智慧如同大海，知覺如同須彌山，積累眾多功德，游戲七覺支贊頌，修行佛贊頌。
^ck205
「他們用肉眼觀察，也運用天眼，通曉慧眼，精通法眼,成就佛眼。
他們宣示，說明，詳細解釋，運用無礙智，
追求三界平等，心調伏，心平靜，獲知一切法無所得。
他們善于解釋苦的緣起，善于解釋法，善于取舍，明了合理處和不合理處。
他們不關注世間言談,而通過出世間言談證得真實精華。
^ck206
「他們善于⑤探求一切法，了知一切法性寂滅⑥，所行處也無所得，空無所有，無所取，無所思，無苦惱，無執著，善解脫，無染著，安住無邊際⑦，安住神通本根，心無礙，不懈怠，修習甚深法，不消沉。
^ck207
「他們努力把握難知難覺的佛智，遵循一乘道①，斷除懷疑，擺脫疑問，不由他緣認知，不驕慢。
識見高廣似須彌山，知覺不亂似大海，
智慧光芒②超過日月，內心清凈潔白，
殊勝功德光芒似熔煉的真金，
安忍一切眾生善惡似大地，
清洗和沖走一切煩惱污垢似水,
焚燒一切法的妄想和煩惱似火王，
不執著一切世界似風，
遍及一切法而終究無所有似空。
^ck208
「不沾染一切世界似蓮花，
說法雷聲似隨時出現的烏云，
降下法水似大雨，
征服大眾似雄牛，
心善調伏似大象，
訓練有素似駿馬，
勇猛無畏無懼似獸王獅子，
庇護一切眾生似樹王榕樹，
一切外道論說搖撼不動似須彌山王，
慈悲無量似天空，
一切善根法自在先導似大梵天，
無所積蓄①似鳥，
摧毀外道論說似金翅鳥王，
難得希有展現似優曇花，
鎮定自若、諸根端正不散亂似大象。
善于抉擇，忍辱柔順，
毫無妒忌心，不貪圖他人成就。
^ck209
「說法無畏，求法無厭。
戒行似琉璃，
所聞似寶藏，大法鼓聲美妙。
捶響大法鼓，吹響大法螺，
樹起大法幢①，點燃大法炬，閃耀智慧光。
無愚癡，無瞋怒，平息忿恨②，純潔，無惡臭，無貪欲，樂于布施，伸手慷慨布施，法施和財施皆不吝嗇。
不混雜，心無恐懼，無染著，堅定，英勇，擔負重任，堅強，知廉恥，無與倫比③，無遮限，得神通，柔順，容易相處，做益事，世界之燈，導師，滅除貪愛喜樂，斷除一切而純潔，
無憂愁，無污垢，滌除三垢，游戲神通，具有因力④，具有愿力⑤，剛直不阿。
^ck210
「他們供奉數百千千萬那由多佛，種植善根。
拔除驕慢箭，遠離貪瞋癡，清凈，熱愛清凈，為勝者所稱贊，成為世間智者，充滿明凈智，為勝者所贊頌。
心中愉悅，英勇，頑強，無可等同，圓滿無缺①，無與倫比，無塵垢，有益處，高尚，雄牛，知廉恥，堅強，有念力，有慧力，有悟力，執持智慧劍，有功德，有光輝，遠離錯誤,摒棄污垢，修習永恒正法。
^ck211
「阿難啊，以上只是簡略說明這個佛土里的菩薩大士。
如果詳細說明，即使如來壽命長達百千千萬那由多劫，也不能說盡這些聖賢的功德。
而這也無損于如來的無畏。
為什么？阿難啊，因為這些菩薩的功德和如來的無上智慧辯才，兩者都不可思議，無與倫比。

































































































































































^ck212
「阿難啊，起身面朝西方，撒下鮮花，合掌跪拜。
世尊無量光如來、阿羅漢、正等覺在這個方位居住、生活、度日和說法。
無塵垢，純潔，他的名號傳播十方世界無阻礙。
每個方位恒河沙數的佛世尊贊美、贊頌和稱揚，一次又一次應答無阻礙。」
^ck213
聞聽此言，尊者阿難對世尊說道：
「我想要見到世尊無量光、無量光明、無量壽如來、阿羅漢、正等覺以及那些供奉數百千千萬那由多佛而種植善根的菩薩大士。」
^ck214
尊者阿難的話音剛落①，
無量光如來、阿羅漢、正等覺就從自己的手掌中放出這樣的光芒：大光明普照所有百千千萬佛土。
這時，所有百千千萬佛土中，那些黑山、寶山、須彌山、大須彌山、目真鄰陀山、大目真鄰陀山、鐵圍山和大鐵圍山，
那些墻壁、柱子、樹木、房屋、花園和宮殿，無論是天神的或人的，
如來的光芒穿越和覆蓋這一切。
^ck215
猶如太陽升起時，一個人目睹僅隔一尋的另一個人，
這時，這個佛土的比丘、比丘尼、優婆塞和優婆夷①，
神、蛇、夜叉、健達縛、阿修羅、金翅鳥、緊那羅和大蛇，全都看見這位無量光如來、阿羅漢、正等覺,如同看見聳立于一切佛土的須彌山王,映蔽一切方位②，發光，發熱，照耀，閃耀，
同時也看見大量的菩薩和比丘。
這一切都依靠佛的威力，依靠他的純潔光芒。
^ck216
譬如，大地上如果洪水泛濫，
那里的樹木、群山、島嶼、草、灌木、藥草和大樹，河流、峽谷和深坑，全都淹沒不見，
唯有布滿洪水的大地。
同樣，在這個佛土，沒有其他的標記或標識，唯有那些放光一尋的聲聞和放光百千千萬由旬的菩薩。
而看見世尊無量光如來、阿羅漢、正等覺映蔽這些聲聞和菩薩，光照所有方位。
這時，在極樂世界上所有的菩薩、聲聞、神和人也看見這個世界，釋迦牟尼如來正在說法，身邊圍繞眾比丘。
^ck217
這時，世尊對阿逸多②菩薩大士說道：
「阿逸多啊，你看這個佛士充滿功德莊嚴，
上面③空中可愛的園林，可愛的樹林，可愛的花園，可愛的河流和蓮花池，布滿各種寶石青蓮花、紅蓮花、黃蓮花和白蓮花。
從下面大地直至阿迦尼吒天宮，天空中布滿成串成串鮮花，成排成排柱子閃閃發光，如來幻化的各種鳥禽出沒。」
^ck218
阿逸多說道：「世尊啊，我看見了。"
世尊說道：「阿逸多啊，你再看這些鳥禽將佛音傳遍②一切佛土，由此那些菩薩永遠不忘憶念佛。」
阿逸多說道：「世尊啊，我看見了。"
世尊說道：「你看這個佛士上的眾生登上百千由旬規模的宮殿，在空中周游無礙。」
阿逸多說道：「我看見了。"
^ck219
世尊說道：「阿逸多啊，你認為怎樣，在極樂世界里，存在他化自在天和人之間的差別嗎？」
阿逸多說道：「世尊啊，我看不出有任何一點差別。
在極樂世界里，那些人也具有那樣的大神通。」
^ck220
世尊說道：「阿逸多啊,你再看在這個極樂世界里，一些人住在優美的蓮花胎中。」
阿逸多說道：「世尊啊，我看見極樂世界里一些人住在優美的蓮花胎中，
猶如三十三天或夜摩天住在縱橫五十由旬、一百由旬或五百由旬的宮殿中游戲、娛樂和漫步。
世尊啊，那里還有一些眾生自然化生，在蓮花中結跚趺坐。
^ck221
世尊啊，什么原因，什么緣由，一些眾生住在蓮花胎中，
而另一些眾生自然化生，在蓮花中結跚趺坐？」
^ck222
世尊說道：「阿逸多啊，住在其他佛士的一些菩薩對出生在極樂世界抱有懷疑，
帶著疑心種植善根，故而他們住在蓮花胎中。
而另一些菩薩斷除疑惑，毫不懷疑，為出生在極樂世界而種植善根,
相信、信仰和信奉佛世尊的無礙智，故而自然化生，在蓮花中結跚趺坐。
^ck223
「阿逸多啊，住在其他佛士的一些菩薩大士心中想要見到無量光如來、阿羅漢、正等覺，
毫無疑惑，毫不懷疑，相信無礙的佛智和自己的善根，
故而他們自然化生，在蓮花中結現趺坐。
他們在一瞬間就產生這樣的身體，就像在這里出生已久的那些眾生。
^ck224
「阿逸多啊，你看智慧薄弱，智慧異樣，智慧短缺，智慧少量，由此，他們五百年不能見到佛，見到菩薩，
不能聞聽正法①，不能談論正法，不能修行和種植一切善根。
這是因為心中抱有懷疑的想法。
^ck225
「譬如，阿逸多啊，用于囚禁灌頂的王子的牢獄鑲嵌一切金子和琉璃，懸掛絹布、花環和飄帶，張有彩色帳幔，鋪設綢布，遍布各種鮮花，散發美妙的香料香氣，有宮殿樓閣，裝飾有窗戶、祭壇、拱門和各種美妙寶石，覆蓋金子和寶石鈴鐺網，四方形，四根柱子,四扇門，四座臺階。
^ck226
「王子犯有某種過失而遭囚禁，系縛閻浮金鎖鏈。
那里安有床座，鋪設各種毛毯、棉褥和蒲團，觸感舒服似迦鄰陀衣，覆蓋羯陵迦衣①和優質布料，兩邊有紅色枕具，優美可愛。
他在這里或坐或躺，
各種精美的飲料和食物供應充足。
阿逸多啊，你認為王子的享受充分嗎？」
阿逸多說道：「世尊啊，充分。
^ck227
"世尊說道：「阿逸多啊,即使品嘗和感受這一切，你認為他會滿意嗎？」
阿逸多說道：「世尊啊，確實不會。
而且，他被國王驅離①，送進囚禁地后，只會盼望獲得釋放。
他會尋求貴族、王子、大臣、后宮婦女、富商、長者和王侯，幫他獲得釋放。
世尊啊，這個王子在牢獄中不會快樂。
即使獲得釋放，只要國王尚未對他表示恩寵，他也不會快樂。」
^ck228
世尊說道：「正是這樣，阿逸多啊，那些心存懷疑的菩薩種植善根，但懷疑佛智，無等等智。
他們只是憑借聞聽佛的名號，內心平靜，而出生在極樂世界。
但不是自然化生，在蓮花中結跳趺坐,而是住在蓮花胎中。
^ck229
「他們住在那里，有花園和宮殿的感受，沒有糞便，沒有痰液鼻涕，心無反感。
然而，在五百年中不能見到佛，不能聞聽法，不能見到菩薩，不能談論法和確認法，不能修行一切善法。
他們在這里并不快樂，并不滿意。
而他們消除過去的過失后，便從那里走出。
而他們走出后，上下左右，不知所從。
^ck230
「你看，阿逸多啊，他們可能已在五百年中，供奉數百千千萬那由多佛，種植無量無數善根，受持佛法，
而由于懷疑的過失,他們毀掉①這一切。
阿逸多啊，你看這些菩薩的懷疑造成多大的不幸！
^ck231
「因此，阿逸多啊，沒有懷疑的菩薩應該發起菩提心①，迅速回向善根，為了謀求一切眾生的利益和幸福，為了獲得能力，為了出生在世尊無量光如來、阿羅漢、正等覺所在的極樂世界。」
^ck232
聞聽此言，阿逸多菩薩對世尊說道：
「世尊啊，會有多少菩薩完成修行，從這里佛土或其他佛世尊身邊離去，出生在極樂世界？」
^ck233
世尊說道：「阿逸多啊，從這里的佛土會有七億二千萬那由多菩薩完成修行，出生在極樂世界。
這些完成修行的不退轉菩薩具有供奉數百千千萬佛而種植的善根，更不用說那些善根較少者。
^ck234

「從難忍如來身邊，會有一億八千萬那由多菩薩出生在極樂世界。
^ck235
「在東方①，住著名為寶藏的如來。
從他的身邊，會有九億菩薩出生在極樂世界。
「從光明如來身邊，會有二億二千萬菩薩出生在極樂世界。
「從無量光明如來身邊，會有二億五千萬菩薩出生在極樂世界。
「從世間燈如來身邊，會有六億菩薩出生在極樂世界。
「從蛇勝如來身邊，會有六億四千萬菩薩出生在極樂世界。
「從離垢光如來身邊，會有二億五千萬菩薩出生在極樂世界。
「從獅子如來身邊，會有一萬八千菩薩出生在極樂世界。
「從吉祥峰如來身邊，會有八億一千萬那由多菩薩出生在極樂世界。
「從王中王如來身邊，會有一億那由多菩薩出生在極樂世界。
從神通力如來身邊，會有一億二千萬菩薩出生在極樂世界。

「從花幢如來身邊，會有二億五千萬菩薩勇猛精進，
志向專一，于八天中，（如同）于九十萬億那由多劫中，面向西方，出生在極樂世界。
「從光明王如來身邊，會有一億二千萬菩薩出生在極樂世界。
「從無畏如來身邊，會有六億九千萬菩薩出生在極樂世界。
^ck236
「他們都為了拜見、禮敬、侍奉、詢問和請教無量光如來。
^ck237
「因此，阿逸多啊，那些菩薩從他們的如來那里前往極樂世界拜見、禮敬和侍奉無量光如來。
如果我一一講述這些如來的名號,即使用整個千萬那由多劫，也說不盡。
^ck238
「你看，阿逸多啊，那些聞聽無量光如來、阿羅漢、正等覺名號的眾生多么容易獲得利益。
只要心中對這位如來和這個法門產生一念喜愛，這些眾生也就不缺少信仰。
^ck239
「因此，阿逸多啊，我現在在包括天神在內的世界面前告知你們，囑咐你們聽取①這個法門。
即使三千大千世界布滿烈火，也要進入它，越過它，絕無一絲疑悔之意。
為什么？阿逸多啊，因為數千萬菩薩沒有聞聽這個法門而轉離無上正等菩提。
^ck240
「因此，傾心于這個法門，為了聽取、接受和記取，為了掌握，為了詳細解說，為了修習，應該勇猛精進。
乃至一日一夜，一次擠奶時間，書寫經卷，書寫后，受持記取，
于此產生導師想①，希望讓無量眾生迅速安住無上正等菩提不退轉，
見到世尊無量光如來、阿羅漢、正等覺的佛土②，
也讓自己的佛士獲得殊勝③功德莊嚴。
^ck241
「確實，阿逸多啊，這些眾生極其容易獲得利益。
他們已經種植善根，已經供奉以前的勝者，會受到佛的護持。
在未來世，乃至正法毀滅時，這樣美妙的法門為一切佛所贊美，為一切佛所稱贊,為一切佛所認同，
能迅速傳達偉大的佛智，會進入眾生耳中。
聞聽后，他們會感到欣喜愉悅，接受，記取，誦讀，掌握，為他人詳細解說。
他們會樂于修習，乃至書寫，供奉，由此產生難以計數的大量功德。
^ck242
「阿逸多啊，我已經做了如來應該做的事，
現在你們應該毫無疑慮地踐行。
不要懷疑無著無礙的佛智。
不要進入具有一切優美形態①的寶石蓮花牢獄中。
阿逸多啊，佛出世難得，說法難得，機會難得。
阿逸多啊，我已經說明如何達到一切②善根圓滿，
現在你們就努力踐行③吧！
^ck243
「阿逸多啊，我鄭重托付這個法門，不要讓它毀滅。
你們要努力不讓佛法消失，
不讓佛智受損。」
^ck244
就在這時，世尊誦出這些偈頌:
那些不積累功德的人，
他們不會聽取這些話，
而獲得成就的勇士們，
他們會聆聽這些話。（1）
^ck245
他們見到正等覺，
救世主，放光者，
深心崇敬①聆聽法，
會獲得無上喜悅。（2）
^ck246
懷抱邪見的低劣者，
對佛法不會心生喜悅；
己在前世供奉過去佛，
他們會修習世主②所行。（3）
^ck247
猶如盲人處在黑暗中，
不能辨路，何況指路？
一切聲聞也不知佛智，
更何況其他無知眾生。（4）
^ck248
唯有佛知佛功德，
而非神、蛇、阿修羅和夜叉，
以及聲聞，甚至辟支佛
也不知道如何說明佛智。（5）
^ck249
如果一切眾生都成佛，
徹底通曉純潔的佛智，
即使講述一佛的功德，
也要千萬劫或更多劫。（6）
^ck250
他們講述數千萬劫，
在這中間進入涅槃，
而沒有說盡佛智量，
這正是佛智的奇妙！（7）
^ck251
天資聰慧的智者，
他會信仰我的話，
親證所有的佛智，
知佛而能如實言。（8）
^ck252
偶爾獲得人身，偶爾
逢佛出世，長久信仰，
具有智慧，才能獲得，
為此①應該精進努力。（9）
^ck253
已經聞聽這種殊勝法，
經常憶念佛而心喜悅，
在前世就是我們的朋友，
他們渴望獲得佛菩提①。(10)
^ck254
就在世尊講述這個法門的時候，一億二千萬那由多眾生依法獲得無塵無垢清凈法眼。
二億四千萬眾生獲得不還果。
八百比丘煩惱除盡②，心得解脫。
二億五千萬菩薩獲得無生法忍。
四十萬億那由多神和人等眾生以前沒有而現在發起無上正等菩提心，
為了出生極樂世界而種植善根，盼望見到世尊無量光。
^ck255
他們在這里出生②后，還會依次出生在其他世界，成為如來，名為妙音。
八億那由多眾生曾獲得燃燈如來授記法忍，安住無上正等菩提不退轉。
他們接受無量光如來教化，繼續奉行③以前的菩薩行。
他們出生在極樂世界后，會圓滿實現以前的誓愿和修行。
^ck256
這時，三千大千世界出現六種震動④，
展現種種神通變化，曼陀羅花遍布大地，達到膝蓋，
天上人間樂器齊鳴，
歡慶聲⑤直達阿迦尼吒天。
^ck257
世尊這樣說完后，心中喜悅。
阿逸多菩薩大士、尊者阿難、包括神、人、阿修羅和健達縛在內的世界所有會眾歡迎世尊所說。
^ck258
稱揚世尊無量光功德、進入菩薩不退轉地、無量光極樂世界莊嚴品結束。
^:<name=timestamp preload=true>vid	videohost	bookid	performer	timestamp=numbers
5C4INS3hK406SPgY9y4S2c7OXGM0CArAw9S7vUKn42D09S7vUKn42D0^2BkLfOEyEW6UDnLGZhs6hH0HvFWWs01qWMKMyG9nQofS8Mbxd5YUz8swP5HI-Yw7AaoRquHJ4jzXKsS4S7k2JU2LQS4S7k2JU2LQ^2S4S7k2JU2LQ^3S4S7k2JU2LQ^4S4S7k2JU2LQ^5S4S7k2JU2LQ^6S4S7k2JU2LQ^7St8uh97EEFcXpROd_PKBb0YWNJUqf7YIQ_afssYk-CUQaBdwfpjoeRkbDOcp6uk584cm9wdgmC0BsiL_W8W2737Aji1bHi62yiom9ZmMrY88qEn7ehR3iVBLgw35152ox685wjvwySjCVoQz-IpOREVDHo

youtubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeyoutubeqqyoutubeyoutube
vcppamtbpphsksitigarbha1ksitigarbha2pphsbhaisajyavcpp_yijingbhaisajyalastwordpphsvcppsdpdrk1sdpdrk2sdpdrk3sdpdrk4sdpdrk5sdpdrk6sdpdrk7amtb_xuanzangvcppbhaisajyapphsvcpp_xuanzangpphspphspphspumenvcpppphvcppvcppvcpp
養德禪寺國家一級播音員課頌一級播音員一級播音員寬邦漢語法鼓山星辰慧平法師見輝法師王菲張智霖法鼓山誦讀誦讀誦讀誦讀誦讀誦讀誦讀星辰王菲湛願法師寬邦日語星辰般禪梵唱韓國觀音禪林張學友佛光山課誦心定法師王菲朗誦王菲(腾讯)蔣勳見輝法師
;'6!(Wy*;^ =A%;x+<>; ;-"*XM)g6'%g>'$&''gb\\&(*hn+)(%$h8K'%'%;!.@i!;_0%;'!%#   ;";?>7..`)