jsonp(39,{"name":"dc","start":109028},`隨．其所作．若罪、若福，皆具書之，
盡持^lb授與琰魔法王。
爾時，彼王，推問其人，算計所^lb作，隨其罪福，而處斷之。
^ck56【作福續命】
時，彼病人親屬、知識，^lb若能為彼歸依世尊．藥師．琉璃光．如來，請諸^pb44眾僧，轉讀此經，然七層之燈，懸五色續命神^lb幡，
或有是處——
^ck57【勵力行善】
彼識得還，如在夢中，明了自見。
^lb或經七日，或二十一日，或三十五日，或四十^lb九日，彼識還時，
如從夢覺，皆自憶知善不善^lb業所得果報。
由自證見業果報故，乃至命難，^pb45亦不造作諸惡之業。
^ck58【結勸】
是故，淨信善男子、善女^lb人等，皆應受持藥師．琉璃光．如來名號；
隨力^lb所能，恭敬、供養。」
^ck59【明延壽儀】
爾時，阿難問救脫菩薩曰：
「善^lb男子！應云何恭敬、供養彼世尊．藥師．琉璃光．^lb如來．續命幡燈？復，云何造？」
^ck60【明延壽儀】
救脫菩薩言：
「大德！^pb46若有病人，欲脫病苦，當為其人，七日七夜，受^lb持八分齋戒；
應以飲食及餘資具，隨力所辦，^lb供養苾芻僧；
晝夜六時，禮拜、供養彼世尊．藥^lb師．琉璃光．如來；
讀誦此經四十九遍；
然四十^lb九燈；
造彼如來形像七軀；
一一像前，各置七^pb47燈，
一一燈．量．大如車輪，
乃至四十九日，光明^lb不絕；
造五色綵幡，長四十九搩手；應放雜類^lb眾生．至四十九——可得過度危厄之難，不為諸^lb橫惡鬼所持。
^ck61【救國難以延命】
復次，阿難！若剎帝利灌頂王等，^lb災難起時——
所謂人眾疾疫難，他國侵逼難，自^pb48界叛逆難，星宿變怪難，日月薄蝕難，非時．風^lb雨難，過時．不雨難——
彼剎帝利灌頂王等，爾時，^lb應於一切有情起慈悲心，赦．諸繫閉；
依前所^lb說供養之法，供養彼世尊．藥師．琉璃光．如來。
^lb由此善根，及彼如來本願力故，令其國界即^pb49得安隱；
風雨順時，穀稼成熟。
一切有情，無病、^lb歡樂。
於其國中，無有暴虐藥叉等神．惱有情^lb者；
一切惡相，皆即隱沒。
而剎帝利灌頂王等，^lb壽命、色、力，無病、自在，皆得增益。
^ck62【救眾難以延命】
阿難！若帝后、^lb妃主、儲君、王子、大臣、輔相、中宮婇女、百官、黎^pb50庶，為病所苦，及餘厄難；
亦應造立五色神幡，^lb然燈續明，放諸生命，散雜色華，燒眾名香，病^lb得除愈，眾難解脫。」
^ck63【增益已盡之命】
爾時，阿難問救脫菩薩言：
^lb「善男子！云何已盡之命而可增益？」
救脫菩薩^lb言：
「大德！汝豈不聞如來說有九橫死耶？
是故，^pb51勸造續命幡燈，修諸福德；
以修福故，盡其壽^lb命，不經苦患。」
阿難問言：「九橫，云何？」
救脫菩薩^lb言：「
^ck64【九種橫死】
若諸有情，得病雖輕，
然無醫藥及看病者；
^lb設復遇醫，授以非藥；
實不應死，而便橫死。
又，^lb信世間邪魔、外道、妖㜸之師，妄說禍福，便生^pb52恐動，心不自正，卜問、覓禍，殺．種種眾生，解奏^lb神明，呼．諸魍魎，請乞．福祐，欲冀延年，終不能^lb得；
愚癡、迷惑，信．邪倒見，遂令橫死，入於地獄，^lb無有出期——是名初橫。
二者，橫．被王法之所誅^lb戮。
三者，畋獵、嬉戲，耽婬、嗜酒，放逸無度，橫．為^pb53非人奪其精氣。
四者，橫．為火焚。
五者，橫．為水^lb溺。
六者，橫．為種種惡獸所噉。
七者，橫．墮山崖。
^lb八者，橫．為毒藥、厭禱、呪詛、起屍鬼等．之所中^lb害。
九者，飢渴所困，不得飲、食，而便橫死。
是為^lb如來略說橫死，有此九種。
其餘，復有無量諸^pb54橫，難可具說。
^ck65【結勸修度】
復次，阿難！
彼琰魔王，主領世間^lb名籍之記。
若諸有情，不孝、五逆、破辱三寶、壞^lb君臣法、毀於信戒，琰魔法王，
隨罪輕重，考而^lb罰之。

是故，我今勸諸有情，然燈、造幡，放生、修^lb福，令度苦厄，不遭眾難。」
^ck66【藥叉誓護】


爾時，眾中有十二藥^pb55叉大將，俱在會坐，


所謂：
^lb^gatha宮毘羅大將．伐折羅大將．迷企羅大將，^lb^gatha安底羅大將．頞儞羅大將．珊底羅大將^lb^gatha因達羅大將．波夷羅大將．摩虎羅大將^lb^gatha真達羅大將．招杜羅大將．毘羯羅大將。
^pb56此十二藥叉大將，一一各有七千藥叉以為^lb眷屬，同時舉聲白佛言：
「世尊！我等今者，蒙佛^lb威力，得聞世尊．藥師．琉璃光．如來名號；不復^lb更有惡趣之怖。
我等相率，皆同一心，乃至盡^lb形．
歸佛、法、僧，
誓當荷負一切有情，為作義利、^pb57饒益、安樂。
隨於何等村城、國邑、空閑林中，
若^lb有流布此經，或復受持藥師．琉璃光．如來名^lb號，恭敬、供養者，
我等眷屬，衛護是人，皆使解^lb脫一切苦難；
諸有願求，悉令滿足。
或有疾厄．^lb求度脫者，亦應讀誦此經，以五色縷，結我名^pb58字，得如願已，然後解結。」
爾時，世尊讚諸藥叉^lb大將言：
「善哉，善哉。大藥叉將！汝等念報世尊．^lb藥師．琉璃光．如來恩德者，常應如是利益、安^lb樂一切有情。」
^ck67【呪】


^ck68【阿難問名】

爾時，阿難白佛言：
「世尊！當何名^lb此法門？我等云何奉持？」
佛告阿難：「此法門，名．^pb59說藥師．琉璃光．如來本願功德；
亦名．說十二^lb神將．饒益有情．結願神呪；
亦名．拔除一切業^lb障——應如是持。」
^ck69【大眾奉行】
時，薄伽梵說是語已，
諸菩薩摩^lb訶薩，
及大聲聞、
國王、大臣、婆羅門、居士，
天、龍、^lb藥叉、揵達縛、阿素洛、揭路荼、緊捺洛、莫呼洛^pb60伽、人、非人等，一切大眾，聞佛所說，皆大歡喜，^lb信受奉行。
^lb^lb^lb藥師．琉璃光．如來本願功德經^pb61
^pb1^folio#bhaisajya_gupta【笈多】^bk#bhaisajya_gupta〔佛說藥師如來本願經〕^ck0【序】^lb^gatha^au〔　　　隋　天竺三藏　達摩笈多　譯〕
^ck1【敘事證信】
^lb如是我聞：
一時婆伽婆遊行人間

至毘舍離^lb國
住樂音樹下，與大比丘眾
八千人俱、菩薩^lb三萬六千、
國王、大臣、婆羅門、居士、天龍、阿修^pb2羅、揵達婆、伽樓茶、緊那羅、摩呼羅伽等，大眾^lb圍遶於前說法。
^ck2【禮請】
爾時，曼殊室利法王子，承佛^lb威神，即從座起，
偏露一髆，右膝著地，向婆伽^lb婆合掌曲躬白言：
「世尊！唯願演說諸佛名號^lb及本昔所發殊勝大願，
令眾生聞已，業障消^pb3除，
攝受來世正法壞時諸眾生故。」
^ck3【起說】
爾時，婆伽^lb婆讚曼殊室利童子言：
「善哉！善哉！曼殊室利^lb大慈悲者，起無量悲，勸請我說，
為欲義利種^lb種業障所纏眾生，饒益安樂諸天人故。
曼殊^lb室利！當善憶念，聽我所說。」
時曼殊室利童子^pb4樂聽佛說，白言：「唯然，世尊！」
^ck4【總標依正】
佛告曼殊室利：
「東^lb方過此佛土
十恒河沙等佛土之外，
有世界^lb名淨琉璃，
彼土有佛，名藥師琉璃光如來、應、^lb正遍知、
明行足、善逝、世間解、無上士、調御丈^lb夫、
天人師、佛、世尊。
^ck5【行願】
「曼殊室利！彼世尊藥師琉^pb5璃光如來本行菩薩行時，發十二大願。
何者^lb十二？
^lb^ck6【生佛平等願】
「第一大願：
願我來世於佛菩提得正覺時，自^lb身光明熾然，照曜無量無數無邊世界，
三十^lb二丈夫大相及八十小好以為莊嚴；
我身既^pb6爾，令一切眾生如我無異。
^lb^ck7【開曉事業願】
「第二大願：
願我來世得菩提時，
身如琉璃，內^lb外清淨，無復瑕垢，
光明曠大，威德熾然，身善^lb安住，
焰網莊嚴，過於日月，
若有眾生，生世界^lb之間，或復人中昏暗及夜，莫知方所，
以我光^pb7故，隨意所趣，作諸事業。
^lb^ck8【無盡資生願】
^lb「第三大願：
願我來世得菩提時，
以無邊無限^lb智慧方便，令無量眾生界受用無盡，
莫令一^lb人有所少乏。
^lb^ck9【安立大道願】
「第四大願：
願我來世得菩提時，
諸有眾生行^pb8異道者，一切安立菩提道中，
行聲聞道、行辟^lb支佛道者，皆以大乘而安立之。
^lb^ck10【戒行清淨願】
「第五大願：
願我來世得菩提時，
若有眾生於^lb我法中修行梵行，
此諸眾生無量無邊，一切^lb皆得不缺減戒，具三聚戒，
無有破戒趣惡道^pb9者。
^lb^ck11【諸根具足願】
「第六大願：
願我來世得菩提時，
若有眾生，其^lb身下劣，諸根不具，醜陋頑愚，聾盲跛躄，身攣^lb背傴，白癩癲狂，
若復有餘種種身病，聞我名^lb已，一切皆得，諸根具足，身分成滿。
^pb10^ck12【身心康樂願】
「第七大願：
願我來世得菩提時，
若有眾生，諸^lb患逼切，無護無依，無有住處，遠離一切資生^lb醫藥，又無親屬，貧窮可愍，
此人若得聞我名^lb號，
眾患悉除，無諸痛惱，
乃至究竟無上菩提。
^lb^ck13【轉女成男願】
「第八大願：
願我來世得菩提時，
若有女人，為^lb婦人百惡所逼惱故，厭離女身，願捨女形，
聞^lb我名已，轉女人身成丈夫相，乃至究竟無上^lb菩提。
^lb^ck14【回邪歸正願】
「第九大願：
願我來世得菩提時，
令一切眾生^lb解脫魔網，
若墮種種異見稠林，悉當安立置^pb12於正見，次第示以菩薩行門。
^lb^ck15【從縛得脫願】
「第十大願：
願我來世得菩提時，
若有眾生，種^lb種王法，繫縛、鞭撻、牢獄、應死，無量災難，悲憂^lb煎迫，身心受苦，
此等眾生，以我福力，皆得解^lb脫一切苦惱。
^pb13^ck16【得妙飲食願】
「十一大願：
願我來世得菩提時，
若有眾生，飢^lb火燒身，為求食故，作諸惡業，

我於彼所，先以^lb最妙色香味食，飽足其身，後以法味，畢竟安^lb樂而建立之。
^pb14^ck17【得妙衣具願】
「十二大願：
願我來世得菩提時，
若有眾生，貧^lb無衣服，寒熱蚊虻，日夜逼惱，
我當施彼，隨用^lb衣服，種種雜色，如其所好，
亦以一切寶莊嚴^lb具，花鬘、塗香、鼓樂、眾伎，隨諸眾生所須之，具^lb皆令滿足。
^ck18【總結】
「此十二大願，是彼世尊藥師琉璃^lb光如來、應、正遍知，行菩薩時，本昔所作。
^ck19【說略指廣】
「復次，^pb15曼殊室利！藥師琉璃光如來所有諸願，及彼^lb佛土功德莊嚴，
乃至窮劫說不可盡。
^ck20【以西喻東】
彼佛國^lb土一向清淨，無女人形，離諸欲惡，亦無一切^lb惡道苦聲，
琉璃為地，城闕、垣墻、門窓、堂閣柱^lb架、斗拱、周匝羅網，皆七寶成，
如極樂國，淨琉^pb16璃界莊嚴如是。
^ck21【以伴讚主】
「於其國中有二菩薩摩訶薩，

^lb一名日光，二名月光，
於彼無量無數諸菩薩^lb眾，最為上首，持彼世尊藥師琉璃光如來正^lb法之藏。
^ck22【結勸往生】
「是故，曼殊室利！信心善男子、善女人，
^lb應當願生彼佛國土。」
^ck23【離慳吝】
爾時，世尊復告曼殊室^pb17利童子言：
「曼殊室利！或有眾生，不識善惡，
多^lb貪無厭，不知布施及施果報，
愚癡無智，闕於^lb信根，聚財護惜，不欲分施。
此等眾生，無施心^lb故，見乞者來，其心不喜，
如割身肉。
復有無量^lb慳貪眾生，自不受用，
亦不欲與父母、妻子，況^pb18奴婢、作使及餘乞人。
此等眾生，人間命終，生^lb餓鬼道，或畜生道。
^ck24【離貪惜】
由昔人間，曾得聞彼藥師^lb琉璃光如來名號故，
或在鬼道，或畜生道，如^lb來名號暫得現前，
即於念時，彼處命終，還生^lb人道，得宿命智，
怖畏惡趣，不樂欲樂，
好行慧^pb19施，讚歎施者，
一切所有，悉能捨施，漸以頭目、^lb手足、血肉、身分
皆與求者，況餘財物。
^ck25【離毀犯】
「復次，曼^lb殊室利！有諸眾生，雖奉如來，受持學句，
然破^lb戒、破行、破於正見；
或受學句，護持禁戒，
然不^lb求多聞，
不解如來所說修多羅中甚深之義；
^pb20或復多聞，而增上慢，自是非他，
嫌謗正法，為^lb魔伴黨。
此等癡人，
及餘無量百千俱胝那由^lb他眾生，行邪道者，當墮地獄。
此等眾生，應於^lb地獄流轉無期，
^ck26【離見慢】
以得聞彼世尊藥師琉璃光^lb如來名號故，於地獄處，
彼佛威力，如來名號^pb21暫得現前，
即時捨命，還生人道，正見精進，淳^lb善淨心，
便能捨家，於如來教中出家學道，漸^lb次修行菩薩諸行。
^ck27【離嫉妬】
「復次，曼殊室利！或有眾生，^lb以妬忌故，但自稱讚，不讚他人。
此諸眾生，以^lb自高輕他故，於三惡道，無量千歲，受諸苦毒；
^pb22過無量千歲已，於彼命終，
生畜生趣，作牛馬^lb駝驢，
鞭杖捶擊，飢渴逼惱，身負重擔，隨路而^lb行；
若生人道，常居下賤，
為人奴婢，受他驅役。
^ck28【斷魔羂】
^lb若昔人中，聞彼世尊藥師琉璃光如來名號^lb者，
以此善根，
眾苦解脫，諸根猛利，聰慧博識，^pb23恒求善本，
得與良友常相隨逐，能斷魔羂，
破^lb無明㲉，竭煩惱河，
解脫一切生老病死，憂悲^lb苦惱。
^ck29【離鬥訟咒詛】
「復次，曼殊室利！有諸眾生，
好喜乖離，更^lb相鬪訟，此等互起惡心眾生，
身口及意，恒作^lb諸惡，
為欲相損，各各常以無益相加，
或告林^pb24神、樹神、山神、塚神種種別神，

殺諸畜生，
取其血肉，祭祀一切夜叉、羅剎食^lb血肉者，
書怨人^lb字，并作其形，成就種種毒害、呪術、
厭魅、蠱道、^lb起屍鬼呪，欲斷彼命及壞其身。
^ck30【轉起慈心】
由聞世尊藥^lb師琉璃光如來名號故，
此諸惡事不能傷損，
^pb25皆得互起慈心、益心、無嫌恨心，
各各歡悅，更^lb相攝受。
^ck31【往生極樂】
「復次，曼殊室利！此諸四眾——比丘、比丘^lb尼、優婆塞、優婆私——
及餘信心善男子、善女人^lb等，受八分齋，
或復一年，或復三月受持諸戒，
^lb以此善根，隨所憙樂，隨所願求，若欲往生西^pb26方極樂世界阿彌陀如來所者，
^ck32【自然化生】
由得聞彼世^lb尊藥師琉璃光如來名號故，
於命終時，有八^lb菩薩乘空而來，示其道徑，
即於彼界，種種異^lb色波頭摩華中自然化生；
^ck33【上生天國】
若復此人欲生天^lb上，
即得往生，本昔善根無有窮盡，
不復更生^pb27諸餘惡趣，
^ck34【還生人間】
天上命盡，當生人間，
為轉輪王，四^lb洲自在安立，
無量百千俱胝那由他眾生於^lb十善業道，
^ck35【生剎帝利】
或復生於剎利大族、婆羅門大族、^lb居士大家，金銀、粟帛、倉庫盈滿，
形色具足，自^lb在具足，眷屬具足，勇健多力如大力士；
^ck36【轉生丈夫】
若有^pb28女人得聞說此如來名號至心受持，此人於^lb後永離女身。」
^ck37【曼殊護持】
爾時，曼殊室利童子白佛言：
「世^lb尊！我於後時，以彼世尊藥師琉璃光如來名^lb號，於信心善男子、善女人所，
種種方便流布^lb令聞，
乃至睡中亦以佛名覺寤其耳。
^ck38【諸天護持】
若受持^pb29此經讀誦宣說，或復為他分別開解，
若自書，^lb若令人書，若取經卷，五色淨綵以盛裹之，灑^lb掃淨處以安置之，
持種種華、種種香、塗香、華^lb鬘、寶幢、幡蓋而用供養，

爾時，四大天王，與其^lb眷屬，并餘百千俱胝那由他諸天，皆詣其所。
^pb30若此經卷流行之處，
若復有人誦持此經，以^lb得聞彼世尊藥師琉璃光如來名號，及本昔^lb所發殊勝大願故，當知是處無復橫死，
亦復^lb不為諸鬼所持奪其魂魄，
設已奪者，還復如^lb故。」
^ck39【受持儀軌】
佛言：「如是，如是！曼殊室利！如汝所說。
曼殊^pb31室利！信心善男子、善女人，若欲供養彼如來^lb者，
此人應作如來形像，七日七夜受八分齋^lb食清淨食，
於清淨處散種種華，燒種種香，以^lb種種繒綵，種種幡幢，莊嚴其處，
澡浴清潔，著^lb新淨衣，
應生無垢濁心，無怒害心，於一切眾^pb32生起利益心，慈悲喜捨平等之心，
鼓樂歌讚，^lb右遶佛像，
應念彼如來本昔大願并解釋此^lb經，
^ck40【獲福益】
如所思念，如所願求，一切所欲，皆得圓滿——
^lb求長壽得長壽，
求福報得福報，
求自在得自^lb在，
求男女得男女。
^ck41【百怪出現難】
「或復有人忽得惡夢，或見^pb33諸惡相，或怪鳥來集，
於其住所百怪出現，
此^lb人若能以種種眾具，供養恭敬彼藥師琉璃^lb光如來者，
一切惡夢、惡相、不吉祥事皆悉隱^lb沒，
^ck42【一切怖畏難】
或有水怖、火怖、刀怖、毒怖、懸嶮之怖，惡象、^lb師子、虎狼、熊羆、毒蛇、惡蝎、蜈蚣、蚰蜒如是等^pb34怖，
憶念供養彼如來者，
一切怖畏皆得解脫。
^ck43【內亂外患難】
^lb若他國侵擾、賊盜反亂、
如是等怖，亦應念彼^lb如來恭敬尊重。
^ck44【華報如是】


^ck45【橫病除愈】





^ck46【毀犯墮落難】
「復次，曼殊室利！若有信心善^lb男子、善女人，
乃至盡形受三歸依，不事餘天，
^lb或持五戒，或持十戒，
或持菩薩一百四戒，
或^pb35復出家受持比丘二百五十戒，
若比丘尼受^lb持五百戒，
於隨所受中，毀犯禁戒，畏墮惡道，
^lb若能供養彼世尊藥師琉璃光如來者，
決定^lb不受三惡道報。









































^ck47【女人生產難】
或有女人臨當產時，受於極^lb苦，
若能稱名供養彼世尊藥師琉璃光如來^pb36者，速得解脫，
所生之子身分具足，形色端正，^lb見者歡喜，利根聰明，
安隱少病，無有非人奪^lb其魂魄。」
^ck48【問答決定】
爾時，世尊告慧命阿難言：
「阿難！如我^lb稱揚彼世尊藥師琉璃光如來所有功德，汝^lb信受耶？汝於如是諸佛如來甚深境界多生^pb37疑惑。」
時，慧命阿難白佛言：
「大德世尊！我於如^lb來所說法中，無復疑惑。
何以故？
一切如來身^lb口意行無不清淨。
世尊！此日月，有如是大神^lb通，有如是大威力，可令墮落，
須彌山王可得^lb移動，
諸佛所言無有差異。


^ck49【信謗德失】
大德世尊！或有眾^pb38生信根不具，
聞說如來佛境界已，作是思惟：
^lb『云何但念彼如來名獲爾許功德？』
心不信受，^lb生於誹謗，
此等長夜無義饒益，當墮苦趣。」
佛^lb言：
「阿難！若彼如來所有名號入其耳中，此人^lb墮惡道者，
無有是處。
^ck50【信解希有】
阿難！諸佛境界誠為難^pb39信，
汝今信受，應知皆是如來威力，
非一切聲^lb聞、辟支佛地所能信受，唯除一生補處菩薩^lb摩訶薩。
阿難！人身難得，
於三寶中信敬尊重^lb亦難可得，
聞彼如來名號倍難於此。






^ck51【功德無盡】
阿難！彼^lb世尊藥師琉璃光如來無量菩薩行，
無量諸^pb40巧便，無量曠大願，
我欲一劫若過一劫說彼^lb如來菩薩行願，乃至窮劫，
彼世尊藥師琉^lb璃光如來本昔所行及殊勝大願，亦不究盡。」








^ck52【說延壽法】
^lb爾時，眾中有菩薩摩訶薩名曰救脫，即從座^lb起，
偏露一髆，右膝著地，向婆伽婆合掌曲躬^pb41白言：
^ck53【病患垂危】
「大德世尊！於未來世，當有眾生，身嬰重^lb病，
長患羸瘦，不食飢渴，喉脣乾燥，
死相現前，^lb目無所見，父母、親眷、朋友、知識啼泣圍遶，
^ck54【引其神識】
其^lb人屍形臥在本處，閻摩使人引其神識，置於^lb閻摩法王之前，
^ck55【神識受報】
此人背後有同生神，隨其所^pb42作，
若罪若福一切皆書，
盡持授與閻摩法王。
^lb時閻摩法王推問其人，算計所作，隨善隨惡^lb而處分之。
^ck56【作福續命】
若能為此病人歸依彼世尊藥師^lb琉璃光如來，如法供養，
即得還復。
^ck57【勵力行善】
此人神識^lb得迴還時，如從夢覺皆自憶知，
或經七日、或^pb43二十一日、或三十五日、或四十九日，神識還^lb已，
具憶所有善惡業報，
由自證故，乃至失命^lb不造惡業。
^ck58【結勸】
是故信心善男子、善女人，
應當供^lb養藥師如來。」
^ck59【明延壽儀】
爾時，慧命阿難問救脫菩薩言：
^lb「善男子！應云何供養彼世尊藥師琉璃光如^pb44來也？」
^ck60【答延壽儀】
救脫菩薩言：
「大德阿難！若有患人欲脫^lb重病，當為此人七日七夜受八分齋，
當以飲^lb食，及種種眾具，隨力所辦，供養比丘僧，
晝夜^lb六時，禮拜供養彼世尊藥師琉璃光如來，
四^lb十九遍讀誦此經，
然四十九燈，
應造七軀彼^pb45如來像，
一一像前各置七燈，
一一燈量大如^lb車輪，
或復乃至四十九日光明不絕，
當造五^lb色綵幡長四十九尺。
^ck61【救國難以延命】
「復次，大德阿難！灌頂剎^lb利王等，若災難起時——
所謂人民疾疫難、他方^lb侵逼難、自界反逆難、星宿變怪難、日月薄蝕^pb46難、非時風雨難、過時不雨難——
爾時，此灌頂剎^lb利王，當於一切眾生，起慈愍心，赦諸繫閉，
依^lb前所說供養法式，供養彼世尊藥師琉璃光^lb如來。
時灌頂剎利王用此善根，由彼世尊藥^lb師琉璃光如來本昔勝願故，其王境界即得^pb47安隱，
風雨以時、禾稼成就、國土豐熟，
一切國^lb界所有眾生，無病安樂，多生歡喜，
於其國界^lb亦無夜叉、羅剎、毘舍闍等諸惡鬼神擾亂眾^lb生，
所有惡相皆即不現，
彼灌頂剎利王，壽命^lb色力無病自在並得增益。」
^ck62【救眾難以延命】


^ck63【增益已盡之命】
爾時，慧命阿難問^pb48救脫菩薩言：
「善男子！云何已盡之命而可更^lb延？」
救脫菩薩言：
「阿難！汝豈不聞如來所說九^lb橫死耶？




^ck64【九種橫死】
是故教以呪藥方便；或有眾生，得病^lb非重，
然無醫藥及看病人，
或復醫人療治失^lb所，
非時而死，

是為初橫；
第二橫者，王法所殺；
^pb49第三橫者，遊獵、放逸、婬醉無度，為諸非人害^lb其魂魄；
第四橫者，為火所燒；
第五橫者，為水^lb所溺；
第六橫者，入師子、虎豹、諸惡獸中；
第七^lb橫者，飢渴所困，不得飲食，因此致死；
第八橫^lb者，厭禱、毒藥、起屍鬼等之所損害；
第九橫者，^pb50投巖取死，
是名如來略說大橫有此九種，
其^lb餘復有無量諸橫。」
^ck65【結勸修度】






^ck66【藥叉誓護】


爾時，眾中有十二夜叉大^lb將，俱在會坐，


所謂：
^lb^gatha宮毘羅大將．跋折羅大將．迷佉羅大將、^lb安捺羅大將．安怛羅大將．摩涅羅大將．^pb51因陀羅大將．波異羅大將．摩呼羅大將^lb真達羅大將．招度羅大將．鼻羯羅大將，
^lb此等十二夜叉大將，一一各有七千夜叉以^lb為眷屬，皆同一聲白世尊言：
「我等今者蒙佛^lb威力，得聞世尊藥師琉璃光如來名號已，不^pb52復更有惡道之怖。
我今相與皆同一心，乃至^lb壽盡
歸依佛、歸依法、歸依僧，
皆當荷負一切^lb眾生，為作義利，饒益安樂，
隨於何等村城聚^lb落阿蘭拏處，
若流布此經，若復持彼世尊藥^lb師琉璃光如來名號親近供養者，
我等眷屬^pb53衛護是人，皆使解脫一切苦難，
諸有所求，悉^lb令滿足。」

爾時，世尊讚諸夜叉大將言：
「善哉，善^lb哉！大夜叉將！汝等若念彼世尊藥師琉璃光^lb如來恩德者，當念饒益一切眾生。」
^ck67【呪】


^ck68【阿難問名】

爾時，慧命^lb阿難白佛言：
「世尊！此經何名？云何奉持？」
佛言：^pb54「阿難！此法門者，名為『藥師琉璃光如來本昔^lb所發殊勝大願』，當如是持；
名為『十二夜叉大^lb將自誓』，當如是持；
名為『淨一切業障』，當如是^lb持。」
^ck69【大眾奉行】
時婆伽婆說是語已，
諸菩薩摩訶薩、
諸大^lb聲聞、
國王、大臣、婆羅門、居士，
及一切大眾阿^pb55修羅、揵達婆等，聞佛所說，歡喜奉行。
^lb^lb^lb佛說藥師如來本願經^pb56
^pb1^folio#bhaisajya_srimitra【尸梨蜜多】^bk#bhaisajya_srimitra〔佛說灌頂拔除過罪生死得度經卷第十二〕
^ck0【序】^lb^au〔東晉天竺三藏帛尸梨蜜多羅譯〕
^ck1【敘事證信】^lb灌頂章句拔除過罪生死得度經第十
^lb聞如是：
一時，佛遊

維耶離
音樂樹下，與八千^lb比丘眾、
菩薩三萬六千人俱，
國王、大臣、^pb2人民，及諸天龍八部、鬼神共會說法。
^ck2【禮請】
於是，文^lb殊師利法王子菩薩摩訶薩，承佛威神從座^lb而起，
長跪叉手，前白佛言：
「世尊！願為未來像^lb法眾生，宣揚顯說往昔過去諸佛名字及
清^lb淨國土莊嚴之事，
願為解說得聞法要。」
^ck3【起說】
佛告^pb3文殊師利：
「善哉，善哉！汝大慈無量，愍念罪苦^lb一切眾生，
問此往昔諸佛名字及國土清淨^lb莊嚴之事，利益一切無量眾生，度諸危厄令^lb得安隱。
汝今諦聽、諦受！善思念之！吾當為汝^lb分別說之。」
眾坐諸菩薩摩訶薩無央數眾，及^pb4諸應真、國王、長者、大臣、人民、天龍、鬼神、四輩^lb弟子，皆各默然聽佛所說，莫不歡喜一心樂^lb聞。
^ck4【總標依正】
佛告文殊師利：
「東方去此佛剎
十恒河沙^lb世界，
有佛名曰藥師琉璃光如來、
無所著、至^lb真、等正覺、
明行足、善逝、世間解、無上士、調御^pb5丈夫、
天人師、佛、世尊，度脫生老病死苦患。
^ck5【行願】
此^lb藥師琉璃光，本所修行菩薩道時，發心自^lb誓行十二上願，令一切眾生所求皆得。

^lb^ck6【生佛平等願】
「第一願者，
使我來世得作佛時，自身光明普^lb照十方，
三十二相八十種好而自莊嚴，
令一^pb6切眾生如我無異。
^lb^ck7【開曉事業願】
「第二願者，
使我來世自身猶如瑠璃，
內外明徹淨^lb無瑕穢，
妙色廣大功德巍巍，
安住十方如日^lb照世，
幽冥眾生悉蒙開曉。

^lb^ck8【無盡資生願】
「第三願者，
使我來世
智慧廣大，如海無窮潤^pb7澤枯涸無量眾生普使蒙益，
悉令飽滿無飢^lb渴想，甘食美饍悉持施與。
^lb^ck9【安立大道願】
「第四願者，
使我來世佛道成就，
巍巍堂堂如^lb星中之月，消除生死之雲令無有翳，
明照世^lb界行者見道，熱得清涼解除垢穢。
^pb8^ck10【戒行清淨願】
「第五願者，
使我來世發大精進，
淨持戒地令^lb無濁穢，慎護所受令無缺犯，
亦令一切戒行^lb具足，堅持不犯至無為道。

^lb^ck11【諸根具足願】
「第六願者，
使我來世若有眾生，
諸根毀敗盲^lb者使視，䏊者能聽啞者得語，軁者能申跛者^pb9能行，
如是不完具者悉令具足。
^lb^ck12【身心康樂願】
「第七願者，
使我來世十方世界，
若有苦惱無^lb救護者，我為此等攝大法藥，

令諸疾病皆得^lb除愈，
無復苦患至得佛道。
^lb^ck13【轉女成男願】
「第八願者，
使我來世以善業因緣，
為諸愚冥^pb10無量眾生講宣妙法，
令得度脫入智慧門，普使明了無諸疑惑。
^lb^ck14【回邪歸正願】
「第九願者，
使我來世
摧伏惡魔及諸外道，
顯^lb揚清淨無上道法，使入正真無諸邪僻，迴向^lb菩提八正覺路。
^pb11^ck15【從縛得脫願】
「第十願者，
使我來世
若有眾生，王法所加臨^lb當刑戮，無量怖畏愁憂苦惱。若復鞭撻枷鎖^lb其體，種種恐懼逼切其身，
如是無量諸苦惱^lb等，悉令解脫無有眾難。
^lb^ck16【得妙飲食願】
「第十一願者，
使我來世若
有眾生飢火所惱，

^pb12令得種種甘美飲食，天諸餚饍種種無數，悉^lb以賜與令身充足。
^lb^ck17【得妙衣具願】
「第十二願者，
使我來世
若有貧凍裸露眾生^lb即得衣服，窮乏之者施以珍寶，倉庫盈溢無^lb所乏少。
一切皆受無量快樂，乃至無有一人^pb13受苦，
使諸眾生和顏悅色，形貌端嚴人所憙^lb見，琴瑟鼓吹如是無量最上音聲，施與一切^lb無量眾生。是為十二微妙上願。」
^lb^ck18【總結】
佛告文殊師利：「此藥師琉璃光佛本願功德^lb如是。
^ck19【說略指廣】
我今為汝略說其國莊嚴之事。

^ck20【以西喻東】
此藥師^pb14琉璃光如來國土清淨，無五濁、無愛欲、無意^lb垢，
以白銀琉璃為地，宮殿樓閣悉用七寶，
亦^lb如西方無量壽國無有異也。
^ck21【以伴讚主】
有二菩薩：

一名日曜、二名月淨，
是二菩薩次^lb補佛處。
^ck22【結勸往生】

諸善男子及善女人，亦當願生彼^pb15國土也。」
^ck23【離慳吝】
文殊師利白佛言：「唯願演說藥^lb師琉璃光如來無量功德，饒益眾生令得佛^lb道。」佛言：「若有男子、女人，新破眾魔來入^lb正道，得聞我說是藥師琉璃光如來名字者，^lb魔家眷屬退散馳走，如是無量拔眾生苦，我^pb16今說之。」佛告文殊師利：
「世間有人不解罪福，
^lb慳貪不知布施今世後世當得其福，
世人愚^lb癡
但知貪惜，
寧自割身肉而噉食之，
不肯持^lb錢財布施求後世之福。
世又有人身不衣食，
^lb此大慳貪命終已後，當墮餓鬼及在畜生^pb17中，
^ck24【離貪惜】
聞我說是藥師琉璃光如來名字之時，

無^lb不解脫憂苦者也。
皆作信心貪福畏罪，

人從^lb索頭與頭索眼與眼，
乞妻與妻匃子與子，求^lb金銀珍寶皆大布施一時歡喜，即發無上正^lb真道意。」
^ck25【離毀犯】
佛言：「若復有人受佛淨戒，
遵奉明法^pb18不解罪福，


雖知明經不及中義，不能分別曉^lb了中事，
以自貢高恒常矒憒，
乃與世間眾魔^lb從事，
更作縛著不解行之。
戀著婦女恩愛之^lb情，口為說空行在有中，不能發覺復不自知，
^lb但能論說他人是非，如此人輩皆當墮三^pb19惡道中。
^ck26【離見慢】
聞我說是藥師瑠璃光佛本願功德，

^lb無不歡喜，
念欲捨家行作沙門者也。」
^ck27【離嫉妬】
^lb佛言：「世間有人，好自稱譽皆是貢高，
當墮三^lb惡道中，
後還為人，
作牛馬、奴婢，

生下賤中人，
當^lb乘其力負重而行，困苦疲極亡失人身。
^ck28【斷魔羂】
聞我^pb20說是藥師瑠璃光佛如來本願功德者，
皆當一^lb心歡喜踊躍更作謙敬，即得解脫眾苦之患，
^lb長得歡樂聰明智慧，遠離惡道得生善處，
與^lb善知識共相值遇
無復憂惱，
離諸魔縛長得安隱。」
^ck29【離鬥訟咒詛】
佛言：^lb「世間愚癡人輩，
兩舌、鬪諍、惡口、

罵詈更相嫌^pb21恨。
或就山神樹下鬼神，日月之神南斗北辰^lb諸鬼神，所作諸呪誓。



或作人名字，或作人^lb形像，
或作符書以相厭禱呪咀言說，
^ck30【轉起慈心】
聞我說^lb是藥師瑠璃光佛本願功德，
無不兩作和解，
^lb俱生慈心惡意悉滅，
各各歡喜無復惡念。」
^ck31【往生極樂】
佛^pb22言：「若四輩弟子——比丘、比丘尼、
清信士、清信女——^lb常修月
六齋年三長齋，或晝夜精勤一心苦^lb行，
願欲往生西方阿彌陀佛國者，憶念晝夜，^lb若一日、二日、三日、四日、五日、六日、七日，
^ck32【自然化生】
或復^lb中悔，聞我說是藥師瑠璃光佛本願功德，
盡^pb23其壽命欲終之日，有八菩薩，其名曰：「文殊師^lb利菩薩、觀世音菩薩、得大勢菩薩、無盡意^lb菩薩、寶壇華菩薩、藥王菩薩、藥上菩薩、彌勒^lb菩薩。
如是八菩薩摩訶薩等皆當飛往迎其^lb精神，不經八難生蓮華中，自然音樂而相娛^pb24樂。」
^ck33【上生天國】
佛言：「假使壽命自欲盡時臨終之日，得聞^lb我說是藥師瑠璃光佛本願功德者，命終之^lb後皆得上生天上，

不復歷三惡道中。
^ck34【還生人間】
天上^lb福盡若下生人間，
當為帝王家作子，

^ck35【生剎帝利】
或於豪^lb姓長者居士富貴家生，
皆當端正聰明智慧^pb25高才勇猛。
^ck36【轉生丈夫】
若是女人化成男子，無復憂苦患^lb難者也。」
^ck37【曼殊護持】
佛語文殊：
「我稱譽顯說藥師瑠^lb璃光佛、至真、等正覺，
本所修集無量行願功^lb德如是。」

^ck38【諸天護持】
文殊師利從坐而起，長跪叉手，白佛^lb言：
「世尊！佛去世後，當以此法開化十方一切^pb26眾生，使其受持是經典也。
若有男子女^lb人愛樂是經，受持讀誦宣通之者，復能專念，^lb若一日、二日、三日、四日、五日，乃至七日憶念^lb不忘，
能以好素帛紙書取是經，五色雜綵作囊^lb盛之者，
是時當有諸天善神、四天大王、龍神^pb27八部，當來營衛愛敬此經。

能日日作禮，是持經^lb者不墮橫死，
所在安隱惡氣消滅，
諸魔鬼神^lb亦不中害。」
^ck39【受持儀軌】
佛言：「如是，如是！如汝所說。」文殊師^lb利言：「天尊所說，言無不善。」
佛言：「文殊！^lb若有善男子、善女人等，
發心造立藥師瑠璃^pb28光如來形像，
供養禮拜懸雜色幡蓋，燒香散^lb華歌詠讚歎，
圍繞百匝還本座處，
端坐思惟^lb念藥師瑠璃光佛無量功德。
若有男子、女人，七日七夜菜食長齋，

^ck40【獲福益】
供養禮拜藥師瑠^lb璃光佛，求心中所願者無不獲得。
求長壽得^pb29長壽，
求富饒得富饒，求安隱得安隱，
求男女^lb得男女，
求官位得官位。
^ck41【百怪出現難】
若命過已後，欲生妙^lb樂天上者，亦當禮敬藥師瑠璃光佛、至真、等^lb正覺；若欲上生三十三天者，亦當禮敬^lb瑠璃光佛必得往生；若欲與明師世世相值遇^pb30者，亦當禮敬瑠璃光佛。」

佛告文殊：^lb「若欲生十方妙樂國土者，亦當禮敬瑠^lb璃光佛。欲得生兜率天見彌勒者，亦應禮敬藥師瑠璃光佛。
若欲遠諸邪道，亦應^lb禮敬藥師瑠璃光佛。若夜惡夢鳥鳴百怪蜚^pb31尸邪忤，魍魎鬼神之所嬈者，亦當禮敬^lb藥師瑠璃光佛。
^ck42【一切怖畏難】
若為水火所焚漂者，亦當禮敬^lb藥師瑠璃光佛。若入山谷為虎狼熊羆蒺䔧^lb諸獸象龍，蚖蛇蝮蠍種種雜類，
若有惡心來^lb相向者，心當存念瑠璃光佛，
山中諸難^pb32不能為害。
^ck43【內亂外患難】
若他方怨賊偷竊惡人，怨家債主^lb欲來侵陵，
心當存念瑠璃光佛，則不為^lb害。
^ck44【華報如是】
以善男女禮敬瑠璃光如來^lb功德，所致華報如是，況果報也。
是故，吾今勸^lb請四輩，禮事瑠璃光佛、至真、等正覺。」
^ck45【橫病除愈】
佛告^pb33文殊：「我但為汝略說藥師瑠璃光佛^lb禮敬功德。
若使我廣說是瑠璃光佛無^lb量功德，與一切人求心中所願者，
從^lb一劫至一劫故無不周遍，其世間人若有著床痿黃困^lb篤惡病，
連年累月不差者，聞我說是藥師^pb34瑠璃光佛名字之時，
橫病之厄無不^lb除愈，唯宿殃不請耳。」
^ck46【毀犯墮落難】
佛告文殊：「若男子、^lb女人，
受三自歸，
若五戒、若十戒、
若善信菩薩^lb二十四戒、
若沙門二百五十戒、
若比丘尼五^lb百戒、若菩薩戒，
若破是諸戒，若能至心一^pb35懺悔者，
復聞我說藥師瑠璃光佛，
終不墮^lb三惡道中，必得解脫。




























若人愚癡不受父母師^lb友教誨，不信佛、不信經戒、不信聖僧，應墮三^lb惡道中者，亡失人種受畜生身，聞我說是藥^lb師瑠璃光佛善願功德者，即得解脫。」
佛告文^pb36殊師利：「世有惡人，雖受佛禁戒觸事違犯，
或^lb殺無道、偷竊他人財寶、欺詐妄語、婬他婦女、^lb飲酒、鬪亂兩舌惡口罵詈毀人，
犯戒為惡，^lb復祠祀鬼神，有如是過罪當墮地獄中。
若當^lb屠割，若抱銅柱，若臥鐵床，若鐵鉤出舌，若洋^pb37銅灌口者，
聞我說是藥師瑠璃光佛，無不即^lb得解脫者也。」
佛告文殊：「其世間人豪貴^lb下賤，不信佛、不信經道、不信沙門、不信有須^lb陀洹、不信有斯陀含、不信有阿那含、不信有^lb阿羅漢、不信有辟支佛、不信有十住菩薩、不^pb38信有三世之事、不信有十方諸佛、不信有本^lb師釋迦文佛、不信人死神明更生，善者受^lb福惡者受殃，有如是之罪應墮惡道。
聞^lb我說是藥師瑠璃光佛名字之者，一切過罪^lb自然消滅。」
佛告文殊：「若有善男子、善女^pb39人，聞我說是藥師瑠璃光佛、至真、等正覺，其^lb誰不發無上正真道意，後皆當得作佛。
人居^lb世間仕官不遷，治生不得飢寒困厄，亡失財^lb產無復方計，
聞我說是藥師瑠璃光佛，各各^lb得心中所願，仕官皆得高遷，
財物自然長^pb40益，飲食充饒皆得富貴。
若為縣官之所拘錄，^lb惡人侵枉，若為怨家所得便者，心當存念藥^lb師瑠璃光佛。
^ck47【女人生產難】
若他婦女生產難者，
皆當念是^lb藥師瑠璃光佛，
兒則易生身體平正，無諸疾^lb痛六情完具，聰明智慧壽命得長，
不遭抂橫^pb41善神擁護，不為惡鬼舐其頭也。」
^ck48【問答決定】
佛說是語時，^lb阿難在右邊。佛顧語阿難言：
「汝信我為文殊^lb師利說往昔東方過十恒河沙有佛名藥^lb師瑠璃光本願功德者不？」
阿難白佛言：
「唯，^lb天中天！佛之所說何敢不信耶！」
佛復語阿難^pb42言：
「如世間人，雖有眼耳鼻舌身意，人常用是^lb六事以自迷惑。
但信世間魔邪之言，不信至^lb真至誠度世苦切之語，如是輩人難可開化^lb也。」
阿難白佛言：「世尊！世人多有惡逆下賤之^lb者，
若聞佛說經開人耳目破治人病，除人^pb43闇冥使覩光明，
解人疑結去人重罪，千劫萬^lb劫無復憂患，
皆因佛說是藥師瑠璃光佛本^lb願功德，悉令安隱得其福也。」
^ck49【信謗德失】
佛言：「阿難！汝口^lb為言善，而汝內心狐疑不信我言。
阿難！汝莫^lb作是念，以自毀敗汝之功德。」
佛言：「阿難！我見汝心，我知^pb44汝意，汝知之不？」
阿難即以頭面著地長跪，白^lb佛言：
「審如天中天所說，我造次，聞佛說是藥^lb師瑠璃光極大尊貴，智慧巍巍難可度量，^lb我心有小疑耳，敢不首伏。」
佛言：
「汝智慧狹劣^lb少見少聞，汝聞我說深妙之法無上空義，
應^pb45生信敬貴重之心，必當得至無上正真道^lb也。」
^ck50【信解希有】
文殊問佛言：「世尊！佛說是藥師瑠璃^lb光如來無量功德，
如是不審誰肯信此^lb言者？」
佛答文殊言：「唯有百億諸菩薩摩^lb訶薩當信是言耳，唯有十方三世諸佛當信^pb46是言。」
佛言：「我說是藥師瑠璃光佛如來本願功^lb德，難可得見何況得聞，亦難得說難得書^lb寫亦難得讀。
文殊師利！若有男子、女人，^lb能信是經，受持讀誦書著竹帛，復能為他人^lb解說中義，此皆先世已發道意，
今復得聞此^pb47微妙法，開化十方無量眾生，^lb當知此人必當得至無上正真道也。」






^ck51【功德無盡】
佛告阿難：「我作佛以^lb來，從生死復至生死，勤苦累劫無所不經無^lb所不歷，
無所不作無所不為，如是不可思議，
^lb況復瑠璃光佛本願功德者乎！
汝所以^pb48有疑者，亦復如是。
「阿難！汝聞佛所說，汝諦信^lb之莫作疑惑。
佛語至誠，無有虛偽亦無二言，^lb佛為信者施，不為疑者說也。
「阿難！汝莫作小^lb疑以毀大乘之業，汝却後亦當發摩訶衍心，^lb莫以小道毀汝功德也。」
阿難言：「唯唯，^pb49天中天！我從今日以去無復爾心，唯佛自當^lb知我心耳。」
佛語阿難：「此經能照諸天宮宅，若^lb三災起時，中有天人發心念此瑠璃光^lb佛本願功德經者，皆得離於彼處之難；
是經^lb能除水涸不調；是經能除他方逆賊悉令斷^pb50滅，四方夷狄各還正治不相嬈惱，國土交通^lb人民歡樂；
是經能除穀貴飢凍；是經能滅惡^lb星變怪；是經能除疫毒之病；是經能救三惡^lb道苦，地獄餓鬼畜生等苦。
若人得聞此經典^lb者，無不解脫厄難者也。」
^ck52【說延壽法】
爾時，眾中有一菩薩^pb51名曰救脫，從座而起整衣服，叉手合掌而^lb白佛言：
「我等今日聞佛世尊演說過東方^lb十恒河沙世界有佛號瑠璃光，一切眾^lb會靡不歡喜。」
^ck53【病患垂危】



^ck54【引其神識】

^ck55【神識受報】




^ck56【作福續命】


^ck57【勵力行善】
救脫菩薩又白佛言：「若族姓^lb男女其有尫羸，著床痛惱無救護者，
我今當^pb52勸請眾僧，七日七夜齋戒一心，受持八禁^lb六時行道，
四十九遍讀是經典，勸然七層之^lb燈，
亦勸懸五色續命神幡。」
^ck58【結勸】


^ck59【明延壽儀】
阿難問救脫菩薩^lb言：
「續命幡燈法則云何？」
^ck60【答延壽儀】
救脫菩薩語阿難言：
^lb「神幡五色，四十九尺，燈亦復爾。
七層之燈，一^pb53層七燈，燈如車輪。
若遭厄難閉在牢獄枷鎖^lb著身，
亦應造立五色神幡、
然四十九燈，
應放^lb雜類眾生至四十九，
可得過度危厄之難，
不^lb為諸橫惡鬼所持。」


^ck61【救國難以延命】










^ck62【救眾難以延命】
救脫菩薩語阿難言：「若國^lb王、大臣，及諸輔相、王子、妃主、中宮、婇女，若為^pb54病苦所惱，亦應造立五色繒幡、然燈續明、救^lb諸生命，散雜色華燒眾名香，王當放赦屈厄^lb之人徒鎖解脫，王得其福天下太平，雨澤以^lb時人民歡樂，惡龍攝毒無病苦者，四方夷狄^lb不生逆害，國土通洞，慈心相向無諸怨害，四^pb55海歌詠稱王之德。
乘此福祿在意所生，見佛^lb聞法信受教誨，從是福報至無上道。」
^ck63【增益已盡之命】
阿難又^lb問救脫菩薩言：
「命可續也？」
救脫菩薩答阿難^lb言：

「我聞世尊說有諸橫，勸造幡蓋令其修福。」
^lb又言：「阿難！昔沙彌救蟻，以修福故，盡其壽命^pb56不更苦患身體安寧，福德力強使之然也。」
阿^lb難因復問救脫菩薩言：「橫有幾種？」
救脫菩薩答阿難言：
^ck64【九種橫死】
「世尊說言^lb橫乃無數，略而言之大橫有九：
一者、橫病；




二^lb者、橫有口舌；
三者、橫遭縣官；
四者、身羸無福，^lb又持戒不完橫為鬼神之所得便；
五者、橫為^pb57劫賊之所剝脫；
六者、橫為水火之所災漂；
七^lb者、橫為雜類禽獸所噉；
八者、橫為怨讎符書^lb厭禱邪神牽引，未得其福，但受其殃先亡牽^lb引，亦名橫死；
九者、有病不治，又不修福，湯藥^lb不順，針炙失度，不值良醫，為病所困於是滅^pb58亡。
又信世間妖㜸之師，為作恐動寒熱言語^lb妄發禍福，所犯者多，心不自正不能自定，卜^lb問覓禍，殺猪狗牛羊種種眾生，解奏神明，呼^lb諸邪妖魍魎鬼神請乞福祚，欲望長生終不^lb能得，愚癡迷惑信邪倒見，死入地獄展轉^pb59其中無解脫時。是名九橫。」
救脫菩薩語阿難言：^lb「其世間人，痿黃之病困篤著床，求生不得求^lb死不得考楚萬端，此病人者或其前世造作^lb惡業，罪過所招殃咎所引故使然也。」
^ck65【結勸修度】
救脫菩^lb薩語阿難言：
「閻羅王者，主領世間名籍之記。
^pb60若人為惡作諸非法，無孝順心造作五逆，破^lb滅三寶無君臣法。又有眾生不持五戒不信^lb正法，設有受者多所毀犯，於是地下鬼神及^lb伺候者奏上五官，五官料簡除死定生，或注^lb錄精神未判是非。
若已定者奏上閻羅，閻羅^pb61監察隨罪輕重考而治之。
世間痿黃之病，困^lb篤不死一絕一生，由其罪福未得料簡，錄其^lb精神在彼王所，或七日、二三七日乃^lb至七七日名籍定者，放其精神還其身中，如^lb從夢中見其善惡。其人若明了者，信驗罪福。
^pb62是故我今勸諸四輩，造續命神旛、然四十九^lb燈、放諸生命，以此旛燈放生功德，拔彼精神^lb令得度苦，今世後世不遭厄難。」
^ck66【藥叉誓護】
救脫菩薩語^lb阿難言：
「如來世尊說是經典，威神功德利益^lb不少。」
座中諸鬼神有十二神王，從座而起往^pb63到佛所，胡跪合掌，白佛言：
「我等十二鬼神^lb在所作護，若城邑聚落空閑林中，若四輩弟^lb子誦持此經，令所結願無求不得。」
阿難問言：^lb「其名云何？為我說之。」
救脫菩薩言：「灌頂章句^lb其名如是：
^pb64「神名金毘羅．神名和耆羅．神名彌佉羅^lb神名安陀羅．神名摩尼羅．神名宋林羅^lb神名因持羅．神名波耶羅．神名摩休羅^lb神名真陀羅．神名照頭羅．神名毘伽羅」
^lb救脫菩薩語阿難言：「此諸鬼神別有七千以^pb65為眷屬，皆悉叉手低頭，
聽佛世尊說是藥師^lb瑠璃光如來本願功德，莫不一時捨鬼神形^lb得受人身，長得度脫無眾惱患。







若人疾急厄^lb難之日，當以五色縷結其名字，得如願已然^lb後解結，令人得福。

灌頂章句法應如是。」
^ck67【呪】
即說^pb66呪曰：
^lb^gatha「南謨鼻殺(所界反)遮．俱嚧吠瑠璃耶．鉢^lb^gatha波喝邏社耶．哆姪他．鼻殺遮．鼻殺遮^lb^gatha娑婆揭帝．薩婆訶」
^lb^ck68【阿難問名】
佛說是經時，比丘僧八千人、諸菩薩三萬^pb67六千人、諸天、龍、鬼神、八部大王無不歡喜。
^lb阿難即從座起，前白佛言：
「世尊、演說此經當^lb何名之？」
佛言：「此經凡有三名：一名『藥師瑠璃^lb光如來本願功德』，
二名『灌頂章句十二神王^lb結願神呪』，
三名『拔除過罪生死得度』。」
^ck69【大眾奉行】
佛說^pb68經竟，
大眾、


人民作禮奉行。
^lb佛說灌頂經卷第十二
^lb^lb^pb69
^pb1^folio#ksitigarbha1【地藏經】^bk#ksitigarbha〔地藏菩薩本願經〕卷上^lb^au〔唐于闐國三藏沙門實叉難陀譯〕
^lb^ck1〔忉利天宮神通品第一〕
^lb如是我聞：
一時，佛在忉利天，為母說法。
爾時，^lb十方無量世界，不可說不可說一切諸佛，及^pb2大菩薩摩訶薩，皆來集會。
讚歎釋迦牟尼佛，^lb能於五濁惡世，現不可思議大智慧神通之^lb力，調伏剛強眾生，知苦樂法，各遣侍者，問訊^lb世尊。
是時，如來含笑，放百千萬億大光明雲——
^lb所謂大圓滿光明雲、大慈悲光明雲、大智慧^pb3光明雲、大般若光明雲、大三昧光明雲、大吉^lb祥光明雲、
大福德光明雲、大功德光明雲、大^lb歸依光明雲、大讚歎光明雲。
放如是等不可^lb說光明雲已，又出種種微妙之音——
所謂檀波^lb羅蜜音、尸波羅蜜音、羼提波羅蜜音、毘離耶^pb4波羅蜜音、禪波羅蜜音、般若波羅蜜音、
慈悲^lb音、喜捨音、解脫音、無漏音、智慧音、大智慧音、^lb師子吼音、大師子吼音、雲雷音、大雲雷音。

出^lb如是等不可說不可說音已，娑婆世界及他^lb方國土，有無量億天龍鬼神，亦集到忉利天^pb5宮。
所謂四天王天、忉利天、須焰摩天、兜率陀^lb天、化樂天、他化自在天、梵眾天、梵輔天、大梵^lb天、
少光天、無量光天、光音天、少淨天、無量淨^lb天、遍淨天、福生天、福愛天、廣果天、
無想天、無^lb煩天、無熱天、善見天、善現天、色究竟天、摩醯^pb6首羅天，乃至非想非非想處天，
一切天眾、龍^lb眾、鬼神等眾，悉來集會。

復有他方國土，及娑^lb婆世界海神、江神、河神、樹神、山神、地神、川澤^lb神、苗稼神、晝神、
夜神、空神、天神、飲食神、草木^lb神，如是等神，皆來集會。

復有他方國土，及娑^pb7婆世界諸大鬼王——
所謂惡目鬼王、噉血鬼王、^lb噉精氣鬼王、噉胎卵鬼王、行病鬼王、攝毒鬼^lb王、慈心鬼王、福利鬼王、大愛敬鬼王，如是等^lb鬼王，皆來集會。

爾時，釋迦牟尼佛告文殊師^lb利法王子菩薩摩訶薩：
「汝觀是一切諸佛菩^pb8薩，及天龍鬼神，此世界，他世界，此國土，他國^lb土，如是今來集會，到忉利天者，汝知數不？」
文^lb殊師利白佛言：「世尊！若以我神力，千劫測度，^lb不能得知。」
佛告文殊師利：「吾以佛眼觀故，猶^lb不盡數。
此皆是地藏菩薩久遠劫來，已度、當^pb9度、未度，已成就、當成就、未成就。」
文殊師利白^lb佛言：「世尊！我已過去久修善根，證無礙智，聞^lb佛所言，即當信受。
小果聲聞、天龍八部，及未^lb來世諸眾生等，雖聞如來誠實之語，必懷疑^lb惑，設使頂受，未免興謗。
唯願世尊，廣說地藏^pb10菩薩摩訶薩因地作何行、立何願，而能成就^lb不思議事？」
佛告文殊師利：「譬如三千大千世^lb界，所有草木叢林，稻麻竹葦，山石微塵，
一物^lb一數，作一恒河，一恒河沙，一沙一界。
一界之^lb內，一塵一劫，一劫之內，所積塵數，盡克為劫。
^pb11地藏菩薩證十地果位已來，千倍多於上喻。
^lb何況地藏菩薩在聲聞、辟支佛地。
文殊師利！^lb此菩薩威神誓願，不可思議。
若未來世，有善^lb男子、善女人，聞是菩薩名字，或讚歎，或瞻禮，^lb或稱名，或供養，
乃至彩畫、刻鏤、塑漆形像，是^pb12人當得百返生於三十三天，永不墮惡道。

「文^lb殊師利！是地藏菩薩摩訶薩，於過去久遠不^lb可說不可說劫前，身為大長者子。
時世有佛，^lb號曰師子奮迅具足萬行如來。
時長者子，見^lb佛相好，千福莊嚴，因問彼佛：『作何行願，而得^pb13此相？』
時師子奮迅具足萬行如來告長者子：^lb『欲證此身，當須久遠度脫一切受苦眾生。』
「文^lb殊師利！時長者子，因發願言：
『我今盡未來際^lb不可計劫，為是罪苦六道眾生，廣設方便，盡^lb令解脫，而我自身，方成佛道。』
以是於彼佛前，^pb14立斯大願，于今百千萬億那由他不可說劫，^lb尚為菩薩。

「又於過去，不可思議阿僧祇劫，時^lb世有佛，號曰覺華定自在王如來。
彼佛壽命，^lb四百千萬億阿僧祇劫。
像法之中，有一婆羅^lb門女，宿福深厚，眾所欽敬；行住坐臥，諸天衛^pb15護。
其母信邪，常輕三寶。
是時聖女，廣說方便，^lb勸誘其母，令生正見。
而此女母，未全生信，不^lb久命終，魂神墮在無間地獄。
時婆羅門女，知^lb母在世不信因果，計當隨業，必生惡趣。
遂賣^lb家宅，廣求香華，及諸供具，於先佛塔寺，大興^pb16供養。
見覺華定自在王如來，其形像在一寺^lb中，塑畫威容，端嚴畢備。
時婆羅門女，瞻禮尊^lb容，倍生敬仰。
私自念言：『佛名大覺，具一切智，^lb若在世時，我母死後，儻來問佛，必知處所。』
時^lb婆羅門女，垂泣良久，瞻戀如來。
忽聞空中聲^pb17曰：『泣者聖女！勿至悲哀，我今示汝母之去處。』
^lb婆羅門女合掌向空，而白空曰：『是何神德，寬^lb我憂慮。
我自失母已來，晝夜憶戀，無處可問^lb知母生界。』
時空中有聲，再報女曰：『我是汝^lb所瞻禮者，過去覺華定自在王如來。
見汝憶母，^pb18倍於常情眾生之分，故來告示。』
婆羅門女聞^lb此聲已，舉身自撲，支節皆損。
左右扶侍，良久^lb方穌，而白空曰：『願佛慈愍，速說我母生界。
我^lb今身心，將死不久。』
時覺華定自在王如來告^lb聖女曰：
『汝供養畢，但早返舍。端坐思惟吾之^pb19名號，即當知母所生去處。』
「時婆羅門女，尋禮^lb佛已，即歸其舍。
以憶母故，端坐念覺華定自^lb在王如來，經一日一夜。
忽見自身，到一海邊。
^lb其水涌沸，多諸惡獸，盡復鐵身，飛走海上，東^lb西馳逐。
見諸男子女人，百千萬數，出沒海中，^pb20被諸惡獸爭取食噉。
又見夜叉，其形各異，或^lb多手多眼，多足多頭，口牙外出，利刃如劍，
驅^lb諸罪人，使近惡獸，復自搏攫，頭足相就。
其形^lb萬類，不敢久視。
時婆羅門女，以念佛力故，自^lb然無懼。

「有一鬼王，名曰無毒，稽首來迎，白聖^pb21女曰：
『善哉！菩薩何緣來此？』
時婆羅門女問鬼^lb王曰：『此是何處？』
無毒答曰：『此是大鐵圍山西^lb面第一重海。』
聖女問曰：『我聞鐵圍之內，地獄^lb在中，是事實不？』
無毒答曰：『實有地獄。』
聖女問^lb曰：『我今云何，得到獄所？』
無毒答曰：『若非威神，^pb22即須業力，非此二事，終不能到。』
聖女又問：『此^lb水何緣，而乃涌沸？多諸罪人，及以惡獸？』
無毒^lb答曰：『此是閻浮提造惡眾生新死之者，經四^lb十九日後，
無人繼嗣為作功德，救拔苦難，生^lb時又無善因，當據本業所感地獄，自然先渡^pb23此海。
海東十萬由旬，又有一海，其苦倍此。
彼^lb海之東，又有一海，其苦復倍。
三業惡因之所^lb招感，共號業海，其處是也。』
聖女又問鬼王無^lb毒曰：『地獄何在？』
無毒答曰：『三海之內，是大地^lb獄，其數百千，各各差別。
所謂大者，具有十八。
^pb24次有五百，苦毒無量。
次有千百，亦無量苦。』
聖^lb女又問大鬼王曰：『我母死來未久，不知魂神^lb當至何趣？』
鬼王問聖女曰：『菩薩之母，在生習^lb何行業？』
聖女答曰：『我母邪見，譏毀三寶。設或^lb暫信，旋又不敬。死雖日淺，未知生處。』
無毒問^pb25曰：『菩薩之母，姓氏何等？』
聖女答曰：『我父我母，^lb俱婆羅門種。
父號尸羅善現，母號悅帝利。』
無^lb毒合掌，啟菩薩曰：『願聖者却返本處，無至憂^lb憶悲戀。
悅帝利罪女，生天以來，經今三日。
云^lb承孝順之子，為母設供、修福，布施覺華定自^pb26在王如來塔寺。
非唯菩薩之母得脫地獄，應^lb是無間罪人，此日悉得受樂，俱同生訖。』鬼王^lb言畢，合掌而退。
婆羅門女，尋如夢歸。
悟此事^lb已，便於覺華定自在王如來塔像之前，立弘^lb誓願：
『願我盡未來劫，應有罪苦眾生，廣設方^pb27便，使令解脫。』」
佛告文殊師利：「時鬼王無毒者，^lb當今財首菩薩是。
婆羅門女者，即地藏菩薩^lb是。」
^lb^ck2〔分身集會品第二〕
^lb爾時，百千萬億不可思、不可議、不可量、不可^pb28說、無量阿僧祇世界，所有地獄處，
分身地藏^lb菩薩，俱來集在忉利天宮。
以如來神力故，各^lb以方面，與諸得解脫從業道出者，
亦各有千^lb萬億那由他數，共持香華，來供養佛。
彼諸同^lb來等輩，皆因地藏菩薩教化，永不退轉於阿^pb29耨多羅三藐三菩提。
是諸眾等，久遠劫來，流^lb浪生死，六道受苦，暫無休息。
以地藏菩薩廣^lb大慈悲，深誓願故，各獲果證。
既至忉利，心懷^lb踊躍，瞻仰如來，目不暫捨。

爾時，世尊舒金色^lb臂，摩百千萬億不可思、不可議、不可量、不可^pb30說、
無量阿僧祇世界諸分身地藏菩薩摩訶^lb薩頂，而作是言：
「吾於五濁惡世，教化如是剛^lb強眾生，令心調伏，捨邪歸正。
十有一二，尚惡^lb習在。
吾亦分身千百億，廣設方便。
或有利根，^lb聞即信受。
或有善果，勤勸成就。
或有暗鈍，久^pb31化方歸。
或有業重，不生敬仰。
如是等輩眾生，^lb各各差別，分身度脫。
或現男子身，或現女人^lb身，或現天龍身，或現神鬼身，或現山林川原、^lb河池泉井，利及於人，悉皆度脫。
或現天帝身，^lb或現梵王身，或現轉輪王身，或現居士身，或^pb32現國王身，
或現宰輔身，或現官屬身，或現比^lb丘、比丘尼、優婆塞、優婆夷身，
乃至聲聞、羅漢、^lb辟支佛、菩薩等身，而以化度。
非但佛身，獨現^lb其前。
汝觀吾累劫勤苦，度脫如是等難化剛^lb強罪苦眾生。
其有未調伏者，隨業報應。
若墮^pb33惡趣，受大苦時，汝當憶念吾在忉利天宮，殷^lb勤付囑。
令娑婆世界，至彌勒出世已來眾生，^lb悉使解脫，永離諸苦，遇佛授記。」
爾時，諸世界^lb分身地藏菩薩，共復一形，涕淚哀戀，白其佛^lb言：
「我從久遠劫來，蒙佛接引，使獲不可思議^pb34神力，具大智慧。
我所分身，遍滿百千萬億恒^lb河沙世界。
每一世界，化百千萬億身。
每一身，^lb度百千萬億人，令歸敬三寶，永離生死，至涅^lb槃樂。
但於佛法中，所為善事，一毛一渧，一沙^lb一塵，或毫髮許，我漸度脫，使獲大利。
唯願世^pb35尊不以後世惡業眾生為慮。」如是三白佛言：^lb「唯願世尊不以後世惡業眾生為慮。」
爾時，佛^lb讚地藏菩薩言：「善哉！善哉！吾助汝喜。
汝能成^lb就久遠劫來，發弘誓願，廣度將畢，即證菩提。」
^lb^ck3〔觀眾生業緣品第三〕
^pb36爾時，佛母摩耶夫人，恭敬合掌，問地藏菩薩^lb言：
「聖者！閻浮眾生，造業差別，所受報應，其事^lb云何？」
地藏答言：「千萬世界，乃及國土，或有地^lb獄，或無地獄，或有女人，或無女人，或有佛法，
^lb或無佛法，乃至聲聞、辟支佛，亦復如是。
非但^pb37地獄，罪報一等。」
摩耶夫人重白菩薩：「且願聞^lb於閻浮罪報，所感惡趣。」
地藏答言：「聖母！唯願^lb聽受，我麁說之。」佛母白言：「願聖者說。」
爾時，地^lb藏菩薩白聖母言：「南閻浮提罪報，名號如是：
^lb若有眾生，不孝父母，或至殺害，當墮無間地^pb38獄，千萬億劫，求出無期。
若有眾生，出佛身血，^lb毀謗三寶，不敬尊經，亦當墮於無間地獄，千^lb萬億劫，求出無期。
若有眾生，侵損常住，點污^lb僧尼，或伽藍內，恣行淫欲，或殺或害，
如是等^lb輩，當墮無間地獄，千萬億劫，求出無期。
若有^pb39眾生，偽作沙門，心非沙門，破用常住，欺誑白^lb衣，違背戒律，種種造惡，
如是等輩，當墮無間^lb地獄，千萬億劫，求出無期。
若有眾生，偷竊常^lb住財物穀米、飲食衣服，乃至一物不與取者，^lb當墮無間地獄，千萬億劫，求出無期。」
地藏白^pb40言：「聖母！若有眾生，作如是罪，當墮五無間地^lb獄，求暫停苦，一念不得。」
摩耶夫人重白地藏^lb菩薩言：「云何名為無間地獄？」
地藏白言：「聖母！^lb諸有地獄，在大鐵圍山之內。
其大地獄，有一^lb十八所。
次有五百，名號各別。
次有千百，名字^pb41亦別。
無間獄者，其獄城，周匝八萬餘里，其城^lb純鐵，高一萬里，城上火聚，少有空缺。
其獄城^lb中，諸獄相連，名號各別。

「獨有一獄，名曰無間。
^lb其獄周匝萬八千里，獄墻高一千里，悉是鐵^lb為，上火徹下，下火徹上，鐵蛇鐵狗，
吐火馳逐，^pb42獄墻之上，東西而走。
獄中有床，遍滿萬里。
一^lb人受罪，自見其身，遍臥滿床。
千萬人受罪，亦^lb各自見，身滿床上。
眾業所感，獲報如是。
又諸^lb罪人，備受眾苦。
千百夜叉，及以惡鬼，口牙如^lb劍，眼如電光，手復銅爪，拖拽罪人。
復有夜叉，^pb43執大鐵戟，中罪人身，或中口鼻，或中腹背，拋^lb空翻接，或置床上。
復有鐵鷹，啗罪人目。
復有^lb鐵蛇，繳罪人頸。
百肢節內，悉下長釘，拔舌耕^lb犁，抽腸剉斬，洋銅灌口，熱鐵纏身。
萬死千生，^lb業感如是。
動經億劫，求出無期。
此界壞時，寄^pb44生他界。
他界次壞，轉寄他方。
他方壞時，展轉^lb相寄。
此界成後，還復而來。
無間罪報，其事如^lb是。

「又五事業感，故稱無間。
何等為五？一者，日^lb夜受罪，以至劫數，無時間絕，故稱無間。
二者，^lb一人亦滿，多人亦滿，故稱無間。
三者，罪器叉^pb45棒，鷹蛇狼犬，碓磨鋸鑿，剉斫鑊湯，鐵網鐵繩，^lb鐵驢鐵馬，生革絡首，
熱鐵澆身，飢吞鐵丸，渴^lb飲鐵汁。
從年竟劫，數那由他，苦楚相連，更無^lb間斷，故稱無間。
四者，不問男子女人，羗胡夷^lb狄，老幼貴賤，或龍或神，或天或鬼，罪行業感，^pb46悉同受之，故稱無間。
五者，若墮此獄，從初入^lb時，至百千劫，一日一夜，萬死萬生。
求一念間，^lb暫住不得。
除非業盡，方得受生。
以此連綿，故^lb稱無間。」
地藏菩薩白聖母言：「無間地獄，麁說^lb如是。
若廣說地獄罪器等名，及諸苦事，一劫^pb47之中，求說不盡。」
摩耶夫人聞已，愁憂合掌，頂^lb禮而退。
^lb^ck4〔閻浮眾生業感品第四〕
^lb爾時，地藏菩薩摩訶薩白佛言：
「世尊！我承佛^lb如來威神力故，遍百千萬億世界，分是身形，^pb48救拔一切業報眾生。
若非如來大慈力故，即^lb不能作如是變化。
我今又蒙佛付囑，至阿逸^lb多成佛已來，六道眾生，遣令度脫。
唯然，世尊，^lb願不有慮。」
爾時，佛告地藏菩薩：「一切眾生，未^lb解脫者，性識無定。
惡習結業，善習結果，為善^pb49為惡，逐境而生。
輪轉五道，暫無休息，動經塵^lb劫，迷惑障難。
如魚遊網，將是長流，脫入暫出，^lb又復遭網。
以是等輩，吾當憂念。
汝既畢是往^lb願，累劫重誓，廣度罪輩，吾復何慮？」
說是語時，^lb會中有一菩薩摩訶薩，名定自在王，白佛言：
^pb50「世尊！地藏菩薩累劫已來，各發何願？今蒙世^lb尊，殷勤讚歎。
唯願世尊，略而說之。」
爾時，世尊^lb告定自在王菩薩：「諦聽！諦聽！善思念之，吾當^lb為汝，分別解說。
乃往過去，無量阿僧祇那由^lb他不可說劫，爾時有佛，號一切智成就如來——
^pb51應供、正遍知、明行足、善逝、世間解、無上士、調^lb御丈夫、天人師、佛、世尊，其佛壽命六萬劫。
未^lb出家時，為小國王，與一隣國王為友，同行十^lb善，饒益眾生。
其隣國內，所有人民，多造眾惡。
^lb二王議計，廣設方便。
一王發願，早成佛道，當^pb52度是輩，令使無餘。
一王發願，若不先度罪苦，^lb令是安樂，得至菩提，我終未願成佛。」
佛告定^lb自在王菩薩：「一王發願早成佛者，即一切智^lb成就如來是。
一王發願永度罪苦眾生，未願^lb成佛者，即地藏菩薩是。
復於過去，無量阿僧祇^pb53劫，有佛出世，名清淨蓮華目如來，其佛壽^lb命四十劫。
像法之中，有一羅漢，福度眾生。
因^lb次教化，遇一女人，字曰光目，設食供養。
羅漢^lb問之：『欲願何等？』
光目答言：『我以母亡之日，資^lb福救拔，未知我母生處何趣？』
羅漢愍之，為入^pb54定觀，見光目女母墮在惡趣，受極大苦。
羅漢^lb問光目言：『汝母在生，作何行業？今在惡趣，受^lb極大苦。』
光目答言：『我母所習，唯好食噉魚鼈^lb之屬。
所食魚鼈多食其子，或炒或煮，恣情食^lb噉。
計其命數，千萬復倍。尊者慈愍，如何哀救？』
^pb55羅漢愍之，為作方便，勸光目言：
『汝可志誠念^lb清淨蓮華目如來，兼塑畫形像，存亡獲報。』
「光^lb目聞已，即捨所愛，尋畫佛像，而供養之。
復恭^lb敬心，悲泣瞻禮。
忽於夜後，夢見佛身，金色晃^lb耀，如須彌山，放大光明，而告光目：
『汝母不久，^pb56當生汝家，纔覺飢寒，即當言說。』
「其後家內，婢^lb生一子，未滿三日，而乃言說，稽首悲泣，告於^lb光目：
『生死業緣，果報自受。
吾是汝母，久處暗^lb冥，自別汝來，累墮大地獄。
蒙汝福力，方得受^lb生。
為下賤人，又復短命，壽年十三，更落惡道。
^pb57汝有何計，令吾脫免？』光目聞說，知母無疑，哽^lb咽悲啼，而白婢子：
『既是我母，合知本罪，作何^lb行業，墮於惡道？』
婢子答言：『以殺害毀罵二業^lb受報。
若非蒙福，救拔吾難，以是業故，未合解^lb脫。』
光目問言：『地獄罪報，其事云何？』
婢子答言：^pb58『罪苦之事，不忍稱說，百千歲中，卒白難竟。』
「光^lb目聞已，啼淚號泣，而白空界：『願我之母，永脫^lb地獄。
畢十三歲，更無重罪，及歷惡道。
十方諸^lb佛，慈哀愍我，聽我為母所發廣大誓願：
若得^lb我母永離三塗，及斯下賤，乃至女人之身，永^lb劫不受者，願我自今日後，
對清淨蓮華目如^lb來像前，却後百千萬億劫中，應有世界，所有^lb地獄，及三惡道，
諸罪苦眾生，誓願救拔，令離^lb地獄惡趣、畜生、餓鬼等。
如是罪報等人，盡成^lb佛竟，我然後方成正覺。』
「發誓願已，具聞清淨^pb60蓮華目如來而告之曰：
『光目！汝大慈愍，善能^lb為母發如是大願。
吾觀汝母，十三歲畢，捨此^lb報已，生為梵志，壽年百歲。
過是報後，當生無^lb憂國土，壽命不可計劫。
後成佛果，廣度人天，^lb數如恒河沙。』」
佛告定自在王：「爾時羅漢福度^pb61光目者，即無盡意菩薩是。
光目母者，即解脫^lb菩薩是。
光目女者，即地藏菩薩是。
過去久遠^lb劫中，如是慈愍發恒河沙願，廣度眾生。

「未來^lb世中，若有男子女人，不行善者，行惡者，
乃至不^lb信因果者，邪婬妄語者，兩舌惡口者，
毀謗大^pb62乘者，如是諸業眾生，必墮惡趣。
若遇善知識，^lb勸令一彈指間歸依地藏菩薩，是諸眾生，即^lb得解脫三惡道報。
若能志心歸敬，及瞻禮讚^lb歎，香華衣服，種種珍寶，或復飲食，如是奉事^lb者，
未來百千萬億劫中，常在諸天受勝妙樂。
^pb63若天福盡，下生人間，猶百千劫，常為帝王，能^lb憶宿命因果本末。
定自在王，如是地藏菩薩，^lb有如此不可思議大威神力，廣利眾生，汝等^lb諸菩薩，當記是經，廣宣流布。」
定自在王白佛^lb言：「世尊！願不有慮。
我等千萬億菩薩摩訶薩，^pb64必能承佛威神，廣演是經於閻浮提，利益眾^lb生。」
定自在王菩薩白世尊已，合掌恭敬，作禮^lb而退。

爾時，四方天王，俱從座起，合掌恭敬，白^lb佛言：
「世尊！地藏菩薩於久遠劫來，發如是大^lb願，云何至今，猶度未絕，更發廣大誓言？唯願^pb65世尊，為我等說。」
佛告四天王：「善哉！善哉！吾今^lb為汝，及未來現在天人眾等，廣利益故，說地^lb藏菩薩於娑婆世界，
閻浮提內，生死道中，慈^lb哀救拔，度脫一切罪苦眾生方便之事。」
四天^lb王言：「唯然，世尊！願樂欲聞。」
佛告四天王：「地藏^pb66菩薩久遠劫來，迄至于今，度脫眾生，猶未畢^lb願。
慈愍此世罪苦眾生，復觀未來無量劫中，^lb因蔓不斷，以是之故，又發重願。
如是菩薩，於^lb娑婆世界，閻浮提中，百千萬億方便，而為教^lb化。

「四天王！地藏菩薩若遇殺生者，說宿殃短^pb67命報。
若遇竊盜者，說貧窮苦楚報。
若遇邪婬^lb者，說雀鴿鴛鴦報。
若遇惡口者，說眷屬鬪諍^lb報。
若遇毀謗者，說無舌瘡口報。
若遇瞋恚者，^lb說醜陋癃殘報。
若遇慳悋者，說所求違願報。
^lb若遇飲食無度者，說飢渴咽病報。
若遇畋獵^pb68恣情者，說驚狂喪命報。
若遇悖逆父母者，說^lb天地災殺報。
若遇燒山林木者，說狂迷取死^lb報。
若遇前後父母惡毒者，說返生鞭撻現受^lb報。
若遇網捕生雛者，說骨肉分離報。
若遇毀^lb謗三寶者，說盲聾瘖瘂報。
若遇輕法慢教者，^pb69說永處惡道報。
若遇破用常住者，說億劫輪^lb迴地獄報。
若遇污梵誣僧者，說永在畜生報。
^lb若遇湯火斬斫傷生者，說輪迴遞償報。
若遇^lb破戒犯齋者，說禽獸飢餓報。
若遇非理毀用^lb者，說所求闕絕報。
若遇吾我貢高者，說卑使^pb70下賤報。
若遇兩舌鬪亂者，說無舌百舌報。
若^lb遇邪見者，說邊地受生報。

「如是等閻浮提眾^lb生，身口意業，惡習結果，百千報應，今麁略說。
^lb如是等閻浮提眾生，業感差別，地藏菩薩百^lb千方便，而教化之。
是諸眾生，先受如是等報，^pb71後墮地獄，動經劫數，無有出期。
是故汝等，護^lb人護國，無令是諸眾業，迷惑眾生。」
四天王聞^lb已，涕淚悲歎，合掌而退。
^lb^ck5〔地獄名號品第五〕
^lb爾時，普賢菩薩摩訶薩白地藏菩薩言：「仁者！^pb72願為天龍四眾，及未來現在一切眾生，
說娑^lb婆世界及閻浮提罪苦眾生，所受報處地獄^lb名號，及惡報等事，使未來世末法眾生，知是^lb果報。」
地藏答言：「仁者！我今承佛威神，及大士^lb之力，略說地獄名號，及罪報惡報之事。
仁者，^pb73閻浮提東方有山，號曰鐵圍，其山黑邃，無日^lb月光。
有大地獄，號極無間。
又有地獄，名大阿^lb鼻。
復有地獄，名曰四角。
復有地獄，名曰飛刀。
^lb復有地獄，名曰火箭。
復有地獄，名曰夾山。
復^lb有地獄，名曰通槍。
復有地獄，名曰鐵車。
復有^lb地獄，名曰鐵床。
復有地獄，名曰鐵牛。
復有地^lb獄，名曰鐵衣。
復有地獄，名曰千刃。
復有地獄，^lb名曰鐵驢。
復有地獄，名曰洋銅。
復有地獄，名^lb曰抱柱。
復有地獄，名曰流火。
復有地獄，名曰^lb耕舌。
復有地獄，名為剉首。
復有地獄，名曰燒^lb脚。
復有地獄，名曰啗眼。
復有地獄，名曰鐵丸。
^lb復有地獄，名曰諍論。
復有地獄，名曰鐵鈇。
復^lb有地獄，名曰多瞋。」
地藏白言：「仁者！鐵圍之內，有^lb如是等地獄，其數無限。
更有叫喚地獄、拔舌^lb地獄、糞尿地獄、銅鎖地獄、火象地獄、火狗地^pb76獄、火馬地獄、火牛地獄、
火山地獄、火石地獄、^lb火床地獄、火梁地獄、火鷹地獄、鋸牙地獄、剝^lb皮地獄、飲血地獄、
燒手地獄、燒脚地獄、倒刺^lb地獄、火屋地獄、鐵屋地獄、火狼地獄。
如是等^lb地獄，其中各各復有諸小地獄，或一或二，或^pb77三或四，乃至百千。
其中名號，各各不同。」
地藏^lb菩薩告普賢菩薩言：「仁者！此者皆是南閻浮^lb提行惡眾生，業感如是。
業力甚大，能敵須彌，^lb能深巨海，能障聖道。
是故眾生莫輕小惡，以^lb為無罪，死後有報，纖毫受之。
父子至親，岐路^pb78各別，縱然相逢，無肯代受。
我今承佛威力，略^lb說地獄罪報之事。
唯願仁者，暫聽是言。」
普賢^lb答言：「吾已久知三惡道報，望仁者說，令後世^lb末法一切惡行眾生，聞仁者說，使令歸佛。」
地^lb藏白言：「仁者！地獄罪報，其事如是：或有地獄，^pb79取罪人舌，使牛耕之。
或有地獄，取罪人心，夜^lb叉食之。
或有地獄，鑊湯盛沸，煮罪人身。
或有^lb地獄，赤燒銅柱，使罪人抱。
或有地獄，使諸火^lb燒，趁及罪人。
或有地獄，一向寒氷。
或有地獄，^lb無限糞尿。
或有地獄，純飛𨪏鏫。
或有地獄，多^pb80攢火槍。
或有地獄，唯撞胸背。
或有地獄，但燒^lb手足。
或有地獄，盤繳鐵蛇。
或有地獄，驅逐鐵^lb狗。
或有地獄，盡駕鐵騾。
仁者，如是等報，各各^lb獄中，有百千種業道之器，無非是銅，是鐵，是^lb石，是火。
此四種物，眾業行感。
若廣說地獄罪^pb81報等事，一一獄中，更有百千種苦楚，何況多^lb獄。
我今承佛威神，及仁者問，略說如是。
若廣^lb解說，窮劫不盡。」
^lb^ck6〔如來讚歎品第六〕
^lb爾時，世尊舉身放大光明，遍照百千萬億恒^pb82河沙等諸佛世界，出大音聲，
普告諸佛世界^lb一切諸菩薩摩訶薩，及天龍鬼神、人、非人等：
^lb「聽吾今日稱揚讚歎地藏菩薩摩訶薩，於十^lb方世界，現大不可思議威神慈悲之力，救護^lb一切罪苦之事。
吾滅度後，汝等諸菩薩大士，^pb83及天龍鬼神等，廣作方便，衛護是經，令一切^lb眾生，證涅槃樂。」
說是語已，會中有一菩薩，名^lb曰普廣，合掌恭敬，而白佛言：
「今見世尊讚歎^lb地藏菩薩，有如是不可思議大威神德。
唯願^lb世尊為未來世末法眾生，宣說地藏菩薩利^pb84益人天因果等事，使諸天龍八部，及未來世^lb眾生，頂受佛語。」
爾時，世尊告普廣菩薩及四眾^lb等：「諦聽！諦聽！吾當為汝略說地藏菩薩利^lb益人天福德之事。」
普廣白言：「唯然，世尊！願樂^lb欲聞。」
佛告普廣菩薩：「未來世中，若有善男子、^pb85善女人，聞是地藏菩薩摩訶薩名者，
或合掌^lb者、讚歎者、作禮者、戀慕者，是人超越三十劫^lb罪。

「普廣！若有善男子、善女人，或彩畫形像，或^lb土石膠漆，金、銀、銅、鐵，
作此菩薩，一瞻一禮者，^lb是人百返生於三十三天，永不墮於惡道。
假^pb86如天福盡故，下生人間，猶為國王，不失大利。
^lb若有女人，厭女人身，盡心供養地藏菩薩畫^lb像，及土石膠漆銅鐵等像，
如是日日不退，常^lb以華、香、飲食、衣服、繒綵、幢旛、錢、寶物等供養。
^lb是善女人，盡此一報女身，百千萬劫，更不生^pb87有女人世界，何況復受？
除非慈願力故，要受^lb女身，度脫眾生。
承斯供養地藏力故，及功德^lb力，百千萬劫，不受女身。

「復次，普廣！若有女人，^lb厭是醜陋、多疾病者，但於地藏像前，志心瞻^lb禮，食頃之間，
是人千萬劫中，所受生身，相貌^pb88圓滿。
是醜陋女人，如不厭女身，即百千萬億^lb生中，常為王女，乃及王妃、宰輔大姓、大長者^lb女，端正受生，諸相圓滿。
由志心故，瞻禮地藏菩^lb薩，獲福如是。

「復次，普廣！若有善男子、善女人，能^lb對菩薩像前，作諸伎樂，及歌詠讚歎，香華供^pb89養，
乃至勸於一人多人，如是等輩，現在世中，^lb及未來世，常得百千鬼神日夜衛護，不令惡^lb事輒聞其耳，何況親受諸橫？
「復次，普廣！未來^lb世中，若有惡人，及惡神惡鬼，見有善男子、善^lb女人歸敬供養讚歎瞻禮地藏菩薩形像，
或^pb90妄生譏毀，謗無功德及利益事，或露齒笑，或^lb背面非，或勸人共非，或一人非，或多人非，
乃^lb至一念生譏毀者，如是之人，賢劫千佛滅度，^lb譏毀之報，尚在阿鼻地獄，受極重罪。
過是劫^lb已，方受餓鬼。
又經千劫，復受畜生。
又經千劫，^pb91方得人身。
縱受人身，貧窮下賤，諸根不具，多^lb被惡業，來結其心，不久之間，復墮惡道。
是故，^lb普廣！譏毀他人供養，尚獲此報，何況別生惡^lb見毀滅？
「復次，普廣！若未來世，有男子女人，久^lb處床枕，求生求死，了不可得，或夜夢惡鬼，乃^pb92及家親，
或遊險道，或多魘寐，共鬼神遊，日月^lb歲深，轉復尫瘵，眠中叫苦，慘悽不樂者，
此皆^lb是業道論對，未定輕重，或難捨壽，或不得愈。
^lb男女俗眼，不辨是事。
但當對諸佛菩薩像前，^lb高聲轉讀此經一遍。
或取病人可愛之物，或^pb93衣服寶貝、莊園舍宅，對病人前，高聲唱言：
『我^lb某甲等，為是病人，對經像前，捨諸等物，或供^lb養經像，或造佛菩薩形像，或造塔寺，或然油^lb燈，或施常住。』如是三白病人，遣令聞知。
假令^lb諸識分散，至氣盡者，乃至一日、二日、三日、四^pb94日，至七日已來，但高聲白，高聲讀經。
是人命^lb終之後，宿殃重罪，至于五無間罪，永得解脫。
^lb所受生處，常知宿命。
何況善男子、善女人，自^lb書此經，或教人書，或自塑畫菩薩形像，乃至^lb教人塑畫，所受果報，必獲大利。

「是故，普廣！若^pb95見有人讀誦是經，乃至一念讚歎是經，或恭^lb敬者，
汝須百千方便，勸是等人，勤心莫退，能^lb得未來現在千萬億不可思議功德。

「復次，普^lb廣！若未來世諸眾生等，或夢或寐，見諸鬼神^lb乃及諸形，或悲或啼，或愁或歎，或恐或怖。
此^pb96皆是一生十生，百生千生，過去父母、男女弟^lb妹、夫妻眷屬，在於惡趣，未得出離，
無處希望^lb福力救拔，當告宿世骨肉，使作方便，願離惡^lb道。
普廣！汝以神力，遣是眷屬，令對諸佛菩薩^lb像前，志心自讀此經，或請人讀。
其數三遍，或^pb97七遍。
如是惡道眷屬，經聲畢是遍數，當得解^lb脫。
乃至夢寐之中，永不復見。

「復次，普廣！若未^lb來世有諸下賤等人，或奴或婢，乃至諸不自^lb由之人，
覺知宿業，要懺悔者，志心瞻禮地藏^lb菩薩形像，乃至一七日中，念菩薩名，可滿萬^pb98遍。
如是等人，盡此報後，千萬生中，常生尊貴，^lb更不經三惡道苦。

「復次，普廣！若未來世中，閻^lb浮提內，剎利、婆羅門、長者、居士、一切人等，
及^lb異姓種族，有新產者，或男或女，七日之中，早^lb與讀誦此不思議經典，更為念菩薩名，可滿^pb99萬遍。
是新生子，或男或女，宿有殃報，便得解^lb脫，安樂易養，壽命增長。
若是承福生者，轉增^lb安樂，及與壽命。

「復次，普廣！若未來世眾生，於^lb月一日、八日、十四日、十五日、十八日、二十三、
^lb二十四、二十八、二十九日，乃至三十日，
是諸^pb100日等，諸罪結集，定其輕重。
南閻浮提眾生，舉^lb止動念，無不是業，無不是罪，何況恣情殺害、^lb竊盜、邪婬、妄語，百千罪狀？
能於是十齋日，對^lb佛菩薩諸賢聖像前，讀是經一遍，東西南北，^lb百由旬內，無諸災難。
當此居家，若長若幼，現^pb101在未來百千歲中，永離惡趣。
能於十齋日每^lb轉一遍，現世令此居家無諸橫病，衣食豐溢。

^lb「是故，普廣！當知地藏菩薩有如是等不可說^lb百千萬億大威神力利益之事。
閻浮眾生，於^lb此大士有大因緣。
是諸眾生，聞菩薩名，見菩^pb102薩像，乃至聞是經，三字五字，或一偈一句者，
^lb現在殊妙安樂，未來之世，百千萬生，常得端^lb正，生尊貴家。」
爾時，普廣菩薩聞佛如來稱揚^lb讚歎地藏菩薩已，胡跪合掌，復白佛言：
「世尊！^lb我久知是大士有如此不可思議神力，及大^pb103誓願力。
為未來眾生，遣知利益，故問如來，唯^lb然頂受。
世尊！當何名此經？使我云何流布？」
佛^lb告普廣：「此經有三名：一名地藏本願，亦名地^lb藏本行，亦名地藏本誓力經。
緣此菩薩，久遠^lb劫來，發大重願，利益眾生，是故汝等，依願流^pb104布。」
普廣聞已，合掌恭敬，作禮而退。
^lb地藏菩薩本願經卷上
^lb音釋^lb^pb105
^pb1^folio#ksitigarbha2地藏菩薩本願經卷下
^lb^au【唐于闐國三藏沙門實叉難陀譯】
^lb^ck7〔利益存亡品第七〕
^lb爾時，地藏菩薩摩訶薩白佛言：「世尊！我觀是^lb閻浮眾生，舉心動念，無非是罪。
脫獲善利，多^pb2退初心；若遇惡緣，念念增益。
是等輩人，如履^lb泥塗，負於重石，漸困漸重，足步深邃。
若得遇^lb知識，替與減負，或全與負，是知識有大力故，^lb復相扶助，勸令牢脚，若達平地，須省惡路，無^lb再經歷。

「世尊！習惡眾生，從纖毫間，便至無量。
^pb3是諸眾生，有如此習，臨命終時，父母眷屬宜^lb為設福，以資前路。
或懸旛蓋，及然油燈，或轉^lb讀尊經，或供養佛像及諸聖像。
乃至念佛菩^lb薩及辟支佛名字，一名一號，歷臨終人耳根，^lb或聞在本識。
是諸眾生所造惡業，計其感果，^pb4必墮惡趣，緣是眷屬為臨終人修此聖因，如^lb是眾罪，悉皆銷滅。
若能更為身死之後，七七^lb日內，廣造眾善，能使是諸眾生，永離惡趣，得^lb生人天，受勝妙樂，現在眷屬，利益無量。

「是故^lb我今對佛世尊，及天龍八部、人、非人等，勸於^pb5閻浮提眾生：
臨終之日，慎勿殺害，及造惡緣——^lb拜祭鬼神，求諸魍魎。
何以故？爾所殺害，乃至^lb拜祭，無纖毫之力利益亡人，但結罪緣，轉增^lb深重。
假使來世，或現在生，得獲聖分，生人天^lb中，緣是臨終被諸眷屬造是惡因，亦令是命^pb6終人，殃累對辯，晚生善處。
何況臨命終人，在^lb生未曾有少善根，各據本業，自受惡趣，何忍^lb眷屬，更為增業？
譬如有人，從遠地來，絕糧三^lb日，所負擔物，強過百斤。
忽遇隣人，更附少物，^lb以是之故，轉復困重。
世尊！我觀閻浮眾生，但^pb7能於諸佛教中，乃至善事，一毛一渧，一沙一^lb塵，如是利益，悉皆自得。」
說是語時，會中有一^lb長者，名曰大辯——是長者，久證無生，化度十方，^lb現長者身——，
合掌恭敬，問地藏菩薩言：
「大士！是^lb南閻浮提眾生，命終之後，小大眷屬，為修功^pb8德，
乃至設齋，造眾善因，是命終人，得大利益^lb及解脫不？」
地藏答言：「長者！我今為未來現在^lb一切眾生，承佛威力，略說是事。
長者，未來現^lb在諸眾生等，臨命終日，得聞一佛名、一菩薩^lb名、一辟支佛名，不問有罪無罪，悉得解脫。

「若^pb9有男子女人，在生不修善因，多造眾罪，命終^lb之後，眷屬小大為造福利一切聖事，
七分之^lb中，而乃獲一，六分功德，生者自利。
以是之故，^lb未來現在善男女等，聞健自修，分分己獲。
無^lb常大鬼，不期而到，冥冥遊神，未知罪福，七七^pb10日內，如癡如聾。
或在諸司，辯論業果，審定之^lb後，據業受生。
未測之間，千萬愁苦，何況墮於^lb諸惡趣等？
是命終人，未得受生，在七七日內，^lb念念之間，望諸骨肉眷屬，與造福力救拔。
過^lb是日後，隨業受報，若是罪人，動經千百歲中，^pb11無解脫日。
若是五無間罪，墮大地獄，千劫萬^lb劫，永受眾苦。

「復次，長者！如是罪業眾生，命終^lb之後，眷屬骨肉，為修營齋，資助業道。
未齋食^lb竟，及營齋之次，米泔菜葉，不棄於地。
乃至諸^lb食未獻佛僧，勿得先食。
如有違食及不精勤，^pb12是命終人，了不得力。
如精勤護淨，奉獻佛僧，^lb是命終人，七分獲一。
是故，長者！閻浮眾生，若^lb能為其父母，乃至眷屬，
命終之後，設齋供養，^lb志心勤懇，如是之人，存亡獲利。」
說是語時，忉^lb利天宮有千萬億那由他閻浮鬼神，悉發無^pb13量菩提之心。
大辯長者，作禮而退。

^lb^ck8〔閻羅王眾讚歎品第八〕
^lb爾時，鐵圍山內，有無量鬼王，與閻羅天子，俱^lb詣忉利，來到佛所。
所謂惡毒鬼王、多惡鬼王、^lb大諍鬼王、白虎鬼王、血虎鬼王、赤虎鬼王、
散^pb14殃鬼王、飛身鬼王、電光鬼王、狼牙鬼王、千眼^lb鬼王、噉獸鬼王、負石鬼王、
主耗鬼王、主禍鬼^lb王、主食鬼王、主財鬼王、主畜鬼王、主禽鬼王、^lb主獸鬼王、
主魅鬼王、主產鬼王、主命鬼王、主^lb疾鬼王、主險鬼王、三目鬼王、四目鬼王、五目^pb15鬼王、
祁利失王、大祁利失王、祁利叉王、大祁^lb利叉王、阿那吒王、大阿那吒王。
如是等大鬼^lb王，各各與百千諸小鬼王，盡居閻浮提，各有^lb所執，各有所主。
是諸鬼王，與閻羅天子，承佛^lb威神，及地藏菩薩摩訶薩力，俱詣忉利，在一^pb16面立。

爾時，閻羅天子，胡跪合掌，白佛言：
「世尊！^lb我等今者與諸鬼王，承佛威神，及地藏菩薩^lb摩訶薩力，
方得詣此忉利大會，亦是我等獲^lb善利故。
我今有小疑事，敢問世尊，唯願世尊，^lb慈悲宣說。」
佛告閻羅天子：「恣汝所問，吾為汝^pb17說。」
是時，閻羅天子瞻禮世尊，及迴視地藏菩^lb薩，而白佛言：
「世尊！我觀地藏菩薩，在六道中，^lb百千方便，而度罪苦眾生，不辭疲倦。
是大菩^lb薩，有如是不可思議神通之事。
然諸眾生，脫^lb獲罪報，未久之間，又墮惡道。
世尊！是地藏菩^pb18薩既有如是不可思議神力，
云何眾生而不^lb依止善道，永取解脫？唯願世尊，為我解說。」
佛^lb告閻羅天子：「南閻浮提眾生，其性剛強，難調^lb難伏。
是大菩薩，於百千劫，頭頭救拔如是眾^lb生，早令解脫。
是罪報人，乃至墮大惡趣。
菩薩^pb19以方便力，拔出根本業緣，而遣悟宿世之事。
^lb自是閻浮眾生，結惡習重，旋出旋入。
勞斯菩^lb薩，久經劫數，而作度脫。

「譬如有人，迷失本家，^lb誤入險道。
其險道中，多諸夜叉，及虎狼師子、^lb蚖蛇蝮蠍。
如是迷人，在險道中，須臾之間，即^pb20遭諸毒。
有一知識，多解大術，善禁是毒，乃及^lb夜叉諸惡毒等。
忽逢迷人，欲進險道，而語之^lb言：
『咄哉！男子！為何事故，而入此路？有何異術，^lb能制諸毒？』
是迷路人，忽聞是語，方知險道，即^lb便退步，求出此路。
是善知識，提携接手，引出^pb21險道，免諸惡毒，至于好道，令得安樂，而語之^lb言：
『咄哉！迷人！自今已後，勿履是道。
此路入者，^lb卒難得出，復損性命。』是迷路人，亦生感重。
臨^lb別之時，知識又言：『若見親知及諸路人，若男^lb若女，言於此路多諸毒惡，喪失性命。
無令是^pb22眾，自取其死。』
「是故地藏菩薩具大慈悲，救拔^lb罪苦眾生，生天人中，令受妙樂。
是諸罪眾，^lb知業道苦，脫得出離，永不再歷。
如迷路人，誤^lb入險道，遇善知識，引接令出，永不復入。
逢見^lb他人，復勸莫入，自言：『因是迷故，得解脫竟，更^pb23不復入。』
若再履踐，猶尚迷誤，不覺舊曾所落^lb險道，或致失命，如墮惡趣。
地藏菩薩方便力^lb故，使令解脫，生人天中。
旋又再入，若業結重，^lb永處地獄，無解脫時。」
爾時，惡毒鬼王合掌恭^lb敬，白佛言：
「世尊！我等諸鬼王，其數無量，在閻^pb24浮提，或利益人，或損害人，各各不同。
然是業^lb報，使我眷屬，遊行世界，多惡少善。
過人家庭，^lb或城邑聚落，莊園房舍。
或有男子女人，修毛^lb髮善事，乃至懸一旛一蓋，少香少華，
供養佛^lb像及菩薩像，或轉讀尊經，燒香供養一句一^pb25偈。
我等鬼王，敬禮是人，如過去、現在、未來諸^lb佛。
勅諸小鬼，各有大力，及土地分，便令衛護。
^lb不令惡事橫事、惡病橫病，乃至不如意事，近^lb於此舍等處，何況入門？」
佛讚鬼王：「善哉！善哉！^lb汝等及與閻羅，能如是擁護善男女等，吾亦^pb26告梵王帝釋，令衛護汝。」
說是語時，會中有一^lb鬼王，名曰主命，白佛言：
「世尊！我本業緣，主閻^lb浮人命，生時死時，我皆主之。
在我本願，甚欲^lb利益。
自是眾生，不會我意，致令生死，俱不得^lb安。

「何以故？是閻浮提人，初生之時，不問男女，^pb27或欲生時，但作善事，增益舍宅。
自令土地無^lb量歡喜，擁護子母，得大安樂，利益眷屬。
或已^lb生下，慎勿殺害，取諸鮮味，供給產母。
及廣聚^lb眷屬，飲酒食肉，歌樂絃管，能令子母，不得安^lb樂。

「何以故？是產難時，有無數惡鬼，及魍魎精^pb28魅，欲食腥血。
是我早令舍宅土地靈祇，荷護^lb子母，使令安樂，而得利益。
如是之人，見安樂^lb故，便合設福，答諸土地。
翻為殺害，集聚眷屬，^lb以是之故，犯殃自受，子母俱損。

「又閻浮提臨^lb命終人，不問善惡，我欲令是命終之人，不落^pb29惡道，何況自修善根，增我力故。
是閻浮提行^lb善之人，臨命終時，亦有百千惡道鬼神，或變^lb作父母，乃至諸眷屬，引接亡人，令落惡道，何^lb況本造惡者？
「世尊！如是閻浮提男子女人，臨^lb命終時，神識惛昧，不辯善惡，乃至眼耳，更無^pb30見聞。
是諸眷屬，當須設大供養，轉讀尊經，念^lb佛菩薩名號。
如是善緣，能令亡者，離諸惡道，^lb諸魔鬼神，悉皆退散。
世尊！一切眾生臨命終^lb時，若得聞一佛名、一菩薩名，或大乘經典一^lb句一偈，我觀如是輩人，
除五無間殺害之罪，^pb31小小惡業，合墮惡趣者，尋即解脫。」
佛告主命^lb鬼王：「汝大慈故，能發如是大願，於生死中，護^lb諸眾生。
若未來世中，有男子女人，至生死時，^lb汝莫退是願，總令解脫，永得安樂。」
鬼王白佛^lb言：「願不有慮，我畢是形，念念擁護閻浮眾生，^pb32生時死時，俱得安樂。
但願諸眾生，於生死時，^lb信受我語，無不解脫，獲大利益。」
爾時，佛告地^lb藏菩薩：「是大鬼王主命者，已曾經百千生，作大^lb鬼王，於生死中，擁護眾生。
是大士，慈悲願^lb故，現大鬼身，實非鬼也。
却後過一百七十劫，^pb33當得成佛，號曰無相如來。
劫名安樂，世界名^lb淨住。
其佛壽命，不可計劫。
地藏！是大鬼王，其^lb事如是，不可思議，所度天人，亦不可限量。」
^lb^ck9〔稱佛名號品第九〕
^lb爾時，地藏菩薩摩訶薩白佛言：「世尊！我今為^pb34未來眾生，演利益事，於生死中，得大利益。
唯^lb願世尊，聽我說之。」
佛告地藏菩薩：「汝今欲興^lb慈悲，救拔一切罪苦六道眾生，演不思議事，^lb今正是時，唯當速說。
吾即涅槃，使汝早畢是^lb願，吾亦無憂現在未來一切眾生。」
地藏菩薩^pb35白佛言：「世尊！過去無量阿僧祇劫，有佛出世，^lb號無邊身如來。
若有男子女人，聞是佛名，暫^lb生恭敬，即得超越四十劫生死重罪。
何況塑^lb畫形像、供養讚歎？其人獲福，無量無邊。

「又於^lb過去恒河沙劫，有佛出世，號寶性如來。
若有^pb36男子女人，聞是佛名，一彈指頃，發心歸依，是^lb人於無上道，永不退轉。
又於過去，有佛出世，^lb號波頭摩勝如來。
若有男子女人，聞是佛名，^lb歷於耳根，是人當得千返生於六欲天中，何^lb況志心稱念？
「又於過去不可說不可說阿僧^pb37祇劫，有佛出世，號師子吼如來。
若有男子女^lb人，聞是佛名，一念歸依，是人得遇無量諸佛，^lb摩頂授記。
又於過去，有佛出世，號拘留孫佛。
^lb若有男子女人，聞是佛名，志心瞻禮，或復讚^lb歎，是人於賢劫千佛會中，為大梵王，得授上^pb38記。

「又於過去，有佛出世，號毘婆尸。
若有男子^lb女人，聞是佛名，永不墮惡道，常生人天，受勝^lb妙樂。

「又於過去無量無數恒河沙劫，有佛出^lb世，號寶勝如來。
若有男子女人，聞是佛名，畢^lb竟不墮惡道，常在天上，受勝妙樂。

「又於過去，^pb39有佛出世，號寶相如來。
若有男子女人，聞是^lb佛名，生恭敬心，是人不久，得阿羅漢果。

「又於^lb過去，無量阿僧祇劫，有佛出世，號袈裟幢如^lb來。
若有男子女人，聞是佛名者，超一百大劫^lb生死之罪。

「又於過去，有佛出世，號大通山王^pb40如來。
若有男子女人，聞是佛名者，是人得遇^lb恒河沙佛，廣為說法，必成菩提。
又於過去，有^lb淨月佛、山王佛、智勝佛、淨名王佛、智成就佛、^lb無上佛、妙聲佛、滿月佛、月面佛，有如是等不^lb可說佛。

「世尊！現在未來一切眾生，若天若人，^pb41若男若女，但念得一佛名號，功德無量，何況^lb多名？
是眾生等，生時死時，自得大利，終不墮^lb惡道。
若有臨命終人，家中眷屬，乃至一人，為^lb是病人，高聲念一佛名，是命終人，除五無間^lb罪，餘業報等，悉得銷滅。
是五無間罪，雖至極^lb重，動經億劫，了不得出，承斯臨命終時，他人^lb為其稱念佛名，於是罪中亦漸銷滅。
何況眾^lb生，自稱自念，獲福無量，滅無量罪。」
^lb^ck10〔校量布施功德緣品第十〕
^lb爾時，地藏菩薩摩訶薩承佛威神，從座而起，^pb43胡跪合掌，白佛言：
「世尊！我觀業道眾生，校量^lb布施，有輕有重：
有一生受福，有十生受福，有^lb百生千生受大福利者。
是事云何？唯願世尊，^lb為我說之。」
爾時，佛告地藏菩薩：「吾今於忉利^lb天宮，一切眾會，說閻浮提布施，校量功德輕^pb44重。
汝當諦聽，吾為汝說。」
地藏白佛言：「我疑是事，^lb願樂欲聞。」
佛告地藏菩薩：「南閻浮提，有諸國^lb王、宰輔大臣、大長者、大剎利、大婆羅門等，
若^lb遇最下貧窮，乃至癃殘瘖瘂，聾癡無目，如是^lb種種不完具者。
是大國王等，欲布施時，若能^pb45具大慈悲，下心含笑，親手遍布施，或使人施，軟^lb言慰喻。
是國王等，所獲福利，如布施百恒河^lb沙佛功德之利。
何以故？緣是國王等，於是最^lb貧賤輩，及不完具者，發大慈心，是故福利，有^lb如此報：
百千生中，常得七寶具足，何況衣食^pb46受用？
「復次，地藏！若未來世，有諸國王，至婆羅^lb門等，遇佛塔寺，或佛形像，
乃至菩薩、聲聞、辟^lb支佛像，躬自營辦，供養布施。
是國王等，當得^lb三劫為帝釋身，受勝妙樂。
若能以此布施福^lb利，迴向法界，是大國王等，於十劫中，常為大^pb47梵天王。

「復次，地藏！若未來世，有諸國王，至婆^lb羅門等，遇先佛塔廟，或至經像，毀壞破落，乃^lb能發心修補。
是國王等，或自營辦，或勸他人，^lb乃至百千人等，布施結緣。
是國王等，百千生^lb中，常為轉輪王身。
如是他人同布施者，百千^pb48生中，常為小國王身。
更能於塔廟前，發迴向^lb心，如是國王，乃及諸人，盡成佛道，以此果報，^lb無量無邊。

「復次，地藏！未來世中，有諸國王，及^lb婆羅門等，見諸老病，及生產婦女，若一念間，^lb具大慈心，
布施醫藥、飲食、臥具，使令安樂。
如^pb49是福利，最不思議：一百劫中，常為淨居天主；^lb二百劫中，常為六欲天主；
畢竟成佛，永不墮^lb惡道，乃至百千生中，耳不聞苦聲。

「復次，地藏！^lb若未來世中，有諸國王，及婆羅門等，能作如^lb是布施，獲福無量，
更能迴向，不問多少，畢竟^pb50成佛，何況釋梵轉輪之報？是故，地藏！普勸眾^lb生，當如是學。

「復次，地藏！未來世中，若善男子、^lb善女人，於佛法中，種少善根，毛髮沙塵等許，^lb所受福利，不可為喻。
復次，地藏！未來世中，若^lb有善男子、善女人，遇佛形像、菩薩形像、辟支^pb51佛形像、轉輪王形像，布施供養，得無量福，常^lb在人天，受勝妙樂。
若能迴向法界，是人福利，^lb不可為喻。

「復次，地藏！未來世中，若有善男子、^lb善女人，遇大乘經典，或聽聞一偈一句，發殷^lb重心，讚歎恭敬，布施供養。
是人獲大果報，無^pb52量無邊。
若能迴向法界，其福不可為喻。

「復次，^lb地藏！若未來世中，有善男子、善女人，遇佛塔^lb寺、大乘經典新者，布施供養，瞻禮讚歎，恭敬^lb合掌；
若遇故者或毀壞者，修補營理，或獨發^lb心，或勸多人同共發心。
如是等輩，三十生中，^pb53常為諸小國王。
檀越之人，常為輪王，還以善^lb法，教化諸小國王。

「復次，地藏！未來世中，若有^lb善男子、善女人，於佛法中，所種善根，或布施^lb供養，或修補塔寺，或裝理經典，
乃至一毛一^lb塵，一沙一渧。
如是善事，但能迴向法界，是人^pb54功德，百千生中，受上妙樂。
如但迴向自家眷^lb屬，或自身利益，如是之果，即三生受樂，捨一^lb得萬報。
是故，地藏！布施因緣，其事如是。」
^lb^ck11〔地神護法品第十一〕
^lb爾時，堅牢地神白佛言：「世尊！我從昔來，瞻視^pb55頂禮無量菩薩摩訶薩，皆是大不可思議神^lb通智慧，廣度眾生。
是地藏菩薩摩訶薩，於諸^lb菩薩，誓願深重。
世尊！是地藏菩薩，於閻浮提，^lb有大因緣。
如文殊、普賢、觀音、彌勒，亦化百千^lb身形，度於六道，其願尚有畢竟。
是地藏菩薩，^pb56教化六道一切眾生，所發誓願劫數，如千百^lb億恒河沙。

「世尊！我觀未來及現在眾生，於所^lb住處，於南方清潔之地，以土石竹木，作其龕^lb室。
是中能塑畫，乃至金銀銅鐵，作地藏形像，^lb燒香供養，瞻禮讚歎。
是人居處，即得十種利^pb57益。
何等為十？一者，土地豐壤。
二者，家宅永安。
^lb三者，先亡生天。
四者，現存益壽。
五者，所求遂^lb意。
六者，無水火災。
七者，虛耗辟除。
八者，杜絕^lb惡夢。
九者，出入神護。
十者，多遇聖因。

「世尊！未^lb來世中，及現在眾生，若能於所住處方面，作^pb58如是供養，得如是利益。」
復白佛言：「世尊！未來^lb世中，若有善男子、善女人，於所住處，有此經^lb典及菩薩像，
是人更能轉讀經典，供養菩薩。
^lb我常日夜，以本神力，衛護是人，乃至水火盜^lb賊，大橫小橫，一切惡事，悉皆銷滅。」
佛告堅牢^pb59地神：「汝大神力，諸神少及。
何以故？閻浮土地，^lb悉蒙汝護。
乃至草木沙石，稻麻竹葦，穀米寶^lb貝，從地而有，皆因汝力。
又常稱揚地藏菩薩^lb利益之事，汝之功德，及以神通，百千倍於常^lb分地神。
若未來世中，有善男子、善女人，供養^pb60菩薩，及轉讀是經，但依地藏本願經一事修^lb行者，汝以本神力，而擁護之。
勿令一切災害，^lb及不如意事，輒聞於耳，何況令受？非但汝獨^lb護是人故，亦有釋梵眷屬、諸天眷屬，擁護是^lb人。
何故得如是聖賢擁護？皆由瞻禮地藏形^pb61像，及轉讀是本願經故。
自然畢竟出離苦海，^lb證涅槃樂。以是之故，得大擁護。」
^lb^ck12〔見聞利益品第十二〕
^lb爾時，世尊從頂門上，放百千萬億大毫相光——
^lb所謂白毫相光、大白毫相光、瑞毫相光、大瑞^pb62毫相光、玉毫相光、大玉毫相光、紫毫相光、大^lb紫毫相光、
青毫相光、大青毫相光、碧毫相光、^lb大碧毫相光、紅毫相光、大紅毫相光、綠毫相^lb光、大綠毫相光、
金毫相光、大金毫相光、慶雲^lb毫相光、大慶雲毫相光、千輪毫光、大千輪毫^pb63光、寶輪毫光、大寶輪毫光、
日輪毫光、大日輪^lb毫光、月輪毫光、大月輪毫光、宮殿毫光、大宮^lb殿毫光、海雲毫光、大海雲毫光。
於頂門上，放^lb如是等毫相光已，出微妙音，告諸大眾、天龍^lb八部、人、非人等：
「聽吾今日於忉利天宮稱揚^pb64讚歎地藏菩薩於人天中利益等事、不思議^lb事、超聖因事、證十地事、
畢竟不退阿耨多羅^lb三藐三菩提事。」
說是語時，會中有一菩薩摩^lb訶薩，名觀世音，從座而起，胡跪合掌，白佛言：
^lb「世尊！是地藏菩薩摩訶薩，具大慈悲，憐愍罪^pb65苦眾生，於千萬億世界，化千萬億身。
所有功^lb德，及不思議威神之力，我聞世尊與十方無^lb量諸佛，異口同音，讚歎地藏菩薩云：
正使過^lb去現在未來諸佛，說其功德，猶不能盡。
向者，^lb又蒙世尊普告大眾，欲稱揚地藏利益等事。
^pb66唯願世尊，為現在未來一切眾生，稱揚地藏^lb不思議事，令天龍八部，瞻禮獲福。」
佛告觀世^lb音菩薩：「汝於娑婆世界，有大因緣。
若天若龍、^lb若男若女、若神若鬼，乃至六道罪苦眾生，聞^lb汝名者、見汝形者、戀慕汝者、讚歎汝者，
是諸^pb67眾生，於無上道，必不退轉，常生人天，具受妙^lb樂，因果將熟，遇佛授記。
汝今具大慈悲，憐愍^lb眾生，及天龍八部，聽吾宣說地藏菩薩不思^lb議利益之事。
汝當諦聽，吾今說之。」
觀世音言：^lb「唯然，世尊！願樂欲聞。」
佛告觀世音菩薩：「未來^pb68現在諸世界中，有天人受天福盡，有五衰相^lb現，或有墮於惡道之者。
如是天人，若男若女，^lb當現相時，或見地藏菩薩形像，或聞地藏菩^lb薩名，一瞻一禮，
是諸天人，轉增天福，受大快^lb樂，永不墮三惡道報。
何況見聞菩薩，以諸香、^pb69華、衣服、飲食、寶貝、瓔珞，布施供養，所獲功德^lb福利，無量無邊。

「復次，觀世音！若未來現在諸^lb世界中，六道眾生，臨命終時，得聞地藏菩薩^lb名，
一聲歷耳根者，是諸眾生，永不歷三惡道^lb苦。
何況臨命終時，父母眷屬，將是命終人舍^pb70宅、財物、寶貝、衣服，塑畫地藏形像。
或使病人^lb未終之時，眼耳見聞，知道眷屬將舍宅寶貝^lb等，為其自身，塑畫地藏菩薩形像。
是人若是^lb業報合受重病者，承斯功德，尋即除愈，壽命^lb增益。
是人若是業報命盡，應有一切罪障業^pb71障，合墮惡趣者，
承斯功德，命終之後，即生人^lb天，受勝妙樂，一切罪障，悉皆銷滅。

「復次，觀世^lb音菩薩！若未來世，有男子女人，或乳哺時，
或^lb三歲、五歲、十歲已下，亡失父母，乃及亡失兄弟^lb姊妹。
是人年既長大，思憶父母，及諸眷屬，不知^pb72落在何趣？生何世界？生何天中？
是人若能塑^lb畫地藏菩薩形像，乃至聞名，一瞻一禮，一日^lb至七日，莫退初心，聞名見形，瞻禮供養。
是人^lb眷屬，假因業故，墮惡趣者，計當劫數，承斯男^lb女兄弟姊妹塑畫地藏形像、瞻禮功德，尋即^pb73解脫，生人天中；
受勝妙樂者，即承斯功德，轉^lb增聖因，受無量樂。
是人更能三七日中，一心^lb瞻禮地藏形像，念其名字，滿於萬遍。
當得菩^lb薩現無邊身，具告是人眷屬生界；或於夢中，^lb菩薩現大神力，親領是人於諸世界，見諸眷^pb74屬。
更能每日，念菩薩名千遍，至于千日。
是人^lb當得菩薩遣所在土地鬼神，終身衛護，現世^lb衣食豐溢，無諸疾苦，乃至橫事不入其門，何^lb況及身？
是人畢竟得菩薩摩頂授記。

「復次，觀^lb世音菩薩！若未來世，有善男子、善女人，
欲發^pb75廣大慈心，救度一切眾生者，欲修無上菩提^lb者，欲出離三界者。
是諸人等，見地藏形像及^lb聞名者，至心歸依，或以香華衣服、寶貝飲食，^lb供養瞻禮。
是善男女等，所願速成，永無障礙。

^lb「復次，觀世音！若未來世，有善男子、善女人，欲^pb76求現在未來百千萬億等願、百千萬億等事，
^lb但當歸依、瞻禮、供養、讚歎地藏菩薩形像，如^lb是所願所求，悉皆成就。
復願地藏菩薩，具大^lb慈悲，永擁護我，是人於睡夢中，即得菩薩摩^lb頂授記。

「復次，觀世音菩薩！若未來世，善男子、^pb77善女人，於大乘經典，深生珍重，發不思議心，^lb欲讀欲誦。
縱遇明師，教視令熟，旋得旋忘，動^lb經年月，不能讀誦。
是善男子等，有宿業障，未^lb得銷除，故於大乘經典，無讀誦性。
如是之人，^lb聞地藏菩薩名，見地藏菩薩像，具以本心恭^pb78敬陳白，更以香、華、衣服、飲食、一切玩具，供養^lb菩薩。
以淨水一盞，經一日一夜，安菩薩前，然^lb後合掌請服，迴首向南，臨入口時，至心鄭重。
^lb服水既畢，慎五辛、酒肉、邪婬、妄語，及諸殺害，^lb一七日，或三七日。
是善男子、善女人，於睡夢^pb79中，具見地藏菩薩現無邊身，於是人處授灌^lb頂水。
其人夢覺，即獲聰明，應是經典，一歷耳^lb根，即當永記，更不忘失一句一偈。

「復次，觀世^lb音菩薩！若未來世，有諸人等：衣食不足，求者^lb乖願；
或多病疾，或多凶衰；家宅不安，眷屬分^pb80散；或諸橫事，多來忤身；睡夢之間，多有驚怖。
^lb如是人等，聞地藏名，見地藏形，至心恭敬，念^lb滿萬遍。
是諸不如意事，漸漸消滅，即得安樂，^lb衣食豐溢，乃至於睡夢中，悉皆安樂。

「復次，觀^lb世音菩薩！若未來世，有善男子、善女人，或因^pb81治生，或因公私，或因生死，或因急事，
入山林^lb中，過渡河海，乃及大水，或經險道。
是人先當^lb念地藏菩薩名萬遍，所過土地，鬼神衛護，行^lb住坐臥，永保安樂。
乃至逢於虎狼師子、一切^lb毒害，不能損之。」
佛告觀世音菩薩：「是地藏菩^pb82薩，於閻浮提，有大因緣。
若說於諸眾生見聞^lb利益等事，百千劫中，說不能盡。
是故，觀世音！^lb汝以神力，流布是經，令娑婆世界眾生，百千^lb萬劫，永受安樂。」
爾時，世尊而說偈言：
^lb^gatha「吾觀地藏威神力，恒河沙劫說難盡，
^pb83^gatha見聞瞻禮一念間，利益人天無量事。
^lb^gatha若男若女若龍神，報盡應當墮惡道，
^lb^gatha至心歸依大士身，壽命轉增除罪障。
^lb^gatha少失父母恩愛者，未知魂神在何趣？
^lb^gatha兄弟姊妹及諸親，生長以來皆不識。
^pb84^gatha或塑或畫大士身，悲戀瞻禮不暫捨，
^lb^gatha三七日中念其名。菩薩當現無邊體，
^lb^gatha示其眷屬所生界，縱墮惡趣尋出離。
^lb^gatha若能不退是初心，即獲摩頂受聖記。
^lb^gatha欲修無上菩提者，乃至出離三界苦，
^pb85^gatha是人既發大悲心，先當瞻禮大士像，
^lb^gatha一切諸願速成就，永無業障能遮止。
^lb^gatha有人發心念經典，欲度群迷超彼岸，
^lb^gatha雖立是願不思議，旋讀旋忘多廢失。
^lb^gatha斯人有業障惑故，於大乘經不能記。
^pb86^gatha供養地藏以香華，衣服飲食諸玩具，
^lb^gatha以淨水安大士前，一日一夜求服之，
^lb^gatha發殷重心慎五辛，酒肉邪淫及妄語，
^lb^gatha三七日內勿殺害，至心思念大士名。
^lb^gatha即於夢中見無邊，覺來便得利根耳，
^pb87^gatha應是經教歷耳聞，千萬生中永不忘。
^lb^gatha以是大士不思議，能使斯人獲此慧。
^lb^gatha貧窮眾生及疾病，家宅凶衰眷屬離，
^lb^gatha睡夢之中悉不安，求者乖違無稱遂。
^lb^gatha至心瞻禮地藏像，一切惡事皆消滅，
^pb88^gatha至於夢中盡得安，衣食豐饒神鬼護。
^lb^gatha欲入山林及渡海，毒惡禽獸及惡人，
^lb^gatha惡神惡鬼并惡風，一切諸難諸苦惱。
^lb^gatha但當瞻禮及供養，地藏菩薩大士像，
^lb^gatha如是山林大海中，應是諸惡皆消滅。
^pb89^gatha觀音至心聽吾說，地藏無盡不思議，
^lb^gatha百千萬劫說不周，廣宣大士如是力。
^lb^gatha地藏名字人若聞，乃至見像瞻禮者，
^lb^gatha香華衣服飲食奉，供養百千受妙樂，
^lb^gatha若能以此迴法界，畢竟成佛超生死。
^pb90^gatha是故觀音汝當知，普告恒沙諸國土。」
^lb^ck13〔囑累人天品第十三〕
^lb爾時，世尊舉金色臂，又摩地藏菩薩摩訶薩^lb頂，而作是言：
「地藏！地藏！汝之神力，不可思議；^lb汝之慈悲，不可思議；汝之智慧，不可思議；汝^lb之辯才，不可思議。
正使十方諸佛，讚歎宣說^lb汝之不思議事，千萬劫中，不能得盡。
地藏！地藏！^lb記吾今日在忉利天中，於百千萬億不可說不^lb可說一切諸佛菩薩、天龍八部大會之中，
再以^lb人天諸眾生等，未出三界，在火宅中者，付囑^pb92於汝。
無令是諸眾生，墮惡趣中一日一夜，何^lb況更落五無間及阿鼻地獄，動經千萬億劫，^lb無有出期？
「地藏！是南閻浮提眾生，志性無定，^lb習惡者多，縱發善心，須臾即退，若遇惡緣，念^lb念增長。
以是之故，吾分是形，百千億化度，隨^pb93其根性而度脫之。
地藏！吾今殷勤以天人眾，^lb付囑於汝。
未來之世，若有天人，及善男子、善^lb女人，於佛法中，種少善根，一毛一塵，一沙一^lb渧。
汝以道力，擁護是人，漸修無上，勿令退失。
^lb復次，地藏！未來世中，若天若人，隨業報應，落^pb94在惡趣。
臨墮趣中，或至門首，是諸眾生，若能^lb念得一佛名、一菩薩名、一句一偈大乘經典。
^lb是諸眾生，汝以神力，方便救拔。
於是人所，現^lb無邊身，為碎地獄，遣令生天，受勝妙樂。」
爾時，^lb世尊而說偈言：
^lb^gatha「現在未來天人眾，  	吾今殷勤付囑汝，
^lb^gatha以大神通方便度，  	勿令墮在諸惡趣。」
^lb爾時，地藏菩薩摩訶薩胡跪合掌，白佛言：
「世^lb尊！唯願世尊，不以為慮。
未來世中，若有善男^lb子、善女人，於佛法中，一念恭敬，
我亦百千方^pb96便，度脫是人，於生死中，速得解脫。
何況聞諸^lb善事，念念修行？自然於無上道，永不退轉。」
說^lb是語時，會中有一菩薩，名虛空藏，白佛言：
「世^lb尊！我自至忉利，聞於如來讚歎地藏菩薩威^lb神勢力，不可思議。
未來世中，若有善男子、善^pb97女人，乃及一切天龍，聞此經典，及地藏名字，^lb或瞻禮形像，得幾種福利？
唯願世尊，為未來^lb現在一切眾等，略而說之。」
佛告虛空藏菩薩：^lb「諦聽！諦聽！吾當為汝分別說之。
若未來世，有^lb善男子、善女人，見地藏形像，及聞此經，乃至^pb98讀誦，
香華飲食、衣服珍寶，布施供養，讚歎瞻^lb禮，得二十八種利益：
一者天龍護念，二者善^lb果日增，三者集聖上因，四者菩提不退，五者^lb衣食豐足，
六者疾疫不臨，七者離水火災，八^lb者無盜賊厄，九者人見欽敬，十者神鬼助持，
^pb99十一者女轉男身，十二者為王臣女，十三者^lb端正相好，十四者多生天上，十五者或為帝^lb王，
十六者宿智命通，十七者有求皆從，十八^lb者眷屬歡樂，十九者諸橫銷滅，二十者業道^lb永除，
二十一者去處盡通，二十二者夜夢安^pb100樂，二十三者先亡離苦，二十四者宿福受生，^lb二十五者諸聖讚歎，
二十六者聰明利根，二^lb十七者饒慈愍心，二十八者畢竟成佛。

「復次，^lb虛空藏菩薩！若現在未來，天龍鬼神，聞地藏^lb名，禮地藏形，或聞地藏本願事行，讚歎瞻禮，^pb101得七種利益：
一者速超聖地，二者惡業銷滅，^lb三者諸佛護臨，四者菩提不退，五者增長本^lb力，六者宿命皆通，七者畢竟成佛。」
爾時，十方^lb一切諸來不可說不可說諸佛如來，及大菩^lb薩、天龍八部，聞釋迦牟尼佛，
稱揚讚歎地藏^pb102菩薩，大威神力，不可思議，歎未曾有。
是時忉^lb利天，雨無量香華，天衣珠瓔，供養釋迦牟尼^lb佛，及地藏菩薩已。
一切眾會，俱復瞻禮，合掌^lb而退。
^lb地藏菩薩本願經卷下^pb103
 ^pb1^folio#lastword【佛遺教經】^bk#lastword〔佛垂般涅槃略說教誡經〕(亦名遺教經)^lb^au〔　　　姚秦龜茲國三藏．鳩摩羅什奉　詔譯〕
^ck1【序】
^lb釋迦牟尼佛初轉法輪，度阿若憍陳如，最後^lb說法度須跋陀羅，所應度者皆已度訖，於娑^lb羅雙樹間將入涅槃。
是時中夜寂然無聲，為^pb2諸弟子略說法要：
^ck2【珍敬淨戒】
^lb「汝等比丘，於我滅後，當尊重珍敬波羅提木^lb叉，如闇遇明、貧人得寶。
當知此則是汝大師，^lb若我住世無異此也。
持淨戒者，不得販賣貿^lb易、安置田宅、畜養人民奴婢畜生，一切種殖^pb3及諸財寶，皆當遠離如避火坑。
不得斬伐草^lb木、墾土掘地，合和湯藥、占相吉凶、仰觀星宿^lb推步盈虛、曆數算計，皆所不應。
節身時食清^lb淨自活，不得參預世事通致使命，呪術仙藥、^lb結好貴人親厚媟嫚，皆不應作。
當自端心正^pb4念求度，不得苞藏瑕疵、顯異惑眾。
於四供養^lb知量知足，趣得供事不應稸積。
此則略說持^lb戒之相。
戒是正順解脫之本，故名波羅提木^lb叉。
依因此戒，得生諸禪定及滅苦智慧。
是故^lb比丘，當持淨戒勿令毀犯。
若人能持淨戒，是^pb5則能有善法；若無淨戒，諸善功德皆不得生。
^lb是以當知，戒為第一安隱功德之所住處。
^ck3【勿縱五根】
^lb「汝等比丘，已能住戒當制五根，勿令放逸入^lb於五欲，譬如牧牛之人執杖視之，不令縱逸^lb犯人苗稼。
若縱五根，非唯五欲將無崖畔不^pb6可制也，亦如惡馬不以轡制，將當牽人墜於^lb坑陷。
如被劫害苦止一世，五根賊禍殃及累^lb世，為害甚重，不可不慎。
是故智者制而不隨，^lb持之如賊不令縱逸；假令縱之，皆亦不久見^lb其磨滅。
此五根者，心為其主。
是故汝等當好^pb7制心，心之可畏甚於毒蛇、惡獸、怨賊，大火越^lb逸，未足喻也。
動轉輕躁，但觀於蜜不見深坑，^lb譬如狂象無鈎、猿猴得樹，騰躍跳躑，難可禁^lb制，當急挫之無令放逸。
縱此心者喪人善事，^lb制之一處無事不辦。
是故比丘，當勤精進折^pb8伏其心。
^lb^ck4【飲食如藥】
「汝等比丘，受諸飲食當如服藥，於好於惡勿^lb生增減，趣得支身以除飢渴。
如蜂採花，但取^lb其味不損色香；
比丘亦爾，受人供養取自除^lb惱，無得多求壞其善心。
譬如智者籌量牛力^pb9所堪多少，不令過分以竭其力。
^lb^ck5【醒寤慚恥】
「汝等比丘，晝則勤心修習善法，無令失時，初^lb夜後夜亦勿有廢，中夜誦經以自消息，無以^lb睡眠因緣令一生空過無所得也。
當念無常^lb之火燒諸世間，早求自度勿睡眠也。
諸煩惱^pb10賊常伺殺人，甚於怨家，安可睡眠不自驚寤？
^lb煩惱毒蛇睡在汝心，譬如黑蚖在汝室睡，當^lb以持戒之鉤早摒除之。
睡蛇既出乃可安眠，^lb不出而眠是無慚人也。
慚恥之服，於諸莊嚴^lb最為第一，慚如鐵鉤，能制人非法。
是故比丘，^pb11常當慚恥，無得暫替；若離慚恥則失諸功德。
^lb有愧之人則有善法；若無愧者，與諸禽獸無^lb相異也。
^lb^ck6【忍辱戒瞋】
「汝等比丘，若有人來節節支解，當自攝心無^lb令瞋恨，亦當護口勿出惡言；若縱恚心，則自^pb12妨道、失功德利。
忍之為德，持戒苦行所不能^lb及。
能行忍者，乃可名為有力大人；若其不能^lb歡喜忍受惡罵之毒如飲甘露者，不名入道^lb智慧人也。
所以者何？瞋恚之害能破諸善法、^lb壞好名聞，今世後世人不憙見。
當知瞋心甚^pb13於猛火，常當防護無令得入，劫功德賊無過^lb瞋恚。
白衣受欲非行道人，無法自制，瞋猶可^lb恕；出家行道無欲之人，而懷瞋恚，甚不可也。
^lb譬如清冷雲中霹靂起火，非所應也。
^ck7【戒憍直心】
^lb「汝等比丘，當自摩頭，已捨飾好著壞色衣，執^pb14持應器以乞自活，自見如是，若起憍慢當疾^lb滅之。
謂長憍慢尚非世俗白衣所宜，何況出^lb家入道之人為解脫故，自降其心而行乞耶？
^lb「汝等比丘，諂曲之心與道相違，是故宜應質^lb直其心。
當知諂曲但為欺誑，入道之人則無^pb15是處。
是故汝等宜應端心，以質直為本。
^lb^ck8【少欲少惱】
「汝等比丘，當知多欲之人多求利故，苦惱亦^lb多；少欲之人無求無欲，則無此患。
直爾少欲^lb尚應修習，何況少欲能生諸善功德？少欲之人^lb則無諂曲以求人意，亦復不為諸根所牽。
行^pb16少欲者，心則坦然無所憂畏，觸事有餘常無^lb不足，有少欲者則有涅槃。
是名少欲。
^lb^ck9【安樂知足】
「汝等比丘，若欲脫諸苦惱，當觀知足，知足之^lb法即是富樂安隱之處。
知足之人，雖臥地上^lb猶為安樂；不知足者，雖處天堂亦不稱意。
不^pb17知足者雖富而貧，知足之人雖貧而富。
不知^lb足者常為五欲所牽，為知足者之所憐愍。
是^lb名知足。
^lb^ck10【獨處遠離】
「汝等比丘，若求寂靜無為安樂，當離憒閙、獨^lb處閑居，靜處之人帝釋諸天所共敬重。
是故^pb18當捨己眾他眾，空閑獨處思滅苦本。
若樂眾^lb者則受眾惱，譬如大樹眾鳥集之，則有枯折^lb之患。
世間縛著沒於眾苦，譬如老象溺泥不^lb能自出。
是名遠離。
^lb^ck11【當勤精進】
「汝等比丘，若勤精進則事無難者，是故汝等^pb19當勤精進，譬如小水常流則能穿石。
若行者^lb之心數數懈廢，譬如鑽火未熱而息，雖欲得^lb火，火難可得。
是名精進。
^lb^ck12【攝念無畏】
「汝等比丘，求善知識、求善護助而不忘念；^lb若不忘念者，諸煩惱賊則不能入。
是故汝^pb20等常當攝念在心，若失念者則失諸功德。
若^lb念力堅強，雖入五欲賊中不為所害，譬如著^lb鎧入陣則無所畏。
是名不忘念。
^lb^ck13【定知生滅】
「汝等比丘，若攝心者心則在定，心在定故能^lb知世間生滅法相。
是故汝等常當精勤修集^pb21諸定，若得定者心則不亂，譬如惜水之家善^lb治堤塘；
行者亦爾，為智慧水故，善修禪定令不^lb漏失。
是名為定。
^lb^ck14【增益智慧】
「汝等比丘，若有智慧則無貪著，常自省察不^lb令有失，是則於我法中能得解脫；
若不爾者，^pb22既非道人又非白衣，無所名也。
實智慧者，則^lb是度老病死海堅牢船也，亦是無明黑闇大^lb明燈也，一切病苦之良藥也，伐煩惱樹者之利^lb斧也。
是故汝等當以聞、思、修慧而自增益；若^lb人有智慧之照，雖無天眼而是明見人也。
是^pb23為智慧。
^ck15【捨離戲論】
^lb「汝等比丘，若種種戲論其心則亂，雖復出家^lb猶未得脫。
是故比丘，當急捨離亂心戲論；若^lb汝欲得寂滅樂者，唯當善滅戲論之患。
是名^lb不戲論。
^pb24^ck16【良醫善導】
「汝等比丘，於諸功德常當一心，捨諸放逸如^lb離怨賊。
大悲世尊所欲利益皆以究竟，汝等^lb但當勤而行之。
若在山間、若空澤中、若在樹^lb下、閑處靜室，念所受法勿令忘失，常當自勉^lb精進修之，無為空死後致憂悔。
我如良醫，知^pb25病說藥，服與不服，非醫咎也。
又如善導，導人^lb善道，聞之不行，非導過也。
汝等若於苦等四^lb諦有所疑者，可疾問之，無得懷疑不求決也。」
^lb爾時世尊如是三唱，人無問者。
所以者何？眾^lb無疑故。
^ck17【四諦真實】
爾時阿㝹樓馱觀察眾心而白佛言：「世^pb26尊！月可令熱，日可令冷，佛說四諦不可令異。
^lb佛說苦諦真實是苦，不可令樂；集真是因，更無異^lb因；苦若滅者即是因滅，因滅故果滅。
滅苦之^lb道實是真道，更無餘道。
世尊！是諸比丘於四^lb諦中決定無疑。
於此眾中所作未辦者，見^pb27佛滅度當有悲感，若有初入法者，聞佛所說^lb即皆得度，譬如夜見電光即得見道；
若所作^lb已辦、已度苦海者，但作是念：『世尊滅度，一何^lb疾哉！』」
阿㝹樓馱雖說是語，眾中皆悉了達四^lb聖諦義。
世尊欲令此諸大眾皆得堅固，以大^pb28悲心復為眾說：
^lb^ck18【久住無益】
「汝等比丘，勿懷憂惱。
若我住世一劫會亦當^lb滅，會而不離終不可得。
自利利人法皆具足，^lb若我久住更無所益。
應可度者，若天上人間^lb皆悉已度，其未度者，皆亦已作得度因緣。
自^pb29今已後，我諸弟子展轉行之，則是如來法身^lb常在而不滅也。
是故當知，世皆無常，會必有^lb離，勿懷憂也。
世相如是，當勤精進早求解脫，^lb以智慧明滅諸癡闇。
世實危脆無牢強者，我^lb今得滅如除惡病。
此是應捨罪惡之物，假名^pb30為身，沒在生老病死大海，何有智者得除滅^lb之，如殺怨賊而不歡喜？
^ck19【行法當滅】
「汝等比丘，常當一心^lb勤求出道，一切世間動不動法，皆是敗壞不^lb安之相。
汝等且止，勿得復語，時將欲過，我欲^lb滅度，是我最後之所教誨。」
^pb31
^pb1^folio#pph【廣本心經】^bk#pph〔佛說聖佛母般若波羅蜜多經〕^ck0【經題】^lb^au〔宋西天三藏朝奉大夫試光祿卿傳法大師 施護奉詔譯〕
^ck1【序分】^ck2【正宗分】^lb如是我聞：
一時，世尊在王舍城鷲峯山中，
與^lb大苾芻眾千二百五十人俱，并諸菩薩摩訶^lb薩眾而共圍繞。
爾時，世尊即入甚深光明宣^pb2說正法三摩地。
時，觀自在菩薩摩訶薩在佛^lb會中，而此菩薩摩訶薩已能修行甚深般若^lb波羅蜜多，
觀見五蘊自性皆空。
爾時，尊者舍^lb利子承佛威神，前白觀自在菩薩摩訶薩言：
^lb「若善男子、善女人，於此甚深般若波羅蜜多^pb3法門，樂欲修學者，當云何學？」
時，觀自在菩薩^lb摩訶薩告尊者舍利子言：
「汝今諦聽，為汝宣^lb說。
若善男子、善女人，樂欲修學此甚深般若^lb波羅蜜多法門者，當觀五蘊自性皆空。
何名^lb五蘊自性空耶？
所謂即色是空，即空是色；
色^pb4無異於空，空無異於色。

受、想、行、識，亦復如是。
^lb「舍利子！此一切法如是空相，無所生無所滅，^lb無垢染無清淨，無增長無損減。
舍利子！是故，^lb空中無色，無受、想、行、識；
無眼、耳、鼻、舌、身、意；
無^lb色、聲、香、味、觸、法；
無眼界無眼識界，乃至無意^pb5界無意識界；
無無明無無明盡，
乃至無老死^lb亦無老死盡；
無苦、集、滅、道；無智，無所得，亦無^lb無得。
「舍利子！由是無得故，菩薩摩訶薩依般^lb若波羅蜜多相應行故，心無所著亦無罣礙；
^lb以無著無礙故，無有恐怖，遠離一切顛倒妄想，究^pb6竟圓寂。
所有三世諸佛依此般若波羅^lb蜜多故，得阿耨多羅三藐三菩提。
「是故，應知^lb般若波羅蜜多是廣大明、是無上明、是無等^lb等明，
而能息除一切苦惱，是即真實無虛妄^lb法，諸修學者當如是學。
^ck3【咒】我今宣說般若波羅^pb7蜜多大明曰：
^lb「怛𭔞(寧也)他(一)　唵(引)　誐帝(引)　誐帝(二)　播(引)囉^lb誐帝(三)　播(引)囉僧誐帝(四)　冐提　莎(引)賀(五)
^ck4【流通分】^lb「舍利子！諸菩薩摩訶薩，若能誦是般若波羅^lb蜜多明句，是即修學甚深般若波羅蜜多。」
爾^pb8時，世尊從三摩地安詳而起，讚觀自在菩薩^lb摩訶薩言：
「善哉，善哉！善男子！如汝所說，如是，^lb如是！
般若波羅蜜多當如是學，是即真實最^lb上究竟，
一切如來亦皆隨喜。」
佛說此經已，
觀^lb自在菩薩摩訶薩并諸苾芻，
乃至世間天、人、^pb9阿修羅、乾闥婆等一切大眾，聞佛所說，皆大^lb歡喜，信受奉行。
^lb^lb^lb佛說聖佛母般若波羅蜜多經
^pb10音釋^lb^lb^lb^lb^pb11
^pb1^folio#pphs【心經】^bk#pphs〔般若波羅蜜多心經〕^ck0【經題】^lb^au〔　　　唐三藏法師．玄奘．奉．詔譯〕
^ck1【序分】^ck2【正宗分】^lb觀自在菩薩行深般若波羅蜜多時，
照見五^lb蘊皆空，度一切苦厄。

「舍利子！色不異空，空不^lb異色，
色即是空，空即是色；

受、想、行、識，亦復如^pb2是。
「舍利子！是諸法空相，不生不滅，不垢不淨，^lb不增不減。

是故，空中無色，無受、想、行、識；
無眼、^lb耳、鼻、舌、身、意；
無色、聲、香、味、觸、法；
無眼界，乃至^lb無意識界；
無無明亦無無明盡，
乃至無老死^lb亦無老死盡；
無苦、集、滅、道；
無智，亦無得。
「以無^pb3所得故，菩提薩埵依般若波羅蜜多故，心無^lb罣礙；
無罣礙故，無有恐怖，遠離顛倒夢想，究^lb竟涅槃。
三世諸佛依般若波羅蜜多故，得阿^lb耨多羅三藐三菩提。
「故知般若波羅蜜多是^lb大神咒、是大明咒、是無上咒、是無等等咒，
能^pb4除一切苦，真實不虛，
故說般若波羅蜜多咒。」
^ck3【咒】^lb即說咒曰：
^lb^gatha「揭帝．揭帝．般羅揭帝．般羅僧揭帝^lb菩提．僧莎訶」
^ck4【流通分】^lb般若波羅蜜多心經
^pb5
^pb1^folio#pphs_kumarajiva【羅什】^bk#pphs_kumarajiva〔摩訶般若波羅蜜大明呪經〕^ck0【經題】^lb^au〔．．．後秦三藏．鳩摩羅什．譯〕
^ck1【序分】^ck2【正宗分】^lb觀世音菩薩行深般若波羅蜜時，
照見五^lb陰空，度一切苦厄。
「舍利弗！色空故無惱壞相，受^lb空故無受相，想空故無知相，行空故無作^pb2相，識空故無覺相。
何以故？舍利弗！非色異空，^lb非空異色。
色即是空，空即是色。

受、想、行、識亦^lb復如是。
「舍利弗！是諸法空相，不生不滅，不垢^lb不淨，不增不減。
是空法，非過去、非未來、非現^lb在。
是故空中無色，無受、想、行、識，
無眼、耳、鼻、舌、^pb3身、意，
無色、聲、香、味、觸、法，
無眼界乃至無意識^lb界，
無無明亦無無明盡，
乃至無老死無老死^lb盡，
無苦、集、滅、道，
無智亦無得。
「以無所得故，菩^lb薩依般若波羅蜜故，心無罣礙。
無罣礙故，無^lb有恐怖，離一切顛倒夢想苦惱，究竟涅槃。
三^pb4世諸佛依般若波羅蜜故，得阿耨多羅三藐^lb三菩提。
「故知般若波羅蜜是大明呪、無上明^lb呪、無等等明呪，
能除一切苦，真實不虛。
^ck3【咒】故說^lb般若波羅蜜呪。」
即說呪曰：
^lb^gatha「竭帝竭帝．波羅竭帝．波羅僧竭帝．^pb5^gatha菩提．僧莎呵」
^ck4【流通分】^lb^lb^lb^lb摩訶般若波羅蜜大明呪經
^pb6
^pb1^folio#pumen【普門品】^bk#pumen〔妙法蓮華經觀世音菩薩普門品經〕^ck0【經題】^lb^gatha^au〔．．．姚秦三藏法師鳩摩羅什〕譯長行
^lb^gatha．．．隋北天竺沙門闍那崛多譯重頌
^lb^ck1【序分】
爾時，無盡意菩薩即從座起，偏袒右肩，合掌^lb向佛而作是言：
「世尊！觀世音菩薩以何因緣^pb2名觀世音？」
^lb^ck2【水難】
佛告無盡意菩薩：
「善男子！若有無量百千萬^lb億眾生受諸苦惱，聞是觀世音菩薩，一心稱^lb名，觀世音菩薩即時觀其音聲，皆得解脫。
^lb若有持是觀世音菩薩名者，設入大火，火不^pb3能燒，由是菩薩威神力故。
若為大水所漂，稱^lb其名號，即得淺處。
若有百千萬億眾生，為求^lb金、銀、琉璃、車𤦲、馬瑙、珊瑚、虎珀、真珠等寶，入^lb於大海。
假使黑風吹其船舫，飄墮羅剎鬼國，^lb其中若有，乃至一人，稱觀世音菩薩名者，是^pb4諸人等皆得解脫羅剎之難。
以是因緣，名觀^lb世音。
^ck3【陸難】
若復有人臨當被害，稱觀世音菩薩名^lb者，彼所執刀杖尋段段壞，而得解脫。
若三千^lb大千國土滿中夜叉、羅剎欲來惱人，聞其稱^lb觀世音菩薩名者，是諸惡鬼尚不能以惡眼^pb5視之，況復加害。
設復有人，若有罪、若無罪，杻^lb械、枷鎖檢繫其身，稱觀世音菩薩名者，皆悉^lb斷壞，即得解脫。
若三千大千國土滿中怨賊，^lb有一商主將諸商人，齎持重寶經過嶮路。
其^lb中一人作是唱言：
『諸善男子！勿得恐怖！汝等^pb6應當一心稱觀世音菩薩名號。是菩薩能以^lb無畏施於眾生。
汝等若稱名者，於此怨賊當^lb得解脫。』
眾商人聞，俱發聲言：『南無觀世音菩^lb薩。』
稱其名故，即得解脫。
^ck4【離欲】
「無盡意！觀世音菩薩^lb摩訶薩威神之力，巍巍如是。
^pb7若有眾生多於婬欲，常念恭敬觀世音菩薩，^lb便得離欲。
若多瞋恚，常念恭敬觀世音菩薩，^lb便得離瞋。
若多愚癡，常念恭敬觀世音菩薩，^lb便得離癡。
^ck5【求生男女】
「無盡意！觀世音菩薩有如是等大^lb威神力，多所饒益。是故眾生常應心念。
^pb8若有女人，設欲求男，禮拜供養觀世音菩薩，^lb便生福德智慧之男；
設欲求女，便生端正有^lb相之女。宿殖德本，眾人愛敬。
「無盡意！觀世音^lb菩薩有如是力。若有眾生恭敬禮拜觀世音^lb菩薩，福不唐捐。
是故眾生皆應受持觀世音^lb菩薩名號。
^ck6【無邊福德】
「無盡意！若有人受持六十二億恒^lb河沙菩薩名字，
復盡形供養飲食、衣服、臥具、^lb醫藥。
於汝意云何？是善男子、善女人，功德多^lb不？」
無盡意言：「甚多，世尊！」
佛言：「若復有人受持^lb觀世音菩薩名號，乃至一時禮拜、供養。
是二^pb10人福，正等無異，於百千萬億劫不可窮盡。
無^lb盡意！受持觀世音菩薩名號，得如是無量無^lb邊福德之利。」
^ck7【現身說法】
^lb無盡意菩薩白佛言：「世尊！觀世音菩薩云何^lb遊此娑婆世界？
云何而為眾生說法？方便之^pb11力，其事云何？」
^lb佛告無盡意菩薩：
「善男子！若有國土眾生應^lb以佛身得度者，觀世音菩薩即現佛身而為^lb說法；
應以辟支佛身得度者，即現辟支佛身^lb而為說法；
應以聲聞身得度者，即現聲聞身^lb而為說法；
應以梵王身得度者，即現梵王身^lb而為說法；
應以帝釋身得度者，即現帝釋身^lb而為說法；
應以自在天身得度者，即現自在^lb天身而為說法；
應以大自在天身得度者，即^lb現大自在天身而為說法；
應以天大將軍身^lb得度者，即現天大將軍身而為說法；
應以毘^lb沙門身得度者，即現毘沙門身而為說法；
應^lb以小王身得度者，即現小王身而為說法；
應^lb以長者身得度者，即現長者身而為說法；
應^lb以居士身得度者，即現居士身而為說法；
應^pb14以宰官身得度者，即現宰官身而為說法；
應^lb以婆羅門身得度者，即現婆羅門身而為說^lb法；
應以比丘、比丘尼、優婆塞、優婆夷身得度^lb者，即現比丘、比丘尼、優婆塞、優婆夷身而為^lb說法；
應以長者、居士、宰官、婆羅門婦女身得度^pb15者，即現婦女身而為說法；
應以童男、童女^lb身得度者，即現童男、童女身而為說法；
應以^lb天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩^lb睺羅伽、人非人等身得度者，即皆現之而為^lb說法；
應以執金剛身得度者，即現執金剛身^pb16而為說法。
「無盡意！是觀世音菩薩成就如是^lb功德，以種種形，遊諸國土，度脫眾生。
^lb是故汝等應當一心供養觀世音菩薩。
是觀^lb世音菩薩摩訶薩於怖畏急難之中能施無^lb畏，是故此娑婆世界皆號之為施無畏者。」
^ck8【珍寶供養】
無^pb17盡意菩薩白佛言：
「世尊！我今當供養觀世音^lb菩薩。」
即解頸眾寶珠、瓔珞，價直百千兩金，而^lb以與之，作是言：
「仁者！受此法施珍寶瓔珞。」
時^lb觀世音菩薩不肯受之。
無盡意復白觀世音^lb菩薩言：
「仁者！愍我等故，受此瓔珞。」
爾時佛告^pb18觀世音菩薩：
「當愍此無盡意菩薩及四眾，天、^lb龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺^lb羅伽、人非人等故，受是瓔珞。」
即時觀世音菩^lb薩愍諸四眾，及於天、龍、人非人等，
受其瓔珞，^lb分作二分，一分奉釋迦牟尼佛，一分奉多寶^pb19佛塔。
「無盡意！觀世音菩薩有如是自在神力，^lb遊於娑婆世界。」
^ck9【偈】
爾時無盡意菩薩以偈問曰：
^lb^gatha「世尊妙相具．我今重問彼，
佛子何因緣．^lb^gatha名為觀世音？
具足妙相尊．偈答無盡意：
^lb^gatha『汝聽觀音行．善應諸方所，
弘誓深如海．^pb20^gatha歷劫不思議，
侍多千億佛．發大清淨願。
^lb^gatha我為汝略說．聞名及見身，
心念不空過．^lb^gatha能滅諸有苦。
假使興害意．推落大火坑，
^lb^gatha念彼觀音力．火坑變成池。
或漂流巨海．^lb^gatha龍魚諸鬼難，
念彼觀音力．波浪不能沒。
^pb21^gatha或在須彌峯．為人所推墮，
念彼觀音力．^lb^gatha如日虛空住。
或被惡人逐．墮落金剛山，
^lb^gatha念彼觀音力．不能損一毛。
或值怨賊繞．^lb各執刀加害，
念彼觀音力．咸即起慈心。
^lb^gatha或遭王難苦．臨刑欲壽終，
念彼觀音力．^pb22^gatha刀尋段段壞。
或囚禁枷鎖．手足被杻械，
^lb^gatha念彼觀音力．釋然得解脫。
呪詛諸毒藥．^lb^gatha所欲害身者，
念彼觀音力．還著於本人。
^lb^gatha或遇惡羅剎．毒龍諸鬼等，
念彼觀音力．^lb^gatha時悉不敢害。
若惡獸圍遶．利牙爪可怖，
^pb23^gatha念彼觀音力．疾走無邊方。
蚖蛇及蝮蠍．^lb^gatha氣毒煙火燃，
念彼觀音力．尋聲自迴去。
^lb^gatha雲雷鼓掣電．降雹澍大雨，
念彼觀音力．^lb^gatha應時得消散。
眾生被困厄．無量苦逼身，
^lb^gatha觀音妙智力．能救世間苦。
具足神通力．^pb24^gatha廣修智方便，
十方諸國土．無剎不現身。
^lb^gatha種種諸惡趣．地獄鬼畜生，
生老病死苦．^lb^gatha以漸悉令滅。
真觀清淨觀．廣大智慧觀，
^lb^gatha悲觀及慈觀．常願常瞻仰。
無垢清淨光．^lb^gatha慧日破諸闇，
能伏災風火．普明照世間。
^pb25^gatha悲體戒雷震．慈意妙大雲，
澍甘露法雨．^lb^gatha滅除煩惱焰。
諍訟經官處．怖畏軍陣中，
^lb^gatha念彼觀音力．眾怨悉退散。
妙音觀世音．^lb^gatha梵音海潮音，
勝彼世間音．是故須常念，
^lb^gatha念念勿生疑．觀世音淨聖，
於苦惱死厄．^pb26^gatha能為作依怙，
具一切功德．慈眼視眾生，
^lb^gatha福聚海無量．是故應頂禮。』」
^lb^ck10【流通分】
爾時持地菩薩即從座起，前白佛言：
「世尊！若^lb有眾生聞是觀世音菩薩品自在之業、普門^lb示現神通力者，當知是人功德不少。」
佛說是^pb27普門品時，眾中八萬四千眾生，皆發無等等^lb阿耨多羅三藐三菩提心。
^lb^lb^lb妙法蓮華經觀世音菩薩普門品經^pb28
^pb1^ak#sdpdrk^folio#sdpdrk1<lines=6>【法華經】^bk#sdpdrk〔妙法蓮華經〕卷第一^lb^au〔．．．．姚秦三藏法師鳩摩羅什奉詔譯〕
^lb^ck1〔序品第一〕
^lb^cb#01c19如是我聞：
一時，佛住王舍城耆闍崛山中，與^lb大比丘眾萬二千人俱，皆是阿羅漢，諸漏已^lb盡，無復煩惱，逮得己利，盡諸有結，心得自在。
^pb2其名曰：阿若憍陳如、摩訶迦葉、優樓頻螺迦^lb葉、伽耶迦葉、那提迦葉舍利弗、大目揵連、摩^lb訶迦旃延、阿㝹樓馱、劫賓那、憍梵波提、離婆^lb多、畢陵伽婆蹉、薄拘羅、摩訶拘絺羅、難陀、孫^lb陀羅難陀、富樓那彌多羅尼子、須菩提、阿難、^lb羅睺羅。如是眾所知識大阿羅漢等。
復有學、^pb3無學二千人。摩訶波闍波提比丘尼，與眷屬^lb六千人俱。
羅睺羅母耶輸陀羅比丘尼，亦與^lb眷屬俱。
菩薩摩訶薩八萬人，皆於阿耨多羅^lb三藐三菩提不退轉；皆得陀羅尼；樂說辯才，^lb轉不退轉法輪；供養無量百千諸佛，於諸佛^lb所植眾德本，常為諸佛之所稱歎；以慈修身，^pb4善入佛慧；通達大智，到於彼岸；名稱普聞無^lb量世界，能度無數百千眾生。
其名曰：文殊師^lb利菩薩、觀世音菩薩、得大勢菩薩、常精進菩^lb薩、不休息菩薩、寶掌菩薩、藥王菩薩、勇施菩^lb薩、寶月菩薩、月光菩薩、滿月菩薩、大力菩薩、^lb無量力菩薩、越三界菩薩、跋陀婆羅菩薩、彌^pb5勒菩薩、寶積菩薩、導師菩薩，如是等菩薩摩^lb訶薩八萬人俱。
^cb#02a15爾時釋提桓因，與其眷屬二^lb萬天子俱。
復有名月天子、普香天子、寶光天^lb子、四大天王，與其眷屬萬天子俱。
自在天子、大^lb自在天子，與其眷屬三萬天子俱。
娑婆世^lb界主梵天王——尸棄大梵、光明大梵等，與其眷^pb6屬萬二千天子俱。
有八龍王——難陀龍王、跋難^lb陀龍王、娑伽羅龍王、和脩吉龍王、德叉迦龍^lb王、阿那婆達多龍王、摩那斯龍王、優鉢羅龍^lb王等，各與若干百千眷屬俱。
有四緊那羅王——^lb法緊那羅王、妙法緊那羅王、大法緊那羅王、^lb持法緊那羅王，各與若干百千眷屬俱。
有四^pb7乾闥婆王——樂乾闥婆王、樂音乾闥婆王、美乾^lb闥婆王、美音乾闥婆王，各與若干百千眷屬^lb俱。
有四阿修羅王——婆稚阿修羅王、佉羅騫馱^lb阿修羅王、毘摩質多羅阿修羅王、羅睺阿修^lb羅王，各與若干百千眷屬俱。
有四迦樓羅王——^lb大威德迦樓羅王、大身迦樓羅王、大滿迦樓^pb8羅王、如意迦樓羅王，各與若干百千眷屬俱。
^lb韋提希子阿闍世王，與若干百千眷屬俱。各^lb禮佛足，退坐一面。
^cb#02b07爾時世尊，四眾圍遶，供養、^lb恭敬、尊重、讚歎。
為諸菩薩說大乘經，名無量^lb義，教菩薩法，佛所護念。
佛說此經已，結加趺^lb坐，入於無量義處三昧，身心不動。
是時天雨曼陀羅華、摩訶^pb9曼陀羅華、曼殊沙華、摩訶曼^lb殊沙華，而散佛上、及諸大眾。普佛世界，六種^lb震動。
爾時會中，比丘、比丘尼、優婆塞、優婆夷、^lb天龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩^lb睺羅伽、人非人，及諸小王、轉輪聖王，是諸大^lb眾，得未曾有，歡喜合掌，一心觀佛。
^cb#02b16爾時佛放^pb10眉間白毫相光，照東方萬八千世界，靡不周^lb遍，下至阿鼻地獄，上至阿迦尼吒天。
於此世^lb界，盡見彼土六趣眾生，又見彼土現在諸佛，^lb及聞諸佛所說經法。
并見彼諸比丘、比丘尼、^lb優婆塞、優婆夷，諸修行得道者。
復見諸菩薩^lb摩訶薩，種種因緣、種種信解、種種相貌，行菩^pb11薩道。復見諸佛般涅槃者。復見諸佛般涅槃^lb後，以佛舍利起七寶塔。
^cb#02b24爾時彌勒菩薩作是^lb念：「今者世尊現神變相，以何因緣而有此瑞？^lb今佛世尊入于三昧，是不可思議、現希有事。
^lb當以問誰？誰能答者？」復作此念：「是文殊師利，^lb法王之子，已曾親近供養過去無量諸佛，必^pb12應見此希有之相。我今當問。」
^cb#02b29爾時比丘、比丘^lb尼、優婆塞、優婆夷，及諸天、龍、鬼神等，咸作此^lb念：「是佛光明神通之相，今當問誰？」
^cb#02c03爾時彌勒^lb菩薩，欲自決疑，又觀四眾比丘、比丘尼、優婆^lb塞、優婆夷，及諸天，龍、鬼神等眾會之心，而問^lb文殊師利言：「以何因緣而有此瑞神通之相，^pb13放大光明，照于東方萬八千土，悉見彼佛國^lb界莊嚴？」於是彌勒菩薩欲重宣此義，以偈問^lb曰：
^lb^gatha「文殊師利！　　導師何故，　　眉間白毫，
　大光普照。　　^lb雨曼陀羅、　　曼殊沙華，
　栴檀香風，　　悅可眾心？　　^lb以是因緣，
　地皆嚴淨，　　而此世界，　　六種震動。
　^pb14時四部眾，　　咸皆歡喜，　　身意快然，
　得未曾有。　　^lb眉間光明，　　照于東方，
　萬八千土，　　皆如金色，　　^lb從阿鼻獄，
　上至有頂。　　諸世界中，　　六道眾生，
　^lb生死所趣，　　善惡業緣，　　受報好醜，
　於此悉見。　　^lb又覩諸佛、　　聖主師子、
　演說經典，　　微妙第一。　　^lb其聲清淨，
　出柔軟音，　　教諸菩薩，　　無數億萬，
　^pb15梵音深妙，　　令人樂聞。　　各於世界，
　講說正法，　　^lb種種因緣。　　以無量喻，
　照明佛法，　　開悟眾生。　　^lb若人遭苦，
　厭老病死，　　為說涅槃，　　盡諸苦際。
　^lb若人有福，　　曾供養佛，　　志求勝法，
　為說緣覺。　　^lb若有佛子、　　修種種行，
　求無上慧，　　為說淨道。　　^lb文殊師利！
　我住於此，　　見聞若斯，　　及千億事，
　^pb16如是眾多，　　今當略說。　　我見彼土，
　恒沙菩薩，　　^lb種種因緣，　　而求佛道。
　或有行施，　　金銀珊瑚、　　^lb真珠摩尼、
　車璩馬腦、　　金剛諸珍，　　奴婢車乘、
　^lb寶飾輦輿，　　歡喜布施。　　迴向佛道，
　願得是乘，　　^lb三界第一，　　諸佛所歎。
　或有菩薩，　　駟馬寶車、　　^lb欄楯華蓋、
　軒飾布施。　　復見菩薩，　　身肉手足，
　^pb17及妻子施，　　求無上道。　　又見菩薩，
　頭目身體，　　^lb欣樂施與，　　求佛智慧。
　文殊師利！　　我見諸王，　　^lb往詣佛所，
　問無上道，　　便捨樂土、　　宮殿臣妾，
　^lb剃除鬚髮，　　而被法服。　　或見菩薩，
　而作比丘，　　^lb獨處閑靜，　　樂誦經典。
　又見菩薩，　　勇猛精進，　　^lb入於深山，
　思惟佛道。　　又見離欲，　　常處空閑，
　^pb18深修禪定，　　得五神通。　　又見菩薩，
　安禪合掌，　　^lb以千萬偈、　　讚諸法王。
　復見菩薩，　　智深志固，　　^lb能問諸佛，
　聞悉受持。　　又見佛子，　　定慧具足，
　^lb以無量喻，　　為眾講法。　　欣樂說法，
　化諸菩薩，　　^lb破魔兵眾，　　而擊法鼓。
　又見菩薩，　　寂然宴默，　　^lb天龍恭敬，
　不以為喜。　　又見菩薩，　　處林放光，
　^pb19濟地獄苦，　　令入佛道。　　又見佛子，
　未甞睡眠，　　^lb經行林中，　　懃求佛道。
　又見具戒，　　威儀無缺，　　^lb淨如寶珠，
　以求佛道。　　又見佛子，　　住忍辱力，
　^lb增上慢人，　　惡罵捶打，　　皆悉能忍，
　以求佛道。　　^lb又見菩薩，　　離諸戲笑，
　及癡眷屬，　　親近智者，　　^lb一心除亂，
　攝念山林，　　億千萬歲，　　以求佛道。
　^pb20或見菩薩，　　餚饍飲食、　　百種湯藥，
　施佛及僧。　　^lb名衣上服，　　價直千萬，
　或無價衣，　　施佛及僧。　　^lb千萬億種，
　栴檀寶舍、　　眾妙臥具，　　施佛及僧。
　^lb清淨園林，　　華菓茂盛，　　流泉浴池，
　施佛及僧。　　^lb如是等施，　　種種微妙，
　歡喜無厭，　　求無上道。　　^lb或有菩薩，
　說寂滅法，　　種種教詔，　　無數眾生。
　^pb21或見菩薩，　　觀諸法性，　　無有二相，
　猶如虛空。　　^lb又見佛子，　　心無所著，
　以此妙慧、　　求無上道。　　^lb文殊師利！
　又有菩薩，　　佛滅度後，　　供養舍利。
　^lb又見佛子，　　造諸塔廟，　　無數恒沙，
　嚴飾國界，　　^lb寶塔高妙，　　五千由旬，
　縱廣正等，　　二千由旬。　　^lb一一塔廟，
　各千幢幡，　　珠交露幔，　　寶鈴和鳴。
　^pb22諸天龍神、　　人及非人，　　香華伎樂，
　常以供養。　　^lb文殊師利！　　諸佛子等，
　為供舍利，　　嚴飾塔廟，　　^lb國界自然，
　殊特妙好，　　如天樹王，　　其華開敷。
　^lb佛放一光，　　我及眾會，　　見此國界，
　種種殊妙。　　^lb諸佛神力、　　智慧希有，
　放一淨光，　　照無量國。　　^lb我等見此，
　得未曾有。　　佛子文殊！　　願決眾疑。
　^pb23四眾欣仰，　　瞻仁及我。　　世尊何故，
　放斯光明？　　^lb佛子時答，　　決疑令喜。
　何所饒益，　　演斯光明？　　^lb佛坐道場，
　所得妙法，　　為欲說此？　　為當授記？
　^lb示諸佛土，　　眾寶嚴淨，　　及見諸佛，
　此非小緣。　　^lb文殊當知，　　四眾龍神，
　瞻察仁者，　　為說何等。」
^lb^cb#03c11爾時文殊師利語彌勒菩薩摩訶薩及諸大^pb24士、善男子等：「如我惟忖，今佛世尊欲說大法，^lb雨大法雨，吹大法螺，擊大法鼓，演大法義。
諸^lb善男子！我於過去諸佛，曾見此瑞，放斯光已，^lb即說大法。
是故當知，今佛現光，亦復如是，欲^lb令眾生，咸得聞知一切世間難信之法，故現^lb斯瑞。
^cb#03c17「諸善男子！如過去無量無邊不可思議^pb25阿僧祇劫，爾時有佛，號日月燈明如來、應供、^lb正遍知、明行足、善逝世間解、無上士、調御丈^lb夫、天人師、佛、世尊，演說正法，初善中善後善，^lb其義深遠，其語巧妙，純一無雜，具足清白梵^lb行之相。
為求聲聞者說應四諦法，度生老病^lb死，究竟涅槃；為求辟支佛者說應十二因緣^pb26法；為諸菩薩說應六波羅蜜，令得阿耨多羅^lb三藐三菩提，成一切種智。
^cb#03c26「次復有佛亦名日^lb月燈明，次復有佛亦名日月燈明，如是二萬^lb佛，皆同一字，號日月燈明，又同一姓，姓頗羅^lb墮。
彌勒當知，初佛後佛，皆同一字，名日月燈^lb明，十號具足。
所可說法，初中後善。其最後佛，^pb27未出家時有八王子：一名有意，二名善意，三^lb名無量意，四名寶意，五名增意，六名除疑意，七^lb名嚮意，八名法意。
是八王子，威德自在，各^lb領四天下。是諸王子，聞父出家，得阿耨多羅^lb三藐三菩提，悉捨王位亦隨出家，發大乘意，^lb常修梵行，皆為法師，已於千萬佛所、殖諸善^pb28本。
^cb#04a08「是時日月燈明佛說大乘經，名無量義，教^lb菩薩法，佛所護念。
說是經已，即於大眾中結^lb跏趺坐，入於無量義處三昧，身心不動。
是時、^lb天雨曼陀羅華，摩訶曼陀羅華，曼殊沙華，摩^lb訶曼殊沙華，而散佛上、及諸大眾。普佛世界，^lb六種震動。
爾時會中，比丘、比丘尼、優婆塞、優^pb29婆夷，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那^lb羅、摩睺羅伽、人非人，及諸小王、轉輪聖王等，^lb是諸大眾，得未曾有，歡喜合掌，一心觀佛。
^cb#04a18「爾^lb時如來放眉間白毫相光，照東方萬八千佛^lb土，靡不周遍，如今所見是諸佛土。
彌勒當知，^lb爾時會中，有二十億菩薩樂欲聽法。
是諸菩^pb30薩，見此光明、普照佛土，得未曾有，欲知此光^lb所為因緣。
時有菩薩，名曰妙光，有八百弟子。^lb是時日月燈明佛從三昧起，因妙光菩薩、說^lb大乘經，名妙法蓮華，教菩薩法，佛所護念，六^lb十小劫不起于座。
時會聽者亦坐一處，六十^lb小劫身心不動，聽佛所說，謂如食頃。
是時眾^pb31中，無有一人若身若心而生懈惓。
^cb#04a28「日月燈明^lb佛於六十小劫說是經已，即於梵、魔、沙門、婆^lb羅門、及天、人、阿修羅眾中，而宣此言：『如來於^lb今日中夜，當入無餘涅槃。』
時有菩薩，名曰德^lb藏，日月燈明佛即授其記。告諸比丘：『是德藏^lb菩薩，次當作佛，號曰淨身多陀阿伽度、阿羅^pb32訶、三藐三佛陀。』佛授記已，便於中夜、入無餘^lb涅槃。
佛滅度後，妙光菩薩持妙法蓮華經，滿^lb八十小劫為人演說。
日月燈明佛八子皆師^lb妙光，妙光教化令其堅固阿耨多羅三藐三^lb菩提。
是諸王子、供養無量百千萬億佛已，皆^lb成佛道，其最後成佛者，名曰燃燈。
八百弟子^pb33中，有一人號曰求名，貪著利養，雖復讀誦眾^lb經，而不通利，多所忘失，故號求名。
是人亦以^lb種諸善根因緣故，得值無量百千萬億諸佛，^lb供養、恭敬，尊重、讚歎。
彌勒當知，爾時妙光菩^lb薩豈異人乎？我身是也；求名菩薩，汝身是也。
^lb今見此瑞，與本無異，是故惟忖：『今日如來當^pb34說大乘經，名妙法蓮華，教菩薩法，佛所護念。』」
^lb^cb#04b18爾時文殊師利於大眾中，欲重宣此義，而說^lb偈言：
^lb^gatha「我念過去世，　　無量無數劫，
　有佛人中尊，　　^lb號日月燈明。
　世尊演說法，　　度無量眾生，
　^lb無數億菩薩，　　令入佛智慧。
　佛未出家時，　　^pb35所生八王子，
　見大聖出家，　　亦隨修梵行。
　^lb時佛說大乘，　　經名無量義，
　於諸大眾中，　　^lb而為廣分別。
　佛說此經已，　　即於法座上，
　^lb跏趺坐三昧，　　名無量義處。
　天雨曼陀華，　　^lb天鼓自然鳴，
　諸天龍鬼神，　　供養人中尊。
　^lb一切諸佛土，　　即時大震動，
　佛放眉間光，　　^pb36現諸希有事。
　此光照東方，　　萬八千佛土，
　^lb示一切眾生，　　生死業報處。
　有見諸佛土，　　^lb以眾寶莊嚴，
　琉璃頗梨色，　　斯由佛光照。
　^lb及見諸天人、　　龍神夜叉眾、
　乾闥緊那羅，　　^lb各供養其佛。
　又見諸如來，　　自然成佛道，
　^lb身色如金山，　　端嚴甚微妙。
　如淨琉璃中，　　^pb37內現真金像，
　世尊在大眾，　　敷演深法義。
　^lb一一諸佛土，　　聲聞眾無數，
　因佛光所照，　　^lb悉見彼大眾。
　或有諸比丘，　　在於山林中，
　^lb精進持淨戒，　　猶如護明珠。
　又見諸菩薩，　　^lb行施忍辱等，
　其數如恒沙，　　斯由佛光照。
　^lb又見諸菩薩，　　深入諸禪定，
　身心寂不動，　　^pb38以求無上道。
　又見諸菩薩，　　知法寂滅相，
　^lb各於其國土，　　說法求佛道。
　爾時四部眾，　　^lb見日月燈佛，
　現大神通力，　　其心皆歡喜，
　^lb各各自相問：　　『是事何因緣？』
　天人所奉尊，　　^lb適從三昧起，
　讚妙光菩薩：　　『汝為世間眼，
　^lb一切所歸信，　　能奉持法藏，
　如我所說法，　　^pb39唯汝能證知。』
　世尊既讚歎，　　令妙光歡喜，
　^lb說是法華經，　　滿六十小劫，
　不起於此座。　　^lb所說上妙法，
　是妙光法師，　　悉皆能受持。
　^lb佛說是法華，　　令眾歡喜已，
　尋即於是日，　　^lb告於天人眾：
『諸法實相義，　　已為汝等說，
　^lb我今於中夜，　　當入於涅槃。
　汝一心精進，　　^pb40當離於放逸，
　諸佛甚難值，　　億劫時一遇。』
　^lb世尊諸子等，　　聞佛入涅槃，
　各各懷悲惱，　　^lb佛滅一何速。
　聖主法之王，　　安慰無量眾：
^lb『我若滅度時，　　汝等勿憂怖，
　是德藏菩薩，　　^lb於無漏實相，
　心已得通達。　　其次當作佛，
　^lb號曰為淨身，　　亦度無量眾。』
　佛此夜滅度，　　^pb41如薪盡火滅，
　分布諸舍利，　　而起無量塔。
　^lb比丘比丘尼，　　其數如恒沙，
　倍復加精進，　　^lb以求無上道。
　是妙光法師，　　奉持佛法藏，
　^lb八十小劫中，　　廣宣法華經。
　是諸八王子，　　^lb妙光所開化，
　堅固無上道，　　當見無數佛。
　^lb供養諸佛已，　　隨順行大道，
　相繼得成佛，　　^pb42轉次而授記。
　最後天中天，　　號曰燃燈佛，
　^lb諸仙之導師，　　度脫無量眾。
　是妙光法師，　　^lb時有一弟子，
　心常懷懈怠，　　貪著於名利，
　^lb求名利無厭，　　多遊族姓家，
　棄捨所習誦，　　^lb廢忘不通利。
　以是因緣故，　　號之為求名。
　^lb亦行眾善業，　　得見無數佛，
　供養於諸佛，　　^pb43隨順行大道，
　具六波羅蜜，　　今見釋師子。
　^lb其後當作佛，　　號名曰彌勒，
　廣度諸眾生，　　^lb其數無有量。
　彼佛滅度後，　　懈怠者汝是；
　^lb妙光法師者，　　今則我身是。
　我見燈明佛，　　^lb本光瑞如此，
　以是知今佛，　　欲說法華經。
　^lb今相如本瑞，　　是諸佛方便，
　今佛放光明，　　^pb44助發實相義。
　諸人今當知，　　合掌一心待，
　^lb佛當雨法雨，　　充足求道者。
　諸求三乘人，　　^lb若有疑悔者，
　佛當為除斷，　　令盡無有餘。」
^lb^ck2〔方便品第二〕
^lb^cb#05b25爾時，世尊從三昧安詳而起，告舍利弗：「諸佛^lb智慧甚深無量，其智慧門難解難入，一切聲^pb45聞、辟支佛所不能知。
所以者何？佛曾親近百^lb千萬億無數諸佛，盡行諸佛無量道法，勇猛^lb精進名稱普聞，成就甚深未曾有法，隨宜所^lb說意趣難解。
舍利弗！吾從成佛已來，種種因^lb緣，種種譬喻，廣演言教無數方便，引導眾生^lb令離諸著。
所以者何？如來方便知見波羅蜜^pb46皆已具足。舍利弗！如來知見，廣大深遠，無量^lb無礙，力、無所畏、禪定、解脫三昧，深入無際，成^lb就一切未曾有法。
舍利弗！如來能種種分別，^lb巧說諸法，言辭柔軟，悅可眾心。
舍利弗！取要^lb言之，無量無邊未曾有法，佛悉成就。
^cb#05c09「止，舍利^lb弗！不須復說。
所以者何？佛所成就第一希有^pb47難解之法。唯佛與佛乃能究盡諸法實相，所^lb謂諸法如是相，如是性，如是體，如是力，如是^lb作，如是因，如是緣，如是果，如是報，如是本末^lb究竟等。」
^cb#05c14爾時世尊欲重宣此義，而說偈言：
^lb「世雄不可量，　　諸天及世人，
　一切眾生類，　　^lb無能知佛者。
　佛力無所畏、　　解脫諸三昧，
　^pb48及佛諸餘法，　　無能測量者。
　本從無數佛，　　^lb具足行諸道，
　甚深微妙法，　　難見難可了。
　^lb於無量億劫，　　行此諸道已，
　道場得成果，　　^lb我已悉知見。
　如是大果報，　　種種性相義，
　^lb我及十方佛，　　乃能知是事。
　是法不可示，　　^lb言辭相寂滅，
　諸餘眾生類，　　無有能得解，
　^pb49除諸菩薩眾、　　信力堅固者。
　諸佛弟子眾，　　^lb曾供養諸佛，
　一切漏已盡，　　住是最後身，
　^lb如是諸人等，　　其力所不堪。
　假使滿世間，　　^lb皆如舍利弗，
　盡思共度量，　　不能測佛智。
　^lb正使滿十方，　　皆如舍利弗，
　及餘諸弟子，　　^lb亦滿十方剎，
　盡思共度量，　　亦復不能知。
　^pb50辟支佛利智，　　無漏最後身，
　亦滿十方界，　　^lb其數如竹林，
　斯等共一心，　　於億無量劫，
　^lb欲思佛實智，　　莫能知少分。
　新發意菩薩，　　^lb供養無數佛，
　了達諸義趣，　　又能善說法，
　^lb如稻麻竹葦，　　充滿十方剎，
　一心以妙智，　　^lb於恒河沙劫，
　咸皆共思量，　　不能知佛智。
　^pb51不退諸菩薩，　　其數如恒沙，
　一心共思求，　　^lb亦復不能知。
　又告舍利弗：　　『無漏不思議，
　^lb甚深微妙法，　　我今已具得，
　唯我知是相，　　^lb十方佛亦然。
　舍利弗當知，　　諸佛語無異，
　^lb於佛所說法，　　當生大信力，
　世尊法久後，　　^lb要當說真實。』
　告諸聲聞眾，　　及求緣覺乘：
^pb52『我令脫苦縛，　　逮得涅槃者。』
　佛以方便力，　　^lb示以三乘教，
　眾生處處著，　　引之令得出。」
^lb^cb#06a28爾時大眾中，有諸聲聞漏盡阿羅漢，阿若憍^lb陳如等千二百人，及發聲聞、辟支佛心比丘、^lb比丘尼、優婆塞、優婆夷，各作是念：「今者、世尊^lb何故慇懃稱歎方便而作是言：『佛所得法甚^pb53深難解，有所言說意趣難知，一切聲聞、辟支^lb佛所不能及。』佛說一解脫義，我等亦得此法^lb到於涅槃，而今不知是義所趣。」
^cb#06b07爾時舍利弗^lb知四眾心疑，自亦未了，而白佛言：「世尊！何因^lb何緣慇懃稱歎諸佛第一方便、甚深微妙、難^lb解之法？我自昔來，未曾從佛聞如是說；今者^pb54四眾咸皆有疑。唯願世尊敷演斯事。世尊何^lb故慇懃稱歎甚深微妙難解之法？」
^cb#06b12爾時舍利^lb弗欲重宣此義，而說偈言：
^lb^gatha「慧日大聖尊，　　久乃說是法，
　自說得如是，　　^lb力無畏三昧、
　禪定解脫等，　　不可思議法。
　^lb道場所得法，　　無能發問者；
　我意難可測，　　^pb55亦無能問者。
　無問而自說，　　稱歎所行道，
　^lb智慧甚微妙，　　諸佛之所得。
　無漏諸羅漢，　　^lb及求涅槃者，
　今皆墮疑網，　　佛何故說是？
　^lb其求緣覺者，　　比丘比丘尼，
　諸天龍鬼神，　　^lb及乾闥婆等，
　相視懷猶豫，　　瞻仰兩足尊，
　^lb是事為云何，　　願佛為解說。
　於諸聲聞眾，　　^pb56佛說我第一。
　我今自於智，　　疑惑不能了，
　^lb為是究竟法？　　為是所行道？
　佛口所生子，　　^lb合掌瞻仰待，
　願出微妙音，　　時為如實說。
　^lb諸天龍神等，　　其數如恒沙，
　求佛諸菩薩，　　^lb大數有八萬，
　又諸萬億國，　　轉輪聖王至，
　^lb合掌以敬心，　　欲聞具足道。」
^pb57^cb#06c07爾時佛告舍利弗：「止，止！不須復說。
若說是事，^lb一切世間諸天及人皆當驚疑。」
^cb#06c08舍利弗重白^lb佛言：「世尊，唯願說之，唯願說之！所以者何？是^lb會無數百千萬億阿僧祇眾生，曾見諸佛，諸^lb根猛利，智慧明了，聞佛所說，則能敬信。」
^cb#06c12爾時^lb舍利弗欲重宣此義，而說偈言：
^pb58「法王無上尊，　　唯說願勿慮。
　是會無量眾，　　^lb有能敬信者。」
^lb^cb#06c16佛復止舍利弗：「若說是事，一切世間天、人、阿^lb修羅皆當驚疑，增上慢比丘將墜於大坑。」
^cb#06c18爾^lb時世尊重說偈言：
^lb^gatha「止止不須說，　　我法妙難思。
　諸增上慢者，　　^pb59聞必不敬信。」
^lb^cb#06c21爾時舍利弗重白佛言：「世尊！唯願說之，唯願^lb說之！今此會中，如我等比百千萬億，世世已^lb曾從佛受化。
如此人等，必能敬信，長夜安隱，^lb多所饒益。」
^cb#06c24爾時舍利弗欲重宣此義，而說偈^lb言：
^pb60「無上兩足尊，　　願說第一法，
　我為佛長子，　　^lb唯垂分別說。
　是會無量眾，　　能敬信此法，
　^lb佛已曾世世，　　教化如是等，
　皆一心合掌，　　^lb欲聽受佛語。
　我等千二百，　　及餘求佛者，
　^lb願為此眾故，　　唯垂分別說。
　是等聞此法，　　^lb則生大歡喜。」
^pb61^cb#07a05爾時世尊告舍利弗：「汝已慇懃三請，豈得不^lb說。
汝今諦聽，善思念之，吾當為汝分別解說。」^lb說此語時，會中有比丘、比丘尼、優婆塞、優婆^lb夷五千人等，即從座起，禮佛而退。
所以者何？^lb此輩罪根深重及增上慢，未得謂得、未證謂^lb證，有如此失，是以不住。世尊默然而不制止。
^pb62^cb#07a12爾時佛告舍利弗：「我今此眾，無復枝葉，純有^lb真實。
舍利弗！如是增上慢人，退亦佳矣。汝今^lb善聽，當為汝說。」
^cb#07a14舍利弗言：「唯然，世尊！願樂欲^lb聞。」
^cb#07a15佛告舍利弗：「如是妙法，諸佛如來時乃說^lb之，如優曇鉢華，時一現耳。
舍利弗！汝等當信^lb佛之所說，言不虛妄。舍利弗！諸佛隨宜說法，^pb63意趣難解。
所以者何？我以無數方便，種種因^lb緣、譬喻言辭，演說諸法。
是法非思量分別之^lb所能解，唯有諸佛乃能知之。
所以者何？諸佛^lb世尊唯以一大事因緣故出現於世。
舍利弗！^lb云何名諸佛世尊唯以一大事因緣故出現^lb於世？
諸佛世尊，欲令眾生開佛知見，使得清^pb64淨故，出現於世；欲示眾生佛之知見故，出現^lb於世；欲令眾生悟佛知見故，出現於世；欲令^lb眾生入佛知見道故，出現於世。
舍利弗！是為^lb諸佛以一大事因緣故出現於世。」
^cb#07a29佛告舍利^lb弗：「諸佛如來但教化菩薩，諸有所作，常為一^lb事，唯以佛之知見示悟眾生。
舍利弗！如來但^pb65以一佛乘故，為眾生說法，無有餘乘，若二、若^lb三。
舍利弗！一切十方諸佛，法亦如是。
^cb#07b04「舍利弗！^lb過去諸佛，以無量無數方便，種種因緣、譬喻^lb言辭，而為眾生演說諸法，是法皆為一佛乘^lb故。
是諸眾生，從諸佛聞法，究竟皆得一切種^lb智。
^cb#07b07「舍利弗！未來諸佛當出於世，亦以無量無^pb66數方便，種種因緣、譬喻言辭，而為眾生演說^lb諸法，是法皆為一佛乘故。
是諸眾生，從佛聞^lb法，究竟皆得一切種智。
^cb#07b11「舍利弗！現在十方無^lb量百千萬億佛土中，諸佛世尊多所饒益安^lb樂眾生，是諸佛亦以無量無數方便，種種因^lb緣、譬喻言辭，而為眾生演說諸法，是法皆為^pb67一佛乘故。
是諸眾生，從佛聞法，究竟皆得一^lb切種智。
^cb#07b16「舍利弗！是諸佛但教化菩薩，欲以佛^lb之知見示眾生故，欲以佛之知見悟眾生故，^lb欲令眾生入佛之知見故。
^cb#07b18「舍利弗！我今亦復^lb如是，知諸眾生有種種欲，深心所著，隨其本^lb性，以種種因緣、譬喻言辭，方便力而為說法。
^pb68舍利弗！如此皆為得一佛乘、一切種智故。
^cb#07b22「舍^lb利弗！十方世界中，尚無二乘，何況有三。
舍利^lb弗！諸佛出於五濁惡世，所謂劫濁、煩惱濁、眾^lb生濁、見濁、命濁。
如是，舍利弗！劫濁亂時，眾生^lb垢重，慳貪嫉妬，成就諸不善根故，諸佛以方^lb便力，於一佛乘分別說三。
舍利弗！若我弟子，^pb69自謂阿羅漢、辟支佛者，不聞不知諸佛如來^lb但教化菩薩事，此非佛弟子，非阿羅漢，非辟^lb支佛。
^cb#07b29「又，舍利弗！是諸比丘、比丘尼，自謂已得^lb阿羅漢，是最後身，究竟涅槃，便不復志求阿^lb耨多羅三藐三菩提，當知此輩皆是增上慢^lb人。
所以者何。若有比丘、實得阿羅漢，若不信^pb70此法，無有是處。除佛滅度後，現前無佛。
所以^lb者何？佛滅度後，如是等經受持讀誦解義者，^lb是人難得。若遇餘佛，於此法中便得決了。舍^lb利弗！汝等當一心信解受持佛語。諸佛如來^lb言無虛妄，無有餘乘，唯一佛乘。」
^cb#07c09爾時世尊欲^lb重宣此義，而說偈言：
^pb71^gatha「比丘比丘尼，　　有懷增上慢，
　優婆塞我慢，　　^lb優婆夷不信，
　如是四眾等，　　其數有五千，
　^lb不自見其過，　　於戒有缺漏，
　護惜其瑕疵。　　^lb是小智已出，
　眾中之糟糠，　　佛威德故去，
　^lb斯人尠福德，　　不堪受是法。
　此眾無枝葉，　　^lb唯有諸真實。
　舍利弗善聽！　　諸佛所得法，
　^pb72無量方便力，　　而為眾生說。
　眾生心所念，　　^lb種種所行道，
　若干諸欲性，　　先世善惡業。
　^lb佛悉知是已，　　以諸緣譬喻、
　言辭方便力，　　^lb令一切歡喜。
　或說修多羅、　　伽陀及本事、
　^lb本生未曾有，　　亦說於因緣、
　譬喻并祇夜、　　^lb優波提舍經。
　鈍根樂小法，　　貪著於生死，
　^pb73於諸無量佛，　　不行深妙道，
　眾苦所惱亂，　　^lb為是說涅槃。
　我設是方便，　　令得入佛慧，
　^lb未曾說汝等，　　當得成佛道。
　所以未曾說，　　^lb說時未至故，
　今正是其時，　　決定說大乘。
　^lb我此九部法，　　隨順眾生說，
　入大乘為本，　　^lb以故說是經。
　有佛子心淨，　　柔軟亦利根，
　^pb74無量諸佛所，　　而行深妙道。
　為此諸佛子，　　^lb說是大乘經，
　我記如是人，　　來世成佛道，
　^lb以深心念佛，　　修持淨戒故。
　此等聞得佛，　　^lb大喜充遍身，
　佛知彼心行，　　故為說大乘。
　^lb聲聞若菩薩，　　聞我所說法，
　乃至於一偈，　　^lb皆成佛無疑。
　十方佛土中，　　唯有一乘法，
　^pb75無二亦無三。　　除佛方便說。
　但以假名字，　　^lb引導於眾生，
　說佛智慧故，　　諸佛出於世。
　^lb唯此一事實，　　餘二則非真，
　終不以小乘，　　^lb濟度於眾生。
　佛自住大乘，　　如其所得法，
　^lb定慧力莊嚴，　　以此度眾生。
　自證無上道，　　^lb大乘平等法，
　若以小乘化，　　乃至於一人，
　^pb76我則墮慳貪，　　此事為不可。
　若人信歸佛，　　^lb如來不欺誑，
　亦無貪嫉意，　　斷諸法中惡。
　^lb故佛於十方，　　而獨無所畏。
　我以相嚴身，　　^lb光明照世間，
　無量眾所尊，　　為說實相印。
　^lb舍利弗當知，　　我本立誓願，
　欲令一切眾，　　^lb如我等無異。
　如我昔所願，　　今者已滿足，
　^pb77化一切眾生，　　皆令入佛道。
　若我遇眾生，　　^lb盡教以佛道，
　無智者錯亂，　　迷惑不受教。
　^lb我知此眾生，　　未曾修善本，
　堅著於五欲，　　^lb癡愛故生惱。
　以諸欲因緣，　　墜墮三惡道，
　^lb輪迴六趣中，　　備受諸苦毒，
　受胎之微形，　　^lb世世常增長。
　薄德少福人，　　眾苦所逼迫，
　^pb78入邪見稠林，　　若有若無等。
　依止此諸見，　　^lb具足六十二，
　深著虛妄法，　　堅受不可捨，
　^lb我慢自矜高，　　諂曲心不實，
　於千萬億劫，　　^lb不聞佛名字，
　亦不聞正法，　　如是人難度。
　^lb是故舍利弗！　　我為設方便，
　說諸盡苦道，　　^lb示之以涅槃。
　我雖說涅槃，　　是亦非真滅，
　^pb79諸法從本來，　　常自寂滅相。
　佛子行道已，　　^lb來世得作佛，
　我有方便力，　　開示三乘法。
　^lb一切諸世尊，　　皆說一乘道，
　今此諸大眾，　　^lb皆應除疑惑，
　諸佛語無異，　　唯一無二乘。
　^lb過去無數劫，　　無量滅度佛，
　百千萬億種，　　^lb其數不可量。
　如是諸世尊，　　種種緣譬喻，
　^pb80無數方便力，　　演說諸法相。
　是諸世尊等，　　^lb皆說一乘法，
　化無量眾生，　　令入於佛道。
　^lb又諸大聖主，　　知一切世間，
　天人群生類，　　^lb深心之所欲，
　更以異方便，　　助顯第一義。
　^lb若有眾生類，　　值諸過去佛，
　若聞法布施，　　^lb或持戒忍辱、
　精進禪智等，　　種種修福慧。
　^pb81如是諸人等，　　皆已成佛道。
　諸佛滅度已，　　^lb若人善軟心，
　如是諸眾生，　　皆已成佛道。
　^lb諸佛滅度已，　　供養舍利者，
　起萬億種塔，　　^lb金銀及玻璃、
　硨磲與碼碯、　　玫瑰瑠璃珠，
　^lb清淨廣嚴飾，　　莊校於諸塔。
　或有起石廟，　　^lb栴檀及沈水，
　木櫁并餘材，　　塼瓦泥土等。
　^pb82若於曠野中，　　積土成佛廟，
　乃至童子戲，　　^lb聚沙為佛塔，
　如是諸人等，　　皆已成佛道。
　^lb若人為佛故，　　建立諸形像，
　刻雕成眾相，　　^lb皆已成佛道。
　或以七寶成，　　鍮石赤白銅、
　^lb白鑞及鉛錫，　　鐵木及與泥，
　或以膠漆布，　　^lb嚴飾作佛像，
　如是諸人等，　　皆已成佛道。
　^pb83彩畫作佛像，　　百福莊嚴相，
　自作若使人，　　^lb皆已成佛道。
　乃至童子戲，　　若草木及筆，
　^lb或以指爪甲，　　而畫作佛像，
　如是諸人等，　　^lb漸漸積功德，
　具足大悲心，　　皆已成佛道。
　^lb但化諸菩薩，　　度脫無量眾。
　若人於塔廟、　　^lb寶像及畫像，
　以華香幡蓋，　　敬心而供養。
　^pb84若使人作樂，　　擊鼓吹角貝，
　簫笛琴箜篌、　　^lb琵琶鐃銅鈸，
　如是眾妙音，　　盡持以供養。
　^lb或以歡喜心，　　歌唄頌佛德，
　乃至一小音，　　^lb皆已成佛道。
　若人散亂心，　　乃至以一華，
　^lb供養於畫像，　　漸見無數佛。
　或有人禮拜，　　^lb或復但合掌，
　乃至舉一手，　　或復小低頭，
　^pb85以此供養像，　　漸見無量佛。
　自成無上道，　　^lb廣度無數眾，
　入無餘涅槃，　　如薪盡火滅。
　^lb若人散亂心，　　入於塔廟中，
　一稱南無佛，　　^lb皆已成佛道。
　於諸過去佛，　　在世或滅度，
　^lb若有聞是法，　　皆已成佛道。
　未來諸世尊，　　^lb其數無有量，
　是諸如來等，　　亦方便說法。
　^pb86一切諸如來，　　以無量方便，
　度脫諸眾生，　　^lb入佛無漏智，
　若有聞法者，　　無一不成佛。
　^lb諸佛本誓願，　　我所行佛道，
　普欲令眾生，　　^lb亦同得此道。
　未來世諸佛，　　雖說百千億，
　^lb無數諸法門，　　其實為一乘。
　諸佛兩足尊，　　^lb知法常無性，
　佛種從緣起，　　是故說一乘。
　^pb87是法住法位，　　世間相常住，
　於道場知已，　　^lb導師方便說。
　天人所供養，　　現在十方佛，
　^lb其數如恒沙，　　出現於世間，
　安隱眾生故，　　^lb亦說如是法。
　知第一寂滅，　　以方便力故，
　^lb雖示種種道，　　其實為佛乘。
　知眾生諸行，　　^lb深心之所念，
　過去所習業，　　欲性精進力，
　^pb88及諸根利鈍，　　以種種因緣、
　譬喻亦言辭，　　^lb隨應方便說。
　今我亦如是，　　安隱眾生故，
　^lb以種種法門，　　宣示於佛道。
　我以智慧力，　　^lb知眾生性欲，
　方便說諸法，　　皆令得歡喜。
　^lb舍利弗當知！　　我以佛眼觀，
　見六道眾生，　　^lb貧窮無福慧，
　入生死嶮道，　　相續苦不斷，
　^pb89深著於五欲，　　如犛牛愛尾，
　以貪愛自蔽，　　^lb盲瞑無所見。
　不求大勢佛，　　及與斷苦法，
　^lb深入諸邪見，　　以苦欲捨苦，
　為是眾生故，　　^lb而起大悲心。
　我始坐道場，　　觀樹亦經行，
　^lb於三七日中，　　思惟如是事，
　我所得智慧，　　^lb微妙最第一。
　眾生諸根鈍，　　著樂癡所盲，
　^pb90如斯之等類，　　云何而可度？
　爾時諸梵王，　　^lb及諸天帝釋、
　護世四天王，　　及大自在天，
　^lb并餘諸天眾，　　眷屬百千萬，`)