jsonp(43,{"name":"dc","start":112714},`　此經第一。　　^lb若有能持，　　則持佛身。
　諸善男子！　　於我滅後，　　^lb誰能受持、
　讀誦此經，　　今於佛前、　　自說誓言。
　^pb87此經難持，　　若暫持者，　　我則歡喜，
　諸佛亦然。　　^lb如是之人，　　諸佛所歎。
　是則勇猛，　　是則精進，　　^lb是名持戒，
　行頭陀者，　　則為疾得，　　無上佛道。
　^lb能於來世，　　讀持此經，　　是真佛子，
　住淳善地。　　^lb佛滅度後，　　能解其義，
　是諸天人，　　世間之眼。　　^lb於恐畏世，
　能須臾說，　　一切天人，　　皆應供養。』」◎
^pb88^ck12〔提婆達多品第十二〕
^lb^cb#34b24爾時佛告諸菩薩及天人四眾：「吾於過去無^lb量劫中，求法華經，無有懈惓。
於多劫中常作^lb國王，發願求於無上菩提，心不退轉。
為欲滿^lb足六波羅蜜，勤行布施，心無悋惜，象、馬、七珍、^lb國、城、妻、子，奴婢、僕從，頭、目、髓、腦，身、肉、手、足，不^pb89惜軀命。
時世人民壽命無量，為於法故，捐捨^lb國位，委政太子，擊鼓宣令四方求法：『誰能為^lb我說大乘者，吾當終身供給走使。』時有仙人^lb來白王言：『我有大乘，名妙法華經。若不違我，^lb當為宣說。』王聞仙言，歡喜踊躍，即隨仙人，供^lb給所須——採菓、汲水、拾薪、設食，乃至以身而為^pb90床座——身心無惓，于時奉事。
經於千歲，為於法^lb故，精勤給侍，令無所乏。」
^cb#34c08爾時世尊欲重宣此^lb義，而說偈言：
^lb^gatha「我念過去劫，　　為求大法故，
　雖作世國王，　　^lb不貪五欲樂。
　搥鍾告四方，　　誰有大法者，
　^lb若為我解說，　　身當為奴僕。
　時有阿私仙，　　^pb91來白於大王：
『我有微妙法，　　世間所希有。
　^lb若能修行者，　　吾當為汝說。』
　時王聞仙言，　　^lb心生大喜悅，
　即便隨仙人，　　供給於所須，
　^lb採薪及菓蓏，　　隨時恭敬與，
　情存妙法故，　　^lb身心無懈惓。
　普為諸眾生，　　勤求於大法，
　^lb亦不為己身，　　及以五欲樂。
　故為大國王，　　^pb92勤求獲此法，
　遂致得成佛，　　今故為汝說。」
^lb^cb#34c25佛告諸比丘：「爾時王者，則我身是；時仙人者，^lb今提婆達多是。
由提婆達多善知識故，令我^lb具足六波羅蜜，慈悲喜捨，三十二相，八十種^lb好，紫磨金色，十力、四無所畏、四攝法、十八不^lb共神通道力，成等正覺，廣度眾生，皆因提婆^pb93達多善知識故。」
^cb#35a01告諸四眾：「提婆達多却後過^lb無量劫，當得成佛，號曰天王如來、應供、正遍^lb知、明行足、善逝、世間解、無上士、調御丈夫、天^lb人師、佛、世尊。世界名天道。時天王佛住世二^lb十中劫，廣為眾生說於妙法，恒河沙眾生得^lb阿羅漢果，無量眾生發緣覺心，恒河沙眾生^pb94發無上道心，得無生忍，至不退轉。
時天王佛^lb般涅槃後，正法住世二十中劫。全身舍利起^lb七寶塔，高六十由旬，縱廣四十由旬，諸天人^lb民，悉以雜華、末香、燒香、塗香，衣服、瓔珞、幢幡、^lb寶蓋，伎樂、歌頌，禮拜供養七寶妙塔。
無量眾^lb生得阿羅漢果，無量眾生悟辟支佛，不可思^pb95議眾生發菩提心，至不退轉。」
^cb#35a14佛告諸比丘：「未^lb來世中，若有善男子、善女人，聞妙法華經提^lb婆達多品，淨心信敬不生疑惑者，不墮地獄、^lb餓鬼、畜生，生十方佛前，所生之處，常聞此經。
^lb若生人天中，受勝妙樂，若在佛前，蓮華化生。」
^lb^cb#35a18於時下方多寶世尊所從菩薩，名曰智積，白^pb96多寶佛：「當還本土。」釋迦牟尼佛告智積曰：「善^lb男子！且待須臾。
此有菩薩，名文殊師利，可與^lb相見，論說妙法，可還本土。」
^cb#35a22爾時文殊師利，坐^lb千葉蓮華，大如車輪——俱來菩薩亦坐寶蓮華——^lb從於大海娑竭羅龍宮自然踊出，住虛空中，^lb詣靈鷲山，從蓮華下，至於佛所，頭面敬禮二^pb97世尊足。
修敬已畢，往智積所，共相慰問，却坐^lb一面。
^cb#35a27智積菩薩問文殊師利：「仁往龍宮，所化^lb眾生，其數幾何？」
^cb#35a28文殊師利言：「其數無量，不可^lb稱計，非口所宣，非心所測，且待須臾，自當證^lb知。」所言未竟，無數菩薩坐寶蓮華，從海踊出，^lb詣靈鷲山，住在虛空。
此諸菩薩，皆是文殊師^pb98利之所化度，具菩薩行，皆共論說六波羅蜜。
^lb本聲聞人，在虛空中說聲聞行，今皆修行大^lb乘空義。
文殊師利謂智積曰：「於海教化，其事^lb如是。」
^cb#35b06爾時智積菩薩，以偈讚曰：
^lb^gatha「大智德勇健，　　化度無量眾，
　今此諸大會，　　^lb及我皆已見。
　演暢實相義，　　開闡一乘法，
　^pb99廣導諸眾生，　　令速成菩提。」
^lb^cb#35b12文殊師利言：「我於海中，唯常宣說妙法華經。」
^lb^cb#35b13智積問文殊師利言：「此經甚深微妙，諸經中^lb寶，世所希有。
頗有眾生，勤加精進，修行此經，^lb速得佛不？」
^cb#35b15文殊師利言：「有娑竭羅龍王女，年^lb始八歲，智慧利根，善知眾生諸根行業，得陀^pb100羅尼，諸佛所說甚深祕藏，悉能受持。
深入禪^lb定，了達諸法，於剎那頃發菩提心，得不退轉，^lb辯才無礙。
慈念眾生、猶如赤子，功德具足，心^lb念口演，微妙廣大，慈悲仁讓，志意和雅，能至^lb菩提。」
^cb#35b21智積菩薩言：「我見釋迦如來，於無量劫^lb難行苦行，積功累德，求菩提道，未曾止息。
觀^pb101三千大千世界，乃至無有如芥子許非是菩^lb薩捨身命處，為眾生故，然後乃得成菩提道。^lb不信此女於須臾頃、便成正覺。」
^cb#35b26言論未訖，時^lb龍王女忽現於前，頭面禮敬，却住一面，以偈^lb讚曰：
^lb^gatha「深達罪福相，　　遍照於十方，
　微妙淨法身，　　^pb102具相三十二，
　以八十種好，　　用莊嚴法身。
　^lb天人所戴仰，　　龍神咸恭敬，
　一切眾生類，　　^lb無不宗奉者。
　又聞成菩提，　　唯佛當證知，
　^lb我闡大乘教，　　度脫苦眾生。」
^lb^cb#35c06時舍利弗語龍女言：「汝謂不久得無上道，是^lb事難信。
所以者何？女身垢穢，非是法器，云何^pb103能得無上菩提。
佛道懸曠，經無量劫勤苦積^lb行，具修諸度，然後乃成。
又女人身猶有五障：^lb一者、不得作梵天王，二者、帝釋，三者、魔王，四^lb者、轉輪聖王，五者、佛身。云何女身速得成佛？」
^lb^cb#35c12爾時龍女有一寶珠，價直三千大千世界，持^lb以上佛。佛即受之。龍女謂智積菩薩、尊者舍^pb104利弗言：「我獻寶珠，世尊納受，是事疾不？」
^cb#35c15答言：^lb「甚疾。」
女言：「以汝神力，觀我成佛，復速於此。」
^cb#35c16當^lb時眾會，皆見龍女忽然之間變成男子，具菩^lb薩行，即往南方無垢世界，坐寶蓮華，成等正^lb覺，三十二相、八十種好，普為十方一切眾生^lb演說妙法。
^cb#35c19爾時娑婆世界，菩薩、聲聞、天龍八^pb105部、人與非人，皆遙見彼龍女成佛，普為時會^lb人天說法，心大歡喜，悉遙敬禮。
無量眾生，聞^lb法解悟，得不退轉；無量眾生，得受道記。
無垢^lb世界，六反震動；娑婆世界，三千眾生住不退^lb地，三千眾生發菩提心而得受記。
智積菩薩^lb及舍利弗，一切眾會，默然信受。
^pb106^ck13〔勸持品第十三〕
^lb^cb#35c28爾時藥王菩薩摩訶薩及大樂說菩薩摩訶^lb薩，與二萬菩薩眷屬俱，皆於佛前作是誓言：^lb「唯願世尊不以為慮。
我等於佛滅後，當奉持、^lb讀誦、說此經典。後惡世眾生，善根轉少，多增^lb上慢，貪利供養，增不善根，遠離解脫。
雖難可^pb107教化，我等當起大忍力，讀誦此經，持說、書寫、^lb種種供養，不惜身命。」
^cb#36a05爾時眾中五百阿羅漢^lb得受記者、白佛言：「世尊！我等亦自誓願，於異^lb國土、廣說此經。」
^cb#36a07復有學、無學八千人、得受記^lb者，從座而起，合掌向佛作是誓言：「世尊！我等^lb亦當於他國土廣說此經。
所以者何？是娑婆^pb108國中，人多弊惡，懷增上慢，功德淺薄、瞋濁諂^lb曲，心不實故。」
^cb#36a12爾時佛姨母摩訶波闍波提比^lb丘尼，與學、無學比丘尼六千人俱，從座而起，^lb一心合掌，瞻仰尊顏，目不暫捨。
於時世尊告^lb憍曇彌：「何故憂色而視如來，汝心將無謂我^lb不說汝名，授阿耨多羅三藐三菩提記耶？憍^pb109曇彌！我先總說一切聲聞皆已授記，今汝欲^lb知記者，將來之世，當於六萬八千億諸佛法^lb中為大法師，及六千學、無學比丘尼俱為法^lb師。
汝如是漸漸具菩薩道，當得作佛，號一切^lb眾生喜見如來、應供、正遍知、明行足、善逝、世^lb間解、無上士、調御丈夫、天人師、佛、世尊。
憍曇^pb110彌！是一切眾生喜見佛及六千菩薩，轉次授^lb記得阿耨多羅三藐三菩提。」
^cb#36a24爾時羅睺羅母^lb耶輸陀羅比丘尼作是念：「世尊於授記中，獨^lb不說我名。」
^cb#36a26佛告耶輸陀羅：「汝於來世百千萬^lb億諸佛法中修菩薩行，為大法師，漸具佛道。
^lb於善國中當得作佛，號具足千萬光相如來、^pb111應供、正遍知、明行足、善逝、世間解、無上士、調^lb御丈夫、天人師、佛、世尊。佛壽無量阿僧祇劫。」
^lb^cb#36b02爾時摩訶波闍波提比丘尼及耶輸陀羅比^lb丘尼，并其眷屬，皆大歡喜，得未曾有，即於佛^lb前而說偈言：
^lb^gatha「世尊導師，　　安隱天人，　　我等聞記，
　心安具足。」
^pb112^cb#36b07諸比丘尼說是偈已，白佛言：「世尊！我等亦能^lb於他方國土廣宣此經。」
^cb#36b08爾時世尊視八十萬億^lb那由他諸菩薩摩訶薩。
是諸菩薩——皆是阿惟^lb越致，轉不退法輪，得諸陀羅尼——即從座起，至^lb於佛前，一心合掌，而作是念：「若世尊告勅我^lb等持說此經者，當如佛教，廣宣斯法。」復作是^pb113念：「佛今默然，不見告勅，我當云何？」
時諸菩薩^lb敬順佛意，并欲自滿本願，便於佛前，作師子^lb吼而發誓言：「世尊！我等於如來滅後，周旋往^lb返十方世界，能令眾生書寫此經，受持、讀誦，^lb解說其義，如法修行，正憶念，皆是佛之威力。^lb唯願世尊，在於他方遙見守護。」
^cb#36b19即時諸菩薩^pb114俱同發聲、而說偈言：
^lb^gatha「唯願不為慮，　　於佛滅度後，
　恐怖惡世中，　　^lb我等當廣說。
　有諸無智人，　　惡口罵詈等，
　^lb及加刀杖者，　　我等皆當忍。
　惡世中比丘，　　^lb邪智心諂曲，
　未得謂為得，　　我慢心充滿。
　^lb或有阿練若，　　納衣在空閑，
　自謂行真道，　　^pb115輕賤人間者。
　貪著利養故，　　與白衣說法，
　^lb為世所恭敬，　　如六通羅漢。
　是人懷惡心，　　^lb常念世俗事，
　假名阿練若，　　好出我等過，
　^lb而作如是言：　　『此諸比丘等，
　為貪利養故，　　^lb說外道論議；
　自作此經典，　　誑惑世間人，
　^lb為求名聞故，　　分別於是經。』
　常在大眾中，　　^pb116欲毀我等故，
　向國王大臣，　　婆羅門居士，
　^lb及餘比丘眾，　　誹謗說我惡，
　謂是邪見人，　　^lb說外道論議。
　我等敬佛故，　　悉忍是諸惡。
　^lb為斯所輕言，　　汝等皆是佛，
　如此輕慢言，　　^lb皆當忍受之。
　濁劫惡世中，　　多有諸恐怖，
　^lb惡鬼入其身，　　罵詈毀辱我。
　我等敬信佛，　　^pb117當著忍辱鎧，
　為說是經故，　　忍此諸難事。
　^lb我不愛身命，　　但惜無上道，
　我等於來世，　　^lb護持佛所囑，
　世尊自當知。　　濁世惡比丘，
　^lb不知佛方便，　　隨宜所說法，
　惡口而顰蹙，　　^lb數數見擯出，
　遠離於塔寺。　　如是等眾惡，
　^lb念佛告勅故，　　皆當忍是事。
　諸聚落城邑，　　^pb118其有求法者，
　我皆到其所，　　說佛所囑法。
　^lb我是世尊使，　　處眾無所畏，
　我當善說法，　　^lb願佛安隱住。
　我於世尊前，　　諸來十方佛，
　^lb發如是誓言，　　佛自知我心。」
^lb妙法蓮華經卷第四^pb119
^pb1^folio#sdpdrk5<lines=6>妙法蓮華經卷第五^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck14〔安樂行品第十四〕
^lb^cb#37a10爾時文殊師利法王子菩薩摩訶薩白佛言：^lb「世尊！是諸菩薩，甚為難有，敬順佛故，發大誓^lb願，於後惡世，護持讀說是法華經。
世尊！菩薩^pb2摩訶薩於後惡世，云何能說是經？」
^cb#37a14佛告文殊^lb師利：「若菩薩摩訶薩，於後惡世欲說是經，當^lb安住四法。
一者、安住菩薩行處及親近處，能為^lb眾生演說是經。
^cb#37a16「文殊師利！云何名菩薩摩訶^lb薩行處？若菩薩摩訶薩住忍辱地，柔和善順^lb而不卒暴，心亦不驚；又復於法無所行，而觀^pb3諸法如實相，亦不行不分別，是名菩薩摩訶^lb薩行處。
云何名菩薩摩訶薩親近處？菩薩摩^lb訶薩不親近國王、王子、大臣、官長，不親近諸^lb外道梵志、尼揵子等，及造世俗文筆、讚詠外^lb書，及路伽耶陀、逆路伽耶陀者；亦不親近諸^lb有兇戲、相扠相撲，及那羅等種種變現之戲；
^pb4又不親近旃陀羅，及畜猪羊鷄狗，畋獵漁捕^lb諸惡律儀。
如是人等，或時來者，則為說法，無^lb所希望。又不親近求聲聞比丘、比丘尼、優婆^lb塞、優婆夷，亦不問訊。
若於房中，若經行處，若^lb在講堂中，不共住止。或時來者，隨宜說法，^lb無所希求。
^cb#37b02「文殊師利！又菩薩摩訶薩不應於女^pb5人身，取能生欲想相而為說法，亦不樂見。
若^lb入他家，不與小女、處女、寡女等共語。亦復不^lb近五種不男之人以為親厚，不獨入他家，若^lb有因緣須獨入時，但一心念佛。
若為女人說^lb法，不露齒笑，不現胸臆，乃至為法猶不親厚，^lb況復餘事。
不樂畜年少弟子、沙彌、小兒，亦不^pb6樂與同師。常好坐禪，在於閑處，修攝其心。文^lb殊師利！是名初親近處。」
^cb#37b12「復次，菩薩摩訶薩觀^lb一切法空，如實相，不顛倒、不動、不退、不轉，如^lb虛空，無所有性。
一切語言道斷，不生、不出、不^lb起，無名、無相，實無所有，無量、無邊，無礙、無障，^lb但以因緣有，從顛倒生故說。
常樂觀如是法^pb7相，是名菩薩摩訶薩第二親近處。」
^cb#37b17爾時世尊^lb欲重宣此義，而說偈言：
^lb^gatha「若有菩薩，　　於後惡世，　　無怖畏心，
　欲說是經，　　^lb應入行處，　　及親近處。
　常離國王，　　及國王子、　　^lb大臣官長，
　兇險戲者，　　及旃陀羅、　　外道梵志。
　^lb亦不親近，　　增上慢人，　　貪著小乘、
　三藏學者，　　^pb8破戒比丘，　　名字羅漢，
　及比丘尼，　　好戲笑者，　　^lb深著五欲，
　求現滅度，　　諸優婆夷，　　皆勿親近。
　^lb若是人等，　　以好心來，　　到菩薩所，
　為聞佛道。　　^lb菩薩則以，　　無所畏心，
　不懷悕望，　　而為說法。　　^lb寡女處女，
　及諸不男，　　皆勿親近，　　以為親厚。
　^lb亦莫親近，　　屠兒魁膾，　　畋獵漁捕，
　為利殺害，　　^pb9販肉自活，　　衒賣女色，
　如是之人，　　皆勿親近。　　^lb兇險相撲，
　種種嬉戲，　　諸婬女等，　　盡勿親近。
　^lb莫獨屏處，　　為女說法，　　若說法時，
　無得戲笑。　　^lb入里乞食，　　將一比丘，
　若無比丘，　　一心念佛。　　^lb是則名為，
　行處近處，　　以此二處，　　能安樂說。
　^lb又復不行，　　上中下法，　　有為無為，
　實不實法，　　^pb10亦不分別，　　是男是女。
　不得諸法，　　不知不見，　　^lb是則名為，
　菩薩行處。　　一切諸法，　　空無所有，
　^lb無有常住，　　亦無起滅，　　是名智者，
　所親近處。　　^lb顛倒分別，　　諸法有無，
　是實非實，　　是生非生。　　^lb在於閑處，
　修攝其心，　　安住不動，　　如須彌山。
　^lb觀一切法，　　皆無所有，　　猶如虛空，
　無有堅固。　　^pb11不生不出，　　不動不退，
　常住一相，　　是名近處。　　^lb若有比丘，
　於我滅後，　　入是行處、　　及親近處，
　^lb說斯經時，　　無有怯弱。　　菩薩有時，
　入於靜室，　　^lb以正憶念，　　隨義觀法。
　從禪定起，　　為諸國王、　　^lb王子臣民、
　婆羅門等，　　開化演暢，　　說斯經典，
　^lb其心安隱，　　無有怯弱。　　文殊師利！
　是名菩薩，　　^pb12安住初法，　　能於後世，
　說法華經。
^lb^cb#37c29「又，文殊師利！如來滅後，於末法中欲說是經，^lb應住安樂行。
若口宣說、若讀經時，不樂說人^lb及經典過。亦不輕慢諸餘法師，不說他人好^lb惡、長短。於聲聞人，亦不稱名說其過惡，亦不^lb稱名讚歎其美，又亦不生怨嫌之心。
善修如^pb13是安樂心故，諸有聽者不逆其意，有所難問，^lb不以小乘法答，但以大乘而為解說，令得一^lb切種智。」
^cb#38a07爾時世尊欲重宣此義，而說偈言：
^lb^gatha「菩薩常樂，　　安隱說法，　　於清淨地，
　而施床座。　　^lb以油塗身，　　澡浴塵穢，
　著新淨衣，　　內外俱淨，　　^lb安處法座，
　隨問為說。　　若有比丘，　　及比丘尼，
　^pb14諸優婆塞，　　及優婆夷，　　國王王子、
　群臣士民，　　^lb以微妙義，　　和顏為說。
　若有難問，　　隨義而答，　　^lb因緣譬喻，
　敷演分別。　　以是方便，　　皆使發心，
　^lb漸漸增益，　　入於佛道。　　除嬾惰意，
　及懈怠想，　　^lb離諸憂惱，　　慈心說法。
　晝夜常說，　　無上道教，　　^lb以諸因緣、
　無量譬喻，　　開示眾生，　　咸令歡喜。
　^pb15衣服臥具，　　飲食醫藥，　　而於其中，
　無所悕望。　　^lb但一心念，　　說法因緣，
　願成佛道，　　令眾亦爾。　　^lb是則大利，
　安樂供養。　　我滅度後，　　若有比丘，
　^lb能演說斯，　　妙法華經。　　心無嫉恚，
　諸惱障礙，　　^lb亦無憂愁，　　及罵詈者，
　又無怖畏　　加刀杖等，　　^lb亦無擯出，
　安住忍故。　　智者如是，　　善修其心，
　^pb16能住安樂，　　如我上說。　　其人功德，
　千萬億劫，　　^lb算數譬喻，　　說不能盡。
^lb^cb#38b02「又，文殊師利！菩薩摩訶薩，於後末世法欲滅^lb時，受持、讀誦斯經典者，無懷嫉妬謟誑之心，^lb亦勿輕罵學佛道者，求其長短。
若比丘、比丘^lb尼、優婆塞、優婆夷，求聲聞者、求辟支佛者、求^pb17菩薩道者，無得惱之，令其疑悔，語其人言：『汝^lb等去道甚遠，終不能得一切種智。
所以者何？^lb汝是放逸之人，於道懈怠故。』又亦不應戲論^lb諸法，有所諍競。當於一切眾生起大悲想，於^lb諸如來起慈父想，於諸菩薩起大師想，於十^lb方諸大菩薩，常應深心恭敬禮拜。
於一切眾^pb18生，平等說法，以順法故，不多不少，乃至深愛^lb法者，亦不為多說。」
^cb#38b15「文殊師利！是菩薩摩訶薩，^lb於後末世法欲滅時，有成就是第三安樂行^lb者，說是法時，無能惱亂，得好同學共讀誦是^lb經，亦得大眾而來聽受，聽已能持，持已能誦，^lb誦已能說，說已能書、若使人書，供養經卷，恭^pb19敬、尊重、讚歎。」
^cb#38b20爾時世尊欲重宣此義，而說偈^lb言：
^lb^gatha「若欲說是經，　　當捨嫉恚慢、
　謟誑邪偽心，　　^lb常修質直行。
　不輕蔑於人，　　亦不戲論法，
　^lb不令他疑悔，　　云汝不得佛。
　是佛子說法，　　^lb常柔和能忍，
　慈悲於一切，　　不生懈怠心。
　^pb20十方大菩薩，　　愍眾故行道，
　應生恭敬心，　　^lb是則我大師。
　於諸佛世尊，　　生無上父想，
　^lb破於憍慢心，　　說法無障礙。
　第三法如是，　　^lb智者應守護，
　一心安樂行，　　無量眾所敬。
^lb^cb#38c04「又，文殊師利！菩薩摩訶薩，於後末世法欲滅^lb時，有持是法華經者，於在家、出家人中生大^pb21慈心，於非菩薩人中生大悲心，應作是念：『如^lb是之人，則為大失。
如來方便隨宜說法，不聞^lb不知不覺、不問不信不解，其人雖不問不信^lb不解是經，我得阿耨多羅三藐三菩提時，隨^lb在何地，以神通力、智慧力引之，令得住是法^lb中。』
文殊師利！是菩薩摩訶薩，於如來滅後、有^pb22成就此第四法者，說是法時，無有過失，常為比丘、^lb比丘尼、優婆塞、優婆夷、國王、王子、大臣、^lb人民、婆羅門、居士等，供養恭敬、尊重讚歎。虛^lb空諸天，為聽法故亦常隨侍。若在聚落、城邑、^lb空閑林中，有人來欲難問者，諸天晝夜常為^lb法故而衛護之，能令聽者皆得歡喜。
所以者^pb23何？此經是一切過去、未來、現在諸佛神力所^lb護故。
文殊師利！是法華經，於無量國中，乃至^lb名字不可得聞，何況得見受持讀誦？」
^cb#38c22「文殊師^lb利！譬如強力轉輪聖王，欲以威勢降伏諸國，^lb而諸小王不順其命，時轉輪王起種種兵而^lb往討罰。
王見兵眾戰有功者，即大歡喜，隨功^pb24賞賜，或與田宅、聚落、城邑；或與衣服、嚴身之^lb具；或與種種珍寶：金、銀、琉璃、車璩、馬腦、珊瑚、^lb琥珀，象馬車乘，奴婢人民。唯髻中明珠，不以^lb與之。
所以者何？獨王頂上有此一珠，若以與^lb之，王諸眷屬必大驚怪。
^cb#39a01「文殊師利！如來亦復^lb如是，以禪定智慧力得法國土，王於三界，而^pb25諸魔王不肯順伏。
如來賢聖諸將與之共戰，^lb其有功者，心亦歡喜，於四眾中為說諸經，令^lb其心悅，賜以禪定、解脫、無漏根力、諸法之財，^lb又復賜與涅槃之城，言得滅度，引導其心，令^lb皆歡喜，而不為說是法華經。
^cb#39a07「文殊師利！如轉^lb輪王，見諸兵眾有大功者，心甚歡喜，以此難^pb26信之珠，久在髻中不妄與人，而今與之。
如來^lb亦復如是，於三界中為大法王，以法教化一^lb切眾生。
見賢聖軍，與五陰魔、煩惱魔、死魔共^lb戰，有大功勳，滅三毒，出三界，破魔網，爾時如^lb來亦大歡喜。
此法華經，能令眾生至一切智，^lb一切世間多怨難信，先所未說而今說之。
文^pb27殊師利！此法華經，是諸如來第一之說，於諸^lb說中最為甚深，末後賜與，如彼強力之王久^lb護明珠，今乃與之。
文殊師利！此法華經，諸佛^lb如來祕密之藏，於諸經中最在其上，長夜守^lb護不妄宣說，始於今日乃與汝等而敷演之。」
^lb^cb#39a20爾時世尊欲重宣此義，而說偈言：
^pb28^gatha「常行忍辱，　　哀愍一切，　　乃能演說，
　佛所讚經。　　^lb後末世時，　　持此經者，
　於家出家，　　及非菩薩，　　^lb應生慈悲，
　斯等不聞，　　不信是經，　　則為大失。
　^lb我得佛道，　　以諸方便，　　為說此法，
　令住其中。　　^lb譬如強力，　　轉輪之王，
　兵戰有功，　　賞賜諸物，　　^lb象馬車乘，
　嚴身之具，　　及諸田宅，　　聚落城邑，
　^pb29或與衣服，　　種種珍寶，　　奴婢財物，
　歡喜賜與。　　^lb如有勇健，　　能為難事，
　王解髻中，　　明珠賜之。　　^lb如來亦爾，
　為諸法王，　　忍辱大力，　　智慧寶藏，
　^lb以大慈悲，　　如法化世。　　見一切人、
　受諸苦惱，　　^lb欲求解脫，　　與諸魔戰。
　為是眾生，　　說種種法，　　^lb以大方便，
　說此諸經。　　既知眾生，　　得其力已，
　^pb30末後乃為，　　說是法華。　　如王解髻，
　明珠與之。　　^lb此經為尊，　　眾經中上，
　我常守護，　　不妄開示，　　^lb今正是時，
　為汝等說。　　我滅度後，　　求佛道者，
　^lb欲得安隱，　　演說斯經，　　應當親近，
　如是四法。　　^lb讀是經者，　　常無憂惱，
　又無病痛，　　顏色鮮白，　　^lb不生貧窮、
　卑賤醜陋。　　眾生樂見，　　如慕賢聖，
　^pb31天諸童子，　　以為給使。　　刀杖不加，
　毒不能害，　　^lb若人惡罵，　　口則閉塞。
　遊行無畏，　　如師子王，　　^lb智慧光明，
　如日之照。　　若於夢中，　　但見妙事。
　^lb見諸如來，　　坐師子座，　　諸比丘眾、
　圍繞說法。　　^lb又見龍神、　　阿修羅等，
　數如恒沙，　　恭敬合掌，　　^lb自見其身，
　而為說法。　　又見諸佛，　　身相金色，
　^pb32放無量光，　　照於一切，　　以梵音聲，
　演說諸法。　　^lb佛為四眾，　　說無上法，
　見身處中，　　合掌讚佛，　　^lb聞法歡喜，
　而為供養，　　得陀羅尼，　　證不退智。
　^lb佛知其心，　　深入佛道，　　即為授記，
　成最正覺：　　^lb『汝善男子！　　當於來世，
　得無量智，　　佛之大道。　　^lb國土嚴淨，
　廣大無比。』　　亦有四眾，　　合掌聽法。
　^pb33又見自身，　　在山林中，　　修習善法，
　證諸實相，　　^lb深入禪定，　　見十方佛。
　^lb^gatha諸佛身金色，　　百福相莊嚴，
　聞法為人說，　　^lb常有是好夢。
　又夢作國王，　　捨宮殿眷屬，
　^lb及上妙五欲，　　行詣於道場。
　在菩提樹下，　　^lb而處師子座，
　求道過七日，　　得諸佛之智。
　^pb34成無上道已，　　起而轉法輪，
　為四眾說法，　　^lb經千萬億劫，
　說無漏妙法，　　度無量眾生。
　^lb後當入涅槃，　　如烟盡燈滅。
　若後惡世中，　　^lb說是第一法，
　是人得大利，　　如上諸功德。」
^lb^ck15〔從地踊出品第十五〕
^lb^cb#39c19爾時他方國土諸來菩薩摩訶薩，過八恒河^pb35沙數，於大眾中起立，合掌作禮而白佛言：「世尊！^lb若聽我等，於佛滅後，在此娑婆世界，懃加精^lb進，護持、讀誦、書寫、供養是經典者，當於此土^lb而廣說之。」
^cb#39c23爾時佛告諸菩薩摩訶薩眾：「止，善^lb男子！不須汝等護持此經。
所以者何？我娑婆^lb世界自有六萬恒河沙等菩薩摩訶薩，一一^pb36菩薩各有六萬恒河沙眷屬，是諸人等，能於^lb我滅後，護持、讀誦、廣說此經。」
^cb#39c28佛說是時，娑婆^lb世界三千大千國土地皆震裂，而於其中，有^lb無量千萬億菩薩摩訶薩同時踊出。
是諸菩^lb薩，身皆金色，三十二相，無量光明，先盡在此^lb娑婆世界之下、此界虛空中住。
是諸菩薩，聞^pb37釋迦牟尼佛所說音聲，從下發來。
一一菩薩^lb皆是大眾唱導之首，各將六萬恒河沙眷屬；
^lb況將五萬、四萬、三萬、二萬、一萬恒河沙等眷^lb屬者；
況復乃至一恒河沙、半恒河沙、四分之^lb一、乃至千萬億那由他分之一；
況復千萬億^lb那由他眷屬；
況復億萬眷屬；
況復千萬、百萬、^pb38乃至一萬；
況復一千、一百、乃至一十；
況復將^lb五、四、三、二、一弟子者；況復單己，樂遠離行。
如^lb是等比，無量無邊，算數譬喻所不能知。
^cb#40a12是諸^lb菩薩從地出已，各詣虛空七寶妙塔多寶如^lb來、釋迦牟尼佛所。
到已，向二世尊頭面禮足，^lb及至諸寶樹下師子座上佛所，亦皆作禮，右^pb39繞三匝，合掌恭敬，以諸菩薩種種讚法而以^lb讚歎，住在一面，欣樂瞻仰於二世尊。
是諸菩^lb薩摩訶薩，從初踊出，以諸菩薩種種讚法而^lb讚於佛，如是時間，經五十小劫。
是時釋迦牟^lb尼佛默然而坐，及諸四眾亦皆默然五十小^lb劫；佛神力故，令諸大眾謂如半日。
^cb#40a21爾時四眾，^pb40亦以佛神力故，見諸菩薩遍滿無量百千萬^lb億國土虛空。
是菩薩眾中有四導師：一名上^lb行，二名無邊行，三名淨行，四名安立行。
是四^lb菩薩，於其眾中最為上首唱導之師，在大眾^lb前，各共合掌，觀釋迦牟尼佛而問訊言：「世尊！^lb少病、少惱，安樂行不？所應度者，受教易不？不^pb41令世尊生疲勞耶？」
^cb#40a28爾時四大菩薩而說偈言：
^lb^gatha「世尊安樂，　　少病少惱，　　教化眾生，
　得無疲惓。　　^lb又諸眾生，　　受化易不？
　不令世尊，　　生疲勞耶？」
^lb^cb#40b04爾時世尊，於菩薩大眾中而作是言：「如是，如^lb是！諸善男子！如來安樂，少病、少惱；諸眾生等，^lb易可化度，無有疲勞。
所以者何？是諸眾生，世^pb42世已來常受我化，亦於過去諸佛供養尊重，^lb種諸善根。
此諸眾生，始見我身，聞我所說，即^lb皆信受入如來慧；除先修習學小乘者。
如是^lb之人，我今亦令得聞是經，入於佛慧。」
^cb#40b11爾時諸^lb大菩薩而說偈言：
^lb^gatha「善哉善哉！　　大雄世尊！　　諸眾生等，
　易可化度。　　^pb43能問諸佛，　　甚深智慧，
　聞已信行，　　我等隨喜。」
^lb^cb#40b15於時世尊讚歎上首諸大菩薩：「善哉，善哉！善^lb男子！汝等能於如來發隨喜心。」
^cb#40b16爾時彌勒菩^lb薩及八千恒河沙諸菩薩眾，皆作是念：「我等^lb從昔已來，不見不聞如是大菩薩摩訶薩眾，^lb從地踊出，住世尊前，合掌、供養，問訊如來。」
^cb#40b20時^pb44彌勒菩薩摩訶薩，知八千恒河沙諸菩薩等^lb心之所念，并欲自決所疑，合掌向佛，以偈問^lb曰：
^lb^gatha「無量千萬億，　　大眾諸菩薩，
　昔所未曾見，　　^lb願兩足尊說，
　是從何所來，　　以何因緣集？
　^lb巨身大神通，　　智慧叵思議，
　其志念堅固，　　^pb45有大忍辱力，
　眾生所樂見，　　為從何所來？
　^lb一一諸菩薩，　　所將諸眷屬，
　其數無有量，　　^lb如恒河沙等。
　或有大菩薩，　　將六萬恒沙，
　^lb如是諸大眾，　　一心求佛道。
　是諸大師等，　　^lb六萬恒河沙，
　俱來供養佛，　　及護持是經。
　^lb將五萬恒沙，　　其數過於是。
　四萬及三萬、　　^pb46二萬至一萬，
　一千一百等，　　乃至一恒沙、
　^lb半及三四分，　　億萬分之一，
　千萬那由他，　　^lb萬億諸弟子，
　乃至於半億，　　其數復過上。
　^lb百萬至一萬，　　一千及一百，
　五十與一十，　　^lb乃至三二一，
　單己無眷屬，　　樂於獨處者，
　^lb俱來至佛所，　　其數轉過上。
　如是諸大眾，　　^pb47若人行籌數，
　過於恒沙劫，　　猶不能盡知。
　^lb是諸大威德，　　精進菩薩眾，
　誰為其說法，　　^lb教化而成就？
　從誰初發心？　　稱揚何佛法？
　^lb受持行誰經？　　修習何佛道？
　如是諸菩薩，　　^lb神通大智力，
　四方地震裂，　　皆從中踊出。
　^lb世尊我昔來，　　未曾見是事，
　願說其所從，　　^pb48國土之名號。
　我常遊諸國，　　未曾見是眾，
　^lb我於此眾中，　　乃不識一人，
　忽然從地出，　　^lb願說其因緣。
　今此之大會，　　無量百千億，
　^lb是諸菩薩等，　　皆欲知此事。
　是諸菩薩眾，　　^lb本末之因緣，
　無量德世尊，　　唯願決眾疑。」
^lb^cb#41a04爾時釋迦牟尼分身諸佛，從無量千萬億他^pb49方國土來者，在於八方諸寶樹下，師子座上，^lb結跏趺坐。
其佛侍者，各各見是菩薩大眾，於^lb三千大千世界四方，從地踊出，住於虛空。
各^lb白其佛言：「世尊！此諸無量無邊阿僧祇菩薩^lb大眾，從何所來？」
^cb#41a09爾時諸佛各告侍者：「諸善男^lb子！且待須臾，有菩薩摩訶薩，名曰彌勒——釋迦^pb50牟尼佛之所授記，次後作佛——以問斯事，佛今答^lb之，汝等自當因是得聞。」
^cb#41a14爾時釋迦牟尼佛^lb告彌勒菩薩：「善哉，善哉！阿逸多！乃能問佛如^lb是大事。
汝等當共一心，被精進鎧，發堅固意，^lb如來今欲顯發宣示諸佛智慧、諸佛自在神^lb通之力、諸佛師子奮迅之力、諸佛威猛大勢^pb51之力。」
^cb#41a18爾時世尊欲重宣此義，而說偈言：
^lb^gatha「當精進一心，　　我欲說此事，
　勿得有疑悔，　　^lb佛智叵思議。
　汝今出信力，　　住於忍善中，
　^lb昔所未聞法，　　今皆當得聞。
　我今安慰汝，　　^lb勿得懷疑懼，
　佛無不實語，　　智慧不可量。
　^lb所得第一法，　　甚深叵分別，
　如是今當說，　　^pb52汝等一心聽。」
^lb^cb#41a28爾時世尊說此偈已，告彌勒菩薩：「我今於此^lb大眾，宣告汝等。
阿逸多！是諸大菩薩摩訶薩，^lb無量無數阿僧祇，從地踊出，汝等昔所未見^lb者，我於是娑婆世界得阿耨多羅三藐三菩^lb提已，教化示導是諸菩薩，調伏其心，令發道^pb53意。
此諸菩薩，皆於是娑婆世界之下、此界虛^lb空中住；於諸經典，讀誦通利，思惟分別，正憶^lb念。
阿逸多！是諸善男子等，不樂在眾多有所^lb說；常樂靜處，懃行精進未曾休息；亦不依止^lb人天而住。
常樂深智，無有障礙，亦常樂於諸^lb佛之法，一心精進，求無上慧。」
^cb#41b10爾時世尊欲重^pb54宣此義，而說偈言：
^lb^gatha「阿逸汝當知！　　是諸大菩薩，
　從無數劫來，　　^lb修習佛智慧，
　悉是我所化，　　令發大道心。
　^lb此等是我子，　　依止是世界，
　常行頭陀事，　　^lb志樂於靜處，
　捨大眾憒閙，　　不樂多所說。
　^lb如是諸子等，　　學習我道法，
　晝夜常精進，　　^pb55為求佛道故，
　在娑婆世界，　　下方空中住。
　^lb志念力堅固，　　常懃求智慧，
　說種種妙法，　　^lb其心無所畏。
　我於伽耶城，　　菩提樹下坐，
　^lb得成最正覺，　　轉無上法輪。
　爾乃教化之，　　^lb令初發道心，
　今皆住不退，　　悉當得成佛。
　^lb我今說實語，　　汝等一心信，
　我從久遠來，　　^pb56教化是等眾。」
^lb^cb#41b29爾時，彌勒菩薩摩訶薩及無數諸菩薩等，心^lb生疑惑，怪未曾有，而作是念：「云何世尊於少^lb時間、教化如是無量無邊阿僧祇諸大菩薩，^lb令住阿耨多羅三藐三菩提？」即白佛言：「世尊！^lb如來為太子時，出於釋宮，去伽耶城不遠，坐^pb57於道場，得成阿耨多羅三藐三菩提。從是已^lb來，始過四十餘年。世尊！云何於此少時，大作^lb佛事，以佛勢力、以佛功德，教化如是無量大^lb菩薩眾，當成阿耨多羅三藐三菩提？
^cb#41c09「世尊！此^lb大菩薩眾，假使有人於千萬億劫數不能盡，^lb不得其邊。
斯等久遠已來，於無量無邊諸佛^pb58所，殖諸善根，成就菩薩道，常修梵行。世尊！如^lb此之事，世所難信。
譬如有人，色美髮黑，年二^lb十五，指百歲人，言：『是我子。』其百歲人，亦指年^lb少，言：『是我父，生育我等。』是事難信。佛亦如是，^lb得道已來，其實未久，而此大眾諸菩薩等，已^lb於無量千萬億劫，為佛道故，懃行精進，善入^pb59出住無量百千萬億三昧，得大神通，久修梵^lb行，善能次第習諸善法，巧於問答，人中之寶，^lb一切世間甚為希有。
今日世尊方云：『得佛道^lb時，初令發心，教化示導，令向阿耨多羅三藐^lb三菩提。』
世尊得佛未久，乃能作此大功德事。^lb我等雖復信佛隨宜所說，佛所出言未曾虛^pb60妄，佛所知者皆悉通達。
然諸新發意菩薩，於^lb佛滅後，若聞是語，或不信受，而起破法罪業^lb因緣。
唯然，世尊！願為解說，除我等疑，及未來^lb世諸善男子聞此事已，亦不生疑。」
^cb#41c28爾時彌勒^lb菩薩欲重宣此義，而說偈言：
^lb^gatha「佛昔從釋種，　　出家近伽耶，
　坐於菩提樹，　　^pb61爾來尚未久。
　此諸佛子等，　　其數不可量，
　^lb久已行佛道，　　住於神通力，
　善學菩薩道，　　^lb不染世間法，
　如蓮華在水，　　從地而踊出。
　^lb皆起恭敬心，　　住於世尊前。
　是事難思議，　　^lb云何而可信？
　佛得道甚近，　　所成就甚多，
　^lb願為除眾疑，　　如實分別說。
　譬如少壯人，　　^pb62年始二十五，
　示人百歲子，　　髮白而面皺，
　^lb是等我所生；　　子亦說是父。
　父少而子老，　　^lb舉世所不信。
　世尊亦如是，　　得道來甚近。
　^lb是諸菩薩等，　　志固無怯弱，
　從無量劫來，　　^lb而行菩薩道，
　巧於難問答，　　其心無所畏，
　^lb忍辱心決定，　　端正有威德，
　十方佛所讚。　　^pb63善能分別說，
　不樂在人眾，　　常好在禪定，
　^lb為求佛道故，　　於下空中住。
　我等從佛聞，　　^lb於此事無疑，
　願佛為未來，　　演說令開解。
　^lb若有於此經，　　生疑不信者，
　即當墮惡道。　　^lb願今為解說，
　是無量菩薩，　　云何於少時，
　^lb教化令發心，　　而住不退地？」
^pb64^ck16〔如來壽量品第十六〕
^lb^cb#42b01爾時，佛告諸菩薩及一切大眾：「諸善男子！汝^lb等當信解如來誠諦之語。」復告大眾：「汝等當^lb信解如來誠諦之語。」又復告諸大眾：「汝等當^lb信解如來誠諦之語。」
^cb#42b04是時菩薩大眾，彌勒為^lb首，合掌白佛言：「世尊！唯願說之，我等當信受^pb65佛語。」如是三白已，復言：「唯願說之，我等當信^lb受佛語。」
^cb#42b07爾時世尊知諸菩薩三請不止，而告^lb之言：「汝等諦聽，如來祕密神通之力。
一切世^lb間天、人及阿修羅，皆謂：『今釋迦牟尼佛，出釋^lb氏宮，去伽耶城不遠，坐於道場，得阿耨多羅^lb三藐三菩提。』
然，善男子！我實成佛已來無量^pb66無邊百千萬億那由他劫。
譬如五百千萬億^lb那由他阿僧祇三千大千世界，假使有人末^lb為微塵，過於東方五百千萬億那由他阿僧^lb祇國乃下一塵，如是東行，盡是微塵。
諸善男^lb子！於意云何？是諸世界，可得思惟校計知其^lb數不？」
^cb#42b18彌勒菩薩等俱白佛言：「世尊！是諸世界，^pb67無量無邊，非算數所知，亦非心力所及；一切^lb聲聞、辟支佛，以無漏智，不能思惟知其限數；^lb我等住阿惟越致地，於是事中亦所不達。世^lb尊！如是諸世界，無量無邊。」
^cb#42b22爾時佛告大菩薩^lb眾：「諸善男子！今當分明宣語汝等。
是諸世界，^lb若著微塵及不著者盡以為塵，一塵一劫，我^pb68成佛已來，復過於此百千萬億那由他阿僧^lb祇劫。
自從是來，我常在此娑婆世界說法教^lb化，亦於餘處百千萬億那由他阿僧祇國導^lb利眾生。
^cb#42b28「諸善男子！於是中間，我說燃燈佛等，^lb又復言其入於涅槃，如是皆以方便分別。
^cb#42c01「諸^lb善男子！若有眾生來至我所，我以佛眼，觀其^pb69信等諸根利鈍，隨所應度，處處自說，名字不^lb同、年紀大小，亦復現言當入涅槃，又以種種^lb方便說微妙法，能令眾生發歡喜心。
^cb#42c05「諸善男^lb子！如來見諸眾生樂於小法、德薄垢重者，為^lb是人說：『我少出家，得阿耨多羅三藐三菩提。』^lb然我實成佛已來久遠若斯，但以方便，教化^pb70眾生，令入佛道，作如是說。
^cb#42c09「諸善男子！如來所^lb演經典，皆為度脫眾生，或說己身、或說他身，^lb或示己身、或示他身，或示己事、或示他事，諸^lb所言說，皆實不虛。
所以者何？如來如實知見^lb三界之相，無有生死、若退若出，亦無在世及^lb滅度者，非實非虛，非如非異，不如^pb71三界見於三界，如斯之事，如來明見，無有錯謬。
以諸眾^lb生有種種性、種種欲、種種行、種種憶想分別^lb故，欲令生諸善根，以若干因緣、譬喻、言辭種^lb種說法，所作佛事，未曾暫廢。
如是，我成佛已^lb來，甚大久遠，壽命無量阿僧祇劫，常住不滅。
^lb^cb#42c22「諸善男子！我本行菩薩道所成壽命，今猶未^pb72盡，復倍上數。
然今非實滅度，而便唱言：『當取^lb滅度。』如來以是方便，教化眾生。
所以者何？若^lb佛久住於世，薄德之人，不種善根，貧窮下賤，^lb貪著五欲，入於憶想妄見網中。
若見如來常^lb在不滅，便起憍恣而懷厭怠，不能生難遭之^lb想、恭敬之心。
是故如來以方便說：『比丘當知！^pb73諸佛出世，難可值遇。』所以者何？諸薄德人，過^lb無量百千萬億劫，或有見佛，或不見者，以此^lb事故，我作是言：『諸比丘！如來難可得見。』斯眾^lb生等聞如是語，必當生於難遭之想，心懷戀^lb慕，渴仰於佛，便種善根。是故如來雖不實滅，^lb而言滅度。
^cb#43a07「又，善男子！諸佛如來，法皆如是，為^pb74度眾生，皆實不虛。
譬如良醫，智慧聰達，明練^lb方藥，善治眾病。其人多諸子息——若十、二十乃^lb至百數，以有事緣，遠至餘國。
諸子於後，飲他^lb毒藥，藥發悶亂，宛轉于地。是時其父還來歸^lb家，諸子飲毒，或失本心、或不失者，遙見其父，^lb皆大歡喜，拜跪問訊：『善安隱歸。
我等愚癡，誤^pb75服毒藥，願見救療，更賜壽命。』
父見子等苦惱^lb如是，依諸經方，求好藥草，色香美味皆悉具^lb足，擣篩和合與子令服，而作是言：『此大良藥，^lb色香美味皆悉具足，汝等可服，速除苦惱，無^lb復眾患。』其諸子中不失心者，見此良藥、色香^lb俱好，即便服之，病盡除愈。
餘失心者，見其父^pb76來，雖亦歡喜問訊，求索治病，然與其藥而不^lb肯服。
所以者何？毒氣深入，失本心故，於此好^lb色香藥而謂不美。
父作是念：『此子可愍，為毒^lb所中，心皆顛倒。
雖見我喜，求索救療；如是好^lb藥而不肯服。我今當設方便，令服此藥。』
即作^lb是言：『汝等當知！我今衰老，死時已至，是好良^pb77藥，今留在此，汝可取服，勿憂不差。』作是教已，^lb復至他國，遣使還告：『汝父已死。』
是時諸子聞^lb父背喪，心大憂惱而作是念：『若父在者，慈愍^lb我等，能見救護，今者捨我遠喪他國。』自惟孤^lb露，無復恃怙，常懷悲感，心遂醒悟，乃知此藥^lb色味香美，即取服之，毒病皆愈。
其父聞子悉^pb78已得差，尋便來歸，咸使見之。
^cb#43b06「諸善男子！於意^lb云何？頗有人能說此良醫虛妄罪不？」
^cb#43b07「不也，世^lb尊！」
佛言：「我亦如是，成佛已來、無量無邊百千^lb萬億那由他阿僧祇劫，為眾生故，以方便力、^lb言當滅度，亦無有能如法說我虛妄過者。」
^cb#43b10爾^lb時世尊欲重宣此義，而說偈言：
^pb79^gatha「自我得佛來，　　所經諸劫數，
　無量百千萬，　　^lb億載阿僧祇，
　常說法教化，　　無數億眾生，
　^lb令入於佛道。　　爾來無量劫，
　為度眾生故，　　^lb方便現涅槃，
　而實不滅度，　　常住此說法。
　^lb我常住於此，　　以諸神通力，
　令顛倒眾生，　　^lb雖近而不見。
　眾見我滅度，　　廣供養舍利，
　^pb80咸皆懷戀慕，　　而生渴仰心。
　眾生既信伏，　　^lb質直意柔軟，
　一心欲見佛，　　不自惜身命。
　^lb時我及眾僧，　　俱出靈鷲山，
　我時語眾生：　　^lb『常在此不滅，
　以方便力故，　　現有滅不滅。』
　^lb餘國有眾生，　　恭敬信樂者，
　我復於彼中，　　^lb為說無上法。
　汝等不聞此，　　但謂我滅度。
　^pb81我見諸眾生，　　沒在於苦惱，
　故不為現身，　　^lb令其生渴仰，
　因其心戀慕，　　乃出為說法。
　^lb神通力如是，　　於阿僧祇劫，
　常在靈鷲山，　　^lb及餘諸住處。
　眾生見劫盡，　　大火所燒時，
　^lb我此土安隱，　　天人常充滿。
　園林諸堂閣，　　^lb種種寶莊嚴，
　寶樹多花菓，　　眾生所遊樂。
　^pb82諸天擊天鼓，　　常作眾伎樂，
　雨曼陀羅花，　　^lb散佛及大眾。
　我淨土不毀，　　而眾見燒盡，
　^lb憂怖諸苦惱，　　如是悉充滿。
　是諸罪眾生，　　^lb以惡業因緣，
　過阿僧祇劫，　　不聞三寶名。
　^lb諸有修功德，　　柔和質直者，
　則皆見我身，　　^lb在此而說法。
　或時為此眾，　　說佛壽無量，
　^pb83久乃見佛者，　　為說佛難值。
　我智力如是，　　^lb慧光照無量，
　壽命無數劫，　　久修業所得。
　^lb汝等有智者，　　勿於此生疑，
　當斷令永盡，　　^lb佛語實不虛。
　如醫善方便，　　為治狂子故，
　^lb實在而言死，　　無能說虛妄。
　我亦為世父，　　^lb救諸苦患者，
　為凡夫顛倒，　　實在而言滅。
　^pb84以常見我故，　　而生憍恣心，
　放逸著五欲，　　^lb墮於惡道中。
　我常知眾生，　　行道不行道，
　^lb隨所應可度，　　為說種種法。
　每自作是意，　　^lb以何令眾生，
　得入無上慧，　　速成就佛身。」
^lb^ck17〔別功德品第十七〕
^lb^cb#44a06爾時大會，聞佛說壽命劫數長遠如是，無量^pb85無邊阿僧祇眾生得大饒益。
於時世尊告彌^lb勒菩薩摩訶薩：「阿逸多！我說是如來壽命長^lb遠時，六百八十萬億那由他恒河沙眾生，得^lb無生法忍；
復有千倍菩薩摩訶薩，得聞持陀^lb羅尼門；
復有一世界微塵數菩薩摩訶薩，得^lb樂說無礙辯才；
復有一世界微塵數菩薩摩^pb86訶薩，得百千萬億無量旋陀羅尼；
復有三千^lb大千世界微塵數菩薩摩訶薩，能轉不退法^lb輪；
復有二千中國土微塵數菩薩摩訶薩，能^lb轉清淨法輪；
復有小千國土微塵數菩薩摩^lb訶薩，八生當得阿耨多羅三藐三菩提；
復有^lb四四天下微塵數菩薩摩訶薩，四生當得阿^pb87耨多羅三藐三菩提；
復有三四天下微塵數^lb菩薩摩訶薩，三生當得阿耨多羅三藐三菩^lb提；
復有二四天下微塵數菩薩摩訶薩，二生^lb當得阿耨多羅三藐三菩提；
復有一四天下^lb微塵數菩薩摩訶薩，一生當得阿耨多羅三^lb藐三菩提；
復有八世界微塵數眾生，皆發阿^pb88耨多羅三藐三菩提心。」
^cb#44a25佛說是諸菩薩摩訶^lb薩得大法利時，於虛空中，雨曼陀羅華、摩訶^lb曼陀羅華，以散無量百千萬億眾寶樹下、師子^lb座上諸佛，并散七寶塔中師子座上釋迦牟^lb尼佛及久滅度多寶如來，亦散一切諸大菩^lb薩及四部眾。
又雨細末栴檀、沈水香等。於虛^pb89空中，天鼓自鳴，妙聲深遠。又雨千種天衣，垂^lb諸瓔珞、真珠瓔珞、摩尼珠瓔珞、如意珠瓔珞，^lb遍於九方。
眾寶香爐燒無價香，自然周至，供^lb養大會。
一一佛上，有諸菩薩，執持幡蓋，次第^lb而上，至于梵天。
是諸菩薩，以妙音聲，歌無量^lb頌，讚歎諸佛。
^cb#44b08爾時彌勒菩薩從座而起，偏袒^pb90右肩，合掌向佛，而說偈言：
^lb^gatha「佛說希有法，　　昔所未曾聞，
　世尊有大力，　　^lb壽命不可量。
　無數諸佛子，　　聞世尊分別，
　^lb說得法利者，　　歡喜充遍身。
　或住不退地，　　^lb或得陀羅尼，
　或無礙樂說，　　萬億旋總持。
　^lb或有大千界，　　微塵數菩薩，
　各各皆能轉，　　^pb91不退之法輪。
　復有中千界，　　微塵數菩薩，
　^lb各各皆能轉，　　清淨之法輪。
　復有小千界，　　^lb微塵數菩薩，
　餘各八生在，　　當得成佛道。
　^lb復有四三二，　　如此四天下，
　微塵諸菩薩，　　^lb隨數生成佛。
　或一四天下，　　微塵數菩薩，
　^lb餘有一生在，　　當成一切智。
　如是等眾生，　　^pb92聞佛壽長遠，
　得無量無漏，　　清淨之果報。
　^lb復有八世界，　　微塵數眾生，
　聞佛說壽命，　　^lb皆發無上心。
　世尊說無量，　　不可思議法，
　^lb多有所饒益，　　如虛空無邊。
　雨天曼陀羅、　　^lb摩訶曼陀羅，
　釋梵如恒沙，　　無數佛土來。
　^lb雨栴檀沈水，　　繽紛而亂墜，
　如鳥飛空下，　　^pb93供散於諸佛。
　天鼓虛空中，　　自然出妙聲，
　^lb天衣千萬種，　　旋轉而來下。
　眾寶妙香爐，　　^lb燒無價之香，
　自然悉周遍、　　供養諸世尊。
　^lb其大菩薩眾，　　執七寶幡蓋，
　高妙萬億種，　　^lb次第至梵天。
　一一諸佛前，　　寶幢懸勝幡，
　^lb亦以千萬偈、　　歌詠諸如來。
　如是種種事，　　^pb94昔所未曾有，
　聞佛壽無量，　　一切皆歡喜。
　^lb佛名聞十方，　　廣饒益眾生，
　一切具善根，　　^lb以助無上心。」
^lb^cb#44c19爾時佛告彌勒菩薩摩訶薩：「阿逸多！其有眾^lb生，聞佛壽命長遠如是，乃至能生一念信解，^lb所得功德，無有限量。
若有善男子、善女人，為^pb95阿耨多羅三藐三菩提故，於八十萬億那由^lb他劫，行五波羅蜜——檀波羅蜜、尸羅波羅蜜、羼^lb提波羅蜜、毘梨耶波羅蜜、禪波羅蜜——除般若^lb波羅蜜，以是功德比前功德，百分、千分、百千^lb萬億分、不及其一，乃至算數譬喻所不能知。
^lb若善男子、善女人，有如是功德，於阿耨多羅^pb96三藐三菩提退者，無有是處。」
^cb#44c29爾時世尊欲重^lb宣此義，而說偈言：
^lb^gatha「若人求佛慧，　　於八十萬億，
　那由他劫數，　　^lb行五波羅蜜。
　於是諸劫中，　　布施供養佛，
　^lb及緣覺弟子，　　并諸菩薩眾。
　珍異之飲食、　　^lb上服與臥具，
　栴檀立精舍，　　以園林莊嚴。
　^pb97如是等布施，　　種種皆微妙，
　盡此諸劫數，　　^lb以迴向佛道。
　若復持禁戒，　　清淨無缺漏，
　^lb求於無上道，　　諸佛之所歎。
　若復行忍辱，　　^lb住於調柔地，
　設眾惡來加，　　其心不傾動。
　^lb諸有得法者，　　懷於增上慢，
　為此所輕惱，　　^lb如是亦能忍。
　若復懃精進，　　志念常堅固，
　^pb98於無量億劫，　　一心不懈息。
　又於無數劫，　　^lb住於空閑處，
　若坐若經行，　　除睡常攝心。
　^lb以是因緣故，　　能生諸禪定，
　八十億萬劫、　　^lb安住心不亂。
　持此一心福，　　願求無上道，
　^lb我得一切智，　　盡諸禪定際。
　是人於百千，　　^lb萬億劫數中，
　行此諸功德，　　如上之所說。
　^pb99有善男女等，　　聞我說壽命，
　乃至一念信，　　^lb其福過於彼。
　若人悉無有，　　一切諸疑悔，
　^lb深心須臾信，　　其福為如此。
　其有諸菩薩，　　^lb無量劫行道，
　聞我說壽命，　　是則能信受。
　^lb如是諸人等，　　頂受此經典，
　願我於未來，　　^lb長壽度眾生。
　如今日世尊、　　諸釋中之王，
　^pb100道場師子吼，　　說法無所畏。
　我等未來世，　　^lb一切所尊敬，
　坐於道場時，　　說壽亦如是。
　^lb若有深心者，　　清淨而質直，
　多聞能總持，　　^lb隨義解佛語，
　如是諸人等，　　於此無有疑。
^lb^cb#45b11「又，阿逸多！若有聞佛壽命長遠，解其言趣，是^lb人所得功德無有限量，能起如來無上之慧。
^pb101何況廣聞是經、若教人聞，若自持、若教人持，^lb若自書、若教人書，若以華、香、瓔珞、幢幡、繒蓋、^lb香油、酥燈，供養經卷，是人功德無量無邊，能^lb生一切種智。
^cb#45b16「阿逸多！若善男子、善女人，聞我^lb說壽命長遠，深心信解，則為見佛常在耆闍^lb崛山，共大菩薩、諸聲聞眾圍繞說法。
又見此^pb102娑婆世界，其地琉璃，坦然平正，閻浮檀金以^lb界八道，寶樹行列，諸臺樓觀皆悉寶成，其菩^lb薩眾咸處其中。
若有能如是觀者，當知是為^lb深信解相。
^cb#45b22「又復如來滅後，若聞是經而不毀^lb訾，起隨喜心，當知已為深信解相，何況讀誦、^lb受持之者，斯人則為頂戴如來。
^cb#45b25「阿逸多！是善^pb103男子、善女人，不須為我復起塔寺，及作僧坊、^lb以四事供養眾僧。
所以者何？是善男子、善女^lb人，受持讀誦是經典者，為已起塔、造立僧坊、^lb供養眾僧。
則為以佛舍利起七寶塔，高廣漸^lb小至于梵天，懸諸幡蓋及眾寶鈴，華、香、瓔珞，^lb末香、塗香、燒香，眾鼓、伎樂，簫、笛、箜篌，種種舞^pb104戲，以妙音聲歌唄讚頌，則為於無量千萬億^lb劫作是供養已。
^cb#45c05「阿逸多！若我滅後，聞是經典，^lb有能受持，若自書、若教人書，則為起立僧坊，^lb以赤栴檀作諸殿堂三十有二，高八多羅樹，^lb高廣嚴好，百千比丘於其中止，園林、浴池、經^lb行、禪窟，衣服、飲食、床褥、湯藥，一切樂具充滿^pb105其中。
如是僧坊、堂閣，若干百千萬億，其數無^lb量，以此現前供養於我及比丘僧。
是故我說：^lb『如來滅後，若有受持、讀誦、為他人說，若自書、^lb若教人書，供養經卷，不須復起塔寺，及造僧^lb坊、供養眾僧。』況復有人能持是經，兼行布施、^lb持戒、忍辱、精進、一心、智慧，其德最勝，無量無^pb106邊。
譬如虛空，東西南北、四維上下無量無邊；
^lb是人功德，亦復如是無量無邊，疾至一切種^lb智。
若人讀誦受持是經，為他人說，若自書、若^lb教人書，復能起塔，及造僧坊、供養讚歎聲聞^lb眾僧，亦以百千萬億讚歎之法讚歎菩薩功^lb德，又為他人，種種因緣隨義解說此法華經，^pb107復能清淨持戒，與柔和者而共同止，忍辱無^lb瞋，志念堅固，常貴坐禪得諸深定，精進勇猛^lb攝諸善法，利根智慧善答問難。
^cb#45c26「阿逸多！若我^lb滅後，諸善男子、善女人，受持讀誦是經典者，^lb復有如是諸善功德，當知是人已趣道場，近^lb阿耨多羅三藐三菩提，坐道樹下。
^cb#45c29「阿逸多！是^pb108善男子、善女人，若坐、若立、若行處，此中便應^lb起塔，一切天人皆應供養如佛之塔。」
^cb#46a02爾時世^lb尊欲重宣此義，而說偈言：
^lb^gatha「若我滅度後，　　能奉持此經，
　斯人福無量，　　^lb如上之所說，
　是則為具足，　　一切諸供養。
　^lb以舍利起塔，　　七寶而莊嚴，
　表剎甚高廣，　　^pb109漸小至梵天，
　寶鈴千萬億，　　風動出妙音。
　^lb又於無量劫，　　而供養此塔，
　華香諸瓔珞，　　^lb天衣眾伎樂，
　燃香油酥燈，　　周匝常照明。
　^lb惡世法末時，　　能持是經者，
　則為已如上，　　^lb具足諸供養。
　若能持此經，　　則如佛現在，
　^lb以牛頭栴檀，　　起僧坊供養。
　堂有三十二，　　^pb110高八多羅樹，
　上饌妙衣服，　　床臥皆具足，
　^lb百千眾住處，　　園林諸浴池，
　經行及禪窟，　　^lb種種皆嚴好。
　若有信解心，　　受持讀誦書，
　^lb若復教人書，　　及供養經卷，
　散華香末香，　　^lb以須曼瞻蔔、
　阿提目多伽，　　薰油常燃之。
　^lb如是供養者，　　得無量功德，
　如虛空無邊，　　^pb111其福亦如是。
　況復持此經，　　兼布施持戒，
　^lb忍辱樂禪定，　　不瞋不惡口，
　恭敬於塔廟，　　^lb謙下諸比丘，
　遠離自高心，　　常思惟智慧，
　^lb有問難不瞋，　　隨順為解說，
　若能行是行，　　^lb功德不可量。
　若見此法師，　　成就如是德，
　^lb應以天華散，　　天衣覆其身，
　頭面接足禮，　　^pb112生心如佛想。
　又應作是念：　　『不久詣道樹，
　^lb得無漏無為，　　廣利諸人天。』
　其所住止處，　　^lb經行若坐臥，
　乃至說一偈，　　是中應起塔，
　^lb莊嚴令妙好，　　種種以供養。
　佛子住此地，　　^lb則是佛受用，
　常在於其中，　　經行及坐臥。」
^lb妙法蓮華經卷第五^pb113
^pb1^folio#sdpdrk6<lines=6>妙法蓮華經卷第六^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck18〔隨喜功德品第十八〕
^lb^cb#46b22爾時，彌勒菩薩摩訶薩白佛言：「世尊！若有善^lb男子、善女人，聞是法華經隨喜者，得幾所福？」
^lb^cb#46b24而說偈言：
^pb2^gatha「世尊滅度後，　　其有聞是經，
　若能隨喜者，　　^lb為得幾所福？」
^lb^cb#46b27爾時，佛告彌勒菩薩摩訶薩：「阿逸多！如來滅^lb後，若比丘、比丘尼、優婆塞、優婆夷，及餘智者^lb若長若幼，聞是經隨喜已，從法會出，至於餘^lb處，若在僧坊，若空閑地，若城邑、巷陌、聚落、田^pb3里，如其所聞，為父母、宗親、善友、知識，隨力演^lb說。
是諸人等，聞已隨喜，復行轉教；餘人聞已，^lb亦隨喜轉教。如是展轉，至第五十。
^cb#46c04「阿逸多！其^lb第五十善男子、善女人，隨喜功德，我今說之，^lb汝當善聽。
若四百萬億阿僧祇世界，六趣四^lb生眾生——卵生、胎生、濕生、化生，若有形、無形，有^pb4想、無想，非有想、非無想，無足、二足、四足、多足，^lb如是等在眾生數者——有人求福，隨其所欲娛^lb樂之具，皆給與之。
一一眾生，與滿閻浮提金、^lb銀、琉璃、車璩馬腦、珊瑚、虎珀，諸妙珍寶，及象、^lb馬車乘，七寶所成宮殿樓閣等。
是大施主，如^lb是布施滿八十年已，而作是念：『我已施眾生^pb5娛樂之具，隨意所欲，然此眾生，皆已衰老年^lb過八十，髮白面皺，將死不久，我當以佛法而^lb訓導之。』
即集此眾生，宣布法化，示教利喜，一^lb時皆得須陀洹道、斯陀含道、阿那含道、阿羅^lb漢道，盡諸有漏，於深禪定皆得自在，具八解^lb脫。
於汝意云何，是大施主所得功德寧為多^pb6不？」
^cb#46c20彌勒白佛言：「世尊！是人功德甚多，無量無^lb邊。
若是施主，但施眾生一切樂具，功德無量；^lb何況令得阿羅漢果。」
^cb#46c23佛告彌勒：「我今分明語^lb汝，是人以一切樂具，施於四百萬億阿僧祇^lb世界六趣眾生，又令得阿羅漢果，所得功德，^lb不如是第五十人，聞法華經一偈隨喜功德，^pb7百分、千分、百千萬億分、不及其一，乃至算數^lb譬喻所不能知。
^cb#46c28「阿逸多！如是第五十人展轉^lb聞法華經隨喜功德，尚無量無邊阿僧祇，何^lb況最初於會中聞而隨喜者，其福復勝，無量^lb無邊阿僧祇，不可得比。
^cb#47a02「又，阿逸多！若人為是^lb經故，往詣僧坊，若坐、若立須臾聽受，緣是功^pb8德，轉身所生，得好上妙象、馬車乘、珍寶輦輿，^lb及乘天宮。
若復有人於講法處坐，更有人來，^lb勸令坐聽，若分座令坐，是人功德，轉身得帝^lb釋坐處，若梵王坐處，若轉輪聖王所坐之處。
^lb^cb#47a08「阿逸多！若復有人，語餘人言：『有經，名法華，可^lb共往聽。』即受其教，乃至須臾間聞，是人功德，^pb9轉身得與陀羅尼菩薩共生一處，利根智慧，^lb百千萬世終不瘖瘂，口氣不臭，舌常無病，口^lb亦無病，齒不垢黑、不黃、不踈，亦不缺落，不差、^lb不曲，脣不下垂亦不褰縮、不麁澁、不瘡胗，亦^lb不缺壞，亦不喎斜，不厚、不大，亦不黧黑，無諸^lb可惡。
鼻不匾㔸，亦不曲戾，面色不黑，亦不狹^pb10長，亦不窊曲，無有一切不可喜相。
脣舌牙齒^lb悉皆嚴好，鼻修高直，面貌圓滿，眉高而長，額^lb廣平正，人相具足，世世所生，見佛聞法、信受^lb教誨。
^cb#47a20「阿逸多！汝且觀是，勸於一人令往聽法，^lb功德如此，何況一心聽說、讀誦，而於大眾為^lb人分別、如說修行？」
^cb#47a23爾時世尊欲重宣此義，而^pb11說偈言：
^lb^gatha「若人於法會，　　得聞是經典，
　乃至於一偈，　　^lb隨喜為他說，
　如是展轉教，　　至于第五十，
　^lb最後人獲福，　　今當分別之。
　如有大施主，　　^lb供給無量眾，
　具滿八十歲，　　隨意之所欲。
　^lb見彼衰老相，　　髮白而面皺，
　齒踈形枯竭，　　^pb12念其死不久，
　我今應當教，　　令得於道果。
　^lb即為方便說，　　涅槃真實法，
　世皆不牢固，　　^lb如水沫泡焰，
　汝等咸應當，　　疾生厭離心。
　^lb諸人聞是法，　　皆得阿羅漢，
　具足六神通，　　^lb三明八解脫。
　最後第五十，　　聞一偈隨喜，
　^lb是人福勝彼，　　不可為譬喻。
　如是展轉聞，　　^pb13其福尚無量，
　何況於法會，　　初聞隨喜者。
　^lb若有勸一人，　　將引聽法華，
　言此經深妙，　　^lb千萬劫難遇，
　即受教往聽，　　乃至須臾聞，
　^lb斯人之福報，　　今當分別說。
　世世無口患，　　^lb齒不踈黃黑，
　脣不厚褰缺，　　無有可惡相，
　^lb舌不乾黑短，　　鼻高修且直，
　額廣而平正，　　^pb14面目悉端嚴，
　為人所喜見，　　口氣無臭穢，
　^lb優鉢華之香、　　常從其口出。
　若故詣僧坊，　　^lb欲聽法華經，
　須臾聞歡喜，　　今當說其福。
　^lb後生天人中，　　得妙象馬車，
　珍寶之輦輿，　　^lb及乘天宮殿。
　若於講法處，　　勸人坐聽經，
　^lb是福因緣得，　　釋梵轉輪座。
　何況一心聽，　　^pb15解說其義趣，
　如說而修行，　　其福不可量。」
^lb^ck19〔法師功德品第十九〕
^lb^cb#47c03爾時佛告常精進菩薩摩訶薩：「若善男子、善^lb女人，受持是法華經，若讀、若誦、若解說、若書^lb寫，是人當得八百眼功德、千二百耳功德、八^lb百鼻功德、千二百舌功德、八百身功德、千二^pb16百意功德，以是功德、莊嚴六根，皆令清淨。
是^lb善男子、善女人，父母所生清淨肉眼，見於三^lb千大千世界內外所有山林河海，下至阿鼻^lb地獄，上至有頂，亦見其中一切眾生，及業因^lb緣、果報生處，悉見悉知。」
^cb#47c11爾時世尊欲重宣此^lb義，而說偈言：
^pb17^gatha「若於大眾中，　　以無所畏心、
　說是法華經，　　^lb汝聽其功德。
　是人得八百、　　功德殊勝眼，
　^lb以是莊嚴故，　　其目甚清淨。
　父母所生眼，　　^lb悉見三千界，
　內外彌樓山，　　須彌及鐵圍，
　^lb并諸餘山林、　　大海江河水，
　下至阿鼻獄，　　^lb上至有頂處，
　其中諸眾生，　　一切皆悉見。
　^pb18雖未得天眼，　　肉眼力如是。
^lb^cb#47c23「復次，常精進！若善男子、善女人，受持此經，若^lb讀、若誦、若解說、若書寫，得千二百耳功德。
以^lb是清淨耳，聞三千大千世界，下至阿鼻地獄，^lb上至有頂，其中內外種種語言音聲——
象聲、馬^lb聲、牛聲、車聲，啼哭聲、愁歎聲，螺聲、鼓聲、鐘聲、^pb19鈴聲，笑聲、語聲，男聲、女聲、童子聲、童女聲，法^lb聲、非法聲，苦聲、樂聲，凡夫聲、聖人聲，喜聲、不^lb喜聲，天聲、龍聲、夜叉聲、乾闥婆聲、阿修羅聲、^lb迦樓羅聲、緊那羅聲、摩睺羅伽聲，火聲、水聲、^lb風聲，地獄聲、畜生聲、餓鬼聲，比丘聲、比丘尼^lb聲，聲聞聲、辟支佛聲，菩薩聲、佛聲——
以要言之，^pb20三千大千世界中一切內外所有諸聲，雖未^lb得天耳，以父母所生清淨常耳，皆悉聞知，如^lb是分別種種音聲而不壞耳根。」
^cb#48a08爾時世尊欲^lb重宣此義，而說偈言：
^lb^gatha「父母所生耳，　　清淨無濁穢，
　以此常耳聞，　　^lb三千世界聲。
　象馬車牛聲，　　鍾鈴螺鼓聲，
　^pb21琴瑟箜篌聲，　　簫笛之音聲，
　清淨好歌聲，　　^lb聽之而不著，
　無數種人聲，　　聞悉能解了。
　^lb又聞諸天聲，　　微妙之歌音，
　及聞男女聲，　　^lb童子童女聲。
　山川嶮谷中，　　迦陵頻伽聲，
　^lb命命等諸鳥，　　悉聞其音聲。
　地獄眾苦痛，　　^lb種種楚毒聲，
　餓鬼飢渴逼，　　求索飲食聲，
　^pb22諸阿修羅等，　　居在大海邊，
　自共語言時，　　^lb出于大音聲。
　如是說法者，　　安住於此間，
　^lb遙聞是眾聲，　　而不壞耳根。
　十方世界中，　　^lb禽獸鳴相呼，
　其說法之人，　　於此悉聞之。
　^lb其諸梵天上，　　光音及遍淨，
　乃至有頂天，　　^lb言語之音聲，
　法師住於此，　　悉皆得聞之。
　^pb23一切比丘眾，　　及諸比丘尼，
　若讀誦經典，　　^lb若為他人說，
　法師住於此，　　悉皆得聞之。
　^lb復有諸菩薩，　　讀誦於經法，
　若為他人說，　　^lb撰集解其義，
　如是諸音聲，　　悉皆得聞之。
　^lb諸佛大聖尊，　　教化眾生者，
　於諸大會中，　　^lb演說微妙法，
　持此法華者，　　悉皆得聞之。
　^pb24三千大千界，　　內外諸音聲，
　下至阿鼻獄，　　^lb上至有頂天，
　皆聞其音聲，　　而不壞耳根，
　^lb其耳聰利故，　　悉能分別知。
　持是法花者，　　^lb雖未得天耳，
　但用所生耳，　　功德已如是。
^lb^cb#48b16「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦、若解說、若書寫，成就八百鼻功德。
以^pb25是清淨鼻根，聞於三千大千世界上下內外^lb種種諸香——
須曼那華香、闍提華香、末利華香、^lb瞻蔔華香、波羅羅華香，赤蓮華香、青蓮華香、^lb白蓮華香，華樹香、菓樹香，栴檀香、沈水香、多^lb摩羅跋香、多伽羅香，及千萬種和香，若末、若^lb丸、若塗香——
持是經者，於此間住，悉能分別。又^pb26復別知眾生之香——
象香、馬香、牛羊等香，男香、^lb女香、童子香、童女香，及草木叢林香——
若近、若^lb遠、所有諸香，悉皆得聞，分別不錯。
持是經者，^lb雖住於此，亦聞天上諸天之香——波利質多羅、^lb拘鞞陀羅樹香，及曼陀羅華香、摩訶曼陀羅^lb華香、曼殊沙華香、摩訶曼殊沙華香、栴檀、沈^pb27水、種種末香，諸雜華香——如是等天香和合所^lb出之香，無不聞知。
又聞諸天身香——釋提桓因^lb在勝殿上，五欲娛樂嬉戲時香；若在妙法堂^lb上，為忉利諸天說法時香；若於諸園遊戲時^lb香；及餘天等男女身香，皆悉遙聞。
如是展轉^lb乃至梵世，上至有頂諸天身香，亦皆聞之，并^pb28聞諸天所燒之香。
及聲聞香、辟支佛香、菩薩^lb香、諸佛身香，亦皆遙聞，知其所在。
雖聞此香，^lb然於鼻根不壞不錯，若欲分別為他人說，憶^lb念不謬。」
^cb#48c11爾時世尊欲重宣此義，而說偈言：
^lb^gatha「是人鼻清淨，　　於此世界中，
　若香若臭物，　　^lb種種悉聞知。
　須曼那闍提、　　多摩羅栴檀、
　^pb29沈水及桂香，　　種種華菓香，
　及知眾生香，　　^lb男子女人香，
　說法者遠住，　　聞香知所在。
　^lb大勢轉輪王，　　小轉輪及子，
　群臣諸宮人，　　^lb聞香知所在。
　身所著珍寶，　　及地中寶藏，
　^lb轉輪王寶女，　　聞香知所在。
　諸人嚴身具，　　^lb衣服及瓔珞，
　種種所塗香，　　聞香知其身。
　^pb30諸天若行坐，　　遊戲及神變，
　持是法華者，　　^lb聞香悉能知。
　諸樹華菓實，　　及酥油香氣，
　^lb持經者住此，　　悉知其所在。
　諸山深嶮處，　　^lb栴檀樹花敷，
　眾生在中者，　　聞香皆能知。
　^lb鐵圍山大海，　　地中諸眾生，
　持經者聞香，　　^lb悉知其所在。
　阿修羅男女，　　及其諸眷屬，
　^pb31鬪諍遊戲時，　　聞香皆能知。
　曠野險隘處，　　^lb師子象虎狼，
　野牛水牛等，　　聞香知所在。
　^lb若有懷妊者，　　未辯其男女，
　無根及非人，　　^lb聞香悉能知。
　以聞香力故，　　知其初懷妊，
　^lb成就不成就，　　安樂產福子。
　以聞香力故，　　^lb知男女所念，
　染欲癡恚心，　　亦知修善者。
　^pb32地中眾伏藏，　　金銀諸珍寶，
　銅器之所盛，　　^lb聞香悉能知。
　種種諸瓔珞，　　無能識其價，
　^lb聞香知貴賤，　　出處及所在。
　天上諸華等，　　^lb曼陀曼殊沙、
　波利質多樹，　　聞香悉能知。
　^lb天上諸宮殿，　　上中下差別，
　眾寶花莊嚴，　　^lb聞香悉能知。
　天園林勝殿，　　諸觀妙法堂，
　^pb33在中而娛樂，　　聞香悉能知。
　諸天若聽法，　　^lb或受五欲時，
　來往行坐臥，　　聞香悉能知。
　^lb天女所著衣，　　好華香莊嚴，
　周旋遊戲時，　　^lb聞香悉能知。
　如是展轉上，　　乃至於梵世，
　^lb入禪出禪者，　　聞香悉能知。
　光音遍淨天，　　^lb乃至于有頂，
　初生及退沒，　　聞香悉能知。
　^pb34諸比丘眾等，　　於法常精進，
　若坐若經行，　　^lb及讀誦經法，
　或在林樹下，　　專精而坐禪，
　^lb持經者聞香，　　悉知其所在。
　菩薩志堅固，　　^lb坐禪若讀誦，
　或為人說法，　　聞香悉能知。
　^lb在在方世尊，　　一切所恭敬，
　愍眾而說法，　　^lb聞香悉能知。
　眾生在佛前，　　聞經皆歡喜，
　^pb35如法而修行，　　聞香悉能知。
　雖未得菩薩，　　^lb無漏法生鼻，
　而是持經者，　　先得此鼻相。」
^lb^cb#49b15「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦、若解說、若書寫，得千二百舌功德。
若^lb好、若醜，若美、不美，及諸苦澁物，在其舌根，皆^lb變成上味，如天甘露，無不美者。
若以舌根於^pb36大眾中有所演說，出深妙聲，能入其心，皆令^lb歡喜快樂。
又諸天子、天女，釋梵諸天，聞是深^lb妙音聲，有所演說言論次第，皆悉來聽。
及諸^lb龍、龍女，夜叉、夜叉女，乾闥婆、乾闥婆女，阿修^lb羅、阿修羅女，迦樓羅、迦樓羅女，緊那羅、緊那^lb羅女，摩睺羅伽、摩睺羅伽女，為聽法故，皆來^pb37親近恭敬供養。
及比丘、比丘尼，優婆塞、優婆^lb夷，國王、王子、群臣、眷屬，小轉輪王、大轉輪王、^lb七寶千子內外眷屬，乘其宮殿，俱來聽法，以^lb是菩薩善說法故。
婆羅門、居士、國內人民、盡^lb其形壽，隨侍供養。
又諸聲聞、辟支佛、菩薩、諸^lb佛，常樂見之。是人所在方面，諸佛皆向其處^pb38說法，悉能受持一切佛法，又能出於深妙法^lb音。」
^cb#49c03爾時世尊欲重宣此義，而說偈言：
^lb^gatha「是人舌根淨，　　終不受惡味，
　其有所食噉，　　^lb悉皆成甘露。
　以深淨妙聲，　　於大眾說法，
　^lb以諸因緣喻，　　引導眾生心，
　聞者皆歡喜，　　^lb設諸上供養。
　諸天龍夜叉，　　及阿修羅等，
　^pb39皆以恭敬心，　　而共來聽法，
　是說法之人，　　^lb若欲以妙音，
　遍滿三千界，　　隨意即能至。
　^lb大小轉輪王，　　及千子眷屬，
　合掌恭敬心，　　^lb常來聽受法。
　諸天龍夜叉、　　羅剎毘舍闍，
　^lb亦以歡喜心，　　常樂來供養。
　梵天王魔王，　　^lb自在大自在，
　如是諸天眾，　　常來至其所。
　^pb40諸佛及弟子，　　聞其說法音，
　常念而守護，　　^lb或時為現身。
^lb^cb#49c22「復次，常精進！若善男子、善女人，受持是經，若^lb讀、若誦，若解說、若書寫，得八百身功德。得清^lb淨身、如淨琉璃，眾生憙見。其身淨故，三千大^lb千世界眾生，生時、死時，上下、好醜，生善處、惡^pb41處，悉於中現。
及鐵圍山、大鐵圍山、彌樓山、摩^lb訶彌樓山等諸山，及其中眾生，悉於中現。
下^lb至阿鼻地獄，上至有頂，所有及眾生，悉於中^lb現。
若聲聞、辟支佛、菩薩、諸佛、說法，皆於身中^lb現其色像。」
^cb#50a01爾時世尊欲重宣此義，而說偈言：
^lb^gatha「若持法花者，　　其身甚清淨，
　如彼淨琉璃，　　^pb42眾生皆憙見。
　又如淨明鏡，　　悉見諸色像，
　^lb菩薩於淨身，　　皆見世所有，
　唯獨自明了，　　^lb餘人所不見。
　三千世界中，　　一切諸群萌，
　^lb天人阿修羅、　　地獄鬼畜生，
　如是諸色像，　　^lb皆於身中現。
　諸天等宮殿，　　乃至於有頂，
　^lb鐵圍及彌樓、　　摩訶彌樓山，
　諸大海水等，　　^pb43皆於身中現。
　諸佛及聲聞，　　佛子菩薩等，
　^lb若獨若在眾，　　說法悉皆現。
　雖未得無漏，　　^lb法性之妙身，
　以清淨常體，　　一切於中現。
^lb^cb#50a18「復次，常精進！若善男子、善女人，如來滅後、受^lb持是經，若讀、若誦、若解說、若書寫，得千二百^lb意功德。
以是清淨意根，乃至聞一偈一句，通^pb44達無量無邊之義，解是義已，能演說一句一^lb偈至於一月、四月乃至一歲，諸所說法，隨其^lb義趣，皆與實相不相違背。
若說俗間經書、治^lb世語言、資生業等，皆順正法。
三千大千世界^lb六趣眾生，心之所行、心所動作、心所戲論，皆^lb悉知之。
雖未得無漏智慧，而其意根、清淨如^pb45此。是人有所思惟、籌量、言說，皆是佛法，無不^lb真實，亦是先佛經中所說。」
^cb#50a29爾時世尊欲重宣^lb此義，而說偈言：
^lb^gatha「是人意清淨，　　明利無穢濁，
　以此妙意根，　　^lb知上中下法，
　乃至聞一偈，　　通達無量義，
　^lb次第如法說，　　月四月至歲。
　是世界內外，　　^pb46一切諸眾生，
　若天龍及人、　　夜叉鬼神等，
　^lb其在六趣中，　　所念若干種，
　持法花之報，　　^lb一時皆悉知。
　十方無數佛，　　百福莊嚴相，
　^lb為眾生說法，　　悉聞能受持。
　思惟無量義，　　^lb說法亦無量，
　終始不忘錯，　　以持法華故。
　^lb悉知諸法相，　　隨義識次第，
　達名字語言，　　^pb47如所知演說。
　此人有所說，　　皆是先佛法，
　^lb以演此法故，　　於眾無所畏。
　持法花經者，　　^lb意根淨若斯，
　雖未得無漏，　　先有如是相。
　^lb是人持此經，　　安住希有地，
　為一切眾生，　　^lb歡喜而愛敬。
　能以千萬種，　　善巧之語言，
　^lb分別而說法，　　持法花經故。」
^pb48^ck20〔常不輕菩薩品第二十〕
^lb^cb#50b24爾時，佛告得大勢菩薩摩訶薩：「汝今當知！若^lb比丘、比丘尼、優婆塞、優婆夷持法花經者，若^lb有惡口、罵詈、誹謗，獲大罪報，如前所說；其所^lb得功德，如向所說，眼、耳、鼻、舌、身、意清淨。
^cb#50b28「得大^lb勢！乃往古昔，過無量無邊不可思議阿僧祇^pb49劫，有佛名威音王如來、應供、正遍知、明行足、^lb善逝、世間解、無上士、調御丈夫、天人師、佛、世^lb尊。劫名離衰，國名大成。其威音王佛，於彼世^lb中，為天、人、阿修羅說法，為求聲聞者，說應四^lb諦法，度生老病死，究竟涅槃；為求辟支佛者，^lb說應十二因緣法；為諸菩薩，因阿耨多羅三^pb50藐三菩提，說應六波羅蜜法，究竟佛慧。
^cb#50c07「得大^lb勢！是威音王佛，壽四十萬億那由他恒河沙^lb劫；正法住世劫數，如一閻浮提微塵；像法住^lb世劫數，如四天下微塵。其佛饒益眾生已，然^lb後滅度。正法、像法滅盡之後，於此國土復有^lb佛出，亦號威音王如來、應供、正遍知、明行足、^pb51善逝、世間解、無上士、調御丈夫、天人師、佛、世^lb尊。如是次第有二萬億佛，皆同一號。
^cb#50c14「最初威^lb音王如來既已滅度，正法滅後，於像法中，增^lb上慢比丘有大勢力。
爾時有一菩薩比丘名^lb常不輕。得大勢！以何因緣名常不輕？是比丘，^lb凡有所見——若比丘、比丘尼、優婆塞、優婆夷——^pb52皆悉禮拜讚歎而作是言：『我深敬汝等，不敢輕^lb慢。
所以者何？汝等皆行菩薩道，當得作佛。』
而^lb是比丘，不專讀誦經典，但行禮拜，乃至遠見^lb四眾，亦復故往禮拜讚歎而作是言：『我不敢^lb輕於汝等，汝等皆當作佛。』
四眾之中，有生瞋^lb恚、心不淨者，惡口罵詈言：『是無智比丘從何^pb53所來？自言：「我不輕汝。」而與我等授記，當得作^lb佛。我等不用如是虛妄授記。』如此經歷多年，^lb常被罵詈，不生瞋恚，常作是言：『汝當作佛。』
說^lb是語時，眾人或以杖木瓦石而打擲之，避走^lb遠住，猶高聲唱言：
『我不敢輕於汝等，汝等皆^lb當作佛。』
以其常作是語故，增上慢比丘、比丘^pb54尼、優婆塞、優婆夷，號之為常不輕。
是比丘臨^lb欲終時，於虛空中，具聞威音王佛先所說法^lb華經二十千萬億偈，悉能受持，即得如上眼^lb根清淨、耳鼻舌身意根清淨。
得是六根清淨^lb已，更增壽命二百萬億那由他歲，廣為人說^lb是法華經。
於時增上慢四眾——比丘、比丘尼、優^pb55婆塞、優婆夷——輕賤是人，為作不輕名者，見其^lb得大神通力、樂說辯力、大善寂力，聞其所說，^lb皆信伏隨從。
是菩薩復化千萬億眾，令住阿^lb耨多羅三藐三菩提。
命終之後，得值二千億^lb佛，皆號日月燈明，於其法中，說是法華經。
以^lb是因緣，復值二千億佛，同號雲自在燈王，於^pb56此諸佛法中，受持讀誦，為諸四眾說此經典^lb故，得是常眼清淨，耳、鼻、舌、身、意諸根清淨，於^lb四眾中說法，心無所畏。
^cb#51a17「得大勢！是常不輕菩^lb薩摩訶薩，供養如是若干諸佛，恭敬、尊重、讚^lb歎、種諸善根，於後復值千萬億佛，亦於諸佛^lb法中說是經典，功德成就，當得作佛。
^cb#51a21「得大勢！^pb57於意云何？爾時常不輕菩薩豈異人乎？則我^lb身是。
若我於宿世不受持讀誦此經、為他人^lb說者，不能疾得阿耨多羅三藐三菩提。
我於^lb先佛所，受持讀誦此經、為人說故，疾得阿耨^lb多羅三藐三菩提。
^cb#51a26「得大勢！彼時四眾——比丘、比^lb丘尼、優婆塞、優婆夷——以瞋恚意輕賤我故，二^pb58百億劫常不值佛、不聞法、不見僧，千劫於阿^lb鼻地獄受大苦惱。
畢是罪已，復遇常不輕菩^lb薩，教化阿耨多羅三藐三菩提。
^cb#51b01「得大勢，於汝^lb意云何？爾時四眾常輕是菩薩者，豈異人乎？^lb今此會中跋陀婆羅等五百菩薩、師子月等^lb五百比丘、尼思佛等五百優婆塞，皆於阿耨^pb59多羅三藐三菩提不退轉者是。
^cb#51b05「得大勢！當知^lb是法華經，大饒益諸菩薩摩訶薩，能令至於^lb阿耨多羅三藐三菩提。
是故諸菩薩摩訶薩，^lb於如來滅後，常應受持、讀誦、解說、書寫是經。」
^lb^cb#51b09爾時世尊欲重宣此義，而說偈言：
^lb^gatha「過去有佛，　　號威音王，　　神智無量，
　將導一切，　　^pb60天人龍神，　　所共供養。
　是佛滅後，　　法欲盡時，　　^lb有一菩薩，
　名常不輕。　　時諸四眾，　　計著於法。
　^lb不輕菩薩，　　往到其所，　　而語之言：
『我不輕汝，　　^lb汝等行道，　　皆當作佛。』
　諸人聞已，　　輕毀罵詈；　　^lb不輕菩薩，
　能忍受之。　　其罪畢已，　　臨命終時，
　^lb得聞此經，　　六根清淨。　　神通力故，
　增益壽命，　　^pb61復為諸人，　　廣說是經。
　諸著法眾，　　皆蒙菩薩，　　^lb教化成就，
　令住佛道。　　不輕命終，　　值無數佛，
　^lb說是經故，　　得無量福，　　漸具功德，
　疾成佛道。　　^lb彼時不輕，　　則我身是。
　時四部眾，　　著法之者，　　^lb聞不輕言：
『汝當作佛。』　　以是因緣，　　值無數佛。
　^lb此會菩薩，　　五百之眾，　　并及四部，
　清信士女，　　^pb62今於我前，　　聽法者是。
　我於前世，　　勸是諸人，　　^lb聽受斯經，
　第一之法。　　開示教人，　　令住涅槃，
　^lb世世受持，　　如是經典。　　億億萬劫，
　至不可議，　　^lb時乃得聞，　　是法華經。
　億億萬劫，　　至不可議，　　^lb諸佛世尊、
　時說是經。　　是故行者，　　於佛滅後，
　^lb聞如是經，　　勿生疑惑。　　應當一心、
　廣說此經，　　^pb63世世值佛，　　疾成佛道。」
^lb^ck21〔如來神力品第二十一〕
^lb^cb#51c09爾時，千世界微塵等菩薩摩訶薩，從地踊出^lb者，皆於佛前一心合掌，瞻仰尊顏，而白佛言：^lb「世尊！我等於佛滅後，世尊分身所在國土滅^lb度之處，當廣說此經。
所以者何？我等亦自欲^pb64得是真淨大法，受持、讀誦、解說、書寫，而供養^lb之。」
^cb#51c14爾時世尊，於文殊師利等無量百千萬億^lb舊住娑婆世界菩薩摩訶薩，及諸比丘、比丘^lb尼、優婆塞、優婆夷，天、龍、夜叉、乾闥婆、阿修羅、^lb迦樓羅、緊那羅、摩睺羅伽、人非人等，一切眾^lb前，現大神力，出廣長舌上至梵世，一切毛孔^pb65放於無量無數色光，皆悉遍照十方世界。
眾^lb寶樹下、師子座上諸佛，亦復如是，出廣長舌，^lb放無量光。
釋迦牟尼佛及寶樹下諸佛現神^lb力時，滿百千歲，然後還攝舌相。
一時謦欬、俱^lb共彈指，是二音聲，遍至十方諸佛世界，地皆^lb六種震動。
其中眾生，天、龍、夜叉、乾闥婆、阿修^pb66羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，以佛^lb神力故，皆見此娑婆世界，無量無邊百千萬^lb億眾寶樹下、師子座上諸佛；及見釋迦牟尼^lb佛共多寶如來，在寶塔中、坐師子座；
又見無^lb量無邊百千萬億菩薩摩訶薩及諸四眾，恭^lb敬圍繞釋迦牟尼佛。既見是已，皆大歡喜，得^pb67未曾有。
即時諸天、於虛空中、高聲唱言：「過此^lb無量無邊百千萬億阿僧祇世界，有國名娑^lb婆，是中有佛名釋迦牟尼，今為諸菩薩摩訶^lb薩說大乘經，名妙法蓮華，教菩薩法，佛所護^lb念。
汝等當深心隨喜，亦當禮拜供養釋迦牟^lb尼佛。」
彼諸眾生，聞虛空中聲已，合掌向娑婆^pb68世界作如是言：「南無釋迦牟尼佛！南無釋迦^lb牟尼佛！」
以種種華、香、瓔珞、幡蓋，及諸嚴身之^lb具、珍寶妙物，皆共遙散娑婆世界。
所散諸物，^lb從十方來，譬如雲集，變成寶帳，遍覆此間諸^lb佛之上。
于時十方世界，通達無礙，如一佛土。
^lb^cb#52a13爾時，佛告上行等菩薩大眾：「諸佛神力如是，^pb69無量無邊、不可思議，若我以是神力，於無量^lb無邊百千萬億阿僧祇劫，為囑累故，說此經^lb功德，猶不能盡。
以要言之，如來一切所有之^lb法、如來一切自在神力、如來一切祕要之藏、^lb如來一切甚深之事，皆於此經宣示顯說。
是^lb故汝等於如來滅後，應一心受持、讀誦、解說、^pb70書寫、如說修行。
所在國土，若有受持、讀誦、解^lb說、書寫、如說修行，若經卷所住之處，若於園^lb中、若於林中、若於樹下、若於僧坊、若白衣舍、^lb若在殿堂、若山谷曠野，是中皆應起塔供養。
^lb所以者何？當知是處、即是道場，諸佛於此得^lb阿耨多羅三藐三菩提，諸佛於此轉于法輪，^pb71諸佛於此而般涅槃。」
^lb^cb#52a27爾時世尊欲重宣此義，而說偈言：
^lb^gatha「諸佛救世者，　　住於大神通，
　為悅眾生故，　　^lb現無量神力，
　舌相至梵天，　　身放無數光，
　^lb為求佛道者，　　現此希有事。
　諸佛謦欬聲，　　^lb及彈指之聲，
　周聞十方國，　　地皆六種動。
　^pb72以佛滅度後，　　能持是經故，
　諸佛皆歡喜，　　^lb現無量神力。
　囑累是經故，　　讚美受持者，
　^lb於無量劫中，　　猶故不能盡。
　是人之功德，　　^lb無邊無有窮，
　如十方虛空，　　不可得邊際。
　^lb能持是經者，　　則為已見我，
　亦見多寶佛，　　^lb及諸分身者，
　又見我今日，　　教化諸菩薩。
　^pb73能持是經者，　　令我及分身，
　滅度多寶佛，　　^lb一切皆歡喜。
　十方現在佛，　　并過去未來，
　^lb亦見亦供養，　　亦令得歡喜。
　諸佛坐道場，　　^lb所得祕要法，
　能持是經者，　　不久亦當得。
　^lb能持是經者，　　於諸法之義，
　名字及言辭，　　^lb樂說無窮盡，
　如風於空中，　　一切無障礙。
　^pb74於如來滅後，　　知佛所說經，
　因緣及次第，　　^lb隨義如實說，
　如日月光明，　　能除諸幽冥。
　^lb斯人行世間，　　能滅眾生闇，
　教無量菩薩，　　^lb畢竟住一乘。
　是故有智者，　　聞此功德利，
　^lb於我滅度後，　　應受持斯經，
　是人於佛道，　　^lb決定無有疑。」
^pb75^ck22〔囑累品第二十二〕
^lb^cb#52c04爾時，釋迦牟尼佛從法座起，現大神力，以右^lb手摩無量菩薩摩訶薩頂，而作是言：「我於無^lb量百千萬億阿僧祇劫，修習是難得阿耨多^lb羅三藐三菩提法，今以付囑汝等。
汝等應當^lb一心流布此法，廣令增益。」
如是三摩諸菩薩^pb76摩訶薩頂，而作是言：「我於無量百千萬億阿^lb僧祇劫，修習是難得阿耨多羅三藐三菩提^lb法，今以付囑汝等。
汝等當受持、讀誦、廣宣此^lb法，令一切眾生普得聞知。
所以者何？如來有^lb大慈悲，無諸慳悋，亦無所畏，能與眾生，佛之^lb智慧、如來智慧、自然智慧，如來是一切眾生^pb77之大施主。
汝等亦應隨學如來之法，勿生慳^lb悋。
於未來世，若有善男子、善女人，信如來智^lb慧者，當為演說此法華經，使得聞知，為令其^lb人得佛慧故。
若有眾生不信受者，當於如來^lb餘深法中，示教利喜。
汝等若能如是，則為已^lb報諸佛之恩。」
^cb#52c21時諸菩薩摩訶薩，聞佛作是說^pb78已，皆大歡喜遍滿其身，益加恭敬，曲躬、低頭，^lb合掌向佛，俱發聲言：「如世尊勅，當具奉行。唯^lb然，世尊！願不有慮。」諸菩薩摩訶薩眾，如是三^lb反，俱發聲言：「如世尊勅，當具奉行。唯然，世尊！^lb願不有慮。」
^cb#52c26爾時釋迦牟尼佛令十方來諸分^lb身佛各還本土，而作是言：「諸佛各隨所安，多^pb79寶佛塔還可如故。」說是語時，十方無量分身^lb諸佛——坐寶樹下師子座上者，及多寶佛，并上^lb行等無邊阿僧祇菩薩大眾，舍利弗等聲聞^lb四眾，及一切世間天、人、阿修羅等，聞佛所說，^lb皆大歡喜。
^lb^ck23〔藥王菩薩本事品第二十三〕
^pb80^cb#53a05爾時宿王華菩薩白佛言：「世尊！藥王菩薩云^lb何遊於娑婆世界？世尊！是藥王菩薩有若干^lb百千萬億那由他難行苦行？善哉，世尊！願少^lb解說。」諸天、龍、神、夜叉、乾闥婆、阿修羅、迦樓羅、^lb緊那羅、摩睺羅伽、人非人等，又他國土諸來^lb菩薩，及此聲聞眾，聞皆歡喜。
^cb#53a10爾時佛告宿王^pb81華菩薩：「乃往過去無量恒河沙劫，有佛號日^lb月淨明德如來、應供、正遍知、明行足、善逝、世^lb間解、無上士、調御丈夫、天人師、佛、世尊。
其佛^lb有八十億大菩薩摩訶薩，七十二恒河沙大^lb聲聞眾，佛壽四萬二千劫，菩薩壽命亦等。
彼^lb國無有女人、地獄、餓鬼、畜生、阿修羅等，及以^pb82諸難；地平如掌，琉璃所成，寶樹莊嚴，寶帳覆^lb上，垂寶華幡，寶瓶香爐周遍國界，七寶為臺，^lb一樹一臺，其樹去臺盡一箭道。
此諸寶樹，皆^lb有菩薩、聲聞而坐其下。諸寶臺上，各有百億^lb諸天作天伎樂，歌歎於佛，以為供養。
爾時彼^lb佛為一切眾生喜見菩薩，及眾菩薩、諸聲聞^pb83眾，說法華經。
^cb#53a23「是一切眾生喜見菩薩，樂習苦^lb行，於日月淨明德佛法中，精進經行，一心求^lb佛，滿萬二千歲已，得現一切色身三昧。
得此^lb三昧已，心大歡喜，即作念言：『我得現一切色^lb身三昧，皆是得聞法華經力，我今當供養日^lb月淨明德佛及法華經。』即時入是三昧，於虛^pb84空中，雨曼陀羅華、摩訶曼陀羅華、細末堅黑^lb栴檀，滿虛空中，如雲而下，又雨海此岸栴檀^lb之香——此香六銖，價直娑婆世界——以供養佛。
作^lb是供養已，從三昧起，而自念言：『我雖以神力^lb供養於佛，不如以身供養。』即服諸香——栴檀、薰^lb陸、兜樓婆、畢力迦、沈水、膠香，又飲瞻蔔諸華^pb85香油，滿千二百歲已，香油塗身，於日月淨明^lb德佛前，以天寶衣而自纏身，灌諸香油，以神^lb通力願而自然身，光明遍照八十億恒河沙^lb世界。
其中諸佛同時讚言：『善哉，善哉！善男子！^lb是真精進，是名真法供養如來。
若以華、香、瓔^lb珞、燒香、末香、塗香、天繒、幡蓋及海此岸栴檀^pb86之香，如是等種種諸物供養，所不能及；假使^lb國城、妻子布施，亦所不及。
善男子！是名第一^lb之施，於諸施中最尊最上，以法供養諸如來^lb故。』
作是語已而各默然。其身火燃千二百歲，^lb過是已後，其身乃盡。
^cb#53b18「一切眾生喜見菩薩作^lb如是法供養已，命終之後，復生日月淨明德^pb87佛國中，於淨德王家結加趺坐，忽然化生。即^lb為其父而說偈言：
^lb^gatha「『大王今當知，　　我經行彼處，
　　即時得一切，　　^lb現諸身三昧。
　　勤行大精進，　　捨所愛之身，
^missing<t=供養於世尊，　　為求無上慧。』>
^lb^cb#53b26「說是偈已，而白父言：『日月淨明德佛，今故現^lb在。
我先供養佛已，得解一切眾生語言陀羅^pb88尼，復聞是法華經八百千萬億那由他甄迦^lb羅、頻婆羅、阿閦婆等偈。大王！我今當還供養^lb此佛。』白已，即坐七寶之臺，上昇虛空，高七多^lb羅樹，往到佛所，頭面禮足，合十指爪，以偈讚^lb佛：
^lb^gatha「『容顏甚奇妙，　　光明照十方，
　　我適曾供養，　　^pb89今復還親覲。』
^lb^cb#53c06「爾時，一切眾生喜見菩薩說是偈已，而白佛^lb言：『世尊！世尊猶故在世。』
爾時日月淨明德佛，^lb告一切眾生喜見菩薩：『善男子！我涅槃時到、^lb滅盡時至，汝可安施床座，我於今夜當般涅^lb槃。』又勅一切眾生喜見菩薩：『善男子！我以佛^pb90法囑累於汝及諸菩薩大弟子，并阿耨多羅^lb三藐三菩提法，亦以三千大千七寶世界諸^lb寶樹、寶臺及給侍諸天，悉付於汝。
我滅度後，^lb所有舍利亦付囑汝，當令流布，廣設供養，應^lb起若干千塔。』如是日月淨明德佛勅一切眾^lb生喜見菩薩已，於夜後分入於涅槃。
^cb#53c17「爾時，一^pb91切眾生喜見菩薩見佛滅度，悲感、懊惱，戀慕^lb於佛，即以海此岸栴檀為𧂐，供養佛身，而以^lb燒之。
火滅已後，收取舍利，作八萬四千寶瓶，^lb以起八萬四千塔，高三世界，表剎莊嚴，垂諸^lb幡蓋，懸眾寶鈴。
^cb#53c22「爾時一切眾生喜見菩薩復^lb自念言：『我雖作是供養，心猶未足，我今當更^pb92供養舍利。』便語諸菩薩大弟子及天、龍、夜叉^lb等一切大眾：『汝等當一心念，我今供養日月^lb淨明德佛舍利。』作是語已，即於八萬四千塔^lb前，燃百福莊嚴臂七萬二千歲而以供養，令^lb無數求聲聞眾、無量阿僧祇人，發阿耨多羅^lb三藐三菩提心，皆使得住現一切色身三昧。
^pb93^cb#54a01「爾時，諸菩薩、天、人、阿修羅等，見其無臂，憂惱^lb悲哀而作是言：『此一切眾生喜見菩薩，是我^lb等師，教化我者，而今燒臂，身不具足。』于時一^lb切眾生喜見菩薩，於大眾中立此誓言：『我捨^lb兩臂，必當得佛金色之身，若實不虛，令我兩^lb臂還復如故。』作是誓已，自然還復，由斯菩薩^pb94福德智慧淳厚所致。
當爾之時，三千大千世^lb界六種震動，天雨寶華，一切人、天得未曾有。」
^lb^cb#54a09佛告宿王華菩薩：「於汝意云何？一切眾生喜^lb見菩薩，豈異人乎？今藥王菩薩是也。
其所捨^lb身布施，如是無量百千萬億那由他數。
^cb#54a12「宿王^lb華！若有發心欲得阿耨多羅三藐三菩提者，^pb95能燃手指，乃至足一指，供養佛塔，勝以國城、^lb妻子，及三千大千國土山林河池、諸珍寶物、^lb而供養者，若復有人，以七寶滿三千大千世^lb界，供養於佛，及大菩薩、辟支佛、阿羅漢，是人^lb所得功德，不如受持此法華經，乃至一四句^lb偈，其福最多。
^cb#54a19「宿王華！譬如一切川流江河，諸^pb96水之中海為第一；此法華經亦復如是，於諸^lb如來所說經中，最為深大。
又如土山、黑山、小^lb鐵圍山、大鐵圍山及十寶山，眾山之中，須彌^lb山為第一；
此法華經亦復如是，於諸經中最^lb為其上。又如眾星之中，月天子最為第一；此^lb法華經亦復如是，於千萬億種諸經法中最^pb97為照明。
又如日天子能除諸闇；此經亦復如^lb是，能破一切不善之闇。
又如諸小王中，轉輪^lb聖王最為第一；此經亦復如是，於眾經中最^lb為其尊。
又如帝釋、於三十三天中王，此經亦^lb復如是，諸經中王。
又如大梵天王，一切眾生^lb之父；此經亦復如是，一切賢聖，學、無學，及發^pb98菩薩心者之父。
又如一切凡夫人中，須陀洹、^lb斯陀含、阿那含、阿羅漢、辟支佛為第一；此經^lb亦復如是，一切如來所說、若菩薩所說、若聲^lb聞所說，諸經法中，最為第一。
有能受持是經^lb典者，亦復如是，於一切眾生中、亦為第一。
一^lb切聲聞、辟支佛中，菩薩為第一；此經亦復如^pb99是，於一切諸經法中、最為第一。
如佛為諸法^lb王；此經亦復如是，諸經中王。
^cb#54b11「宿王華！此經能^lb救一切眾生者，此經能令一切眾生離諸苦^lb惱，此經能大饒益一切眾生，充滿其願。
如清^lb涼池！能滿一切諸渴乏者，如寒者得火，如裸^lb者得衣，如商人得主，如子得母，如渡得船，如^pb100病得醫，如暗得燈，如貧得寶，如民得王，如賈^lb客得海，如炬除暗；此法華經亦復如是，能令^lb眾生離一切苦、一切病痛，能解一切生死之^lb縛。
若人得聞此法華經，若自書、若使人書，所^lb得功德，以佛智慧籌量多少，不得其邊。
若書^lb是經卷，華、香、瓔珞、燒香、末香、塗香，幡蓋、衣服，^pb101種種之燈——酥燈、油燈、諸香油燈、瞻蔔油燈、須^lb曼那油燈、波羅羅油燈、婆利師迦油燈、那婆^lb摩利油燈——供養，所得功德，亦復無量。
^cb#54b26「宿王華！^lb若有人聞是藥王菩薩本事品者，亦得無量^lb無邊功德。
若有女人聞是藥王菩薩本事品，^lb能受持者，盡是女身，後不復受。
若如來滅後^pb102後五百歲中，若有女人聞是經典，如說修行。
^lb於此命終，即往安樂世界，阿彌陀佛、大菩薩^lb眾，圍繞住處，生蓮華中，寶座之上，不復為貪^lb欲所惱，亦復不為瞋恚愚癡所惱，亦復不為^lb憍慢嫉妬諸垢所惱，得菩薩神通、無生法忍。
^lb得是忍已，眼根清淨，以是清淨眼根，見七百^pb103萬二千億那由他恒河沙等諸佛如來。
是時^lb諸佛遙共讚言：『善哉，善哉！善男子！汝能於釋^lb迦牟尼佛法中，受持讀誦思惟是經，為他人^lb說，所得福德無量無邊，火不能燒，水不能漂，^lb汝之功德，千佛共說不能令盡。
汝今已能破^lb諸魔賊，壞生死軍，諸餘怨敵皆悉摧滅。
善男^pb104子！百千諸佛，以神通力共守護汝，於一切世^lb間天、人之中無如汝者，唯除如來，其諸聲聞、^lb辟支佛、乃至菩薩，智慧禪定無有與汝等者。』^lb宿王華！此菩薩成就如是功德智慧之力。
若^lb有人聞是藥王菩薩本事品，能隨喜讚善者，^lb是人現世口中常出青蓮華香，身毛孔中常^pb105出牛頭栴檀之香，所得功德，如上所說。
是故，^lb宿王華！以此藥王菩薩本事品囑累於汝。
我^lb滅度後後五百歲中，廣宣流布於閻浮提，無^lb令斷絕，惡魔、魔民、諸天、龍、夜叉、鳩槃茶等，得^lb其便也。
^cb#54c23「宿王華！汝當以神通之力守護是經。
^lb所以者何？此經則為閻浮提人，病之良藥。若^pb106人有病，得聞是經，病即消滅，不老不死。宿王^lb華！汝若見有受持是經者，應以青蓮花盛滿^lb末香，供散其上。
散已，作是念言：『此人不久必^lb當取草坐於道場，破諸魔軍，當吹法螺、擊大^lb法鼓，度脫一切眾生老病死海。』是故求佛道^lb者、見有受持是經典人，應當如是生恭敬心。」
^pb107^cb#55a03說是藥王菩薩本事品時，八萬四千菩薩得^lb解一切眾生語言陀羅尼。
多寶如來於寶塔^lb中讚宿王華菩薩言：「善哉，善哉！宿王華！汝成^lb就不可思議功德，乃能問釋迦牟尼佛如此^lb之事，利益無量一切眾生。」
^lb妙法蓮華經卷第六^pb108
^pb1^folio#sdpdrk7<lines=6>妙法蓮華經卷第七^lb^au【．．．．姚秦三藏法師鳩摩羅什奉詔譯】
^lb^ck24〔妙音菩薩品第二十四〕
^lb^cb#55a17爾時釋迦牟尼佛放大人相肉髻光明，及放^lb眉間白毫相光，遍照東方百八萬億那由他^lb恒河沙等諸佛世界。
過是數已，有世界名淨^pb2光莊嚴，其國有佛，號淨華宿王智如來、應供、^lb正遍知、明行足、善逝、世間解、無上士、調御丈^lb夫、天人師、佛、世尊，為無量無邊菩薩大眾恭^lb敬圍繞而為說法，釋迦牟尼佛白毫光明遍^lb照其國。
爾時一切淨光莊嚴國中，有一菩薩名^lb曰妙音，久已殖眾德本，供養親近無量百^pb3千萬億諸佛，而悉成就甚深智慧，得妙幢相^lb三昧、法華三昧、淨德三昧、宿王戲三昧、無緣^lb三昧、智印三昧、解一切眾生語言三昧、集一^lb切功德三昧、清淨三昧、神通遊戲三昧、慧炬^lb三昧、莊嚴王三昧、淨光明三昧、淨藏三昧、不^lb共三昧、日旋三昧，得如是等百千萬億恒河^pb4沙等諸大三昧。
釋迦牟尼佛光照其身，即白^lb淨華宿王智佛言：「世尊！我當往詣娑婆世界，^lb禮拜、親近、供養釋迦牟尼佛，及見文殊師利^lb法王子菩薩、藥王菩薩、勇施菩薩、宿王華菩^lb薩、上行意菩薩、莊嚴王菩薩、藥上菩薩。」
^cb#55b08爾時^lb淨華宿王智佛告妙音菩薩：「汝莫輕彼國，生^pb5下劣想。
善男子！彼娑婆世界，高下不平，土石^lb諸山，穢惡充滿，佛身卑小，諸菩薩眾其形亦^lb小。
而汝身四萬二千由旬，我身六百八十萬^lb由旬，汝身第一端正，百千萬福，光明殊妙，是^lb故汝往、莫輕彼國——若佛、菩薩及國土，生下劣^lb想。」
^cb#55b14妙音菩薩白其佛言：「世尊！我今詣娑婆世^pb6界，皆是如來之力，如來神通遊戲，如來功德^lb智慧莊嚴。」於是妙音菩薩不起于座，身不動^lb搖，而入三昧，以三昧力，於耆闍崛山，去法座^lb不遠，化作八萬四千眾寶蓮華，閻浮檀金為^lb莖，白銀為葉，金剛為鬚，甄叔迦寶以為其臺。
^lb^cb#55b21爾時，文殊師利法王子見是蓮華，而白佛言：^pb7「世尊！是何因緣，先現此瑞？有若干千萬蓮華，^lb閻浮檀金為莖，白銀為葉，金剛為鬚，甄叔迦^lb寶以為其臺。」
^cb#55b24爾時釋迦牟尼佛告文殊師利：^lb「是妙音菩薩摩訶薩，欲從淨華宿王智佛國，^lb與八萬四千菩薩，圍繞而來至此娑婆世界，^lb供養、親近、禮拜於我，亦欲供養、聽法華經。」
^cb#55b28文^pb8殊師利白佛言：「世尊！是菩薩種何善本？修何^lb功德？而能有是大神通力？行何三昧？願為我^lb等說是三昧名字，我等亦欲勤修行之，行此^lb三昧，乃能見是菩薩色相大小，威儀進止。
唯^lb願世尊以神通力，彼菩薩來，令我得見。」
^cb#55c04爾時^lb釋迦牟尼佛告文殊師利：「此久滅度多寶如^pb9來，當為汝等而現其相。」
^cb#55c06時多寶佛告彼菩薩：^lb「善男子！來，文殊師利法王子欲見汝身。」于時^lb妙音菩薩於彼國沒，與八萬四千菩薩俱共^lb發來。
所經諸國，六種震動，皆悉雨於七寶蓮^lb華；百千天樂，不鼓自鳴。
是菩薩目如廣大青^lb蓮華葉，正使和合百千萬月，其面貌端正復^pb10過於此，身真金色，無量百千功德莊嚴，威德^lb熾盛，光明照曜，諸相具足，如那羅延堅固之^lb身。
入七寶臺，上昇虛空，去地七多羅樹，諸菩^lb薩眾恭敬圍繞，而來詣此娑婆世界耆闍崛^lb山。
到已，下七寶臺，以價直百千瓔珞，持至釋^lb迦牟尼佛所，頭面禮足，奉上瓔珞，而白佛言：^pb11「世尊！淨華宿王智佛問訊世尊，少病、少惱，起^lb居輕利，安樂行不？四大調和不？
世事可忍不？^lb眾生易度不？無多貪欲、瞋恚、愚癡、嫉妬、慳慢^lb不？無不孝父母、不敬沙門、邪見、不善心、不攝^lb五情不？世尊！眾生能降伏諸魔怨不？久滅度^lb多寶如來在七寶塔中，來聽法不？又問訊多^pb12寶如來，安隱、少惱，堪忍久住不？世尊！我今欲^lb見多寶佛身，唯願世尊，示我令見。」
^cb#55c26爾時釋迦^lb牟尼佛語多寶佛：「是妙音菩薩欲得相見。」
^cb#55c28時^lb多寶佛告妙音言：「善哉，善哉！汝能為供養釋^lb迦牟尼佛及聽法華經，并見文殊師利等，故^lb來至此。」
^cb#56a02爾時華德菩薩白佛言：「世尊！是妙音^pb13菩薩，種何善根，修何功德，有是神力？」
^cb#56a03佛告華^lb德菩薩：「過去有佛，名雲雷音王多陀阿伽度、^lb阿羅訶、三藐三佛陀，國名現一切世間，劫名^lb喜見，妙音菩薩於萬二千歲，以十萬種伎樂^lb供養雲雷音王佛，并奉上八萬四千七寶鉢。
^lb以是因緣果報，今生淨華宿王智佛國，有是^pb14神力。
華德！於汝意云何？爾時雲雷音王佛所，^lb妙音菩薩——伎樂供養、奉上寶器者，豈異人乎？^lb今此妙音菩薩摩訶薩是。
華德！是妙音菩薩，^lb已曾供養親近無量諸佛，久殖德本，又值恒^lb河沙等百千萬億那由他佛。
^cb#56a14「華德！汝但見妙^lb音菩薩其身在此，而是菩薩，現種種身，處處^pb15為諸眾生說是經典——或現梵王^lb身，或現帝釋身，或現自在天身，或現大自在天身，或現天^lb大將軍身，或現毘沙門天王身，或現轉輪聖^lb王身，或現諸小王身，或現長者身，或現居士身，或現宰官身，或現婆羅門^lb身，
或現比丘、比^lb丘尼、優婆塞、優婆夷身，或現長者居士婦女^pb16身，或現宰官婦女身，或現婆羅門婦女身，或^lb現童男、童女身，或現天、龍、夜叉、乾闥婆、阿修^lb羅、迦樓羅、緊那羅、摩睺羅伽、人非人等身，而^lb說是經。
諸有地獄、餓鬼、畜生，及眾難處，皆能^lb救濟，乃至於王後宮，變為女身，而說是經。
^cb#56a26「華^lb德！是妙音菩薩，能救護娑婆世界諸眾生者，^pb17是妙音菩薩如是種種變化現身，在此娑婆^lb國土，為諸眾生說是經典，於神通、變化、智慧^lb無所損減。
是菩薩，以若干智慧明照娑婆世^lb界，令一切眾生各得所知；於十方恒河沙世^lb界中，亦復如是。
若應以聲^lb聞形得度者，現聲聞形而為說法；應以辟^pb18支佛形得度者，現辟支佛形而為說法；應以菩^lb薩形得度者，現菩薩形而為說法；應以佛形得度者，即現佛形^lb而為說法。
如是種種，隨所應度而為現形，乃^lb至應以滅度而得度者，示現滅度。
^cb#56b09「華德！妙音^lb菩薩摩訶薩，成就大神通智慧之力，其事如^lb是。」
^cb#56b12爾時華德菩薩白佛言：「世尊！是妙音菩薩，^pb19深種善根。
世尊！是菩薩住何三昧，而能如是^lb在所變現，度脫眾生？」
^cb#56b14佛告華德菩薩：「善男子！^lb其三昧名現一切色身，妙音菩薩住是三昧^lb中，能如是饒益無量眾生。」
^cb#56b16說是妙音菩薩品^lb時，與妙音菩薩俱來者八萬四千人，皆得現^lb一切色身三昧；此娑婆世界無量菩薩，亦得^pb20是三昧及陀羅尼。
^cb#56b19爾時妙音菩薩摩訶薩供^lb養釋迦牟尼佛及多寶佛塔已，還歸本土，所^lb經諸國，六種震動，雨寶蓮華，作百千萬億種^lb種伎樂。
既到本國，與八萬四千菩薩、圍繞至^lb淨華宿王智佛所，白佛言：
「世尊！我到娑婆世^lb界饒益眾生，見釋迦牟尼佛，及見多寶佛塔，^pb21禮拜、供養；又見文殊師利法王子菩薩，及見^lb藥王菩薩、得勤精進力菩薩、勇施菩薩等，亦^lb令是八萬四千菩薩得現一切色身三昧。
說^lb是妙音菩薩來往品時，四萬二千天子得無^lb生法忍，華德菩薩得法華三昧。」
^lb^ck25〔觀世音菩薩普門品第二十五〕
^pb22^cb#56c03爾時，無盡意菩薩即從座起，偏袒右肩，合掌^lb向佛，而作是言：「世尊！觀世音菩薩，以何因緣^lb名觀世音？」
^cb#56c05佛告無盡意菩薩：「善男子！若有無^lb量百千萬億眾生受諸苦惱，聞是觀世音菩^lb薩，一心稱名，觀世音菩薩即時觀其音聲，皆^lb得解脫。
若有持是觀世音菩薩名者，設入大^pb23火，火不能燒，由是菩薩威神力故。
若為大水^lb所漂，稱其名號，即得淺處。若有百千萬億眾^lb生，為求金、銀、琉璃、車璩、馬瑙、珊瑚、虎珀、真珠^lb等寶，入於大海，假使黑風吹其船舫，飄墮羅^lb剎鬼國，其中若有，乃至一人，稱觀世音菩薩^lb名者，是諸人等皆得解脫羅剎之難。以是因^pb24緣，名觀世音。
若復有人臨當被害，稱觀世音^lb菩薩名者，彼所執刀杖尋段段壞，而得解脫。
^lb若三千大千國土，滿中夜叉、羅剎，欲來惱人，^lb聞其稱觀世音菩薩名者，是諸惡鬼，尚不能^lb以惡眼視之，況復加害。
設復有人，若有罪、若^lb無罪，杻械、枷鎖檢繫其身，稱觀世音菩薩名^pb25者，皆悉斷壞，即得解脫。
若三千大千國土，滿^lb中怨賊，有一商主，將諸商人，齎持重寶、經過^lb險路，其中一人作是唱言：『諸善男子！勿得恐^lb怖，汝等應當一心稱觀世音菩薩名號。
是菩^lb薩能以無畏施於眾生，汝等若稱名者，於此^lb怨賊當得解脫。』眾商人聞，俱發聲言：『南無觀^pb26世音菩薩。』稱其名故，即得解脫。
^cb#56c29「無盡意！觀世^lb音菩薩摩訶薩，威神之力巍巍如是。
若有眾^lb生多於婬欲，常念恭敬觀世音菩薩，便得離^lb欲。
若多瞋恚，常念恭敬觀世音菩薩，便得離^lb瞋。若多愚癡，常念恭敬觀世音菩薩，便得離^lb癡。
^cb#57a05「無盡意！觀世音菩薩有如是等大威神力，^pb27多所饒益，是故眾生常應心念。
若有女人，設^lb欲求男，禮拜供養觀世音菩薩，便生福德智^lb慧之男；設欲求女，便生端正有相之女。宿殖^lb德本，眾人愛敬。
^cb#57a09「無盡意！觀世音菩薩有如是^lb力，若有眾生，恭敬禮拜觀世音菩薩，福不唐^lb捐，是故眾生皆應受持觀世音菩薩名號。
^cb#57a12「無^pb28盡意！若有人受持六十二億恒河沙菩薩名^lb字，復盡形供養飲食、衣服、臥具、醫藥。
於汝意^lb云何？是善男子、善女人，功德多不？」
^cb#57a15無盡意言：^lb「甚多，世尊！」
^cb#57a16佛言：「若復有人受持觀世音菩薩^lb名號，乃至一時禮拜、供養，是二人福，正等無^lb異，於百千萬億劫不可窮盡。
無盡意！受持觀^pb29世音菩薩名號，得如是無量無邊福德之利。」
^lb^cb#57a20無盡意菩薩白佛言：「世尊！觀世音菩薩，云何^lb遊此娑婆世界？云何而為眾生說法？方便之^lb力，其事云何？」
^cb#57a22佛告無盡意菩薩：「善男子！若有^lb國土眾生，
應以佛身得度者，觀世音菩薩即^lb現佛身而為說法；
應以辟支佛身得度者，即^pb30現辟支佛身而為說法；
應以聲聞身得度者，^lb即現聲聞身而為說法；
應以梵王身得度者，^lb即現梵王身而為說法；
應以帝釋身得度者，^lb即現帝釋身而為說法；
應以自在天身得度^lb者，即現自在天身而為說法；
應以大自在天^lb身得度者，即現大自在天身而為說法；
應以^pb31天大將軍身得度者，即現天大將軍身而為^lb說法；
應以毘沙門身得度者，即現毘沙門身^lb而為說法；
應以小王身得度者，即現小王身^lb而為說法；
應以長者身得度者，即現長者身^lb而為說法；
應以居士身得度者，即現居士身^lb而為說法；
應以宰官身得度者，即現宰官身^pb32而為說法；
應以婆羅^lb門身得度者，即現婆羅門身而為說法；
應以比丘、比丘尼、優婆塞、優^lb婆夷身得度者，即現比丘、比丘尼、優婆塞、優^lb婆夷身而為說法；
應以長者、居士、宰官、婆羅^lb門婦女身得度者，即現婦女身而為說法；
應^lb以童男、童女身得度者，即現童男、童女身而^pb33為說法；
應以天、龍、夜叉、乾闥婆、阿修羅、迦樓^lb羅、緊那羅、摩睺羅伽、人非人等身得度者，即^lb皆現之而為說法；
應以執金剛身得度者，即^lb現執金剛身而為說法。
^cb#57b19「無盡意！是觀世音菩^lb薩成就如是功德，以種種形，遊諸國土，度脫^lb眾生。
是故汝等，應當一心供養觀世音菩薩。^pb34是觀世音菩薩摩訶薩，於怖畏急難之中能^lb施無畏，是故此娑婆世界，皆號之為施無畏^lb者。」
^cb#57b24無盡意菩薩白佛言：「世尊！我今當供養觀^lb世音菩薩。」即解頸眾寶珠、瓔珞，價直百千兩^lb金，而以與之，作是言：「仁者！受此法施珍寶瓔^lb珞。」時觀世音菩薩不肯受之。無盡意復白觀^pb35世音菩薩言：「仁者！愍我等故，受此瓔珞。」
^cb#57c01爾時^lb佛告觀世音菩薩：「當愍此無盡意菩薩及四^lb眾，天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、^lb摩睺羅伽、人非人等故，受是瓔珞。」
^cb#57c03即時觀世^lb音菩薩愍諸四眾，及於天、龍、人非人等，受其^lb瓔珞，分作二分，一分奉釋迦牟尼佛，一分奉^pb36多寶佛塔。
^cb#57c06「無盡意，觀世音菩薩有如是自在^lb神力，遊於娑婆世界。」
^cb#57c07爾時無盡意菩薩以偈^lb問曰：
^lb^gatha「世尊妙相具，　　我今重問彼，
　佛子何因緣，　　^lb名為觀世音？
　具足妙相尊，　　偈答無盡意：
^lb『汝聽觀音行，　　善應諸方所，
　弘誓深如海，　　^pb37歷劫不思議，
　侍多千億佛，　　發大清淨願。
　^lb我為汝略說，　　聞名及見身，
　心念不空過，　　^lb能滅諸有苦。
　假使興害意，　　推落大火坑，
　^lb念彼觀音力，　　火坑變成池。
　或漂流巨海，　　^lb龍魚諸鬼難，
　念彼觀音力，　　波浪不能沒。
　^lb或在須彌峯，　　為人所推墮，
　念彼觀音力，　　^pb38如日虛空住。
　或被惡人逐，　　墮落金剛山，
　^lb念彼觀音力，　　不能損一毛。
　或值怨賊繞，　　^lb各執刀加害，
　念彼觀音力，　　咸即起慈心。
　^lb或遭王難苦，　　臨刑欲壽終，
　念彼觀音力，　　^lb刀尋段段壞。
　或囚禁枷鎖，　　手足被杻械，
　^lb念彼觀音力，　　釋然得解脫。
　呪詛諸毒藥，　　^pb39所欲害身者，
　念彼觀音力，　　還著於本人。
　^lb或遇惡羅剎、　　毒龍諸鬼等，
　念彼觀音力，　　^lb時悉不敢害。
　若惡獸圍遶，　　利牙爪可怖，
　^lb念彼觀音力，　　疾走無邊方。
　蚖蛇及蝮蠍，　　^lb氣毒煙火燃，
　念彼觀音力，　　尋聲自迴去。
　^lb雲雷鼓掣電，　　降雹澍大雨，
　念彼觀音力，　　^pb40應時得消散。
　眾生被困厄，　　無量苦逼身，
　^lb觀音妙智力，　　能救世間苦。
　具足神通力，　　^lb廣修智方便，
　十方諸國土，　　無剎不現身。
　^lb種種諸惡趣，　　地獄鬼畜生，
　生老病死苦，　　^lb以漸悉令滅。
　真觀清淨觀，　　廣大智慧觀，
　^lb悲觀及慈觀，　　常願常瞻仰。
　無垢清淨光，　　^pb41慧日破諸闇，
　能伏災風火，　　普明照世間。
　^lb悲體戒雷震，　　慈意妙大雲，
　澍甘露法雨，　　^lb滅除煩惱焰。
　諍訟經官處，　　怖畏軍陣中，
　^lb念彼觀音力，　　眾怨悉退散。
　妙音觀世音，　　^lb梵音海潮音，
　勝彼世間音，　　是故須常念，
　^lb念念勿生疑。　　觀世音淨聖，
　於苦惱死厄，　　^pb42能為作依怙，
　具一切功德，　　慈眼視眾生，
　^lb福聚海無量，　　是故應頂禮。』」
^lb^cb#58b03爾時持地菩薩即從座起，前白佛言：「世尊！若^lb有眾生，聞是觀世音菩薩品自在之業，普門^lb示現神通力者，當知是人功德不少。」
^cb#58b05佛說是^lb普門品時，眾中八萬四千眾生，皆發無等等^pb43阿耨多羅三藐三菩提心。
^lb^ck26〔陀羅尼品第二十六〕
^lb^cb#58b09爾時，藥王菩薩即從座起，偏袒右肩，合掌向^lb佛，而白佛言：「世尊！若善男子、善女人，有能受^lb持法華經者——若讀誦通利，若書寫經卷——得幾^lb所福？」
^cb#58b12佛告藥王：「若有善男子、善女人，供養八^pb44百萬億那由他恒河沙等諸佛。
於汝意云何？^lb其所得福，寧為多不？」
^cb#58b14「甚多，世尊。」
^cb#58b15佛言：「若善男^lb子、善女人，能於是經，乃至受持一四句偈，讀^lb誦、解義、如說修行，功德甚多。」
^lb^cb#58b17爾時藥王菩薩白佛言：「世尊！我今當與說法^lb者陀羅尼呪，以守護之。」即說呪曰：
^pb45^cb#58b19「安爾(一)　曼爾(二)　摩禰(三)　摩摩禰(四)　旨隷(五)　遮^lb梨第(六)　賒咩(羊鳴音)(七)　賒履(冈雉反)多瑋(八)　羶(輸千反)^lb帝(九)　目帝(十)　目多履(十一)　娑履(十二)　阿瑋娑履(十三)　^lb桑履(十四)　娑履(十五)　叉裔(十六)　阿叉裔(十七)　阿耆膩(十八)　^lb羶帝(十九)　賒履(二十)　陀羅尼(二十一)　阿盧伽婆娑(蘇奈反)^lb簸蔗毘叉膩(二十二)　禰毘剃(二十三)　阿便哆(都餓反)邏禰履剃^pb46(廾四)　阿亶哆波隷輸地(途賣反)(二十五)　漚究隷(二十六)　^lb牟究隷(二十七)　阿羅隷(二十八)　波羅隷(二十九)　首迦差(初几反)(三十)　^lb阿三磨三履(三十一)　佛馱毘吉利袠帝(三十二)　^lb達磨波利差(猜離反)帝(三十三)　僧伽涅瞿沙禰^lb(三十四)　婆舍婆舍輸地(三十五)　曼哆邏(三十六)　曼哆^lb邏叉夜多(三十七)　郵樓哆(三十八)　郵樓哆憍舍^pb47略(來加反)(三十九)　惡叉邏(四十)　惡叉冶多冶(四十一)　阿婆^lb盧(四十二)　阿摩若(荏蔗反)那多夜(四十三)
^lb^cb#58c04「世尊！是陀羅尼神咒，六十二億恒河沙等諸^lb佛所說，若有侵毀此法師者，則為侵毀是諸^lb佛已。」
^cb#58c06時釋迦牟尼佛讚藥王菩薩言：「善哉，善^lb哉！藥王！汝愍念擁護此法師故，說是陀羅尼，^pb48於諸眾生，多所饒益。」
^cb#58c09爾時勇施菩薩白佛言：^lb「世尊！我亦為擁護讀誦受持法華經者，說陀^lb羅尼。
若此法師得是陀羅尼，若夜叉、若羅剎、^lb若富單那、若吉遮、若鳩槃茶、若餓鬼等，伺求^lb其短，無能得便。」即於佛前而說呪曰：
^lb^cb#58c14「痤(誓螺反)隷(一)摩訶痤隷(二)郁枳(三)目枳(四)^pb49阿隷(五)阿羅婆第(六)涅隷第(七)涅隷多婆第^lb(八)伊緻(猪履反)柅(女氏反)(九)韋緻柅(十)旨緻柅(十一)涅^lb隷墀柅(十二)涅犁墀婆底(十三)
^lb^cb#59a04「世尊！是陀羅尼神呪，恒河沙等諸佛所說，亦^lb皆隨喜，若有侵毀此法師者，則為侵毀是諸^lb佛已。」
^cb#59a07爾時毘沙門天王護世者白佛言：「世尊！^pb50我亦為愍念眾生、擁護此法師故，說是陀羅^lb尼。」即說呪曰：
^lb^cb#59a10「阿梨(一)那梨(二)㝹那梨(三)阿那盧(四)那履(五)^lb拘那履(六)
^lb^cb#59a12「世尊！以是神呪擁護法師，我亦自當擁護持^lb是經者，令百由旬內無諸衰患。」
^cb#59a13爾時持國天^pb51王在此會中，與千萬億那由他乾闥婆眾，恭^lb敬圍繞，前詣佛所，合掌白佛言：「世尊！我亦以^lb陀羅尼神呪，擁護持法華經者。」即說呪曰：
^lb^cb#59a18「阿伽禰(一)伽禰(二)瞿利(三)乾陀利(四)旃陀^lb利(五)摩蹬耆(六)常求利(七)浮樓莎柅(八)頞^lb(音遏)底(九)
^pb52^cb#59a20「世尊！是陀羅尼神呪，四十二億諸佛所說，若^lb有侵毀此法師者，則為侵毀是諸佛已。」
^cb#59a22爾時^lb有羅剎女等，一名藍婆，二名毘藍婆，三名曲^lb齒，四名華齒，五名黑齒，六名多髮，七名無厭^lb足，八名持瓔珞，九名睪帝，十名奪一切眾生^lb精氣，是十羅剎女，與鬼子母，并其子及眷屬，^pb53俱詣佛所，同聲白佛言：「世尊！我等亦欲擁護^lb讀誦受持法華經者，除其衰患，若有伺求法^lb師短者，令不得便。」即於佛前，而說呪曰：
^lb^cb#59b01「伊提履(一)伊提泯(二)伊提履(三)阿提履(四)伊^lb提履(五)泥履(六)泥履(七)泥履(八)泥履(九)泥履^lb(十)樓醯(十一)樓醯(十二)樓醯(十三)樓醯(十四)多醯^pb54(十五)多醯(十六)多醯(十七)兜醯(十八)㝹醯(十九)
^lb^cb#59b05「寧上我頭上，莫惱於法師。
若夜叉、若羅剎、若^lb餓鬼、若富單那、若吉遮、若毘陀羅、若犍馱、若^lb烏摩勒伽、若阿跋摩羅、若夜叉吉遮、若人吉^lb遮，若熱病若一日、若二日、若三日、若四日乃^lb至七日，若常熱病，若男形、若女形、若童男形、^pb55若童女形，乃至夢中，亦復莫惱。」即於佛前、而^lb說偈言：
^lb^gatha「若不順我呪，　　惱亂說法者，
　頭破作七分，　　^lb如阿梨樹枝。
　如殺父母罪，　　亦如壓油殃，
　^lb^gatha斗秤欺誑人，　　調達破僧罪。
　犯此法師者，　　^lb當獲如是殃。」
^pb56^cb#59b17諸羅剎女說此偈已，白佛言：「世尊！我等亦當^lb身自擁護受持、讀誦、修行是經者，令得安隱，離諸衰患，消眾毒藥。」
^lb^cb#59b19佛告諸羅剎女：「善哉，善^lb哉！汝等但能擁護受持法華名者，福不可量，^lb何況擁護具足受持，供養經卷——華、香、瓔珞，末^lb香、塗香、燒香，幡蓋、伎樂；燃種種燈：酥燈、油燈、^pb57諸香油燈、蘇摩那華油燈、瞻蔔華油燈、婆師^lb迦華油燈、優鉢羅華油燈，如是等百千種供^lb養者。
睪帝！汝等及眷屬，應當擁護如是法師。」
^lb^cb#59b26說是陀羅尼品時，六萬八千人、得無生法忍。
^lb^ck27〔妙莊嚴王本事品第二十七〕
^lb^cb#59b29爾時佛告諸大眾：「乃往古世，過無量無邊不^pb58可思議阿僧祇劫，有佛名雲雷音宿王華智^lb多陀阿伽度、阿羅訶、三藐三佛陀，國名光明^lb莊嚴，劫名憙見。
彼佛法中有王，名妙莊嚴，其^lb王夫人名曰淨德，有二子，一名淨藏，二名淨^lb眼。
是二子有大神力，福德智慧，久修菩薩所^lb行之道，所謂檀波羅蜜、尸羅波羅蜜、羼提波^pb59羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜、^lb方便波羅蜜，慈悲喜捨，乃至三十七品助道^lb法皆悉明了通達。
又得菩薩淨三昧、日星宿^lb三昧、淨光三昧、淨色三昧、淨照明三昧、長莊^lb嚴三昧、大威德藏三昧，於此三昧亦悉通達。
^lb^cb#59c12「爾時彼佛欲引導妙莊嚴王，及愍念眾生故，^pb60說是法華經。
時淨藏、淨眼二子到其母所，合^lb十指爪掌白言：『願母往詣雲雷音宿王華智^lb佛所，我等亦當侍從，親近、供養、禮拜。
所以者^lb何？此佛於一切天人眾中說法華經，宜應聽^lb受。』母告子言：『汝父信受外道，深著婆羅門法，^lb汝等應往白父，與共俱去。』淨藏、淨眼合十指^pb61爪掌白母：『我等是法王子，而生此邪見家。』母^lb告子言：『汝等當憂念汝父，為現神變，若得見^lb者，心必清淨，或聽我等，往至佛所。』
於是二子^lb念其父故，踊在虛空，高七多羅樹，現種種神^lb變——於虛空中行住坐臥；身上出水、^lb身下出火，身下出水、身上出火；或現大身滿虛空中，而^pb62復現小，小復現大；於空中滅，忽然在地；入地^lb如水，履水如地。
現如是等種種神變，令其父^lb王心淨信解。
時父見子神力如是，心大歡喜，^lb得未曾有，合掌向子言：『汝等，師為是誰，誰之^lb弟子？』二子白言：『大王！彼雲雷音宿王華智佛，^lb今在七寶菩提樹下法座上坐，於一切世間^pb63天人眾中廣說法華經，是我等師，我是弟子。』
^lb父語子言：『我今亦欲見汝等師，可共俱往。』於^lb是二子從空中下，到其母所，合掌白母：『父王^lb今已信解，堪任發阿耨多羅三藐三菩提心。
^lb我等為父已作佛事，願母見聽，於彼佛所出^lb家修道。』
^cb#60a20「爾時二子欲重宣其意，以偈白母：
^pb64^gatha「『願母放我等，　　出家作沙門，
　　諸佛甚難值，　　^lb我等隨佛學。
　　如優曇鉢羅，　　值佛復難是，
　　^lb脫諸難亦難，　　願聽我出家。』
^lb^cb#60a26「母即告言：『聽汝出家。所以者何？佛難值故。』
^cb#60a27「於^lb是二子白父母言：『善哉，父母！願時往詣雲雷^lb音宿王華智佛所，親近供養。
所以者何？佛難^pb65得值，如優曇鉢羅華，又如一眼之龜，值浮木^lb孔。
而我等宿福深厚，生值佛法，是故父母當^lb聽我等，令得出家。所以者何？諸佛難值，時亦^lb難遇。』
^cb#60b03「彼時妙莊嚴王後宮八萬四千人，皆悉^lb堪任受持是法華經。
淨眼菩薩，於法華三昧，^lb久已通達；淨藏菩薩，已於無量百千萬億劫^pb66通達離諸惡趣三昧，欲令一切眾生離諸惡^lb趣故。
其王夫人，得諸佛集三昧，能知諸佛祕^lb密之藏。
^cb#60b08「二子如是以方便力善化其父，令心^lb信解，好樂佛法。
於是妙莊嚴王與群臣眷屬^lb俱，淨德夫人與後宮婇女眷屬俱，其王二子^lb與四萬二千人俱，一時共詣佛所。
到已，頭面^pb67禮足，繞佛三匝，却住一面。
^cb#60b14「爾時彼佛為王說^lb法，示教利喜。王大歡悅。
爾時妙莊嚴王及其^lb夫人，解頸真珠瓔珞，價直百千，以散佛上，於^lb虛空中化成四柱寶臺，臺中有大寶床，敷百^lb千萬天衣，其上有佛結加趺坐，放大光明。
爾^lb時妙莊嚴王作是念：『佛身希有，端嚴殊特，成^pb68就第一微妙之色。』時雲雷音宿王華智佛告^lb四眾言：『汝等見是妙莊嚴王，於我前合掌立^lb不？此王於我法中作比丘，精勤修習，助佛道^lb法，當得作佛，號娑羅樹王，國名大光，劫名大^lb高王。
其娑羅樹王佛，有無量菩薩眾及無量^lb聲聞，其國平正，功德如是。』其王即時以國付^pb69弟，與夫人、二子并諸眷屬，於佛法中出家修^lb道。
^cb#60b27「王出家已，於八萬四千歲，常勤精進修行^lb妙法華經。
過是已後，得一切淨功德莊嚴三^lb昧，即昇虛空，高七多羅樹，而白佛言：『世尊！此^lb我二子，已作佛事，以神通變化轉我邪心，令^lb得安住於佛法中，得見世尊。
此二子者，是我^pb70善知識，為欲發起宿世善根，饒益我故，來生^lb我家。』
^cb#60c05「爾時，雲雷音宿王華智佛告妙莊嚴王^lb言：『如是，如是！如汝所言。
若善男子、善女人，種^lb善根故，世世得善知識，其善知識，能作佛事，^lb示教利喜，令入阿耨多羅三藐三菩提。
大王！^lb當知善知識者是大因緣，所謂化導令得見^pb71佛，發阿耨多羅三藐三菩提心。
大王！汝見此^lb二子不？此二子，已曾供養六十五百千萬億^lb那由他恒河沙諸佛，親近恭敬，於諸佛所受^lb持法華經，愍念邪見眾生，令住正見。』妙莊嚴^lb王即從虛空中下，而白佛言：
『世尊！如來甚希^lb有，以功德智慧故，頂上肉髻光明顯照，其眼^pb72長廣而紺青色，眉間毫相白如珂月，齒白齊^lb密常有光明，脣色赤好如頻婆果。』
^cb#60c18「爾時妙莊^lb嚴王，讚歎佛如是等無量百千萬億功德已，^lb於如來前，一心合掌，復白佛言：『世尊！未曾有^lb也。
如來之法，具足成就不可思議微妙功德，^lb教誡所行，安隱快善，我從今日，不復自隨心^pb73行，不生邪見、憍慢、瞋恚諸惡之心。』說是語已，^lb禮佛而出。」
^cb#60c23佛告大眾：「於意云何？妙莊嚴王，豈^lb異人乎？今華德菩薩是。
其淨德夫人，今佛前^lb光照莊嚴相菩薩是。哀愍妙莊嚴王及諸眷^lb屬故，於彼中生。其二子者，今藥王菩薩、藥上^lb菩薩是。是藥王、藥上菩薩，成就如此諸大功^pb74德，已於無量百千萬億諸佛所殖眾德本，成^lb就不可思議諸善功德。
若有人識是二菩薩^lb名字者，一切世間諸天人民亦應禮拜。」
^cb#61a02佛說^lb是妙莊嚴王本事品時，八萬四千人遠塵離^lb垢，於諸法中得法眼淨。
^lb^ck28〔普賢菩薩勸發品第二十八〕
^pb75^cb#61a06爾時普賢菩薩，以自在神通力，威德名聞，與^lb大菩薩無量無邊不可稱數，從東方來。
所經^lb諸國，普皆震動，雨寶蓮華，作無量百千萬億^lb種種伎樂。
又與無數諸天、龍、夜叉、乾闥婆、阿^lb修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，大^lb眾圍繞，各現威德神通之力，到娑婆世界耆^pb76闍崛山中，頭面禮釋迦牟尼佛，右繞七匝，白^lb佛言：
「世尊，我於寶威德上王佛國，遙聞此娑^lb婆世界說法華經，與無量無邊百千萬億諸^lb菩薩眾共來聽受，唯願世尊當為說之。
若善^lb男子、善女人，於如來滅後，云何能得是法華^lb經？」
^cb#61a17佛告普賢菩薩：「若善男子、善女人，成就四^pb77法，於如來滅後，當得是法華經：一者、為諸佛^lb護念，二者、殖眾德本，三者、入正定聚，四者、發^lb救一切眾生之心。
善男子、善女人，如是成就^lb四法，於如來滅後，必得是經。」
^cb#61a22爾時普賢菩薩^lb白佛言：「世尊！於後五百歲、濁惡世中，其有受^lb持是經典者，我當守護，除其衰患，令得安隱，^pb78使無伺求得其便者，若魔、若魔子、若魔女、若^lb魔民、若為魔所著者，若夜叉、若羅剎、若鳩槃^lb茶、若毘舍闍、若吉遮、若富單那、若韋陀羅等，^lb諸惱人者，皆不得便。
是人若行、若立、讀誦此^lb經，我爾時乘六牙白象王，與大菩薩眾俱詣^lb其所，而自現身，供養守護，安慰其心，亦為供^pb79養法華經故。
是人若坐、思惟此經，爾時我復^lb乘白象王現其人前，其人若於法華經有所^lb忘失一句一偈，我當教之，與共讀誦，還令通^lb利。
爾時受持讀誦法華經者，得見我身，甚大^lb歡喜，轉復精進，以見我故，即得三昧及陀羅^lb尼，名為旋陀羅尼、百千萬億旋陀羅尼、法音^pb80方便陀羅尼，得如是等陀羅尼。
^cb#61b09「世尊！若後世^lb後五百歲、濁惡世中，比丘、比丘尼、優婆塞、優^lb婆夷，求索者、受持者、讀誦者、書寫者，欲修習^lb是法華經，於三七日中，應一心精進。
滿三七^lb日已，我當乘六牙白象，與無量菩薩而自圍^lb繞，以一切眾生所憙見身，現其人前，而為說^pb81法，示教利喜，亦復與其陀羅尼呪，得是陀羅^lb尼故，無有非人能破壞者，亦不為女人之所^lb惑亂，我身亦自常護是人。唯願世尊聽我說^lb此陀羅尼呪。」即於佛前而說呪曰：
^lb^cb#61b19「阿檀地(途賣反)(一)檀陀婆地(二)檀陀婆帝(三)檀陀鳩^lb舍隷(四)檀陀修陀隷(五)修陀隷(六)修陀羅婆^pb82底(七)佛馱波羶禰(八)薩婆陀羅尼阿婆多尼^lb(九)薩婆婆沙阿婆多尼(十)修阿婆多尼(十一)僧^lb伽婆履叉尼(十二)僧伽涅伽陀尼(十三)阿僧祇(十四)^lb僧伽波伽地(十五)帝隷阿惰僧伽兜略(盧遮反)阿^lb羅帝婆羅帝(十六)薩婆僧伽三摩地伽蘭地^lb(十七)薩婆達磨修波利剎帝(十八)薩婆薩埵樓馱^pb83憍舍略阿㝹伽地(十九)辛阿毘吉利地帝(二十)
^lb^cb#61b28「世尊！若有菩薩得聞是陀羅尼者，當知普賢^lb神通之力，若法華經行閻浮提，有受持者，應^lb作此念：『皆是普賢威神之力。』若有受持、讀誦，^lb正憶念，解其義趣，如說修行，當知是人行^lb普賢行，於無量無邊諸佛所深種善根，為諸如^pb84來手摩其頭。
若但書寫，是人命終，當生忉利^lb天上，是時八萬四千天女作眾伎樂而來迎^lb之，其人即著七寶冠，於婇女中娛樂快樂；
何^lb況受持、讀誦，正憶念，解其義趣，如說修行。
若^lb有人受持、讀誦，解其義趣，是人命終，為千佛^lb授手，令不恐怖，不墮惡趣，即往兜率天上彌^pb85勒菩薩所。
彌勒菩薩，有三十二相大菩薩眾^lb所共圍繞，有百千萬億天女眷屬，而於中生，^lb有如是等功德利益。
是故智者，應當一心自^lb書、若使人書，受持、讀誦，正憶念，如說修行。
^cb#61c14「世^lb尊！我今以神通力故，守護是經，於如來滅後^lb閻浮提內，廣令流布，使不斷絕。」
^cb#61c16爾時釋迦牟^pb86尼佛讚言：「善哉，善哉！普賢！汝能護助是經，令^lb多所眾生安樂利益。
汝已成就不可思議功^lb德，深大慈悲，從久遠來，發阿耨多羅三藐三^lb菩提意，而能作是神通之願，守護是經。
我當^lb以神通力，守護能受持普賢菩薩名者。
^cb#61c21「普賢！^lb若有受持、讀誦，正憶念，修習、書寫是法華經^pb87者，當知是人，則見釋迦牟尼佛，如從佛口聞^lb此經典；當知是人，供養釋迦牟尼佛；當知是^lb人，佛讚善哉；當知是人，為釋迦牟尼佛手摩^lb其頭；當知是人，為釋迦牟尼佛衣之所覆。
如^lb是之人，不復貪著世樂，不好外道經書、手筆，^lb亦復不喜親近其人及諸惡者——若屠兒、若畜^pb88猪羊雞狗、若獵師、若衒賣女色——是人心意質^lb直，有正憶念，有福德力，是人不為三毒所惱，^lb亦不為嫉妬、我慢、邪慢、增上慢所惱，是人少^lb欲知足，能修普賢之行。
^cb#62a09「普賢！若如來滅後後^lb五百歲，若有人見受持、讀誦法華經者，應作^lb是念：『此人不久當詣道場，破諸魔眾，得阿耨^pb89多羅三藐三菩提，轉法輪、擊法鼓、吹法螺、雨^lb法雨，當坐天人大眾中師子法座上。』
^cb#62a13「普賢！若^lb於後世，受持、讀誦是經典者，是人不復貪著^lb衣服、臥具、飲食、資生之物，所願不虛，亦於現^lb世得其福報。
若有人輕毀之，言：『汝狂人耳，空^lb作是行，終無所獲。』如是罪報，當世世無眼；若^pb90有供養讚歎之者，當於今世得現果報。
若復^lb見受持是經者，出其過惡，若實、若不實，此人^lb現世得白癩病。
若有輕笑之者，當世世牙齒踈^lb缺，醜脣、平鼻，手腳繚戾，眼目角睞，身體臭穢，^lb惡瘡、膿血、水腹、短氣、諸惡重病。
是故，普賢！若^lb見受持是經典者，當起遠迎，當如敬佛。」
^cb#62a24說是^pb91普賢勸發品時，恒河沙等無量無邊菩薩，得^lb百千萬億旋陀羅尼；三千大千世界微塵等^lb諸菩薩，具普賢道。
^cb#62a27佛說是經時，普賢等諸菩^lb薩，舍利弗等諸聲聞，及諸天、龍、人非人等，一^lb切大會，皆大歡喜，受持佛語，作禮而去。
^lb妙法蓮華經卷第七^pb92
^pb1^ak#amtb【淨土】^folio#amtb<lines=6>【阿彌陀經】^bk#amtb〔佛說阿彌陀經〕^lb^au〔　　　姚秦龜茲三藏　鳩摩羅什　譯〕
^lb^ck1【序分】
如是我聞：
一時，佛在舍衛國祇樹給孤獨園，
^lb與大比丘僧千二百五十人俱，皆是大阿羅^lb漢，眾所知識。
長老舍利弗、摩訶目乾連、摩訶^lb迦葉、摩訶迦栴延、摩訶拘絺羅、離婆多、周梨^pb2槃陀迦、難陀、阿難陀、羅睺羅、憍梵波提、賓頭^lb盧頗羅墮、迦留陀夷、摩訶劫賓那、薄俱羅、阿^lb㝹樓馱，
如是等諸大弟子，并諸菩薩摩訶薩——
^lb文殊師利法王子、阿逸多菩薩、乾陀訶提菩^lb薩、常精進菩薩——
與如是等諸大菩薩，
及釋提^lb桓因等
無量諸天大眾俱。
^pb3^ck2【極樂世界】
爾時，佛告長老舍利弗：
「從是西方過十萬億^lb佛土，有世界名曰極樂。
其土有佛，號阿彌陀，^lb今現在說法。
舍利弗！彼土何故名為極樂？
其^lb國眾生無有眾苦，但受諸樂，故名極樂。
^lb^ck3【四寶七重】
又舍利弗！極樂國土，七重欄楯、七重羅網、七^lb重行樹，皆是四寶周匝圍繞，

是故彼國名曰^pb4極樂。
^lb^ck4【寶池蓮花】
「又舍利弗！極樂國土有七寶池，

八功德水充^lb滿其中，池底純以金沙布地。


四邊階道，
金、銀、^lb琉璃、頗梨合成；
上有樓閣，
亦以金、銀、琉璃、玻^lb梨、車磲、赤珠、碼碯而嚴飾之。
池中蓮花，大如^lb車輪，青色青光，
黃色黃光，
赤色赤光，
白色白^pb5光，
微妙香潔。
舍利弗！極樂國土成就如是功^lb德莊嚴。
^lb^ck5【天雨曼華】
「又舍利弗！彼佛國土，常作天樂，黃金為地，




晝^lb夜六時，天雨曼陀羅華。
其國眾生，常以清旦，^lb各以衣裓盛眾妙華，供養他方十萬億佛；
即^lb以食時，還到本國，飯食經行。
舍利弗！極樂國^pb6土成就如是功德莊嚴。
^lb^ck6【鳥宣法音】
「復次舍利弗！彼國常有種種奇妙雜色之鳥——
^lb白鶴、孔雀、鸚鵡、舍利、迦陵頻伽、共命之鳥。
是^lb諸眾鳥，晝夜六時出和雅音，其音演暢五根、^lb五力、七菩提分、八聖道分如是等法。
其土眾^lb生聞是音已，皆悉念佛、念法、念僧。
舍利弗！汝^pb7勿謂此鳥實是罪報所生。
所以者何？彼佛國^lb土無三惡趣。
舍利弗！其佛國土尚無三惡道之^lb名，何況有實？
是諸眾鳥，皆是阿彌陀佛欲令^lb法音宣流，變化所作。

^ck7【寶樹羅網】
舍利弗！彼佛國土微風^lb吹動，諸寶行樹及寶羅網出微妙音，
譬如百^lb千種樂同時俱作，

聞是音者，皆自然生念佛、^pb8念法、念僧之心。
舍利弗！其佛國土成就如是^lb功德莊嚴。


^lb^ck8【無量光明】
「舍利弗！於汝意云何？彼佛何故號阿彌陀？
舍^lb利弗！彼佛光明無量，照十方國無所障礙，是^lb故號為阿彌陀。
^lb^ck9【無量壽命】
又舍利弗！
彼佛壽命及其人民，無量無邊阿^pb9僧祇劫，
故名阿彌陀。
舍利弗！阿彌陀佛成佛^lb已來，於今十劫。
^lb^ck10【無量弟子】



又舍利弗！彼佛有無量無邊聲聞弟子，皆阿^lb羅漢，非是算數之所能知；
諸菩薩，亦復如^lb是。
舍利弗！彼佛國土成就如是功德莊嚴。
^lb^ck11【一生補處】
「又舍利弗！極樂國土眾生生者，皆是阿鞞跋^pb10致。其中多有一生補處，
其數甚多，非是算數^lb所能知之，但可以無量無邊阿僧祇劫說。



^lb舍利弗！眾生聞者，應當發願，願生彼國。
所以^lb者何？得與如是諸上善人俱會一處。
^ck12【臨終七日】
「舍利弗！^lb不可以少善根福德因緣得生彼國。
舍利弗！^lb若有善男子、善女人，聞說阿彌陀佛，執持名^pb11號，若一日、若二日、若三日、若四日、若五日、若^lb六日、若七日，一心不亂。
其人臨命終時，阿彌^lb陀佛與諸聖眾，現在其前。
是人終時，心不顛^lb倒，即得往生阿彌陀佛極樂國土。
舍利弗！我^lb見是利，故說此言。
若有眾生聞是說者，應當^lb發願生彼國土。
^pb12^ck13【東方諸佛】
「舍利弗！如我今者，讚歎阿彌陀佛不可思議^lb功德；
東方亦有阿閦鞞佛、^lb須彌相佛、大須彌佛、須彌光佛、妙音佛，
如是等恒河沙數^lb諸佛，各於其國出廣長舌相，遍覆三千大千^lb世界，說誠實言：
『汝等眾生，當信是稱讚不可^lb思議功德一切諸佛所護念經。』
^pb13^ck14【南方諸佛】
「舍利弗！南方世界有日月燈佛、名聞光佛、大^lb焰肩佛、須彌燈佛、無量精進佛，
如是等恒河^lb沙數諸佛，各於其國出廣長舌相，遍覆三千^lb大千世界，說誠實言：
『汝等眾生，當信是稱讚^lb不可思議功德一切諸佛所護念經。』
^lb^ck15【西方諸佛】
「舍利弗！西方世界有無量壽佛、無量相佛、無^pb14量幢佛、大光佛、大明佛、寶相佛、淨光佛，
如是^lb等恒河沙數諸佛，各於其國出廣長舌相，遍^lb覆三千大千世界，說誠實言：
『汝等眾生，當信^lb是稱讚不可思議功德一切諸佛所護念經。』
^lb^ck16【北方諸佛】
「舍利弗！北方世界有焰肩佛、最勝音佛、難沮^lb佛、日生佛、網明佛，
如是等恒河沙數諸佛，各^pb15於其國出廣長舌相，遍覆三千大千世界，說^lb誠實言：
『汝等眾生，當信是稱讚不可思議功^lb德一切諸佛所護念經。』
^lb^ck17【下方諸佛】
「舍利弗！下方世界有師子佛、名聞佛、名光佛、^lb達摩佛、法幢佛、持法佛，
如是等恒河沙數諸^lb佛，各於其國出廣長舌相，遍覆三千大千世^pb16界，說誠實言：
『汝等眾生，當信是稱讚不可思^lb議功德一切諸佛所護念經。』
^lb^ck18【上方諸佛】
「舍利弗！上方世界有梵音佛、宿王佛、香上佛、^lb香光佛、大焰肩佛、雜色寶華嚴身佛、娑羅樹^lb王佛、寶華德佛、見一切義佛、如須彌山佛，
如^lb是等恒河沙數諸佛，各於其國出廣長舌相，^pb17遍覆三千大千世界，說誠實言：
『汝等眾生，當^lb信是稱讚不可思議功德一切諸佛所護念^lb經。』
^ck19【東南諸佛】



^ck20【西南諸佛】



^ck21【西北諸佛】



^ck22【東北諸佛】



^ck23【佛所護念】
「舍利弗！於汝意云何？何故名為『一切諸佛^lb所護念經』？
舍利弗！若有善男子、善女人，聞是^lb經受持者，及聞諸佛名者；
是諸善男子、善女^lb人，皆為一切諸佛共所護念，皆得不退轉於^pb18阿耨多羅三藐三菩提。
是故舍利弗！汝等皆^lb當信受我語及諸佛所說。
^lb^ck24【三願三生】
「舍利弗！若有人已發願、今發願、當發願，欲生^lb阿彌陀佛國者；
是諸人等，皆得不退轉於阿^lb耨多羅三藐三菩提，於彼國土若已生、若今^lb生、若當生。
是故舍利弗！諸善男子、善女人若^pb19有信者，應當發願生彼國土。
^lb^ck25【穢土成佛】
「舍利弗！如我今者，稱讚諸佛不可思議功德；^lb彼諸佛等，亦稱說我不可思議功德，而作是^lb言：
『釋迦牟尼佛能為甚難希有之事，
能於娑^lb婆國土五濁惡世，劫濁、見濁、煩惱濁、眾生濁、^lb命濁中，得阿耨多羅三藐三菩提，為諸眾生^pb20說是一切世間難信之法。』
^lb^ck26【難信之法】
舍利弗！當知我於五濁惡世行此難事，得阿^lb耨多羅三藐三菩提，
為一切世間說此難信^lb之法，是為甚難！」
^lb^ck27【流通分】
佛說此經已，
舍利弗及諸比丘，
一切世間天、^lb人、阿修羅等，聞佛所說，歡喜信受，作禮而去。
^pb21
^pb1^lb^lb^lb^lb^folio#amtb_xuanzang<lines=6>【玄奘】^bk#amtb_xuanzang〔稱讚淨土佛攝受經〕
^pb2^au〔　　　　　大唐三藏法師玄奘奉　詔譯〕
^lb^ck1【序分】
如是我聞：
一時，薄伽梵在室羅筏住誓多林^lb給孤獨園，
與大苾芻眾千二百五十人俱，一^lb切皆是尊宿聲聞眾望所識大阿羅漢，
其名^lb曰：尊者舍利子、摩訶目犍連、摩訶迦葉、阿泥^lb律陀，如是等諸大聲聞而為上首。
復與無量^pb3菩薩摩訶薩俱，一切皆住不退轉位，無量功^lb德眾所莊嚴，
其名曰：妙吉祥菩薩、無能勝菩^lb薩、常精進菩薩、不休息菩薩，
如是等諸大菩^lb薩而為上首。
復有帝釋、大梵天王、堪忍界主、^lb護世四王，
如是上首百千俱胝那庾多數諸^lb天子眾，及餘世間無量天、人、阿素洛等，為聞^pb4法故，俱來會坐。
^lb^ck2【極樂世界】
爾時，世尊告舍利子：
「汝今知不？於是西方，去^lb此世界過百千俱胝那庾多佛土，有佛世界^lb名曰極樂。
其中世尊名無量壽及無量光，如^lb來、應、正等覺十號圓滿，今現在彼安隱住持，^lb為諸有情宣說甚深微妙之法，令得殊勝利^pb5益安樂。
「又，舍利子！何因何緣，彼佛世界名為^lb極樂？
舍利子！由彼界中諸有情類，無有一切^lb身心憂苦，唯有無量清淨喜樂，是故名為極^lb樂世界。
^ck3【四寶七重】
「又，舍利子！極樂世界淨佛土中，處處^lb皆有七重行列妙寶欄楯、七重行列寶多羅^lb樹，及有七重妙寶羅網，周匝圍繞，四寶莊嚴——
^pb6金寶、銀寶、吠琉璃寶、頗胝迦寶，妙飾間綺。
舍^lb利子！彼佛土中有如是等眾妙綺飾，功德莊^lb嚴甚可愛樂，是故名為極樂世界。
^lb^ck4【寶池蓮花】
「又，舍利子！極樂世界淨佛土中，處處皆有七^lb妙寶池，

八功德水彌滿其中。何等名為八功^lb德水？
一者澄淨，二者清冷，三者甘美，四者輕^pb7軟，五者潤澤，六者安和，七者飲時除飢渴等^lb無量過患，八者飲已定能長養諸根四大；
增^lb益種種殊勝善根，多福眾生常樂受用。
是諸^lb寶池底布金沙，四面周匝有四階道，四寶莊^lb嚴甚可愛樂。

諸池周匝有妙寶樹，間飾行列^lb香氣芬馥，七寶莊嚴甚可愛樂。
言七寶者，一^pb8金、二銀、三吠琉璃、四頗胝迦、五赤真珠、六阿^lb濕摩揭拉婆寶、七牟娑落揭拉婆寶。
是諸池^lb中常有種種雜色蓮華，量如車輪，青形青顯^lb青光青影，
黃形黃顯黃光黃影，
赤形赤顯赤^lb光赤影，
白形白顯白光白影，
四形四顯四光^lb四影。
舍利子！彼佛土中有如是等眾妙綺飾，^pb9功德莊嚴甚可愛樂，是故名為極樂世界。
^lb^ck5【天雨曼華】
「又，舍利子！極樂世界淨佛土中，自然常有無^lb量無邊眾妙伎樂，音曲和雅甚可愛樂。
諸有^lb情類聞斯妙音，諸惡煩惱悉皆消滅，無量善^lb法漸次增長，速證無上正等菩提。
舍利子！彼^lb佛土中有如是等眾妙綺飾，功德莊嚴甚可^pb10愛樂，是故名為極樂世界。
^lb「又，舍利子！極樂世界淨佛土中，周遍大地真^lb金合成，其觸柔軟，香潔光明，無量無邊妙寶^lb間飾。
舍利子！彼佛土中有如是等眾妙綺飾，^lb功德莊嚴甚可愛樂，是故名為極樂世界。
^lb「又，舍利子！極樂世界淨佛土中，晝夜六時常^pb11雨種種上妙天華，光澤香潔，細軟雜色，雖令^lb見者身心適悅而不貪著，增長有情無量無^lb數不可思議殊勝功德。
彼有情類，晝夜六時^lb常持供養無量壽佛；每晨朝時，持此天華，於^lb一食頃，飛至他方無量世界，供養百千俱胝^lb諸佛，
於諸佛所各以百千俱胝樹花持散供^pb12養，還至本處遊天住等。
舍利子！彼佛土中有^lb如是等眾妙綺飾，功德莊嚴甚可愛樂，是故^lb名為極樂世界。
^lb^ck6【寶樹羅網】
「又，舍利子！極樂世界淨佛土中，常有種種奇^lb妙可愛雜色眾鳥，所謂：
鵝鴈、鶖鷺、鴻鶴、孔雀、^lb鸚鵡、羯羅頻迦、命命鳥等。
如是眾鳥，晝夜六^pb13時恒共集會，出和雅聲，隨其類音宣揚妙法，^lb所謂：甚深念住、正斷、神足、根、力、覺、道支等無^lb量妙法。
彼土眾生聞是聲已，各得念佛、念法、^lb念僧無量功德熏修其身。
汝舍利子，於意云^lb何？彼土眾鳥豈是傍生惡趣攝耶？勿作是見。
^lb所以者何？彼佛淨土無三惡道，尚不聞有三^pb14惡趣名，何況有實罪業所招傍生！
眾鳥當知^lb皆是無量壽佛變化所作，
令其宣暢無量法^lb音，作諸有情利益安樂。
舍利子！彼佛土中有^lb如是等眾妙綺飾，功德莊嚴甚可愛樂，是故^lb名為極樂世界。
^lb^ck7【寶樹羅網】
「又，舍利子！極樂世界淨佛土中，常有妙風吹^pb15諸寶樹及寶羅網出微妙音。
譬如百千俱胝^lb天樂同時俱作，出微妙聲甚可愛玩；
如是彼^lb土常有妙風吹眾寶樹及寶羅網，擊出種種^lb微妙音聲說種種法。
彼土眾生聞是聲已，起^lb佛、法、僧念作意等無量功德。
舍利子！彼佛土^lb中有如是等眾妙綺飾，功德莊嚴甚可愛樂，^pb16是故名為極樂世界。
^lb「又，舍利子！極樂世界淨佛土中，有如是等無^lb量無邊不可思議甚希有事。
假使經於百千^lb俱胝那庾多劫，以其無量百千俱胝那庾多^lb舌，一一舌上出無量聲讚其功德亦不能盡，^lb是故名為極樂世界。
^ck8【無量光明】


^ck9【無量壽命】
^pb17「又，舍利子！極樂世界淨佛土中，佛有何緣名^lb無量壽？
舍利子！由彼如來及諸有情，壽命無^lb量無數大劫；
由是緣故，彼土如來名無量壽。
^lb舍利子！無量壽佛證得阿耨多羅三藐三菩^lb提已來經十大劫。
^ck10【無量弟子】
舍利子！何緣彼佛名無量^lb光？
舍利子！由彼如來恒放無量無邊妙光，遍^pb18照一切十方佛土，施作佛事無有障礙；
由是^lb緣故，彼土如來名無量光。
舍利子！彼佛淨土^lb成就如是功德莊嚴甚可愛樂，是故名為極^lb樂世界。
^lb「又，舍利子！極樂世界淨佛土中，無量壽佛常^lb有無量聲聞弟子，一切皆是大阿羅漢，具足^pb19種種微妙功德，其量無邊不可稱數。
舍利子！^lb彼佛淨土成就如是功德莊嚴甚可愛樂，是^lb故名為極樂世界。
^lb^ck11【一生補處】
「又，舍利子！極樂世界淨佛土中，無量壽佛常^lb有無量菩薩弟子，一切皆是一生所繫，
具足^lb種種微妙功德，其量無邊不可稱數，假使經^pb20於無數量劫讚其功德終不能盡。
舍利子！彼^lb佛土中成就如是功德莊嚴甚可愛樂，是故^lb名為極樂世界。
^lb「又，舍利子！若諸有情生彼土者皆不退轉，必^lb不復墮諸險惡趣、邊地下賤蔑戾車中，常遊^lb諸佛清淨國土，殊勝行願念念增進，決定當^pb21證阿耨多羅三藐三菩提。
舍利子！彼佛土中^lb成就如是功德莊嚴甚可愛樂，是故名為極^lb樂世界。
^lb「又，舍利子！若諸有情聞彼西方無量壽佛清^lb淨佛土無量功德眾所莊嚴，皆應發願生彼^lb佛土。
所以者何？若生彼土，得與如是無量功^pb22德眾所莊嚴諸大士等同一集會，受用如是^lb無量功德眾所莊嚴清淨佛土，大乘法樂常^lb無退轉，無量行願念念增進，速證無上正等^lb菩提。
^ck12【臨終七日】
故，舍利子！生彼佛土諸有情類成就無^lb量無邊功德，非少善根諸有情類當得往生^lb無量壽佛極樂世界清淨佛土。
^pb23「又，舍利子！若有淨信諸善男子或善女人，得^lb聞如是無量壽佛無量無邊不可思議功德^lb名號、極樂世界功德莊嚴，聞已思惟，若一日^lb夜，或二、或三、或四、或五、或六、或七，繫念不亂。
^lb是善男子或善女人臨命終時，無量壽佛與^lb其無量聲聞弟子、菩薩眾俱前後圍繞，來住^pb24其前，慈悲加祐，令心不亂；
既捨命已，隨佛眾^lb會，生無量壽極樂世界清淨佛土。
^lb「又，舍利子！我觀如是利益安樂大事因緣，說^lb誠諦語。
若有淨信諸善男子或善女人，得聞^lb如是無量壽佛不可思議功德名號、極樂^lb界淨佛土者，一切皆應信受發願，如說修行，^pb25生彼佛土。
^lb^ck13【東方諸佛】
「又，舍利子！如我今者，稱揚讚歎無量壽佛無^lb量無邊不可思議佛土功德；
如是東方亦有^lb現在不動如來、山幢如來、大山如來、山光如^lb來、妙幢如來，
如是等佛如殑伽沙住在東方，^lb自佛淨土各各示現廣長舌相遍覆三千大^pb26千世界周匝圍繞，說誠諦言：
『汝等有情皆應^lb信受如是稱讚不可思議佛土功德一切諸^lb佛攝受法門。』
^lb^ck14【南方諸佛】
「又，舍利子！如是南方亦有現在日月光如來、^lb名稱光如來、大光蘊如來、迷盧光如來、無邊^lb精進如來，
如是等佛如殑伽沙住在南方，自^pb27佛淨土各各示現廣長舌相遍覆三千大千^lb世界周匝圍繞，說誠諦言：
『汝等有情皆應信^lb受如是稱讚不可思議佛土功德一切諸佛^lb攝受法門。』
^lb^ck15【西方諸佛】
「又，舍利子！如是西方亦有現在無量壽如來、無^lb量蘊如來、無量光如來、無量幢如來、大自在^pb28如來、大光如來、光焰如來、大寶幢如來、放光^lb如來，
如是等佛如殑伽沙住在西方，自佛淨^lb土各各示現廣長舌相遍覆三千大千世界^lb周匝圍繞，說誠諦言：
『汝等有情皆應信受如^lb是稱讚不可思議佛土功德一切諸佛攝受^lb法門。』
^pb29^ck16【北方諸佛】
「又，舍利子！如是北方亦有現在無量光嚴通^lb達覺慧如來、無量天鼓震大妙音如來、大蘊^lb如來、光網如來、娑羅帝王如來，
如是等佛如^lb殑伽沙住在北方，自佛淨土各各示現廣長^lb舌相遍覆三千大千世界周匝圍繞，說誠諦^lb言：
『汝等有情皆應信受如是稱讚不可思議^pb30佛土功德一切諸佛攝受法門。』
^lb^ck17【下方諸佛】
「又，舍利子！如是下方亦有現在示現一切妙^lb法正理常放火王勝德光明如來、師子如來、^lb名稱如來、譽光如來、正法如來、妙法如來、法^lb幢如來、功德友如來、功德號如來，
如是等佛^lb如殑伽沙住在下方，自佛淨土各各示現廣^pb31長舌相遍覆三千大千世界周匝圍繞，說誠^lb諦言：
『汝等有情皆應信受如是稱讚不可思^lb議佛土功德一切諸佛攝受法門。』
^lb^ck18【上方諸佛】
「又，舍利子！如是上方亦有現在梵音如來、宿^lb王如來、香光如來、如紅蓮華勝德如來、示現^lb一切義利如來，
如是等佛如殑伽沙住在上^pb32方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck19【東南諸佛】
「又，舍利子！如是東南方亦有現在最上廣大^lb雲雷音王如來，
如是等佛如殑伽沙住東南^pb33方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck20【西南諸佛】
「又，舍利子！如是西南方亦有現在最上日光^lb名稱功德如來，
如是等佛如殑伽沙住西南^pb34方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck21【西北諸佛】
「又，舍利子！如是西北方亦有現在無量功德^lb火王光明如來，
如是等佛如殑伽沙住西北^pb35方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck22【東北諸佛】
「又，舍利子！如是東北方亦有現在無數百千^lb俱胝廣慧如來，
如是等佛如殑伽沙住東北^pb36方，自佛淨土各各示現廣長舌相遍覆三千^lb大千世界周匝圍繞，說誠諦言：
『汝等有情皆^lb應信受如是稱讚不可思議佛土功德一切^lb諸佛攝受法門。』
^lb^ck23【佛所護念】
「又，舍利子！何緣此經名為『稱讚不可思議佛^lb土功德一切諸佛攝受法門』？舍利子！由此經^pb37中稱揚讚歎無量壽佛極樂世界不可思議^lb佛土功德，及十方面諸佛世尊為欲方便利^lb益安樂諸有情故，各住本土現大神變說誠^lb諦言，勸諸有情信受此法，是故此經名為『稱^lb讚不可思議佛土功德一切諸佛攝受法門』。
^lb「又，舍利子！若善男子或善女人，或已得聞，或^pb38當得聞，或今得聞，聞是經已，深生信解；生信^lb解已，必為如是住十方面十殑伽沙諸佛世^lb尊之所攝受；
如說行者，一切定於阿耨多羅^lb三藐三菩提得不退轉，一切定生無量壽佛^lb極樂世界清淨佛土。
是故，舍利子！汝等有情^lb一切皆應信受領解我及十方佛世尊語，當^pb39勤精進，如說修行，勿生疑慮。
^lb^ck24【三願三生】
「又，舍利子！若善男子或善女人，於無量壽極^lb樂世界清淨佛土功德莊嚴，若已^lb發願，若當發願，若今發願，必為如是住十方面十殑伽^lb沙諸佛世尊之所攝受；
如說行者，一切定於^lb阿耨多羅三藐三菩提得不退轉，一切定生^pb40無量壽佛極樂世界清淨佛土。
是故，舍利子！^lb若有淨信諸善男子或善女人，一切皆應於^lb無量壽極樂世界清淨佛土，深心信解，發願^lb往生，勿行放逸。
^lb^ck25【穢土成佛】
「又，舍利子！如我今者，稱揚讚歎無量壽^lb佛極樂世界不可思議佛土功德；彼十方面^pb41諸佛世尊，亦稱讚我不可思議無邊功德，皆^lb作是言：
『甚奇希有！釋迦寂靜釋迦法王如來、^lb應、正等覺、明行圓滿、善逝、世間解、無上丈夫、^lb調御士、天人師、佛世尊，乃能於是堪忍世界^lb五濁惡時，所謂：
劫濁、諸有情濁、諸煩惱濁、見^lb濁、命濁，於中證得阿耨多羅三藐三菩提，為^pb42欲方便利益安樂諸有情故，說是世間極難^lb信法。』
是故，舍利子！當知我今於此雜染堪忍^lb世界五濁惡時，證得阿耨多羅三藐三菩提，^lb為欲方便利益安樂諸有情故，說是世間極^lb難信法，甚為希有，不可思議。
^lb^ck26【難信之法】
「又，舍利子！於此雜染堪忍世界五濁惡時，若^pb43有淨信諸善男子或善女人，聞說如是一切^lb世間極難信法，能生信解、受持、演說、如教修^lb行。當知是人甚為希有，無量佛所曾種善根。
^lb是人命終定生西方極樂世界，受用種種功^lb德莊嚴清淨佛土大乘法樂，日夜六時親近^lb供養無量壽佛，遊歷十方供養諸佛，於諸佛^pb44所聞法受記，福慧資糧疾得圓滿，速證無上^lb正等菩提。」
^lb^ck27【流通分】
時，薄伽梵說是經已。
尊者舍利子等諸大聲聞，
^lb及諸菩薩摩訶薩眾，無量天、人、阿素洛等，一^lb切大眾聞佛所說皆大歡喜信受奉行。
^lb稱讚淨土佛攝受經^pb45
^pb1^folio#svv1【無量壽經】^bk#svv〔佛說無量壽經卷上〕^ck0【序】
^lb^au〔曹魏天竺三藏康僧鎧譯〕


^ck1
^lb我聞如是：
一時佛住王舍城耆闍崛山中，與^lb大比丘眾萬二千人俱，一切大聖神通已達，



^ck2
^lb其名曰：尊者了本際、尊者正願、尊者正語、尊^pb2者大號、尊者仁賢、尊者離垢、尊者名聞、
尊者^lb善實、尊者具足、尊者牛王、尊者優樓頻䗍迦^lb葉、尊者伽耶迦葉、尊者那提迦葉、尊者摩訶^lb迦葉、
尊者舍利弗、尊者大目揵連、尊者劫賓^lb那、尊者大住、尊者大淨志、尊者摩訶周那、尊^pb3者滿願子、尊者離障閡、
尊者流灌、尊者堅伏、尊^lb者面王、尊者果乘、尊者仁性、尊者喜樂、尊者^lb善來、
尊者羅云、尊者阿難，


皆如斯等上首者^lb也。

^ck3
又與大乘眾菩薩俱，普賢菩薩、妙德菩薩、^lb慈氏菩薩等，此賢劫中一切菩薩。
又賢護等^pb4十六正士：善思議菩薩、信慧菩薩、空無菩薩、^lb神通華菩薩、光英菩薩、慧上菩薩、智幢菩薩、^lb寂根菩薩、願慧菩薩、香象菩薩、寶英菩薩、中^lb住菩薩、制行菩薩、解脫菩薩，
皆遵普賢大士^lb之德，
^ck4
具諸菩薩無量行願，安住一切功德之^pb5法，遊步十方，行權方便，入佛法藏，究竟彼岸，
^lb於無量世界現成等覺。
處兜率天弘宣正法，^lb捨彼天宮降神母胎，從右脇生，現行七步。
光^lb明顯曜，普照十方無量佛土，六種振動，舉聲^lb自稱：
「吾當於世為無上尊，釋梵奉侍，天、人歸^pb6仰。」
示現算計、文藝、射御，博綜道術，貫練群籍，^lb遊於後園講武試藝。
現處宮中色味之間，見^lb老、病、死，悟世非常，棄國財位，入山學道，
服乘、^lb白馬、寶冠、瓔珞，遣之令還。
捨珍妙衣而著法^lb服，剃除鬚髮，端坐樹下。
勤苦六年，行如所應。
^pb7現五濁剎隨順群生，示有塵垢沐浴金流。
天^lb按樹枝得攀出池，靈禽翼從往詣道場，吉祥^lb感徵表章功祚。
哀受施草，敷佛樹下，加趺而^lb坐，
^ck5
奮大光明使魔知之。
魔率官屬而來逼試，^lb制以智力皆令降伏，得微妙法成最正覺。
釋^pb8梵祈勸請轉法輪，以佛遊步、佛吼而吼，扣法^lb鼓、吹法螺、執法劍、建法幢、震法雷、曜法電、澍^lb法雨、演法施，常以法音覺諸世間，
光明普照^lb無量佛土。
一切世界六種震動，
總攝魔界、動^lb魔宮殿，眾魔懾怖莫不歸伏。
摑裂邪網，消滅^pb9諸見，散諸塵勞，壞諸欲塹。
嚴護法城，開闡法^lb門；洗濯垢污，顯明清白；光融佛法，宣流正化。
^lb入國分衛獲諸豐饍，貯功德、示福田、欲宣法、
^lb現欣笑，以諸法藥救療三苦。
顯現道意無量^lb功德，授菩薩記成等正覺，示現滅度拯濟無^pb10極。
消除諸漏，殖眾德本，具足功德微妙難量。
^ck6
^lb遊諸佛國，普現道教，其所修行清淨無穢。
譬^lb如幻師現眾異像，為男、為女無所不變，本學^lb明了在意所為。
此諸菩薩亦復如是，學一切^lb法貫綜縷練，所住安諦靡不感化，無數佛土^pb11皆悉普現，未曾慢恣、愍傷眾生。
如是之法一^lb切具足，菩薩經典究暢要妙，名稱普至導御^lb十方，無量諸佛咸共護念。
佛所住者皆已得^lb住、大聖所立而皆已立，
如來道化各能宣布，^lb為諸菩薩而作大師。
以甚深禪慧開導眾人，^pb12通諸法性，達眾生相，明了諸國，供養諸佛。
化^lb現其身猶如電光，善學無畏曉了幻化^lb之法。
壞裂魔網，解諸纏縛。
超越聲聞、緣覺之^lb地，得空無相、無願三昧。
善立方便，顯示三乘。
^lb於此中下而現滅度，亦無所作、亦無所有，不^pb13起、不滅得平等法。
具足成就無量總持百千^lb三昧，諸根智慧廣普寂定，
深入菩薩法藏，得^lb佛華嚴三昧。
宣揚演說一切經典，
^ck7
住深定門，^lb悉覩現在無量諸佛，一念之頃無不周遍。
濟^lb諸劇難諸閑不閑，分別顯示真實之際，得諸^pb14如來辯才之智。
入眾言音，開化一切，超過世^lb間諸所有法。
心常諦住度世之道，於一切萬^lb物隨意自在。
為眾生類作不請之友，荷負^lb群生為之重任。
受持如來甚深法藏，護佛種^lb性常使不絕。
興大悲、愍眾生，演慈辯、授法眼、^pb15杜三趣、開善門，
以不請之法施諸黎庶，猶如^lb孝子愛敬父母。
於諸眾生視之若己，
一切^lb善本皆度彼岸，悉獲諸佛無量功德，智慧聖^lb明不可思議。
如是菩薩無量大士不可稱計，^lb一時來會。
^ck8
爾時，世尊諸根悅豫，姿色清淨，光^pb16顏巍巍。
尊者阿難承佛聖旨，即從座起，偏袒^lb右肩，長跪合掌而白佛言：
「今日世尊諸根悅^lb豫，姿色清淨，光顏巍巍，如明鏡淨影暢表裏，




^lb威容顯耀超絕無量，未曾瞻覩殊妙如今。
唯^lb然，大聖！我心念言：
『今日世尊住奇特法、今^pb17日世雄住佛所住、今日世眼住導師行、
^lb今日世英住最勝道、今日天尊行如來^lb德。
去來現在佛佛相念，得無今佛念諸佛耶？^lb何故威神光光乃爾？』」
^ck9
於是世尊告阿難曰：「云^lb何，阿難！
諸天教汝來問佛耶？
自以慧見問威^pb18顏乎？」
^ck10
阿難白佛：「無有諸天來教我者，自以所^lb見問斯義耳。」




^ck11
佛言：「善哉，阿難！所問甚快。
發深^lb智慧真妙辯才，
愍念眾生問斯慧義。

^ck12
如來以^lb無盡大悲矜哀三界，所以出興於世，光闡道^lb教，欲拯濟群萌惠以真實之利。無量億劫難^pb19值難見，猶靈瑞華時時乃出。今所問者多所^lb饒益，開化一切諸天人民。
「阿難！當知如來正^lb覺其智難量，多所導御，慧見無礙，無能遏絕。
^ck13
^lb以一喰之力，
能住壽命億百千劫無數無量，^lb復過於此。
諸根悅豫不以毀損，姿色不變光^pb20顏無異。
所以者何？如來定慧究暢無極，於一^lb切法而得自在。
^ck14



^ck15


「阿難諦聽，今為汝說。」
對曰：「唯^lb然，願樂欲聞。」
^ck16
佛告阿難：「乃往過去久遠無量^lb不可思議無央數劫，
錠光如來興出於世，教^lb化度脫無量眾生，皆令得道乃取滅度。
次有^pb21如來名曰光遠、
次名月光、
次名栴檀香、次名^lb善山王、
次名須彌天冠、次名須彌等曜、
^ck17
次名^lb月色、
次名正念、
次名離垢、次名無著、
次名龍^lb天、
次名夜光、
次名安明頂、次名不動地、
次名^lb琉璃妙華、
次名琉璃金色、次名金藏、
次名炎^pb22光、
次名炎根、
次名地種、

次名月像、
次名日音、
^lb次名解脫華、
次名莊嚴光明、
次名海覺神通、
^lb次名水光、
次名大香、
次名離塵垢、名捨厭^lb意、
次名寶炎、次名妙頂、
次名勇立、
^ck18
次名功德^lb持慧、
次名蔽日月光、
次名日月琉璃光、次名^pb23無上琉璃光、
次名最上首、
次名菩提華、











^ck19

次名^lb月明、
次名日光、次名華色王、
次名水月光、
次^lb名除癡冥、



















^ck20
次名度蓋行、
次名淨信、
次名善宿、
次^lb名威神、
次名法慧、
次名鸞音、
次名師子音、
^lb次名龍音、
次名處世，



如此諸佛皆悉已過。
^ck21
「爾^pb24時，次有佛名世自在王如來、應供、等正覺、明^lb行足、善逝、世間解、無上士、調御丈夫、天人師、^lb佛、世尊。
^ck22
時有國王，聞佛說法心懷悅豫，尋發^lb無上正真道意，
棄國、捐王，行作沙門，號曰法^lb藏，高才勇哲與世超異。
^ck23
詣世自在王如來所，^pb25稽首佛足，
右遶三匝，長跪合掌以頌讚曰：
^ck24
^lb^gatha「『光顏巍巍，威神無極，
如是炎明，無與等者。
^lb^gatha日月摩尼，珠光炎耀，
皆悉隱蔽，猶如聚墨。
^ck25
^lb^gatha如來容顏，超世無倫，
正覺大音，響流十方。
^lb^gatha戒聞精進，三昧智慧，
威德無侶，殊勝希有。
^ck26
^pb26深諦善念，
諸佛法海，
窮深盡奧，
究其崖底。
^ck27
^lb無明、欲、怒，世尊永無，人雄師子，神德無量。
^lb功德廣大，智慧深妙，光明威相，震動大千。
^lb願我作佛，齊聖法王，
過度生死，靡不解脫。
^ck28
^lb布施、調意、戒、忍、精進，
如是三昧，智慧為上。
^pb27吾誓得佛，普行此願，
一切恐懼，為作大安。
^ck29
^lb假令有佛，百千億萬，
無量大聖，數如恒沙，
^lb供養一切，斯等諸佛，
不如求道，堅正不却。
^ck30
^lb譬如恒沙，諸佛世界，
復不可計，無數剎土，
^lb光明悉照，遍此諸國，
如是精進，威神難量。
^ck31
^pb28令我作佛，國土第一，
其眾奇妙，道場超絕。
^lb國如泥洹，而無等雙，
我當愍哀，度脫一切。
^ck32
^lb十方來生，心悅清淨，
已到我國，快樂安隱。
^lb幸佛信明，是我真證，
發願於彼，力精所欲。
^ck33
^lb十方世尊，智慧無礙，
常令此尊，知我心行。
^pb29假令身止，諸苦毒中，
我行精進，忍終不悔。』」
^ck34
^lb佛告阿難：「法藏比丘說此頌已而白佛言：
『唯^lb然，世尊！我發無上正覺之心，

^ck35
願佛為我廣宣^lb經法，
我當修行，攝取佛國清淨莊嚴無量妙^lb土，
令我於世速成正覺，拔諸生死勤苦之本。』」
^ck36
^pb30佛告阿難：「時世自在王佛告法藏比丘：
『如所^lb修行莊嚴佛土，汝自當知。』
「比丘白佛：『斯義弘^lb深，非我境界。
唯願世尊廣為敷演諸佛如來^lb淨土之行。
我聞此已，當如說修行成滿所願。』
^ck37
^lb「爾時，世自在王佛知其高明志願深廣，即為^pb31法藏比丘而說經言：
『譬如大海，一人斗量，經^lb歷劫數尚可窮底，得其妙寶。人有至心精進，^lb求道不止，會當剋果，何願不得？』
「於是，世自在^lb王佛即為廣說二百一十億諸佛剎土天人^lb之善惡、國土之粗妙，應其心願悉現與之。
^ck38
「時^pb32彼比丘聞佛所說嚴淨國土，皆悉覩見。
超發^lb無上殊勝之願，其心寂靜，志無所著，一切世^lb間無能及者。
^ck39
具足五劫，思惟攝取莊嚴佛國^lb清淨之行。」
^ck40
阿難白佛：「彼佛國土壽量幾何？」
佛^lb言：「其佛壽命四十二劫。
「時法藏比丘攝取二^pb33百一十億諸佛妙土清淨之行。
^ck41
如是修已，詣^lb彼佛所，稽首禮足，遶佛三匝，合掌而住，白^lb言：
『世尊！我已攝取莊嚴佛土清淨之行。』
「佛告^lb比丘：『汝今可說，宜知是時。發起悅可一切大^lb眾。
菩薩聞已，修行此法，緣致滿足無量大願。』
^ck42
^pb34「比丘白佛：
『唯垂聽察，如我所願，當具說之。

^ck43
「『設^lb我得佛，
國有地獄、餓鬼、畜生者，
不取正覺。
^ck44
「『設^lb我得佛，
國中人天壽終之後復更三惡道者，
^lb不取正覺。
^ck45
「『設我得佛，
國中人天不悉真金色^lb者`)