jsonp(1,{"name":"yinshun","start":0},`^ak#miaoyun【妙雲集】

      
      　　印順導師著作總目
        　　壹、妙雲集
          
◆（全集共二十四冊，上、中、下三編，民國五八年至六二年出版）
          
            上編
               一　般若經講記 (1) ………………………………………民國六二年初版
               　妙雲集序目
                      １. 金剛般若波羅蜜經講記………………民國三一年講，三七年初版
                      ２. 般若波羅蜜多心經講記………………民國三六年講，三九年初版              
              二　寶積經講記 (2) …………………………民國五一年講，五三年初版
              三　勝鬘經講記 (3) …………………………民國四〇年講，四一年初版
              四　藥師經講記 (4) …………………………民國四三年講，四四年初版
              五　中觀論頌講記 (5) ………………………民國三一年講，四一年初版
              六　攝大乘論講記 (6) ………………………民國三〇年講，三五年初版
              七　大乘起信論講記 (7) ……………………民國三九年講，四〇年初版
           中編
              一　佛法概論 (8) …………………………民國三八年初版，四三年重版
              二　中觀今論 (9) ……………………………民國三六年講，三九年初版
              三　唯識學探源 (10)…………………………民國二九年撰，三三年初版
              四　性空學探源 (11) …………………………民國三三年講，三九年初版
              五　成佛之道 (12) …………………………………………民國四九年初版
              六　太虛大師年譜 (13) ……………………………………民國三九年初版            
          下編
              一　佛在人間 (14) …………………………………………民國六〇年初版
              二　學佛三要 (15) …………………………………………民國六〇年初版
              三　以佛法研究佛法 (16) …………………………………民國六一年初版
              四　淨土與禪 (17) …………………………………………民國五九年初版
              五　青年的佛教 (18) ………………………………………民國六二年初版
              六　我之宗教觀 (19) ………………………………………民國六一年初版
              七　無諍之辯 (20) …………………………………………民國六一年初版
              八　教制教典與教學 (21) …………………………………民國六一年初版
              九　佛教史地考論 (22) ……………………………………民國六二年初版
              十　華雨香雲 (23) …………………………………………民國六二年初版
              十一　佛法是救世之光 (24) ………………………………民國六二年初版         
          
        
        
          
          　　貳、華雨集
          
◆（全集共五冊，民國八二年初版）
          
            第一冊
                一　大樹緊那羅王所問經偈頌講記…………………………民國五四年講
                二　楞伽阿跋多羅寶經釋題…………………………………民國四六年撰
                三　辨法法性論講記…………………………………………民國五三年講
                四　往生淨土論講記…………………………………………民國五二年講
                五　精校燉煌本壇經…………………………………………民國五九年撰            
            第二冊（方便之道）
                上編——「佛法」……………………………………………民國七四年撰
                中編——「大乘佛法」………………………………………民國七四年撰            
            第三冊
            第四冊
            第五冊
          
        
        
          
          　　參、單部專著類
          
◆（依筆劃順序，共九冊）
          
            一　中國古代民族神話與文化之研究……民國六四年初版（華岡），七九年再版（正聞）
                序……………………………………………………………………一——六
                第一章　序論………………………………………………………………一
                第二章　神羊族系………………………………………………………四七
                第三章　神鳥族系………………………………………………………八一
                第四章　神魚族系……………………………………………………一四七
          
                第五章　神龍族系……………………………………………………二三七
                第六章　古代史話雜考………………………………………………二七七
                第七章　四靈之研究…………………………………………………三二九
                第八章　羊與文化……………………………………………………三九一
                第九章　鳳與文化……………………………………………………四三三
                第十章　龍蛇與文化…………………………………………………四八五
                參考書目………………………………………………………………五三一            
            二　中國禪宗史………………………………………………民國六〇年初版
            三　如來藏之研究……………………………………………民國七〇年初版
            四　印度之佛教………………………………民國三二年初版，七四年重版
            五　印度佛教思想史…………………………………………民國七七年初版
            六　空之探究…………………………………………………民國七四年初版
            七　初期大乘佛教之起源與開展……………………………民國七〇年初版
            八　原始佛教聖典之集成……………………………………民國六〇年初版
            九　說一切有部為主的論書與論師之研究…………………民國五七年初版
          
        
        
          
          　　肆、編纂、選輯類
          
            一　太虛大師全書（民國三六－三七年編纂，四六年香港出版）
            二　太虛大師選集（分上、中、下三冊，民國七一年初版）
              上冊……………………………………………………………一——四一四
          
                １.　佛法僧義廣論………………………………………………………一
                ２.　佛學概論…………………………………………………………三一
                ３.　佛陀學綱…………………………………………………………九一
                ４.　因緣所生法義…………………………………………………一一九
                ５.　能知的地位差別上之所知諸法………………………………一二九
                ６.　大乘妙法蓮華經懸論…………………………………………一四七
                ７.　大乘入楞伽經釋題……………………………………………一八一
                ８.　優婆塞戒經懸論………………………………………………二〇一
                ９.　發菩提心論開題………………………………………………二一七
                １０.　大乘起信論唯識釋…………………………………………二二九
                １１.　大乘法苑義林唯識章講錄…………………………………二六七              
             中冊……………………………………………………………一——四二六
                １.　大佛頂首楞嚴經攝論………………………………………………一
           
               ２.　真現實論宗體論………………………………………………一六七              
             下冊……………………………………………………………一——五四二
                １.　法相唯識學概論……………………………………………………一
                ２.　唯識觀大綱………………………………………………………六五
                ３.　佛法總抉擇談……………………………………………………八七
                ４.　三重法界觀……………………………………………………一〇一
                ５. 　略釋對於佛教畢竟空之疑義…………………………………一一三
                ６.　曹溪禪之新擊節………………………………………………一二三
                ７. 　論即身成佛……………………………………………………一三五
                ８.　略說賢首義……………………………………………………一四五
                ９.　往生安樂土法門略說…………………………………………一五三
                １０.　為支那堪布翻案……………………………………………一六七
                １１.　論梁漱溟東西文化及其哲學………………………………一七九
           
                １２.　志行自述……………………………………………………一八七
                １３.　中國佛學之重建……………………………………………一九三
                １４.　佛學源流及其新運動………………………………………二〇一
                １５.　即人成佛的真現實論………………………………………二一三
                １６.　我怎樣判攝一切佛法………………………………………二三五
                １７.　我的佛教改進運動略史……………………………………二五七
                １８.　建設現代中國佛教談………………………………………三一一
                １９.　從巴利語系佛教說到今菩薩行……………………………三七一
                ２０.　菩薩學處講要………………………………………………三九一
                ２１.　學佛者應知行之要事………………………………………四三七
                ２２.　瑜伽菩薩戒本之要旨………………………………………四四一
                ２３.　學僧修學綱宗………………………………………………四四五
                ２４.　居士學佛之程序……………………………………………四五七
           
                ２５.　佛之修學法…………………………………………………四六九
                ２６.　佛學之人生道德……………………………………………四八九
                ２７.　提供談文化建設者幾條佛學………………………………四九七
                ２８.　佛學與文化…………………………………………………五〇九
                ２９.　唯物唯心唯生哲學與佛學…………………………………五二一
                ３０.　人人自治與世界和平………………………………………五三三
                ３１.　現代青年與佛教之關係……………………………………五三九
            三　法海微波…………………………………………………民國七六年初版
              序………………………………………………………印順………一——八
              上編……………………………………………………………一——二九六
                １.　評印順〈共不共研究〉………………………太虛………………一
                ２.　再議《印度之佛教》…………………………太虛………………三
                ３.　評印順法師的〈中道方法論〉………………守培……………一七
          
                ４.　《妙雲集》的特色與精神……………………宏印……………二七
                ５.　讀《談入世與佛學》後………………………張曼濤…………四三
                ６.　《說一切有部為主的論書與論師之研究》…張曼濤…………九五
                ７.　《我之宗教觀》讀後…………………………陳榮波…………九九
                ８.　《中國禪宗史》評介…………………………道安…………一二一
                ９.　《成佛之道》讀後……………………………聖嚴…………一三一
                １０.　《中國禪宗史》……………………………聖嚴…………一三七
                １１.　《妙雲集》的內容與精神…………………慧吉祥………一五三
                １２.　我讀《初期大乘佛教之起源與開展》……楊惠南………一六一
                １３.　《初期大乘佛教之起源與開展》讀後……萬榮勳………一九三
                １４.　大乘三系的商榷……………………………默如…………二一一
                １５.　大乘三系概觀………………………………默如…………二一九
                １６.　《中國禪宗史》要義………………………關世謙譯……二五九
          
                １７.　《印度之佛教》簡介………………………藍吉富………二六七
                １８.　印順法師的《淨土新論》……藤吉慈海著，溫金柯譯…二七三
                １９.　讀印順法師的《佛法概論》………………續明…………二八七
                ２０.　《青年佛教與佛教青年》述感……………續明…………二九一              
              中編………………………………………………………二九七——三四四
                １.　印順導師………………………………………真華…………二九七
                ２.　當代佛教思想家印順導師……………………陳慧劍………三〇三
                ３.　劃時代的博士比丘……………………………聖嚴…………三一一
                ４.　近代中國佛教史上的四位思想家……………聖嚴…………三一九
                ５.　印順法師簡介…………………………………藍吉富………三二五
                附錄 　一個別具意義的祝壽集會…………………幻生…………三二九              
              下編………………………………………………………三四五——四〇八
                １.　…………………………………………………仁俊…………三四五
           
                ２.　…………………………………………………光中…………三四七
                ３.　…………………………………………………牟宗三………三四九
                ４.　…………………………………………………吳汝鈞………三六二
                ５.　…………………………………………………杜正勝………三六三
                ６.　…………………………………………………明復…………三六四
                ７.　…………………………………………………真華…………三六五
                ８.　…………………約瑟‧Ｍ‧北川，邱明忠、龔書森譯……三六六
                ９.　…………………………………………………張曼濤………三六七
                附錄…………………………………………………余萬居譯……三六八
                １０.　………………………………………………勞思光………三七〇
                １１.　………………………………………………道安…………三七二
                １２.　………………………………………………聖嚴…………三九二
                １３.　………………………………………………演培…………三九三
         
                １４.　………………………………………………楊郁文………三九六
                １５.　………………………………………………霍韜晦………三九七
                １６.　………………………………………………藍吉富………四〇〇
                １７.　………………………………………………續明…………四〇六
            四　雜阿含經論會編（分上、中、下三冊，民國七二年初版）
              上冊
              中冊
              下冊            
          
        
        
         
          　　伍、增注、重訂類
          
            一　成佛之道（增注本）……………………………………民國八三年初版
            二　平凡的一生（重訂本）……………民國八三年初版，民國九四年重版
          
        
        
        
          　　陸、結集新版類
          
            一  永光集
          
        
        
       
          　　柒、翻譯外文類
          　　一　日文譯本
            
              １.伊吹敦譯，中國禪宗史——禪思想の誕生，東京‧山喜房，1997。２.岩城英規譯，《大智度論》の作者とその翻譯，東京‧山喜房，1993。
            
          
　　二　英文譯本
            
１.The Way to Buddhahood（《成佛之道》，楊泳漢譯）Wing H. Yeung, Wisdom Publications‧Boston, 1998.
２.Selected Translations of Miao Yun Part I（《妙雲選譯》（第一集））Hwa Tsang Monastery Inc.（華藏禪寺）, Australia, 1995.
３.Selected Translations of Miao Yun Part II（《妙雲選譯》（第二集））Hwa Tsang Monastery Inc.（華藏禪寺）,  Australia, 1996.
４.Selected Translations of Miao Yun Part III（《妙雲選譯》（第三集））Hwa Tsang Monastery Inc.（華藏禪寺）,  Australia, 1998.
５.Selected Translations of Miao Yun Part IV（《妙雲選譯》（第四集））Hwa Tsang Monastery Inc.（華藏禪寺）, Australia, 1999.
            
          
          　　三　越文譯本         

              １.Luận Thuyết Mớ'i Về Tịnh Độ Lợi Ích Cua Việc Hành Thiền（《淨土與禪》，阮文發譯）Nhà Xuất Ban Đại Học Và Giáo Dục Chuyên Nghiệp, Hà Nội, 1991.
２.Phật Pháp Khái Luận（《佛法概論》，阮文發譯）Nhà Xuất Ban Đại Học Và Giáo Dục Chuyên Nghiệp, Hà Nội, 1992.
            
          
        
      
      
        　　印順導師著作序　　一、《妙雲集》序　　二、《佛法概論》序　　三、《中觀今論》序　　四、《唯識學探源》序　　五、《成佛之道》序　　六、《太虛大師年譜》附言　　七、《華雨集》序　　八、《大樹緊那羅王所問經偈頌講記》序　　九、《方便之道》緒言　　十、《修定——修心與唯心、秘密乘》序
　　十一、《中國古代民族神話與文化之研究》序
◆《中國古代民族神話與文化之研究》，這本書的寫作動機何在？主要的內容，又是些什麼？
◆我生於民國前六年，這是個變革的時代。生長在農村，沒有受到良好的教育，對我國固有文化，西方來的新知識，都毫無基礎。對我國傳統文化來說，無論是今文、古文，漢學、宋學，程、朱或者陸、王，我都沒有沾到邊；我只是一個生活於中國文化中的中國人。我是中國人，有一分民族的感情，感到中國文化的偉大，特別是同化力的偉大。可能由於我缺少固有文化的了解，所以面對歷史現實，也會不自覺的引起反省。戰國時代的古典文化，是那樣的面面充實！秦、漢大統一的隆盛，決不是偶然的。漢代的學術定於一，為什麼會反而儒學中衰，引起魏、晉、六朝的長期衰亂？由於得到異族血統、文化的融和，才能再度造成隋、唐時代的隆盛。蒙古人成立元朝，滿州人成立清朝，假使當時是看作「異族入主」的話，那麼唐末、宋初以來，我國民族是在慢性的衰落中。元、清的輝煌成就，並不等於宋、明來中國文化的成就。民族文化與民族的興衰，應有一定程度的關係。民族長期的慢性衰落，決不止是近一二百年的事，這不應該深深的反省，傳統文化到底缺少了些什麼嗎？為什麼一千多年來的傳統文化，不能再創漢、唐那樣的盛業？我沒有了解傳統文化，也就不能知道他是否缺少些什麼。我只是面對現實，被迫而引起的，存在於內心的問題。由於我多年以來，選定了探究的論題，所以對中國固有文化，雖引起反省，而沒有好好的研究過，連研究的動機也不曾有過。
◆民國六十年冬天，我動了兩次手術。手術的後遺症，一直不能恢復。長期不能思考，一思考，胸部與頭部就冒出黏汗，使我不能繼續於一向探究的論題。兩年時間，就這樣的一事不為，在寧靜的衰病中過去！六十二年十一月，我移到臺中住。同住的有一部《史記》，我偶爾借來看看，也無非消遣而已。《史記》，是「縉紳先生」所寫的一部古代史，多少留下一些「怪力亂神」的傳說，神話化的古代史話。這些神話化的史話，倒引起了我的興趣。恰好從報上見到，地平線出版社有一部日本作品的譯本——《中國古代神話之研究》，也就買了一本。這本書的內容，我不能完全同意，卻給了我很大的啟發。有羊神話的民族姓姜，有鳳神話的民族姓㜄——風，民族的神話與姓，有這樣的密切關係。該書說到鯀與禹的蛇魚神話，使我想起了舊事——顧頡剛發表禹是動物、是神，而引起當年學界的大震動，與互相論辯的那個事實。無巧不巧的，報上有與顧頡剛有關的《古史辨》出版的廣告，也就好不容易的找到了一部，那是厚厚的七大冊。從這部書中，見到了更多神話式的古代史話。我不能贊同古史辨者的動機與方法，但他們廣泛的搜集資料，形形色色的古代史話，倒引起了我更多的興趣。這一下，欲罷不能，不能不擴大閱讀的範圍。神話與史話的作品，如《山海經》、《楚辭》、《穆天子傳》、《竹書紀年》、《世本》、《左傳》、《國語》而外，《書》、《詩》、《周禮》、《禮記》、《易》，與代表儒、墨、道、法的諸子，也搜集起來。有關古代文字的，如段氏《說文解字注》；甲骨文字——羅振玉、王國維、葉玉森、董作賓、胡厚宣的作品，也見到一部分。從這些典籍中，覺得古代的民族神話，神話式的史話，不但與民族有一定的關係，也與中國古代的文化有關。一向存在於心裡的問題，也多少理會一些。那就是古代不同民族融和所展開的文化——古代傳統文化，並不是後人所想像的那樣偏狹。一向「讀書不求甚解」，看到那裡，想到那裡的我，也就粗枝大葉的寫下這本中國古代史話－－《中國古代民族神話與文化之研究》。
◆古代的中華民族，是多民族融和所成的。不同的民族，有不同的民族神話。民族神話，不是個人創作，是源於民族的共同意識而成的。所以古代的民族神話，在古代是嚴肅的信仰，在政治、經濟、文化沒有太多的變動時，是會長期延續下來的（與秦、漢以來的神奇傳說，神話小說不同）。因此，古史辨者的廣泛引證，證明他是神話；是神話，就以為達成了否定古代史，主要是夏代史的目的。在我看來，恰好相反。古代史話是不離神話形式的；沒有神話的古代史，才是經過改編的，不可輕易信任的。神話形式的古代史話，才是古代史的最好資料。從古代神話以理解古代的民族系統，民族的遷移與分化，從部分聯合到融合，是這部書的主題之一——第二章到第六章。
◆《古史辨》〔（二上）〕說到：對古代史的態度，當時有「信古」、「疑古」、「考古」、「釋古」四派。我沒有了解傳統文化，所以不會信古，不會想維護傳統古代史的系統。我也不是疑古的，因為心有所著，心就有所拘蔽。如立定主意要疑古，那就免不了「疑心生暗鬼」，「草木皆兵」。如「帝之元子」，「主名山川」這一類話，也被疑古者作為不是人的證明。陳夢家說：夏是殷商的一支。顧頡剛說：夏是西戎。東夷與西戎的結論是相反的，而否定夏史的結論相同。顧頡剛說：禹是動物；禹是南方的神話人物；禹是西戎的宗神。立論可以一變再變，而否定禹的人性，卻一成不變。這就是非疑不可，非推翻他的成見在作祟。疑古者歡喜說這是神話，那是神話，其實並不想了解神話，而不過用作破壞的資料。廣泛的引證，說累層地造成，說分化，而並不明白神話系統，結果等於在編織他們自己的神話。說到考古，我當然更不是的。我雖也看過《細說史前中國》等書，但我不想將自己所見的古代民族系統，民族的興衰繼起，比附近代的發掘報告。我國古代的地下文物，還有待大量的發掘。我應該是近於釋古的，不過我沒有預存什麼古代社會史的概念，拿來解說我國古代的史話，只是以神話來印證古代的民族傳說。李宗侗《中國古代社會史》，是參考現存落後民族的圖騰制，解說我國的古代社會。圖騰與我國古代的民族神話，大致相同，但我國古代史話的傳說，與一部族分三部族的制度，也不能完全相合。所以本書是依照我國史話的傳說，條理出古代民族的不同系統——四大系：夷族是神鳥系（以鷹為主），羌族是神獸系（以羊為主），越族是神魚系（龜、蛇等在內），氐族是神龍系。漢代的「四靈」說，就是古代四大神話的演變與組合，所以特地寫下「四靈之研究」——第七章。
◆在古代史話的研究中，發現我國古代不同性質的文化，與不同的民族神話有關。首先注意到羊的宗教文化。炎帝的神羊族系，衰落最早。古代的神羊文化，多數已隱沒了，變質了。從故紙堆中，搜剔爬梳，使他部分的顯現出來。從民族神話與文化關係去觀察，認清了鳳——風的文化，那是古代的禮「樂」文明，氣的玄學的根源。還有，蛇——水族與柔和的文化，龍蛇與變化的玄學。這是本書的又一主題，從第八章到第十章。古代傳說，諸子出於王官，或說出於道家；似乎應該還有這樣的說法，百家淵源於古代不同民族（神話）的文化。在民族的先後興衰中，不但有自己的文化特性，也繼承了前代的文化而予以發展。所以當民族傾向融和，政治傾向大統一而展開的百家之學，都已不再是單純的。但在不同文化的互為影響中，追究其根源，文化的特性，文化的不同發展，還是可以理解出來的。
◆一年多的時間，意外的寫成了這本書，也許有一些可參考的價值。我想，學力所限，加上沒有精密的研究，錯誤是一定難免的。不過，如觀點不同，或由於不合潮流，那就會覺得錯誤更多了些。這本書的寫成，是無意的，只是感覺到了，就把他說出來。不成熟的作品，是不能說有什麼成果的。只有這一年多來，體重從四十二公斤，增加到五十公斤；又添了滿滿的一架書，這是不可否認的有了收穫。現在身體好了些，我不能再作這方面的閱讀與寫作，而要重新拾取一向探究的論題。中華民國六十四年六月十五日，自序於嘉義妙雲蘭若。　　十二、《中國禪宗史》序　　十三、《如來藏之研究》序　　十四、《印度之佛教》序　　十五、《印度之佛教》重版後記　　十六、《印度佛教思想史》序　　十七、《空之探究》序　　十八、《初期大乘佛教之起源與開展》序　　十九、《原始佛教聖典之集成》序　　二十、《說一切有部為主的論書與論師之研究》序
　　二一、《太虛大師選集》序
◆太虛大師，以護教護國為事，四十年如一日，悲心深重，近代佛教界一人而已！大師之著述講說，嘗集為《太虛大師全書》，六十四冊，讀者每以文繁義廣為難。大師之學行，足為今日佛教之南針者特多，因編《選集》以問世。
◆大師之學，純乎為中國佛學也。深契於《楞嚴》、《起信》，本禪之無礙，契臺賢之圓融，得唯識之善巧。初唱八宗平等，次攝為三宗——法性空慧，法相唯識，法界圓覺而言平等。雖法貴應機，多以法相唯識化眾，然與專宗唯識者異也。大師之志行，純乎為菩薩之行也。嘗謂「志在整理僧伽制度，行在瑜伽菩薩戒本」。雖佛法方便多門，菩薩有曲誘聲聞、天神之說，而大師則盱衡當世，探佛陀本懷，主「人菩薩行」，以「人生佛教」示人。婆心苦口，胥在於此。
◆今所集者，上冊初五篇為佛法之概說；顯三寶實義，《佛法僧義廣論》為尤要！次六篇，略示大師解說經論之善巧。中冊二篇，大師學本於《楞嚴》，故取《楞嚴攝論》。常說真現實義，《宗體論》為現變實事，現事實性，現性實覺，現覺實變。舉此而攝佛法無遺，乃知佛法本於真現實，非虛妄迷謬之學。二書足以見大師之學，故並集之。下冊初十一篇，融貫料簡諸宗，顯其勝而祛其偏。《志行自述》以下，可見大師整僧護教之意趣。《學佛者應知應行之要事》等，所以示學佛者修學之方隅。末五篇，則略明佛法與文化，與世界和平之關係。大師之學，深廣無涯，嘗一滴足以知瀛渤之味，讀《選集》可為探求大師學行之方便也。是為序。民國七十一年印順序。        
　　二二、《法海微波》序
◆一
◆太虛大師為了謀求中國佛教的復興，以無比的悲願，畢生從事於「教理」、「教制」、「教產」的革新運動，雖受到少數青年僧侶與社會人士的贊同，而在佛教內部，卻受到了（長老與居士）嚴重的抗拒。抗戰前，大師創辦的《海潮音》，在某些大寺院及佛教學團中，被禁止閱讀，就足以說明抗拒的嚴重性。復興古老而久已衰落的中國佛教，真是談何容易！我多病而不善交際，所以雖列名大師門下，而不可能追步大師的遺蹤。我覺得，古老而衰落了的中國佛教，習以成性，是不可能迅速改觀的，不如多作些思想的啟發工作。從傳譯來的三藏，多方面去探討研求，闡明佛法的特質與方便，使真誠為法的人，能有所抉擇，撥開適應過去而不適應現在的，及適應低級趣味的方便，使佛法的真義，能適應現代而
  重新活躍起來。在這一意趣下，決定了我為佛教而學，為眾生——人類而學的方針。這也可說是虛大師「教理革命」的延續，不過我從來不說革命，只是多多研求印度佛教史上所見的種種相，略加抉擇，介紹給中國的佛弟子。然而中國佛教還是那樣的佛教，要多少受到傳統佛教（法師與居士）的誤會與抗拒，那也是無可避免的事了！
◆提出某種見解，如受到批評或反對，依我的理解，那是大好事。我曾說：「由於對方的評論，會認識到不同的觀點，不同的論法，不同的意義，對受批評的自己來說，真是極豐碩的收穫」。如以文字「表現出來，就會引起反應，或者受到讚美，或者受到批評，這就是警策自己向上的良好動力。有的歡喜人讚歎，怕別人批評，那是私欲和淺見作怪。其實，受到讚歎，是對自己的一種同情的鼓勵；受到批評，是對自己的一種有力的鞭策。鼓勵與鞭策，一順一逆的增上緣，會激發自己的精進，修正自己，充實自己，不斷的向前邁進」（《教制教典與教學》一九九——二〇一頁）。民國二十年，我寫下了第一篇——〈抉擇三時教〉，一直到現在，記錄的與寫作的，也不算少了，但傳統佛教界給予的反應，除極少數外，反對、不滿、厭惡、咒詛，都在口頭傳說中不斷流行，這實在使我失望！例如：
◆一、民國三十二年，我的《印度之佛教》在重慶出版，引起了（抗戰後方）部分人士的不滿。那時，很少有人知道印順是何許人也，由於與虛大師有關，所以重慶長安寺——那時是（屬於居士的）佛學社有關的某居士，推斷為：印順一定是戴金絲邊眼鏡，穿皮鞋，手拿司的克（杖）的新僧。漢院同學們告訴我，使我哭笑不得，被稱為太虛派的新僧形象，竟被他們惡意歪曲到如此！然而他們可以惡意的口頭中傷，卻不作公開的評論。二、五十四年三月，我在嘉義妙雲蘭若掩關。竹山的達超師等，陪同日本花園大學教授藤吉慈海來訪。藤吉教授提起：這次訪問臺灣佛教界，一提到印順，似乎都表示「不以為然」，但到底什麼不對，大家又都不說出來。我不好意思說別的，只說：也許與淨土有關吧！因為我以為在往生淨土以外，還有創造淨土，人間淨土。我送了一本《淨土新論》給他（後來，他在《印度學佛教學研究》中，介紹了我的《淨土新論》）。三、大約四年前吧，臺北一位青年居士（姓名已忘了），寫信給我。這是一位虔誠的居士，追隨周宣德居士多年，六十四年曾依我受菩薩戒。他先介紹了他自己，然後說：這次到臺中來，見到幾位蓮友，提到老法師的見解，使我非常懷疑，所以要請求解說。他提出的問題，我還記得三則：一、有沒有淨土？我那時答：有穢土就有淨土；大乘經所說的淨土非常多。二、到底能不能往生淨土？我答：依佛法，天業成就的往生天上，成就地獄業的往生地獄；如淨土業成就，當然能往生淨土。三、往生的傳記是否可信？我答：傳記是有傳說成分的，所以古德說：「諸傳所說，或然（或）不然」。這是過去的傳記，我沒有資料來證明他是虛偽的，也無法證明他是事實。好在佛弟子的信心，並不是建立在傳說上的（以上，都是大意如此）。末了，我信上對他說：臺中蓮友們對我所說的有疑惑，我不是因病而長住在臺中嗎？為什麼不就近提出來討論，要通過你這位臺北居士來問呢？四、最近見到《印順導師的思想與學問》中，傳道法師說：「近幾年來，有些人很怕知識份子閱讀《妙雲集》以及導師的作品，害怕他們變成太平凡、太平實，而銷鎔了高蹈的凌雲壯志。……又有人怕形成妙雲風、妙雲派」。唉！我的文字，竟是這樣的惹人討厭！我曾說：「我所研究的，決非一宗一派（之學）；尤其領導大家修學，更未想到要如何控制思想，使大家跟我一樣」（〈福嚴閒話〉）。我只是本於對佛法的誠心，提出佛法的種種相，希望讀者能平心靜氣的思考、抉擇，使佛法能更純淨、更適合於現代人心。我從沒有以為自己就是對的，反而是希望佛教界能給我批評。然而不滿與批評，四十多年來一直保持在口頭的傳說中。有時也自我安慰：這是大家的好意，免得我受批評而難堪呀！等一口氣不來，再來公開批評，不就「皆大歡喜」了嗎？也許是這樣的，但我已無法接受寶貴的意見而有所改進，也失去了為自己解說與答辯的機會！
◆二
◆身體衰弱而不喜交際的我，等於將自己局限在狹小的天地裡。對於教內大德，平時少往來；與學術界、文化界人士，可說沒有往來；不通外文的我，對國際佛學界，當然更沒有往來了。一心想對佛教的思想，作一些啟發與澄清的工作，有時講，有時寫，但生成了這一個性，不用說，對佛法在社會、在教內所起的影響，是微小得等於零。何況面對一個不重學的中國佛教，大德們又都惜字如金，不願提供寶貴的意見呢！但想到佛法不用過分從功利著想，盡自己的心力做去就可以，所以五十歲以後，雖明知對佛教不能有什麼貢獻，還是一直的堅持下去。
◆我的寫作與出版，也可說太不懂得宣傳了。一、一般書籍的出版，總是請人（或好多人）寫序、題字。當我出版第一部《印度之佛教》時，將第一章寄去，請虛大師題簽、寫序。虛大師寄下了〈議印度之佛教〉，表示了：印度佛教史是應該這樣寫的。這不是序，而是師長的指導。我的《唯識學探源》，原是「唯識思想史」的第一部分——「唯識學的先驅思想」。將出版時，請虛大師審核。「虛公以為唯識思想史已有人譯出，預備出版，不必再寫下去」；「遂為題曰唯識學探源」，這也與我的原意不合。覺得如請人寫序而招來困擾，或者揄揚讚歎一番，甚至說幾句「言不由衷」的好聽話，實在沒有意義，從此再也沒有請人寫序了。其實，請名人寫序、題字，對一般讀者的觀感來說，是多少有些影響的。二、我也曾在一般刊物投稿：抗戰期間，在《文史》上發表了〈秦漢之佛教〉（後來簡化淨化，改寫為〈漢明帝與四十二章經〉）。三十六、七年間，在（香港）《學原》登載了〈佛教之興起與東方印度〉。再寄去〈評熊十力「新唯識論」〉，已經接受了，但由於《學原》的停辦而退稿。從此不再向外投稿（僅在四年前，寄一短篇，登在《鵝湖》，以解答牟宗三先生對我的批評），一切都發表在佛教的刊物上，主要是虛大師創刊的《海潮音》。三、關於出版，因虛大師的推介，正中書局曾同意出版《中國佛教史略》，因抗戰勝利，書局要遷還上海，把原稿連同製成鋅版的「中國佛教源流表」，一併寄還。懶於向外活動的我，覺得求人不如求己，從到香港以後，一概設法自己出版（僅有與佛法無關的，《中國古代民族神話與文化之研究》，委託華岡出版公司代為出版）。四、《印度之佛教》與《攝大乘論講記》的出版，都曾徵求預約。到了香港，菲律賓妙欽，檳城明德法師，自動籌助印費。來臺灣以後，有黃陳宏德、邵黃志儒居士，自動發心贊助出版（還有少數人的助印）。其他，正如大醒法師說的：「賣得書來再印書」了。不向教外刊物發表，不在一般書局出版，不請名人題字、作序，不向教內預約推銷，只是默默的寫作，慢慢的賣出，未免太不合一般出版的原則了。雖做到了不為稿費而寫稿，不為盈利而出書，但到底不能引起更多人的注意，減少了對佛教所有啟發和澄清的影響。不過，從我的個性與我所處的環境來說，也許這還是比較合適的辦法。
◆三
◆偶爾與性瀅等談起：一生寫作、出版而不能對佛教界有些影響，不免有浪費紙墨的感覺。他們認為：不能說完全沒有，在佛教的刊物、書籍中，多少也有些贊同或批評的。我要他們代為搜集，雖然數量不多，也聚集了一些資料。我想，今年已虛度八十一，從認真寫作以來，已有四十六年了，以後怕難有什麼作品。這些見於刊物、書籍的僅有影響，把他編集起來，題為《法海微波》，作為一生的紀念吧！這比之死後，「諛墓」式的紀念，「鞭尸」式的批評，總還來得實際一些。把資料整理一下，決定分為三編：「上編」是書的評介，無論是「評」，是「讀後」，是「述感」，總之是對全部、一本或一篇文字，一個問題的反響（編列以作者的筆畫多少為次第）。「中編」是人的評介，當然也還是思想的。「下編」是雜錄，從別人文字中節錄出與我有關的片段文字。讀道安老法師的「日記」，才發覺臺灣長老中，道老是我的唯一知己。佛教的一般刊物與書籍，我沒有購買與保存的習慣，所以不容易搜集，搜集也難得完備，相信批評我的文字，一定是有遺漏的。
◆附帶要說到的：一、王恩洋居士的〈讀印度佛教書感〉，是評論《印度之佛教》的；及教外人的評論一篇，都找不到原文而沒有編入。二、前年孫麟生居士贈我一部《當代儒佛之爭》，才知熊十力先生門下黃艮庸先生，有〈評印順著「評熊十力新唯識論」〉。黃先生所知道的是儒學，對佛學雖從熊先生處知道一些，而對印度佛教史上真正的空宗，也許根本沒有聽見過。我是依空宗立論，所以他雖大力的駁斥我，而實際是自說自話，毫不相干。這一教外的批評，沒有集錄。三、五十二年，我發表了〈上帝愛世人〉，引起香港吳恩溥牧師等的憤怒，認為「非予以痛擊不可」，而有〈斥印順和尚「上帝愛世人」篇的謬妄〉，我不得不寫〈上帝愛世人的再討論〉。這一論評，純依《新舊約》而說，與佛法無關，所以也沒有採錄吳君的批評。四、六十二年，因《中國禪宗史》而引起各方面的不同觀感。這無關於《中國禪宗史》的內容，所以批評的與反批評的作品，都沒有集錄。五、四十二年，在某君的文字中，說要大家跟印順學。四、五年前，有人說：「從釋迦、龍樹、印順學足矣」。如這類過甚其辭，與佛法無益的話，一概不加採錄。
◆本書得到性瀅、心如、明聖，及藍吉富居士的助力——搜集、抄錄、校對、出版，特地在這裡表示我的謝意！民國七十五年六月，序於臺中華雨精舍。　　二三、《雜阿含經論會編》序　　二四、《永光集》序


^bk#y01【《妙雲集》序目】
◆民國五十八年九月，我重回嘉義妙雲蘭若安住。
想到自己寫作的，別人記錄的，也不算少了。
文章未必自己的好，但到底費過自己的一番心力。
想到虛大師、慈航法師、大醒法師、續明法師等去世以後，由後人來搜集整編，實在並不容易。
倒不如自己來編集一下，應該省力得多。
同時，已經出版的，或是紙張差，或是字體小，參差不一。
不如統一重排，改用新四號字，也讓讀者省一點目力。
就這樣，定下了編集為《妙雲集》的決心。
◆我的作品，體裁不一，長短不一，所以將《妙雲集》分為三編。
「上編」，是經論的解說。
已經整理出版的，共有八部，現編為七冊：一、《般若經講記》，這包含了《金剛經》及《心經》的兩部講記；
二、《寶積經講記》；三、《勝鬘經講記》；
四、《藥師經講記》；五、《中觀論頌講記》；
六、《攝大乘論講記》；
七、《大乘起信論講記》。
◆「中編」，是專著而篇幅超過十萬字的，現編成六冊：一、《佛法概論》；
二、《中觀今論》；三、《唯識學探源》；
四、《性空學探源》；五、《成佛之道》；
六、《太虛大師年譜》。
◆「下編」，是短篇的總集，不問是寫的，記錄的，都編在一起。
我的思想專一而單純，所以沒有虛大師那樣的多彩多姿。
現分編為十一冊，分別的標一書名，其次第與重要內容如下：
◆一、《佛在人間》：這是過去所曾用過的書名，重於人間佛教的現實利益，從人乘正行而向佛道。
除舊有的幾篇外，增入了〈人間佛教緒言〉，〈從依機設教來說明人間佛教〉，〈人性〉，〈人間佛教要略〉，〈佛法是救世之仁〉等數篇。

◆二、《學佛三要》：這也是過去所採用的書名。
信願、智慧、慈悲——為大乘佛法的三要，學者要不偏不離的去學習。
除原有的篇章外，又增加了〈生生不已之流〉；
〈心為一切法的主導者〉；
〈菩提心的修習次第〉；〈佛教之涅槃觀〉等。
◆三、《以佛法研究佛法》：這雖然也是過去曾用過的書名，但大大的充實了內容，編入了〈佛教之興起與東方印度〉；
〈法之研究〉；〈密教之興與佛教之滅〉；
〈大乘是佛說論〉；
〈中國佛教與印度佛教之關係〉；
〈論真諦三藏所傳的阿摩羅識〉；
〈如來藏之研究〉等長篇。
◆四、《淨土與禪》：這一冊以〈淨土新論〉為主體，更增入〈東方淨土發微〉，〈念佛淺說〉，〈東山法門的念佛禪〉等。

◆五、《青年的佛教》：在〈青年佛教與佛教青年〉外，加入〈初級佛學教科書〉及〈高級佛學教科書〉。

◆六、《我之宗教觀》：本書所編集的，有〈我之宗教觀〉，是通論一切的。
〈中國的宗教興衰與儒家〉，〈修身之道〉，〈人心與道心別說〉，是論到儒家與道家的。
〈上帝愛世人〉，〈上帝愛世人的再討論〉，〈上帝與耶和華之間〉，是我對基督教的一點認識。

◆七、《無諍之辯》：這都是有關批評與討論的文字。
有〈評熊十力的新唯識論〉；
評胡適的〈神會與壇經〉。
〈評精刻大藏緣起〉，〈空有之間〉，是對內院歐陽竟無及王恩洋居士的。
〈敬答議印度之佛教〉，是與虛大師商討的。
有關〈大乘三系〉的兩篇，是與學友默如法師的討論。
〈佛法有無共同佛心與絕對精神〉，〈與巴利文系學者論大乘〉，是立足於中期的大乘佛教，而對前後兩極端的研討。
〈談入世與佛學〉，想喚起佛教徒的自覺，不要一直滑向世俗中去。

◆八、《教制教典與教學》：這是與當前佛教問題有關的。
有關教制的，如〈中國佛教前途與當前要務〉；
〈建設在家佛教的方針〉；〈關於素食問題〉。
〈僧裝改革評議〉，是有關僧裝改革運動的二篇之一。
關於教典的，如〈編修藏經的先決問題〉。
關於教學的如〈論僧才之培養〉，〈學以致用與學無止境〉等。

◆九、《佛教史地考論》：這一冊的篇幅比較多，除曾經單行的〈中國佛教史略〉，〈佛滅紀年抉擇談〉而外，還有許多史地的考論。
如〈印度佛教流變概觀〉；〈北印度之教難〉；
〈大乘經所見的中國〉；〈龍樹龍宮取經考〉；
〈楞伽經編集時地考〉；
〈漢明帝與四十二章經〉；〈世親的年代〉；
〈玄奘大師年代之論定〉等。
◆十、《華雨香雲》：這一冊，編集了「雜記」，「隨筆」，「序跋」，「讚德」，「哀思」，「碑記」等文字。
重要的有〈雜華雜記〉；〈華雨集〉；
〈英譯成唯識論序〉。
有關紀念虛大師的五篇，可為瞭解虛大師精神的參考。

◆十一、《佛法是救世之光》：這是末後一冊，將雜餘的編集在一起。
這一冊大半是講稿，或是對釋迦、彌勒、觀音、地藏菩薩的聖德與法門的讚揚。
或是針對世俗的淺見與誤解，如〈切莫誤解佛教〉；
〈美麗而險惡的歧途〉；〈舍利子釋疑〉等。
或是介紹佛教世界的一角，如〈菲律賓佛教漫談〉；
〈泰國佛教見聞〉。
本冊也有簡要深刻的文字，如〈中道之佛教〉；
〈大乘空義〉；〈色即是空、空即是色〉；
〈人生的意義何在〉等。
◆《妙雲集》編集了我的作品，但不是完全的，這可以分別來說：
◆一、我第一部出版的，以文言寫成的《印度之佛教》，表達了我對佛法的信念。
從佛教史的發展中去理解佛教，理解佛教正常的或偏激的發展，或世俗的適應。
在佛教的發展中，認清我們所應承受的佛法的特質，正常的積極的部分，以適應時機，救濟苦難的現代。
這是我所不能完美達成的，但從事教理、教史的條理考證，成為我報佛深恩的唯一願望！這部書沒有編入《妙雲集》，僅節錄〈印度佛教流變概觀〉；
〈密教之興與佛教之滅〉——兩章，分別編入下編。
為什麼沒有編入，我想拆散這部書，發心以語體文重寫，引用種種文證，寫成多少部；
然後綜合起來。
《說一切有部為主的論書與論師之研究》；
《原始佛教聖典之集成》，就是想寫而已經寫成的兩部。
這兩部書，用老五號字，精裝，自成一類，都不在《妙雲集》之內。
以後再寫「印度之佛教」的部分，都將與上二書一樣。

◆二、去年寫了一部從印度禪到中華禪的發展過程，題為《中國禪宗史》的，也不在《妙雲集》內。
這部書的寫作，是偶然的，從來沒有想這樣的，只能說因緣了。
這是理解中國佛教史的一個重要部分。
◆三、來臺灣以前的文稿，散失的已經散失了。
來臺以後而曾發表過的，大都編在《妙雲集》內，但也有例外的：1.〈藥師琉璃光〉（《潮音》三十五卷），已編入《藥師經講記》。
〈寶積經述要〉（《潮音》四十三卷），已編入《寶積經講記》。
《說一切有部為主的論書與論師之研究‧序》（《潮音》四十九卷），《成佛之道‧序》（《香港佛教》），都已編在書裡；
所以不再編入，以免重複。
〈論部之不同名稱及其意義〉；
〈迦旃延子與發智論〉；
〈佛陀跋陀羅傳來之禪門〉；
〈佛教的文藝大師——馬鳴菩薩〉：這四篇（《潮音》四十二卷），都已編入《說一切有部為主的論書與論師之研究》。
還有〈藥師經開題〉（《潮音》三十九卷），內容不出〈藥師琉璃光〉及〈東方淨土發微〉，所以就捨去了。
曾發表於《文史》的〈秦漢之佛教〉，已簡略而改寫為〈漢明帝與四十二章經〉，所以也就不再存錄。
2.《潮音》卷四十五，有〈論提婆達多之破僧〉。
卷四十六，有〈阿難過在何處〉；
〈佛陀最後之教誡〉；〈王舍城結集的研究〉；
〈論毘舍離七百結集〉。
這五篇，都有關於印度佛教的早期史實。
沒有編入《妙雲集》，預備在寫《佛陀及其弟子》；
《部派佛教之開展》時，把他採錄（或改寫）進去。
3.有些法語之類，沒有保存必要，一概不取。
《妙雲集》就這樣編定了。
◆《妙雲集》的刊行，始於民國五十八年冬，到全部印出算來已四年了（中間同時刊印了《原始佛教聖典之集成》，及《中國禪宗史》）。
印費方面得星洲法坤師、陳慧中居士；
香港邵黃志儒及謝慧輪居士；
臺灣曾慧泰居士等的樂助。
校對督印方面由慧潤、性瀅、依道師負責進行。
在全書完成的時候，謹對給予財力、心力的護持者致深摯的謝意！
◆全書的目次如下：
上　編
　一　般若經講記
　　01　金剛般若波羅蜜經講記
　　02　般若波羅蜜多心經講記
　二　寶積經講記
　三　勝鬘經講記
　四　藥師經講記
　五　中觀論頌講記
　六　攝大乘論講記
　七　大乘起信論講記
中　編
　一　佛法概論
　二　中觀今論
　三　唯識學探源
　四　性空學探源
　五　成佛之道
　六　太虛大師年譜
下　編
　一　佛在人間
　　01　佛在人間
　　02　人間佛教緒言
　　03　從依機設教來說明人間佛教
　　04　人性
　　05　人間佛教要略
　　06　從人到成佛之路
　　07　佛法與人類和平
　　08　佛法是救世之仁
　　09　佛教的財富觀
　　10　佛教的知識觀
　　11　佛教的戰鬥觀
　　12　一般道德與佛化道德
　　13　佛教與教育
　　14　發揚佛法以鼓鑄世界性之新文化
　二　學佛三要
　　01　學佛之根本意趣
　　02　生生不已之流
　　03　心為一切法的主導者
　　04　學佛三要
　　05　信心及其修學
　　06　菩提心的修習次第
　　07　慈悲為佛法宗本
　　08　自利與利他
　　09　慧學概說
　　10　解脫者之境界
　　11　佛教之涅槃觀
　三　以佛法研究佛法
　　01　以佛法研究佛法
　　02　佛教之興起與東方印度
　　03　「法」之研究
　　04　密教之興與佛教之滅
　　05　大乘是佛說論
　　06　略說罽賓區的瑜伽師
　　07　中國佛教與印度佛教之關係
　　08　漢譯聖典在世界佛教中的地位
　　09　論真諦三藏所傳的阿摩羅識
　　10　如來藏之研究
　　11　阿陀那與末那
　　12　欲與離欲
　四　淨土與禪
　　01　淨土新論
　　02　念佛淺說
　　03　求生天國與往生淨土
　　04　東方淨土發微
　　05　宋譯楞伽與達磨禪
　　06　東山法門的念佛禪
　五　青年的佛教
　　01　青年佛教運動小史
　　02　青年佛教參訪記
　　03　初級佛學教科書
　　04　高級佛學教科書
　六　我之宗教觀
　　01　我之宗教觀
　　02　中國的宗教興衰與儒家
　　03　修身之道
　　04　人心與道心別說
　　05　上帝愛世人
　　06　〈上帝愛世人〉的再討論
　　07　上帝與耶和華之間
　　08　我怎樣選擇了佛教
　七　無諍之辯
　　01　評熊十力的新唯識論
　　02　神會與壇經
　　03　評〈精刻大藏緣起〉
　　04　空有之間
　　05　敬答〈議印度佛教史〉
　　06　大乘三系的商榷
　　07　讀〈大乘三系概觀〉以後
　　08　佛法有無「共同佛心」與「絕對精神」
　　09　與巴利文系學者論大乘
　　10　禪宗是否真常唯心論
　　11　談入世與佛學
　八　教制教典與教學
　　01　泛論中國佛教制度
　　02　中國佛教前途與當前要務
　　03　從「中國佛教協會」說起
　　04　僧裝改革評議
　　05　僧衣染色的論究
　　06　建設在家佛教的方針
　　07　關於素食問題
　　08　編修藏經的先決問題
　　09　佛書編目議
　　10　論僧才之培養
　　11　論佛學的修學
　　12　談修學佛法
　　13　學以致用與學無止境
　　14　福嚴閒話
　九　佛教史地考論
　　01　中國佛教史略
　　02　印度佛教流變概觀
　　03　佛滅紀年抉擇談
　　04　論佛滅的年代
　　05　紀念佛誕說佛誕
　　06　龍樹龍宮取經考
　　07　楞伽經編集時地考
　　08　文殊與普賢
　　09　護法韋馱考
　　10　大乘經所見的中國
　　11　從一切世間樂見比丘說到真常論
　　12　北印度之教難
　　13　論笈多王朝的王統
　　14　世親的年代
　　15　漢明帝與四十二章經
　　16　玄奘大師年代之論定
　　17　點頭頑石話生公
　　18　佛鉢考
　　19　釋伽羅王盧頭陀摩
　　20　阿梨車毘伽的自移塔
　十　華雨香雲
　　01　平凡的一生
　　02　雜華雜記
　　03　華雨集
　　04　中華大藏經序
　　05　楞嚴經研究攝論合刊序
　　06　法句序
　　07　英譯成唯識論序
　　08　影印金剛般若波羅蜜經記
　　09　勝鬘夫人經講記序
　　10　哌㗘文集序
　　11　中國佛教哲學概論序
　　12　序佛教時論集
　　13　佛學論文集序
　　14　評新唯識論自序
　　15　慈明寺《同戒錄》序
　　16　善生精舍序
　　17　華嚴寺刻經處募捐啟
　　18　清念上人傳
　　19　法舫法師行傳
　　20　大醒法師略傳
　　21　向近代的佛教大師學習
　　22　革命時代的太虛大師
　　23　我懷念大師
　　24　太虛大師菩薩心行的認識
　　25　略論虛大師的菩薩心行
　　26　悼念守培上人
　　27　悼法舫法師
　　28　我對慈航法師之哀思
　　29　懷念長老、想起佛教
　　30　讚泉公和尚之功德
　　31　一代耆德邈兮難尋
　　32　悼念續明法師
　　33　護國淨覺輔教大師章嘉呼圖克圖舍利塔碑記
　　34　虛雲老和尚舍利塔碑銘
　　35　性公老和尚舍利塔四眾海會塔記
　　36　祝性願老法師七秩大壽
　　37　子寬居士八十壽序
　　38　掩關遙寄
　　39　淨業頌
　十一  佛法是救世之光
　　01　佛法是救世之光
　　02　佛為救護我們而來
　　03　降魔的方法
　　04　南無當來下生彌勒佛
　　05　皆大歡喜
　　06　觀世音菩薩的讚仰
　　07　修學觀世音菩薩的大悲法門
　　08　地藏菩薩之聖德及其法門
　　09　中國佛教各宗之創立
　　10　中國佛教之特色
　　11　三論宗風簡說
　　12　從學者心行中論三乘與一乘
　　13　中道之佛教
　　14　佛學的兩大特色
　　15　教法與證法的仰信
　　16　大乘空義
　　17　色即是空、空即是色
　　18　《法印經》略說
　　19　論三世因果的特勝
　　20　生死大事
　　21　廣大的易行道
　　22　為居士說居士法
　　23　新年應有新觀念
　　24　紀念佛誕話和平
　　25　放下你的憂苦
　　26　從心不苦做到身不苦
　　28　切莫誤解佛教
　　29　誰是糊塗蟲
　　30　美麗而險惡的歧途
　　31　舍利子釋疑
　　32　從金龍寺大佛說起
　　33　菲律賓佛教漫談
　　34　泰國佛教見聞
　　35　《海潮音》之意義及其旨趣
　　36　關於《海潮音》的話
　　37　新年的舊希望
　　38　佛化音樂應有的認識
　　39　受戒難‧受戒以後更難
　　40　政治經濟等與佛法
　　41　論「西方不是菩薩所應去的」
　　42　〈普陀山誌奇〉的來歷
　　43　須彌山與四洲
^bk#y01a【金剛般若波羅蜜經講記】——民國三十一年春講於四川法王學院——
^ck#prolog【懸論】
◆《金剛經》，在中國佛教界，流行極為普遍。
如三論、天臺、賢首、唯識各宗，都有注疏。
尤以唐宋來盛極一時的禪宗，與本經結有深厚的因緣。
傳說：參禮黃梅的六祖慧能，就是聽了本經「應無所住而生其心」而開悟的。
六祖以前，禪宗以《楞伽》印心，此後《金剛經》即代替了《楞伽》。
宋代，出家人的考試，有《金剛經》一科，可見他的弘通之盛！本經的弘通，也有他的特殊因緣。
中國佛教的特點，一重實行：如臺、賢、禪、淨各宗，都注重行持，尤重於從定發慧的體悟。
二好簡易，國人的習性好簡，卷帙浩繁的經論，是極難普遍流通的。
本經既重般若的悟證，卷帙又不多，恰合中國人的口味，所以能特別的盛行起來！
◆本經的文義次第，是極為難解的。
「修多羅次第所顯」，如不明全經的文義次第，即不能理解一經的宗趣。
無著說：「金剛難壞句義聚，一切聖人不能入」。
世親說：「法門句義及次第，世間不解離明慧」。
本經文義次第的艱深，實為印度學者所公認！所以，我國本經的注疏雖多，大抵流於泛論空談，少有能發見全經脈絡而握得宗要的！關於這，我想多少提供一點意見。

^ck#prolog1【一　釋經題】
◆一、金剛：本經名金剛般若波羅蜜經，試為分離而綜合的解說。
金剛，為世間寶物，即金剛石之類。
世間的金剛，屬於炭質的化合物，有三種特點：(一)、堅常：堅是堅固，即不易破壞；
常是不變，即不易轉化。
(二)、明淨：明是透明的，能反映各種色采而閃鑠地放光；
淨是純潔的，即使落在汙穢的地方，也還是那樣的清淨不染。
(三)、快利：他的力用極強，能破壞一切固體物，而鐵石等卻不能摧壞他。
然金剛實有二類：(一)、金剛寶，如菩薩寶冠所莊嚴的。
(二)、世間金剛石之類。
世間的金剛，雖不易破壞而還是可壞的。
《智論》說：把金剛放在龜殼上，用羊角去捶擊，即可以破碎。
唯有菩薩莊嚴的金剛寶，才真的能壞一切而不為一切所壞。

◆二、般若：般若，華言慧。
從前，須菩提在般若會上，曾提出四個問題——何者般若，何名般若，般若何用，般若屬誰。
今隨順龍樹論而略為解說：
◆(一)、何者般若：佛說的般若，到底是什麼？
依佛所說的內容而論，略有三種：(1)實相般若：《智論》說：「般若波羅蜜者，是一切諸法實相，不可破，不可壞」。
如經中說的「菩薩應安住般若波羅蜜」，即指實相而言。
(2)觀照般若：觀照，即觀察的智慧，《智論》說：「從初發心求一切種智，於其中間，知諸法實相慧，是般若波羅蜜」。
(3)文字般若：如經中說：「般若當於何求？
當於須菩提所說中求」，此即指章句經卷說的。
◆(1)實相般若：實相即諸法如實相，不可以「有」、「無」等去敘述他，也不可以「彼此」、「大小」等去想像他，實相是離一切相——言語相、文字相、心緣相，而無可取著的。
《智論》說：「般若如大火聚，四邊不可觸」；
古德說：「說似一物即不中」，都指示這超越戲論而唯證相應的實相。
凡夫的所知所見，無不為自性的戲論所亂，一切是錯誤的。
這種虛誑妄取相，不但不見如實空相，也不能如實了達如幻的行相。
從見中道而成佛的圓證實相說：從畢竟寂滅中，徹見一切法的體、用、因、果，離一切相，即一切法。
如《法華經》說：「唯佛與佛乃能究盡諸法實相，所謂：諸法如是相，如是性，如是體，如是力，如是作，如是因，如是緣，如是果，如是報，如是本末究竟等」。
所以，空寂與緣起相，無不是如實的。
但這是非凡愚的亂相、亂識所得，必須離戲論的虛誑妄取相，那就非「空無所得」不可。
所以，經論所說的實相，每側重於如實空性、無性。
要見性相、空有無礙的如實相，請先透此「都無所得」一關——迷悟的關鍵所在。

◆實相——約理性邊說，是空還是有？
《中論》說：「空則不可說，非空不可說，共不共叵說，但以假名說」。
實相非凡常的思想，世俗的語言可表達，這如何可以說是空是有，更因此而諍論？
然而，實相非離一切而別有實體，所以不應離文字而說實相。
同時，不假藉言說，更無法引導眾生離執而契入，所以「不壞假名而說法性」，即不妨以「有」、「空」去表示他。
《中論》說：「一切實非實，亦實亦非實，非實非非實，是名諸佛法」。
末句，或譯「諸法之實相」。
眾生的不能徹悟實相，病根在執有我法的自性；
所以見色聞聲時，總以為色聲的本質是這樣的，確實是這樣的，自己是這樣的。
由於這一根本的執見，即為生死根本。
所以，經中所說的實相，處處說非有，說自性不可得。
本經也說：「凡所有相，皆是虛妄；
若見諸相非相，則見如來」。
高揚此實相無相的教說，尊為「不二解脫之門」。
即是說：實相非空非有，而在「寄言離執」的教意說，實相是順於「空」的；
但不要忘卻「為可度眾生說是畢竟空」！
◆有人說：實相是客觀真理，非佛作亦非餘人作，是般若所證的。
有人說：實相為超越能所的——絕對的主觀真心，即心自性。
依《智論》說：「觀是一邊，緣是一邊，離此二邊說中道」。
離此客觀的真理與絕待的真心，纔能與實相相應。
實相，在論理的說明上，是般若所證的，所以每被想像為「所」邊。
同時，在定慧的修持上，即心離執而契入，所以每被倒執為「能」邊。
其實，不落能所，更有什麼「所證」與「真心」可說！
◆(2)觀照般若：再作三節解說：凡、外、小智之料簡：1.世間凡夫也各有智慧，如文學的創作，藝術的優美，哲學與科學的昌明，以及政治、經濟等一切，都是智慧的結晶；
沒有智慧，就不會有這些建樹。
但這是世間的，利害參半的。
如飛機的發明，在交通便利上，是有益人群的；
但用他來作戰，就有害了。
常人所有的「俗智俗慧」，偏於事相的，含有雜染的，不能說是般若。
2.外道也有他們的智慧，像印度的婆羅門，西歐的基督教等。
他們的智慧，以人間為醜惡的，痛苦的，要求升到一個美妙的、安樂的天國。
於是乎行慈善，持戒，禱告，念誦，修定等。
這種希求離此生彼的「邪智邪慧」，如尺蠖的取一捨一，沒有解脫的可能，不能說是般若。
3.二乘行者得無我我所慧，解脫生死，可以稱為般若；
但也不是《般若經》所說的般若。
大乘的諸法實相慧，要有大悲方便助成的；
悲智不二的般若，決非二乘的「偏智偏慧」可比。
離此三種，菩薩大悲相應的平等大慧，才是般若。

◆空、般若、菩提之轉化：《智論》說：「般若是一法，隨機而異稱」。
如大乘行者從初抉擇觀察我法無性入門，所以名為空觀或空慧。
不過，這時的空慧還沒有成就；
如真能徹悟諸法空相，就轉名般若；
所以《智論》說：「未成就名空，已成就名般若」。
般若到了究竟圓滿，即名為無上菩提。
所以說：「因名般若，果名薩婆若」——一切種智。
羅什說：薩婆若即是老般若。
約始終淺深說，有此三名，實際即是一般若。
如幼年名孩童，讀書即名學生，長大務農作工又名為農夫或工人。
因此說：「般若是一法，隨機而異稱」。
◆般若、方便之同異：般若是智慧，方便也是智慧。
《智論》比喻說：般若如金，方便如熟煉了的金，可作種種飾物。
菩薩初以般若慧觀一切法空，如通達諸法空性，即能引發無方的巧用，名為方便。
經上說：「以無所得為方便」。
假使離了性空慧，方便也就不成其為方便了！所以，般若與方便，不一不異：般若側重於法空的體證；
方便側重於救濟眾生的大行，即以便宜的方法利濟眾生。
《智論》這樣說：「般若將入畢竟空，絕諸戲論；
方便將出畢竟空，嚴土熟生」。
◆(3)文字般若：文字，指佛所說的一切言教。
常人以書籍為文字，其實，文字不盡是書本的。
書籍，是依色塵而假立的文字；
但佛世卻是以音聲作文字。
佛怎麼說，弟子即怎麼聽受。
所以，佛經以名句文身而立，而名句文身是依聲假立的。
或者偏愛不立文字，以教義的鑽研為文字而加以呵斥，不知言說開示即是文字。
凡能表顯意義，或正或反以使人理解的，都是文字相。
筆墨所寫的，口頭說的，以及做手勢，捉鼻子、豎拂、擎拳，那一樣不是文字！文字雖不即是實義，而到底因文字而入實義；
如離卻文字，即凡聖永隔！此處說的文字，指《大般若經》中的第九分。

◆初學般若，應先於文教聽聞、受持，以聞思慧為主。
經合理的思考、明達，進而攝心以觀察緣起無自性，即觀照般若，以思修慧為主。
如得離一切妄想戲論，現覺實相，即實相般若了。
這三者，同明般若而各有所重，如意在實相，即能所並寂而非名言思惟可及。
如意在觀慧，即依境成觀，以離相無住的相應為宗。
如意在文字，即重在安立二諦，抉擇空有。
◆(二)、何名般若：為什麼稱為般若？
在這一問題中，即抉示出般若究竟指什麼？
應該說：般若是實相；
觀慧與文字，是約某種意義而說為般若的。
如觀慧，因依之深入而能現覺實相——般若，所以也稱為般若。
觀慧是因，實相是——非果之果，即是因得果名。
又，實相不是所觀的，但觀慧卻緣相而間接的觀察他；
為境而引生觀慧，所以也可假說為從境——實相般若而名為般若。
至於文字，約他的能詮實相，及藉此能詮教而起觀，得證實相——般若，所以也就從所詮而名為般若。

◆般若，本是世間舊有的名詞，指智慧而言。
但佛陀所要開示的，即正覺現證的——能所不二的實相，本非世間「般若」的名義所能恰當，但又不能不安立名言以化導眾生。
從由觀慧為方便而可能到達如實證知的意義說，還是採用「般若」一名。
不過，雖稱之為般若，而到底不很完備的，所以《智論》說：「般若定實相，智慧淺薄，不可以稱」。

◆(三)、般若何用：從般若是實相說，這是萬化的本性——一切法畢竟空故，世出世法無不依緣而成立。
這是迷悟的根源——眾生所以有迷有悟，凡夫所以有內有外，聖人所以有大有小，有究竟有不究竟，皆由對於實相的迷悟淺深而來，所以本經說：「一切賢聖皆以無為法而有差別」。

◆從般若是觀慧與實相相應慧說，可有二義：(1)證真實以脫生死：一切眾生，因不見性空如實相，所以依緣起因果而成為雜染的流轉。
要解脫生死，必由空無我慧為方便。
這觀慧，或名正見，或名正觀，或名正思惟，或名毘鉢舍那，或名般若。
從有漏的聞思修慧，引發能所不二的般若，才能離煩惱而得解脫。
解脫道的觀慧，唯一是空無我慧，所以說：「離三解脫門，無道無果」。
(2)導萬行以入智海：大乘般若的妙用，不僅為個人的生死解脫，而重在利他的萬行。
一般人修布施、持戒等，只能感人天善報，不能得解脫，不能積集為成佛的資糧。
聲聞行者解脫了生死，又缺乏利濟眾生的大行。
菩薩綜合了智行與悲行，以空慧得解脫；
而即以大悲為本的無所得為大方便，策導萬行，普度眾生，以此萬行的因華，莊嚴無上的佛果。
要般若通達法性空，方能攝導所修的大行而成佛。
這二種中，證真實以脫生死，是三乘般若所共的；
導萬行以入智海，是菩薩般若的不共妙用。
◆(四)、般若屬誰：約實相般若說，這是三乘所共證的，即屬於三乘聖者。
約觀慧般若說，如約解脫生死說，般若即通於三乘。
所以經中說：「欲學聲聞地，當應聞般若波羅蜜。
欲學辟支佛地，應聞般若波羅蜜。
欲學菩薩地，亦當應聞般若波羅蜜」。
但佛說般若波羅蜜經，實為教化菩薩，即屬於菩薩。
如本經說：「為發大乘者說，為發最上乘者說」。
《解深密經》也說：第二時教「惟為發趣修大乘者說」。
不過，佛說般若，雖說但為菩薩，而也有二乘在座旁聽。
經說：要得二乘果，必須學般若，這固然是三乘同入一法性，也即是解脫生死的不二門——空無我慧。
然也就是密化二乘，使他們聽聞大乘勝法，久久熏習成熟，即可宣告「汝等所行是菩薩道」，而迴心向大了。
所以般若是「通教三乘，但為菩薩」。
從前，成論大乘師說：般若是通教，不夠深刻；
唯識大乘師說：般若但為菩薩，不夠普遍。
總之，照他們看，般若是不究竟，「通」又不好，「但」又不好，這可說是「般若甚深，諸多留難」！那裡知道般若通教三乘，但為菩薩，深廣無礙，如日正中！這所以般若於一切大乘經中，獨名為大！
◆般若屬於菩薩，為什麼不屬於佛？
約般若唯一而貫徹始終說，如來當然也有般若。
不過，佛說般若，重在實相慧離言發悟，策導萬行。
般若「以行為宗」，所以與側重境相而嚴密分析，側重果德而擬議圓融者不同。

◆三、波羅蜜：梵語波羅蜜，譯為到彼岸，簡譯為度。
到彼岸，是說修學而能從此到彼，不是說已經到了。
所以，重在從此到彼的行法，凡可由之而出生死到菩提的，都可以稱為波羅蜜。
經中或說六波羅蜜，或說十波羅蜜，但真實的波羅蜜，唯是般若，其他都是假名波羅蜜。
因為，沒有空慧策導，布施等即不成為波羅蜜了。
聲聞乘法，能度生死河到涅槃岸，為什麼不名波羅蜜？
因為，波羅蜜又有「事究竟」的意義，所以要能究盡諸法實相，圓成自利利他的一切功德，才名為波羅蜜。
聲聞的三無漏學，不能究竟，所以不名為波羅蜜。

◆四、經：梵語修多羅，譯為經。
本義是線，線有貫穿、攝持不令散失的作用。
如來隨機說法，後由結集者把他編集起來，佛法才能流傳到現在；
如線的貫華不散一樣，所以名為經。
◆《金剛般若波羅蜜經》，有兩系解說不同：(一)、玄奘等傳說：般若是能斷的智慧，金剛如所斷的煩惱。
煩惱的微細分，到成佛方能斷淨，深細難斷，如金剛的難於破壞一樣。
所以，譯為「能斷金剛（的）般若」。
(二)、羅什下的傳說：金剛比喻般若。
般若能破壞一切戲論妄執，不為妄執所壞；
他的堅、明、利，如金剛一樣。
然金剛本有兩類：一是能破一切而不為一切所壞的，一是雖堅強難破而還是可以壞的，已如前面所說。
所以，或以金剛喻般若，或以金剛喻煩惱，此兩說都是可通的。
不過，切實的說，應該以金剛喻般若。
考無著的《金剛經論》說：(一)、如金剛杵的「初後闊，中則狹」；
這是以金剛喻信行地、淨心地、及如來地的智體的。
(二)、金剛有遮邪顯正二義，不但比喻所遣的邪行，他也是「細牢」的——「細者智因故，牢者不可壞故」，比喻堅實深細的智因——實相。
無著並沒有金剛必喻煩惱的意義，所以法相學者譯為「能斷金剛般若」，值得懷疑！至少，這不是梵本的原始意義。

◆般若有二類：一、拙慧：這是偏於事相的分析，這是雜染的，這是清淨的；
這是應滅除的，這是應證得的；
要破除妄染，才能證得真淨。
這如冶金的，要煉去渣滓，方能得純淨的黃金。
二、巧慧：這是從一切法本性中去融觀一切，觀煩惱業苦當體即空，直顯諸法實相，實無少法可破，也別無少法可得，一切「不壞不失」。
如有神通的，點石可以成金。
又如求水，拙慧者非鑿開冰層，從冰下去求水不可；
而巧慧者知道冰即是水，一經般若烈火，冰都是水了。
所以，巧慧者的深觀，法法都性空本淨，法法不生不滅如涅槃，法法即實相，從沒有減什麼增什麼。
這不增不減、不失不壞慧，即金剛般若。
◆般若為大乘道體，為五度眼目；
為般若所攝持，萬行始能到達究竟佛果，成為波羅蜜。
然而，般若也需要眾行的莊嚴，如沒有眾行助成，般若也即等於二乘的偏真智，不成其為波羅蜜。
所以，般若為菩薩行的宗主，而又離不了萬行。
龍樹因此說：說般若波羅蜜，即等於說六波羅蜜。

◆發菩提心者，能以如金剛的妙慧，徹悟不失不壞的諸法如實相，依菩薩修行的次第方便，廣行利他事業，則能到達究竟彼岸——無上菩提，所以名為金剛般若波羅蜜。
以文句安布，詮表這甚深法門，所以又稱之為經。

^ck#prolog2【二　示宗要】
◆全經大義，再扼要的提示二點：金剛般若即無上遍正覺：本經以金剛般若為名，而內容多明阿耨多羅三藐三菩提。
如佛為須菩提說如此發心，直至究竟菩提，徹始徹終的歸宗於離相無住。
說無上遍正覺為「是法平等無有高下」；
「於是法中無實無虛」：都是從般若無住以開示無上遍正覺。
般若無所住，無所住而生其心；
不取諸相，即生實相，即名為佛。
須知般若無住的現覺，即離相菩提的分證。
依此觀究竟，究竟也如是；
依此觀初心，初心也還如此。
所以，處處說無上遍正覺，實在即是處處說金剛般若。
不過，約修行趨果說，名之為般若無所住；
約望果行因說，名之為離相菩提心而已！
◆二道即五種菩提：本經初由須菩提問佛：「發阿耨多羅三藐三菩提心，應云何住？
云何降伏其心」？
經佛解說後，須菩提又照樣的再問一遍，佛答也大致相同。
所以，本經明顯的分為兩段。
《大般若經》有兩番囑累，《智論》說：「先囑累者，為說般若波羅蜜體竟；
今以說令眾生得是般若方便竟，囑累」。
智者即曾依此義，判本經的初問初答為般若道，後問後答為方便道。
此二道的分判，極好！
◆二道，為菩薩從初發心到成佛的過程中，所分的兩個階段。
從初發心，修空無我慧，到入見道，證聖位，這一階段重在通達性空離相，所以名般若道。
徹悟法性無相後，進入修道，一直到佛果，這一階段主要為菩薩的方便度生，所以名方便道。
依《智論》說：發心到七地是般若道——餘宗作八地，八地以上是方便道。
般若為道體，方便即般若所起的巧用。
◆般若即菩提，約菩提說：此二道即五種菩提。
一、發心菩提：凡夫於生死中，初發上求佛道、下化眾生的大心，名發阿耨多羅三藐三菩提心，所以名為發心菩提。
二、伏心菩提：發心以後，就依本願去修行，從六度的實行中，漸漸降伏煩惱，漸與性空相應，所以名為伏心菩提。
三、明心菩提：折伏粗煩惱後，進而切實修習止觀，斷一切煩惱，徹證離相菩提——實相，所以名為明心菩提。
這三種菩提即趣向菩提道中由凡入聖的三階，是般若道。
這時，雖得聖果，還沒有圓滿，須繼續修行。
明心菩提，望前般若道說，是證悟；
望後方便道說，是發心。
前發心菩提，是發世俗菩提心；
而明心菩提是發勝義菩提心。
悟到一切法本清淨，本來涅槃，名得真菩提心。
四、出到菩提：發勝義菩提心，得無生忍，以後即修方便道，莊嚴佛國，成熟眾生；
漸漸的出離三界，到達究竟佛果，所以名為出到菩提。
五、究竟菩提：斷煩惱習氣究竟，自利利他究竟，即圓滿證得究竟的無上正等菩提。
如上所說：二道各有三階，綜合凡五種菩提，總括了菩提道的因果次第。
明白此二道、五菩提，即知須菩提與佛的二問二答，以及文段次第的全經脈絡了！
　　　　　　　┌發心菩提─┐　　　　　　　│　　　　　├──發心
　般若道───┤伏心菩提─┼┐
　　　　　　　│　　　　　││
　　　　　　　└明心菩提─┘├─修行
　　　　　　　┌明心菩提─┐│
　　　　　　　│　　　　　││
　方便道───┤出到菩提─┼┘
　　　　　　　│　　　　　├──證果
　　　　　　　└究竟菩提─┘
^ck#prolog3【三　敘傳譯】
◆本經的譯者，是姚秦時來華的鳩摩羅什三藏。
我國朝代稱秦的，不止一國一代，以帝王的姓氏去分別，即有嬴秦、苻秦、姚秦、乞伏秦等。
姚秦，為五胡十六國之一。
三藏，即經、律、論，能通達三藏自利利人，所以尊為三藏法師。
鳩摩羅什，譯為童壽。
父親是印度人，後移居龜茲國；
母親是龜茲國的公主。
母親生他不久，即出家做了比丘尼，什公也就出家。
幼年，到北印的迦溼彌羅，修學聲聞三藏。
回龜茲時，經過莎車國，遇到大乘學者須利耶蘇摩，於是回小向大。
到得龜茲，已是英俊飽學的法師了。
苻秦王苻堅，派呂光攻略龜茲，迎什公來華。
呂光攻破龜茲，護送什公回國，在半路上，聽說苻堅在淝水戰敗，呂光即宣告獨立，國號西涼，在今甘肅西部。
等到姚秦興起，國王姚興，信奉佛法，特派大兵攻西涼，這才迎什公到了長安。
當時，佛教的優秀學者，都集中到長安，從什公稟受大乘佛法。
什公一面翻譯，一面講學。
所翻的大乘經論很多，如般若、法華、淨名、彌陀等經，智度、中、百、十二門等論，信實而能達意，文筆又優美雅馴，在翻譯界可說是第一流最成功的譯品。
所以，什公的譯典，千百年來，受到國人的推崇，得到普遍的弘揚。

◆本經，什公第一次譯出。
除這，還有五種譯本，就是：元魏菩提留支的第二譯，陳真諦的第三譯，隋達摩笈多的第四譯，唐玄奘的第五譯，唐義淨的第六譯。
在六譯中通常流通的，即是什公的初譯。
其後的五譯，實是同一法相學系的誦本；
如菩提留支譯，達摩笈多譯等，都是依無著、世親的釋本而譯出。
唯有什公所譯，是中觀家的誦本，所以彼此間，每有不同之處。
要知道印度原本，即有多少出入；
如玄奘譯本也有與無著、世親所依本不同處。
這點，讀者不可不知！
^ck1【正釋】　　甲一　序分　　乙一　證信序
^o@vcpp.1:1如是我聞：一時，佛在舍衛國祇樹給孤獨園，與大比丘眾千二百五十人俱。
◆本經略分序、正、流通三分。
敘述一期法會的因由，名序分。
正式開顯當經的宗要，名正宗分。
讚歎或囑累流通到未來，名流通分。
序分又分證信及發起二序，今先講證信序。
◆如是，指這部經。我，是結集者自稱。
聞，是從佛陀親聞，或佛弟子間展轉傳聞。
結集者說：佛如此說，我如此聽；
現在就我所聽來的又如此誦出，真實不虛，一一契合於佛說。
依《智論》說：如是，表信：信得過的就說如是，信不過的就說不如是。
佛法甚深，「信為能入」，如沒有真誠善意的信心，即不能虛心領會。
如是又表智慧：有智者能如佛所說，不違真義，即可止息戲論與諍競。
修學佛法，以信智為根本：無信如無手，不能探取佛法寶藏；
無智如無目，不能明達佛法深義。
經文首舉如是，即表示唯有信智具足，才能深入佛法，得大利益。

◆一時，泛指某一時候，即那一次說法時。
因各地的時間不一，曆法不同，不能定說，所以泛稱為一時。

◆佛，譯義為覺者，是無上正遍覺者。
佛陀創覺了諸法實相，即緣起性空的中道。
又從自證中，大悲等流，為眾生開示宣說，以覺悟在迷的眾生。
所以，佛是大智慧，大慈悲的究竟圓滿者。
◆舍衛，本是城名，應稱為憍薩羅國舍衛城。
但古代城邦國家的遺習，每以城名為國名，憍薩羅國的首都在舍衛，所以也稱為舍衛國。
舍衛，是聞物的意思，以此城的政治、文化、物產等都很發達，為全印度所聞名的，所以立名為舍衛。

◆祇樹給孤獨園，是城外如來居住與說法的地方。
如來常住說法，除摩伽陀王舍城外的竹園而外，要算在祇樹給孤獨園的時候最久了。
園是給孤獨長者——須達多發心修蓋供養的；
樹是波斯匿王王子祇陀奉施的。
祇陀的樹林，給孤獨長者的園，所以總名為祇樹給孤獨園。
僧眾的住處，名為僧伽藍，即僧園。
園，不但是林園，僧眾的智德並茂，大德輩出，好像園林的花木繁茂，馥郁芬芳一樣。
所以，僧伽的住處稱為僧園。
◆大比丘眾千二百五十人，是聽法的常隨眾。
佛在鹿苑，初度憍陳如等五比丘；
接著又有耶舍等五十多人，隨佛出家；
三迦葉率領他的徒眾，從佛出家，就有一千多眾了；
王舍城的舍利弗、目犍連，又帶了二百五十弟子來出家；
於是佛的初期出家弟子，就有千二百五十人了。
這千二百五十人，不一定在佛前，像舍利弗等大弟子，常時分化一方。
經中多標千二百五十人，不過約最初從佛出家者而說。
其實，未必全都來會，而新進的比丘極多，又何止千二百五十人？
佛的出家弟子，本有比丘、比丘尼、沙彌、沙彌尼、式叉摩那等五眾。
但因佛現比丘身，所以住持佛法，以比丘為主。
本經的聽眾，除比丘而外，也應該還有比丘尼等，在家的優婆塞、優婆夷、以及護法的天龍等，如流通分所說可知。
不過在這證信序中，沒有一一序列出來罷了。
比丘，譯為乞士，就是「外乞食以養色身，內乞法以資慧命」。
此千二百五十比丘，都是大阿羅漢，所以說大比丘眾。
眾，即僧伽的義譯。
千二百五十人的僧團，同住祇園，所以叫俱。
嚴格的說：和合僧——眾的形成，論事要具備六和合，論理要同得一解脫，這才稱為俱。

◆佛是化主，祇樹給孤獨園是化處，大比丘等是化眾。
具備這種種因緣，本經是佛所說的，可以確信無疑了，所以稱這為證信序。

^ck2【乙二　發起序】
^o@vcpp.1:3爾時，世尊，食時，著衣持鉢，入舍衛大城乞食。於其城中次第乞已，還至本處。飯食訖，收衣鉢。洗足已，敷座而坐。
◆爾時，指將啟金剛法會那一天。
世尊，是佛的通號之一，即梵語薄伽梵。
佛的功德智慧，究竟無上，不但為世間的人天所尊重，也是出世的三乘聖者所尊敬的，所以名為世尊。
食時，約為上午九或十點鐘。
佛及比丘們，過著乞食的生活，又受過午不食戒。
所以，進城去乞食，總在那個時候。
佛見乞食的時候到了，所以著衣持鉢進城去。
佛制：衣有五衣、七衣、大衣三種。
五衣名安荼會，不論睡覺做事，就是大小便，也不離身，這是內衣。
七衣名鬱多羅僧，即入眾的常禮服，在大眾中所穿。
大衣名僧伽黎，即複衣，在乞食、說法等時所穿的，是佛教大禮服。
此處著衣，即大衣。
但不定是穿了走，或擔在肩頭，或由侍者拿著，到城村附近，才穿起來。
鉢是盛飯的器具，譯義為應量，即隨人的食量而有大小不同。
佛用的鉢，傳說是石鉢。
成道後，有商人奉麨供佛，但沒有食器。
四天王各獻一石鉢，佛就合四為一鉢，所以佛鉢的鉢沿，有四層疊痕。
給孤獨園在城外，所以說入城乞食。
於其城中次第乞已，是敘述乞食的經過。
佛教的乞食制度，是平等行化；
除不信三寶不願施食者而外，不得越次而乞，以免世俗的譏毀。
乞食以後，即回祇園吃飯。
飯吃好了，這又把進城所著的大衣，盛放飯食的鉢，一一的整潔收起。
入城乞食是赤足的，路上來回，不免沾染塵埃；
佛陀行同人事，所以需要洗足。
敷座而坐，並非閑坐，是說隨即敷設座位，端身正坐，修習止觀。
如上所說的，乞食屬於戒，坐屬於定，正觀法相屬於慧。
又，來往於祇園及舍衛城中，是身業；
入定攝心正觀，是意業；
下面出定說法，即語業。
三業精進，三學相資，為宣說《金剛般若經》的緣起。

◆大乘經每以佛陀放光、動地等為發起，而本經卻以入城乞食為開端。
《般若經》的中心思想，在悟一切法無自性空，離種種妄執。
但不得性空的實義者，信戒無基，妄想取一空，以為一切都可不必要了。
不知佛說性空，重在離執悟入，即離不了三學；
假使忽略戒行，定慧而說空，決是「惡取空者」。
從體悟說：性空離相，不是離開了緣起法，要能從日常生活中去體驗。
所以，穿衣、吃飯、來往、安坐，無不是正觀性空的道場！佛將開示般若的真空，所以特先在衣食住行的日常生活中，表達出性空即緣起，緣起即性空的中道。

^ck3【甲二　正宗分】　　乙一　般若道次第　　丙一　開示次第　　丁一　請說
^o@vcpp.2:2時長老須菩提，在大眾中，即從座起，偏袒右肩，右膝著地，合掌恭敬而白佛言：「希有世尊！如來善護念諸菩薩，善付囑諸菩薩！世尊！善男子善女人發阿耨多羅三藐三菩提心，應云何住？云何降伏其心」？
◆本經以須菩提為當機者。
在般若法會中，須菩提是聲聞行者，不是菩薩，那他怎能與佛問答大乘呢？
這因為般若雖但為大乘，而密化二乘。
又因為他與般若法門相契：第一、他是解空第一者，是證得無諍三昧者，於性空深義能隨分徹了。
其次，他有慈悲心，哀愍眾生的苦迫，所以不願與人諍競。
得大智慧，能從慈悲心中發為無諍的德行，有菩薩氣概，所以《般若經》多半由他為法會的當機者。

◆長老，是尊稱。凡年高的；
或德高的，如淨持律儀、悟解深法、現證道果，都稱長老。
須菩提，是梵語，譯作空生或善現。
傳說：他誕生時，家內的庫藏財物忽然不見；
不久，財物又自然現出，所以立名須菩提。
佛弟子請佛說法，是有應行禮儀的。
所以須菩提在大眾中，即從座而起，偏袒了右肩，右膝著地，合掌問佛。
袒，是袒露肉體。
比丘們在平時，不論穿七衣或大衣，身體都是不袒露的。
要在行敬禮時，這才把右肩袒露出來。
跪有長跪、胡跪，右膝著地是胡跪法。
袒右跪右，以表順於正道；
合掌當胸以表皈向中道。
如論事，這都是印度的俗禮。
◆須菩提隨順世俗，先讚歎釋尊說：太希有了！世尊！如來善於護念諸菩薩，又能善巧的付囑諸菩薩！這太希有了！如來，即佛號多陀阿伽陀的義譯。
梵語本有三種意思：即從如實道中來的，如法相而解的，如法相而說的；
通常但譯為如來。什麼叫護念？什麼叫付囑？
護念即攝受，對於久學而已入正定聚的菩薩，佛能善巧的攝受他，使他契入甚深的佛道，得如來護念的究竟利益。
經說菩薩入地，有佛光流灌或諸佛親為摩頂等，即是心同佛心而得佛慧攝受的明證。
付囑，即叮嚀教誡，對於初學而未入正定聚的菩薩，佛能善巧教導，使他不捨大乘行，能勇猛的進修。
又可以說：佛能護念菩薩，使他自身於佛法中得大利益；
佛能付囑菩薩，使他能追蹤佛陀的高行，住持佛法而轉化他人。
總之，佛能護念菩薩，付囑菩薩，所以大乘佛法能流化無盡。
教化菩薩的善巧，早為須菩提所熟知，所以先就此推尊讚揚如來，以為啟問大乘深義的引言。
有解說為：須菩提「目擊道存」，「言前薦取」，所以殷勤讚歎，這可說是別解中極有意義的。

◆接著，須菩提問佛：發阿耨多羅三藐三菩提心的善男女們，應怎樣的安住其心？
怎樣的降伏其心？
此二問，是為發大菩提心者問的，所以什麼是發阿耨多羅三藐三菩提心，應先有明確的了解。
阿耨多羅，譯為無上；三藐，譯遍正；
三菩提，譯覺：合為無上遍正覺。
這是指佛果的一切，以佛的大覺為中心，統攝佛位一切功德果利。
單說三菩提——正覺，即通於聲聞、緣覺，離顛倒戲論的正智。
遍是普遍，遍正覺即於一切法的如實性相，無不通達。
但這是菩薩所能分證的，唯佛能究竟圓滿，所以又說無上。
眾生以情愛為本；
佛離一切情執而究竟正覺，所以以大覺為本。
發阿耨多羅三藐三菩提心，即是發成佛的心。
發心，即動機，立志，通於善惡；
發阿耨多羅三藐三菩提心，即是第一等的發心。
以崇高、偉大、無上、究竟的佛果為目標，發起宏大深遠的誓願，確立不拔的信心，這名為發無上遍正覺心。
但是，為什麼要成佛？
要知道：大菩提心是從大悲心生的；
所以發心成佛，與救度眾生有必然的關係。
經上說：「菩薩但從大悲心生，不從餘善生」；
「為利眾生而成佛」，都是此意。
由於悲心的激發，立定度生宏願，以佛陀為軌範，修學大悲大智大勇大力，以救度一切眾生，名為發菩提心。
因此，如貪慕成佛的美名，但為個己的利益，那是菩提心都不會成就，何況成佛！
◆應云何住與云何降伏其心，可通於二義：一、立成佛的大願者，應當怎樣安住，怎樣降伏其心？
一、怎樣安住，怎樣降伏其心，纔能發起成就菩提心？
住，龍樹釋為「深入究竟住」。
凡發大菩提心者，在動靜、語默、來去、出入、待人接物一切中，如何能使菩提心不生變悔，不落於小乘，不墮於凡外，常安住於菩提心而不動？
所以問云何應住。
眾生心中，有種種的顛倒戲論，有各式各樣的妄想雜念，這不但障礙真智，也是菩提心不易安住的大病。
要把顛倒戲論，一一的洗淨，所以問云何降伏其心。
住是住於正，降伏是離於邪；
住是不違法性，降伏是不越毘尼。
但此住與降伏，要在實行中去用心。
如本經即在發菩提心——願菩提心，行菩提心，勝義菩提心等中，開示悟入此即遮即顯的般若無所住法門。
無住與離相，即如是而住，即如是降伏其心。
◆什公所譯，唯有此二問。
此二——住與降伏，於菩提心行上轉；
全經宗要，不過如此住於實相而離於戲論而已。
諸異譯，於住及降伏間，更有「云何修行」一問。
考無著論，此三問遍通於一切，即於發心——發起行相，及修行——行所住處，都有這願求的住，無分別相應的行，折伏散亂的降伏，與本譯意趣相近。
世親釋論，將此三問別配三段文，隔別不融，與本譯即難於和會。

^ck4【丁二　許說】
^o@vcpp.2:5佛言：「善哉！善哉！須菩提！如汝所說『如來善護念諸菩薩，善付囑諸菩薩』。汝今諦聽，當為汝說。善男子善女人發阿耨多羅三藐三菩提心，應如是住，如是降伏其心」！「唯然，世尊！願樂欲聞」！
◆佛聽了須菩提的讚歎與請問，就印可讚歎他說：好得很！好得很！你說得真不錯！如來的確是能善巧護念諸菩薩，能善巧付囑諸菩薩的。
現在，我要給你說發大菩提心的，應當這樣的安住，應當這樣的降伏其心：你仔細聽吧！須菩提得到了如來的應允，歡喜的回答說：是的，世尊！我們都願意聽你的教誨！
◆如是住及如是降伏其心，約全經文義次第說，當然是指如來下文開示。
但古德曾解說為：如上文所說的——乞食、著衣、持鉢、入城、洗足等，那樣安住，那樣降伏其心。
須菩提的「唯然」，即契見如來的深意，這真是富有新意的別解！
^ck5【丁三　正說】　　戊一　發心菩提
^o@vcpp.3:1佛告須菩提：「諸菩薩摩訶薩應如是降伏其心：所有一切眾生之類——若卵生，若胎生，若溼生，若化生；若有色，若無色；若有想，若無想，若非有想非無想，我皆令入無餘涅槃而滅度之。如是滅度無量無數無邊眾生，實無眾生得滅度者。何以故？須菩提！若菩薩有我相、人相、眾生相、壽者相，即非菩薩。
◆發心菩提，即初發為度眾生而上求佛道的大願，也稱為願菩提心。
自所有一切眾生之類至而滅度之，是菩薩的大悲心行。
自如是滅度至即非菩薩，是與般若無相相應，要這樣降伏其心，安住其心，悲願為本的菩提心，才能成就而成為名符其實的菩薩。

◆菩薩，是菩提薩埵的簡稱。
薩埵是眾生——新譯有情，菩提是覺。
發心上求大覺的眾生；
或上求大覺，下化眾生的，名為菩薩。
菩薩以菩提心為本，離了菩提心，即不名為菩薩。
摩訶薩，是摩訶薩埵的簡稱。摩訶譯為大；
菩薩在一切眾生——凡夫，小乘中為上首，所以名摩訶薩。
還有，薩埵，在凡夫以情愛的衝動為中心，生存鬥爭，一切互相的爭執、殘殺，都由此情愛的妄執所引發。
眾生的情愛勝於智慧，所以一言一動，都以一己、一家、一族、一國的利益為前提，甚而不顧眾生多數的福樂。
菩薩發菩提心，以智慧淨化情愛，發為進趣菩提，救度眾生的願樂；
於是乎精進勇猛的向上邁進，但求無上的智慧功德，但為眾生的利益，此心如金剛，勇健、廣大，所以又名摩訶薩埵（薩埵即勇心）。
應如是降伏其心，即於菩薩應發的度生大願中，不著一切眾生相。

◆所有一切眾生之類，是總舉一切眾生。
眾生是五眾和合，生死流轉的眾生。
一切眾生，可以分作三類說：一、從眾生產生的方式說，有四種：卵生，如飛禽等。
先由母體生卵，與母體分離，再加孵化而產生。
胎生，如人獸等。
起先也類似卵，但不離母體，一直到肢體完成，才離母體而生。
溼生，如昆蟲等。
先由母體生卵，離母體後，祇攝受一些水分及溫度，經過一變再變，才達到成蟲階段。
化生，如天上的眾生，都是由業力成熟而忽然產生的。
二、從眾生自體的有沒有色法——物質說，有二類：有色的，如欲界與色界的眾生。
無色的，是無色界眾生。
關於無色界，有說是沒有粗色，細色是有的。
有說：細色也沒有，僅有心識的活動。
三、從眾生的有沒有心識說，有三類：有想的，如人類及一般的天趣。
無想的，這是外道無想定的果報，名無想天。
這無想的眾生，有說：只是沒有粗顯的心識，微細的心識是有的。
有的說：什麼心識也不起。
非想非非想的，是無色界非想非非想處的眾生。
他實在是有想的，但印度某些宗教師，以為到達非想非非想處，就是涅槃解脫了。
所以，佛法中稱之為非想非非想，即雖沒有粗想——非有想，但還有細想——非無想；
還取著三界想，沒有能解脫呢！
◆發菩提心，本經以大悲大願去說明；
可見離了大悲大願，即沒有菩薩，也沒有佛道可成。
以度生為本的菩提心，第一，是廣大的：不但為一人，一些人，或一分眾生，而是以一切眾生為救拔的對象。
又是徹底的：眾生的苦痛無邊，冷了給他衣穿，餓了給他飯吃，病了給他醫藥，都可解除眾生的痛苦；
政治的修明，經濟的繁榮，學術的進步，也著實可以減輕眾生的痛苦。
但苦痛的根源沒有拔除，都是暫時的，局部的，終非徹底的救濟。
所以，菩薩的大菩提心，除了這些暫時的局部的而外，要以根本解脫的無餘涅槃去拯拔眾生。
涅槃為名詞，指解脫生死苦迫的當體；
滅度是動詞，即使眾生於涅槃中得到眾苦的解脫。
涅槃本不可說一說多，然依世俗施設來說，即有凡外與佛法的不同。
世俗有人說：冷了餓了，有饑寒的苦迫；
如生活富裕，豐衣足食，這就是涅槃。
涅槃的字義，有消散的意思，即苦痛的消除而得自在。
所以俗人拍著吃飽的肚子說：這就是涅槃。
有些外道，以四禪八定為涅槃；
不知這祇是定境的自我陶醉，暫時安寧，不是徹底的。
佛法說涅槃，有二：一、有餘（依）涅槃：通達一切法的寂滅性，離煩惱而得到內心的解脫，即是涅槃。
但由前生惑業所感的果報身還在，從身體而來的痛苦，還未能解除。
所以，即使是阿羅漢，饑寒老病的身苦，還是一樣的。
二、無餘（依）涅槃：無學捨身而入無量無數的法性，不再有物我、自他、身心的拘礙，名為無餘。
菩薩發願度生，願使每一眾生都得此究竟解脫，所以說：我皆令入無餘涅槃而滅度之。
無餘涅槃，為三乘聖者所共入，菩薩也會歸於此。
菩薩安住無住大涅槃，即此無餘涅槃的無方大用，能悲願無盡，不證實際罷了！本經以無餘涅槃度脫一切眾生，即本於三乘同入一法性，三乘同得一解脫的立場；
也就因此「通教三乘」而「但為菩薩」。
◆菩薩願滅度無限量、無計算、無邊際的眾生，但在菩薩的菩提心行中，不見有一個眾生得滅度的。
《般若經》也說：「我當以三乘法拔濟一切有情，皆令於無餘涅槃界而般涅槃；
我當雖以三乘滅度一切有情，而實不見有情得滅度者」。
何以不見有情？
因菩薩觀緣起相依相成，無自性可得，通達自身眾生身為同一空寂性，無二無別，不見實有眾生為所度者。
必如此，纔是菩薩的大菩提心，纔能度一切眾生。
否則，即執有我相、人相、眾生相、壽者相，離空無我慧——般若的悲願，即不能降伏其心而安住菩提心了，即不成其為菩薩了！
◆通達我、人、眾生、壽者的無相，即般若慧的妙用。
在大乘行中，般若是遍通一切的，不論四攝、六度、三解脫、四無量以及一切智、一切種智，無不以般若慧而徹悟他的空無自性。
所以，菩提心是即空的菩提心，與菩提心相應的悲願，即無緣大悲。
見到眾生的痛苦，生起濟拔的惻隱心，以世間的財法去救濟他，是眾生緣悲。
如見眾生為相續、和合的假我，法生苦生，法滅苦滅，因而起悲濟心，是法緣悲。
如能觀諸法從緣，都無真實的自性，悟入法性空，緣即空而緣起的假我，生大悲心，願度如幻眾生，這是無緣大悲。
無緣大悲，即與般若相應的大悲。
悟了眾生空寂無自性，所以雖度脫一切而實無眾生得滅度者。
如海中印現的明月，由於風吹波動而月相不見了。
從他的不見說，好似滅去了，其實那有自體可滅呢！發心菩提，重在發願度生，所以也就重於我空。

◆我、人、眾生、壽者，都是眾生的異名；
《般若經》中有十六種異名，都不外從眾生的某一特性而立名，眾生即執此為實有。
我，是主宰義，即每一眾生的行動，常人都有自己作主與支配其他（宰）的意欲，所以稱為我。
人，行人法，所以名為人。
眾生，約現在說：即五眾和合生的——有精神與物質和合的；
約三世說：即由前生來今生，今生去後生，不斷的生了又死，死了又受生，與補特伽羅的意義相合。
壽者，說眾生的從生到死，成就命根，有一期的生命相續。
以般若正觀，即無我、人、眾生、壽命的實性可得。
但在五眾和合的緣起法中，有無性從緣的和合相續——假我；
依此假名眾生，成立業果相續，生死輪迴。
眾生不知無我而執為實有我及我所，所以起惑造業，生死不了；
如達自性空而離自我的妄執，即能解脫而入無餘涅槃。

◆菩薩發菩提心，以大悲為根本，即菩提心由大悲而發起；
大悲所發的菩提心，非般若空無我慧，不得成就，即要以般若為方便。
悲心不具足而慧力強，要退墮聲聞乘的。
慧力不足而悲心強，要流於世俗而成所謂「敗壞菩薩」的。
必須大悲，般若相輔相成，才能安住菩提而降伏其心。
《般若經》說：「一切智智相應作意（即菩提心），大悲為上首，無所得——即般若空慧為方便」。
發菩提心者，不可不知！
^ck6【戊二　伏心菩提】
^o@vcpp.4:1復次，須菩提！菩薩於法應無所住行於布施，所謂不住色布施，不住聲、香、味、觸、法布施。須菩提！菩薩應如是布施，不住於相。何以故？若菩薩不住相布施，其福德不可思量。須菩提！於意云何？東方虛空可思量不」？「不也，世尊」！「須菩提！南、西、北方、四維、上、下虛空可思量不」？「不也，世尊」！「須菩提！菩薩無住相布施，福德亦復如是不可思量。須菩提！菩薩但應如所教住！
◆發菩提心，不單是心念而已，要有踏實的事行去救眾生。
從救度眾生中，降伏自己的煩惱，深入清淨的實相，達到自利利他的圓成。
所以，在發心菩提——願心菩提以後，應進而修行——行心菩提，漸能折伏煩惱使不現行，七地以前，名為伏心菩提。

◆論到菩薩的修行，總括的說，不外乎六波羅蜜。
此六度以般若為導，而實彼此相應相攝，一波羅蜜即具足一切波羅蜜。
本經發菩提心，以大悲度眾生為首，這與布施——以自己所有的給予眾生，使他離苦得樂，尤為吻合，故本經即以布施為主而統攝利他的六度行。
布施如何能攝六度？
布施有三：一、財施：以財物賙濟人是財施，以體力甚至犧牲生命去救助人，也是財施。
所不同的是：衣食等財物為外財施，體力、心力以及生命等為內財施。
這財施，即狹義的施波羅蜜。
二、無畏施：令眾生離諸怖畏，這就是持戒與忍辱二波羅蜜。
持戒，能處眾不礙大眾，不使人受到威脅不安。
如殺人者，使人有生存的威脅；
偷盜者，使人有外命（財物）喪失的恐怖等。
如能受持禁戒，潔身自守，即不會侵害他人，能使人與人間相安無事了。
但人類個性不一，你以戒自守，他卻以非禮待你；
如不能感化或設法避免，不能忍受而衝突起來，仍不免相殺相奪，造成人間的恐怖。
必須以戒自守——克己，又以忍寬容他人——恕人，才能做到無畏施。
三、法施：即精進、禪定、般若三波羅蜜。
般若是明達事理的，沒有智慧，即落於顛倒二邊，不知什麼是佛法？
是邪是正？那怎能救人？
禪定是鑑機的，如內心散亂，貪著世間，我見妄執，即不能洞見時機，不知眾生的根性，即不能知時知機而給予適宜的法藥。
精進是雄健無畏的，有了精進，才能克服障難，誨人不倦，利人不厭。
這樣，六波羅蜜統攝於布施，為菩提行的根本了。
要救眾生，不能不犧牲自己去利他——布施：這必須具足物質救濟，以達到眾生生活等的滿足；
必須以戒忍的精神，達到人與人間和樂安寧；
又必須以進、定、慧的教化，革新眾生的思想意志，而使之歸於中道。
從前，僧團中的「利和同均」「戒和共遵」「見和無諍」，也即是六度精神的實施！
◆佛對須菩提說：菩薩行布施——六度利他時，於法應無所住行於布施。
這即是說：不要住於色境而行布施，不要住於聲境乃至法境而行布施。
於法應無所住的法，指一切法說；
香味觸法的法，但指意識所對的別法塵。
住，是取著不捨的意思。
眾生在六塵境——認識的一切上起意識時，都有自性的執見，以色為實色，以聲為實聲，總以為是確實如此存在的。
因為取著六境，即為境所轉而不能自在解脫。
菩薩為度眾生而行布施，對於施者、受者、施、施時、施處、施因、施果這一切，當然要能遠離自性的妄取，能不著相而布施，才能真實利濟眾生。
否則，覺得有我是能施，他是受施，所施物如何如何，希望受者的報答，希望未來的福報，甚至因而貢高我慢，這都從住於法相而生起來，這那裡還像菩薩行？
所以，佛總結的對須菩提說：菩薩修行，應這樣的不住於相——相即六塵境相而行布施！
◆不住於相的布施，能降伏煩惱，能安住菩提心，而且所得的福德，廣大得不可思議！有相布施，不能通達三輪性空，所得功德即有限有量。
無論功德多麼大，總不過是人天有限的福報。
但如能以般若相應而布施，將此布施融歸於法性，迴向於一切眾生而同趨於大覺，功德即無限而不可思量。
如以一滴水投入大海中，即遍大海的水性而不可窮盡。
為了說明這個，佛便問須菩提說：你的意見怎樣？
東方的虛空可思量嗎？
南方、西方、北方的虛空，以及四維、上方、下方的虛空，可以思量嗎？
須菩提一概否定的說：不可。
佛即說：既知道十方虛空是不可思量的，也應該知道菩薩不住相布施的功德，也同虛空一般的不可思量。
這並不是以虛空的廣大，形容福德的廣大，而是以虛空的無所有，不可住、不可著、不可說邊際數量，如無相布施的自性不可得一樣。
菩薩是應該這樣的安住，這樣的行施，所以如來說：菩薩但應如所教住！無相布施，指空相應布施，通達能施所施畢竟無自性的布施。
即空如幻的布施，如此因，如此果，如此利他，如此自利，都法相宛然有而不失不壞。
佛怕人以無記心布施，或執理廢事，所以特舉不可思量的功德以顯示布施因果。

◆前發心菩提，以願度眾生為主，所以與般若相應即重在我空。
伏心菩提以實行利濟為主，所以與般若相應，即重在法空。

^ck7【戊三　明心菩提】　　己一　法身離相而見
^o@vcpp.5:1須菩提！於意云何？可以身相見如來不」？「不也，世尊！不可以身相得見如來。何以故？如來所說身相，即非身相」。佛告須菩提：「凡所有相皆是虛妄；若見諸相非相，則見如來」。
◆明心菩提，約七地菩薩定慧均等，現證法性，得無生法忍而說。
證法，即「見法」，「見法即見佛」。
佛之所以為佛，即在究竟圓覺緣起空寂的中道；
離此正覺，更沒有什麼奇特！如能悟徹緣起法相的空寂，即與佛同一鼻孔出氣。
所以說：「見緣起即見法，見法即見佛」，這才是真切見佛處。
上面伏心菩提，廣行利濟眾生，積集了無邊的福智資糧；
漸能悲智相扶，定慧均等，「方便成就」，有力現證無分別法性了。
因此，佛特舉「見佛」，問須菩提道：取著身相——三十二相、出入來去相、穿衣吃飯相、坐禪說法相，能正見如來嗎？
須菩提是過來人，所以說不可。
從前，有一次，佛從忉利天來下人間，人間的佛弟子，都歡喜的去見佛。
依次序，比丘應在比丘尼之先，但蓮華色尼為了先得見佛，即化作轉輪王，走在最前面。
他以為最先見佛了，但佛對他說：不是你先見，「須菩提先見我身」。
原來，那一次，須菩提沒有參加迎佛的勝會。
當眾人去見佛時，他想：佛曾說：見法即見佛，我何不正觀法相！於是他就觀察諸法的從緣生滅，從無常為門而悟入諸法無性空，徹見了如來法身。
須菩提曾有此體驗，所以佛一提到，他就肯定的說：不可以身相得見如來。
這些身相，都不過是假名如幻的妄相；
佛的無盡莊嚴，也一樣的絕無少許法可取可得。
所以，佛說的身相，即非有身相的實性。
如取著假相為佛，即不見如實空相，自也不能深見如來的所以為如來了！
◆須菩提但依身相的虛妄說，如來本此原理，又推進一層說：不但如來的身相是虛妄的，所有一切的法相，如山河大地器界相，凡外賢聖眾生相，有礙可壞的色相，明了分別的心相，這一切無不是依緣起滅，虛妄不實的。
虛妄的還他虛妄，如不執妄相自性為可見可得，即由諸相非相的無相門，契入法性空寂，徹見如來法身了！從緣起的虛誑妄取相看，千差萬別；
從緣起本性如實空相看，卻是一味平等的。
法性即一切法自性不可得而無所不在，所以也不須於妄相外另覓法身，能見得諸相非相，即在在直見如來。
所以古人說：「山河及大地，全露法王身」。
◆般若道三階：發心菩提重於願，伏心菩提重在行，明心菩提重在證。
又，初是住菩提心，中是修悲濟行，後是悟如實義。
初以般若扶大悲願，中以般若導六度行，後是般若現證。
雖各有所重，而菩提願、悲濟行與性空見，實是不可離的。

立菩提願───發心菩提
修悲濟行───伏心菩提
住性空見───明心菩提
^ck8【己二　眾生久行乃信】　　庚一　問
^o@vcpp.6:1須菩提白佛言：「世尊！頗有眾生得聞如是言說章句，生實信不」？
◆離一切相的現見法性，非凡常的名言思度可測，真所謂「甚深極甚深，難通達極難通達」的。
所以，須菩提為末世眾生著想，勸學此甚深法門，而啟問如來：未來世中，眾生聽到這樣甚深的法門——言說章句，能有生起真實信心的沒有？

◆實信，在聲聞法中，即證須陀洹，得四不壞信——四證淨；
大乘在見道淨心地。
這是般若相應的證信，非泛泛的仰信可比。
由信順而信忍，由信忍而達到信智一如的證信。
論到證信，佛世即難能可貴了！何況末世眾生的福薄根鈍呢？
須菩提舉此一問，不但說明了能有信者，且說明了證信者的資格；
而相似的信解，也知道應該如何了！
^ck9【庚二　答】　　辛一　戒慧具足
^o@vcpp.6:3佛告須菩提：「莫作是說！如來滅後後五百歲，有持戒修福者，於此章句能生信心，以此為實。
◆般若法門雖極難信解，但自有利根障薄而智慧成就的眾生，能信以為實。
佛說：在如來滅後，後五百年歲時，多有大心眾生出世，能發心學菩薩行，嚴持戒行，廣習布施的利他福德，智慧深徹，於佛說的般若章句，能生起深切的信心，確信唯此般若法門，為不二的解脫門，能如實悟入深義。
從歷史上看：佛滅五百年後，迦膩色迦王治世的時代，大乘教法，廣大流行。
《般若經》也說：「五百年後，般若經於北方當作佛事」。
所以，深信此難信法門，確乎是有的。
不過，要有「戒足」、「慧目」；
如不持戒、不修福、不習禪慧，即不能於這甚深法門，得如實信了！
^ck10【辛二　久集善根】
^o@vcpp.6:6當知是人，不於一佛二佛三四五佛而種善根，已於無量千萬佛所種諸善根。
◆此人所以能信解悟入甚深法門，因為在過去生中，已於無量千萬佛所，積集深厚的善根了！過去生中，多見佛，多聽法，常持戒，常修福，種得廣大的善根，這才今生能一聞大法，就淨信無疑，或一聞即悟得不壞淨信。
在同一法會聽法，有的聽了即深嘗法味，有的聽了是無動於衷；
有的鑽研教義，觸處貫通，有的苦下功夫，還是一無所得；
這無非由於過去生中多聞熏習，或不曾聞熏，也即是善根的厚薄。
要知道：佛法以因果為本，凡能戒正、見正、具福、具慧，能信解此甚深法門，決非偶然，而實由於「夙習三多」。
所以，佛法不可不學，不學，將終久無分了！
^ck11【辛三　諸佛攝持】
^o@vcpp.6:8聞是章句乃至一念生淨信者，須菩提！如來悉知悉見；是諸眾生得如是無量福德。
◆過去久種善根，今生能戒慧雙修，聽此深法能生清淨信的，即為十方如來所知所見。
如來知見，即上文的護念攝受。
佛是大菩提的圓證者；
菩提即智慧，菩薩即是具智慧分的，能與如來的大覺相契，所以能常在諸佛悲智的知見攝受之中。
知而又見，即明是現量的真知灼見。
眾生能淨信甚深法門，能為諸佛所護持，這是怎樣大的福德呀！　　辛四　三相並寂
^o@vcpp.6:10何以故？是諸眾生無復我相、人相、眾生相、壽者相，無法相，亦無非法相。何以故？是諸眾生，若心取相，則為著我、人、眾生、壽者。若取法相，即著我、人、眾生、壽者。何以故？若取非法相，即著我、人、眾生、壽者。是故不應取法，不應取非法。以是義故，如來常說：『汝等比丘！知我說法如筏喻者，法尚應捨，何況非法』！
◆戒慧成就，久集善根者，為什麼能得如來的護念，得無量福德呢？
這因為此類眾生，已能無我相、人相、眾生相、壽者相了；
而且還沒有法相及非法相。
我、人等四相，合為一我相：無此我相，即離我相的執著而得我空。
無法相，即離諸法的自性執而得法空。
無非法相，即離我法二空的空相執而得空空。
執我是我見，執法非法是我所（法）見；
執有我有法是有見，執非法相是無見。
般若離我我所、有無等一切戲論妄執，所以說：「畢竟空中有無戲論皆滅」。
能三相並寂，即能於般若無相生一念清淨心。
經上說：「一切法不信則信般若，一切法不生則般若生」。
能契入離相，自能得如來的知見護念了。
在「無非法相」句下，諸譯本有「無想，無非想」二句。

◆悟解三空，方能於般若無相法門得清淨信，此義極為重要。
有以為我相可空而法相不空的；
有以為我相空卻，法相可以不必空，即是說：執著法有是不妨得我空的；
或者以為我法雖空而此空性——諸法的究竟真實，是真常妙有的。
現在說：如覺有真實的自性相，有所取著，那不論所著的是法相或空相，不但不悟法空與空空，也不得無我慧，必也是取著我等四相的。
所以，我我所見，實為戲論的根源，生死的根源。
如真能無我無我所，離一切我執，那也必能離法見、空見的妄執，而能「見諸相非相，即見如來」。
這因為我空、法空、空空，僅是所遣執取的對象不同，「而自性空故」的所以空，並無差別。
如燒草的火與焚香的火，草火香火雖不同，而火性是同一的。
了解草火的性質，就能明白香火的性質。
眾生妄執自性相，即確實存在的——甚至是不變的，不待他的妄執。
於眾生的自體轉，執有主宰的存在自體，即我執；
於所取的法相上轉，執有存在的實性，是法執；
這是於有為法起執；
如於無為空寂不生不滅上轉，執有存在自性，即非法執。
所以，執取法相而不悟法空，執非法相而不悟空空，終究是不能廓清妄執的根源，不知此等於不知彼，所以也不得我空了。

◆佛為弟子說法，多說眾生由五眾和合成；
此五眾，一切是無常生滅不安隱法，所以色非我非我所，受、想、行、識也非我非我所。
無常故無我的教授，利根者當下能依無我無我所，徹見涅槃寂滅。
既離我執，也不會再取法相及非法相。
佛滅後，有的不能從無常無我中得畢竟空，轉而執我無法有。
對此執法眾生，不得不廣顯法空。
而或者又撥無我法的緣起，或取執空性為實有離言自性。
這都是守指忘月，辜負佛恩！所以，本經又如實開示：不應取相，如執著法相非法相，即執著我相，是不能得無我慧而解脫的。

◆不要以為這是大乘不共妙門！這是如來的一道解脫門，所以提醒須菩提說：還記得嗎？
我在《筏喻經》中說：「法尚應捨，何況非法」，即早已開示過了！筏是竹筏，交通不便或水淺的地方，竹筏可用作交通工具。
利用竹筏，即能由此岸到彼岸。
到了彼岸，竹筏當然捨去了，誰還把他帶著走！眾生在生死海中，受種種苦迫，佛為了濟度他們，說種種法門，以法有除我執，以空相破法執，使眾生得脫生死而到達無餘涅槃。
當橫渡生死苦海時，需要種種法門，但度過中流，必須不執法非法相，才能出離生死，誕登彼岸。

◆《筏喻經》，出《增一阿含》中。
法與非法，有二義：一、法指合理的八正道，非法即不合理的八邪。
法與非法，即善的與惡的。如來教人止惡行善；
但善行也不可取著，取著即轉生戲論——「法愛生」，而不能悟入無生。
約「以捨捨福」說，善法尚且不可取著，何況惡邪的非法？
二、法指有為相，在修行中即八正道等；
非法指平等空性。
意思說：緣起的禪慧等功德，尚且空無自性，不可取執，那裡還可以取著非法的空相呢？
本經約後義說。
從這引阿含教的非法非非法來說，可見前文也應以「不取法相、不取非法相」為正。
諸譯增入「無想無非想」二句，不足取！
^ck12【己三　賢聖無為同證】　　庚一　舉如來為證　　辛一　正說
^o@vcpp.7:2須菩提！於意云何？如來得阿耨多羅三藐三菩提耶？如來有所說法耶」？須菩提言：「如我解佛所說義，無有定法名阿耨多羅三藐三菩提，亦無有定法如來可說。何以故？如來所說法，皆不可取、不可說，非法非非法。所以者何？一切賢聖皆以無為法而有差別。
◆離一切相的般若，難信難解。
上已明未來有人能信能證，以下再以已經能淨信實證的聖賢，來證明此難信難解的可信可證。
先舉究竟圓證的如來為證。
◆佛問須菩提：今有兩個問題問你：一、如來在菩提樹下成遍正覺，實有阿耨多羅三藐三菩提可證得嗎？
二、如來成道後，大轉法輪，確有法可說嗎？
佛舉此二問，因菩薩得明心菩提，即分證無上菩提，而佛卻說：「諸相非相」；
又說：「不應取法，不應取非法」。
恐有人懷疑：佛得阿耨多羅三藐三菩提，不是可得嗎？
不又大轉法輪嗎？
既可證可說，為什麼說「凡所有相皆是虛妄」？
「不應取法，不應取非法」呢？
須菩提雖沒有圓證如來境界，但他是無諍行大阿羅漢，憑自己證覺無為空性的體驗，及佛說無相，比知如來聖境而回答說：如佛所說，如我所解，是沒有定性——自性的阿耨多羅三藐三菩提為佛所證，也沒有定性的法為如來所說。
須菩提的回答，真是恰到好處！佛陀的現覺，沒有能證所證的差別可得，所謂「無智亦無得」。
如覺有什麼為智慧所得，這那裡還是正覺！論到說法，更沒有定法可說，一切名言不得實義。
佛法雖多，不外證法與教法。
無證無說，即明如來的自證化他，無不性空離相；
因為性空離相，這才成佛說法呢！但無有定法可說，決非隨便亂說。
語言不得實相，但在世俗心境的習慣中，也有他的彼此、同異、是非。
如東南西北，雖沒有定性，但世俗仍有一定的方向可指；
假使指東話西，即是違反世間。
世間的一般語言，尚不可亂說，何況佛法！所以，隨順世俗而安立佛法，如來師子吼，常作決定說。

◆何以證無可證，說無可說？
因佛所說的及所證的法，是沒有定性可以取著的或可說的。
取著，約心境的能證所證說；
言說，約語言的能詮所詮說。
凡是心有所取，口有所說，一切都是自性空的，所以名為非法；
一切法非法的無為空寂，也還是不可取不可說，所以又說非非法。
佛的自證化他如此，明心菩提也如此。
為了顯明這點，所以說：一切賢聖皆以無為法而有差別。
大聖佛陀，二乘聖者，大乘菩薩，或還在修證的進程中，或已達究竟極果，這都因體悟無為法而成。
無為，即離一切戲論而都無所取的平等空性。
無為離一切言說，平等一味，怎麼會有聖賢的差別？
這如廣大的虛空——空間，雖可依事物而說身內的空，屋中的空，方空、圓空，但虛空性那裡有此彼差別！虛空雖沒差別，而方圓等空，還是要因虛空而後可說。
這樣，無為法離一切戲論，在證覺中都無可取可說，而三乘聖者的差別，卻依無為法而施設。

^ck13【辛二　校德】
^o@vcpp.8:1須菩提！於意云何？若人滿三千大千世界七寶以用布施，是人所得福德寧為多不」？須菩提言：「甚多，世尊！何以故？是福德，即非福德性，是故如來說福德多」。「若復有人於此經中，受持乃至四句偈等，為他人說，其福勝彼。何以故？須菩提！一切諸佛及諸佛阿耨多羅三藐三菩提法，皆從此經出。須菩提！所謂佛法者，即非佛法。
◆校量功德，在《般若經》中是隨處可見的。
信解般若，必然能得大功德。
這在悟解空性的聖賢，本是用不著廣說的；
但為攝引初學，而怕他們誤解空義而撥無因果，所以特為層層的校量。
功德的殊勝，在比較中最容易表顯出來。
所以，佛問須菩提說：假使有人以充滿三千大千世界那麼多的七寶，布施貧窮困苦的眾生，或供養自己的父母，受教的師長，信奉的三寶，你說這人所得的功德多不多？
七寶，是金、銀、琉璃、玻璃、車渠、赤珠、瑪瑙，這是形容質的貴重。
三千大千世界，是一千小千為中千，一千中千為大千的一佛所化世界，這是形容量的眾多。
以這樣貴重而又那樣多的七寶作布施，是真有其事嗎？
有的說：這是假設的，世間七寶雖多，但總沒有這麼多；
經中所說，只是假設校量罷了！有的說：可能是真實的。
法身菩薩確能以三千大千世界的七寶，上供十方諸佛，下施六道眾生。

◆須菩提回答說：多極了！因所得福德，勝義諦中是沒有真實的福德性可得的。
然而，因為法性空無自性，所以如幻緣起，能有一切的眾多福德可起可說。
不然，實有的即不從緣起，也就沒有布施福德可說了。
須菩提這樣的解說，還是為了聽眾。
一面說有緣起，一面又即此緣起而顯空性。
恐人聽說大福德，就以為福德有自性，所以必須「隨說隨泯」，攝一切法以趣空。

◆佛又對須菩提說，你所說固然不錯，但不要以為那人的福德就算大了！告訴你：假使另有人對於本經，不要說受持全部所得的功德，就是受持一四句偈，或為他人說一四句偈，所得的功德，也是超過那人的布施功德，千倍萬倍而不可計算的。
受是領受，持是憶念明記不忘。
四句偈，有人說是我等四相，有人說是末了一頌。
其實，這是形容極少的意思。
偈，有名為首盧迦偈的，是印度人對於經典文字的計算法。
不問是長行，是偈頌，數滿三十二字，名為一首盧迦偈。
如《般若‧初會》的十萬頌，《金剛般若經》三百頌，都是指首盧迦偈而言。
受持四句偈，意思是極少的；
而所得的福德極多，即顯示了本經的殊勝。
◆修學佛法，不外「聽聞正法，如理作意，法隨法行」。
依此修學的次第而細別起來，或說五法行——如法華，或說六法行等，或總為十法行。
十法行是：一、書寫，二、供養，三、施他，四、諦聽，五、披讀，六、受持，七、開演，八、諷誦，九、思惟，十、修習。
此中受持與為他人說，即略舉其中的二行。
受持是自利，為他人說是利他，能於此甚深法門自利利他，功德當然不可思議。
七寶等財施，固然能予人們以物質的滿足，但它是暫時的；
法施，能啟發人的正知正見，健全人的品德，引導他向上增進以及解脫、成佛，由此而可得徹底的安樂，所以非財施可及！
◆佛所以說這人的功德超過七寶布施，是因為一切佛及佛的阿耨多羅三藐三菩提法，都從此般若性空法門——經典所出生的。
《般若經》說：般若為諸佛母。
如進一層說：佛說的十二部經，修學的三乘賢聖，也沒有不是從般若法門出生的。
沒有般若，即沒有佛及菩薩、二乘，就是世間的人天善法，也不可得。
般若為一切善法的根源！得無上遍正覺，所以名為佛；
而無上遍正覺，即是老般若。
沒有般若因行，那裡會有無上遍正覺，那裡會有佛？
此經讚歎般若，及般若契會實相，所以不限於《金剛經》，凡與此般若無相法門相契的，都同樣的可尊。

◆諸佛，是佛；
阿耨多羅三藐三菩提，是佛所得法。
佛與佛所得的法，合名佛法。
佛說：所說的佛法，即是非佛法。
畢竟空中，確是人法都不可得的。
假使就此執為實有佛法，那就錯了！
^ck14【庚二　舉聲聞為證】
^o@vcpp.9:1須菩提！於意云何？須陀洹能作是念：我得須陀洹果不」？須菩提言：「不也，世尊！何以故？須陀洹名為入流，而無所入，不入色、聲、香、味、觸、法，是名須陀洹」。「須菩提！於意云何？斯陀含能作是念：我得斯陀含果不」？須菩提言：「不也，世尊！何以故？斯陀含名一往來，而實無往來，是名斯陀含」。「須菩提！於意云何？阿那含能作是念：我得阿那含果不」？須菩提言：「不也，世尊！何以故？阿那含名為不來，而實無不來，是故名阿那含」。「須菩提！於意云何？阿羅漢能作是念：我得阿羅漢道不」？須菩提言：「不也，世尊！何以故？實無有法名阿羅漢。世尊！若阿羅漢作是念：我得阿羅漢道，即為著我、人、眾生、壽者。世尊！佛說我得無諍三昧人中最為第一，是第一離欲阿羅漢。我不作是念：我是離欲阿羅漢。世尊！我若作是念：我得阿羅漢道，世尊則不說須菩提是樂阿蘭那行者。以須菩提實無所行，而名須菩提是樂阿蘭那行」。
◆明心菩提所證的諸相非相，是三乘所共入的。
上文說：「一切賢聖皆以無為法而有差別」；
《十地經》也說二乘能得此無分別法性，所以再引聲聞的自證來證成。
《般若經》是教化菩薩的，但也密化聲聞，不要妄執法相非法相，自稱阿羅漢！要知道：般若空為不二門，要是親證聖果的，一定會信解佛說的無我相、無法相、無非法相。
《法華經》以此平等大慧為一乘的根柢，所以也說：除去增上慢人，真阿羅漢是決會信受的。
所以《般若經》說：二乘的智與斷，都是菩薩無生法忍。
這是以聲聞例證菩薩聖境，也即密化聲聞回心大乘。

◆佛問須菩提說：證須陀洹果的聖者，他會起這樣的想念：我能得須陀洹果嗎？
須菩提曾經歷須陀洹果，所以即回答說：這是不會的。
須陀洹的意義，即是入流——或譯預流。
有的說：預是參預、參加、加入；
得法眼淨，見寂滅性，即預入聖者的流類，所以名為須陀洹。
但依本經，應這樣說：契入「法流」，即悟入平等法性，所以名為須陀洹——入流。
然而契入法性流，是約世俗說；
在現覺法流——勝義自證中，實是無所入的。
法法空寂，不見有能證所證，也不見有可證可入。
色聲等六塵，即一切境界相，不入此一切境相，才稱他為須陀洹呢！須陀洹是聲聞乘的初果，斷除三結即一切見所斷惑，初得法眼淨而得法身；
經七番生死，必入涅槃。
◆佛又問：那麼，證得二果的斯陀含，他會自念我能得斯陀含果吧？
須菩提也說不會的。
因為，斯陀含的意義是一往來——簡稱一來。
證得二果的聖者，斷欲界修所斷惑六品，還有下三品，還須一往天上、一來人間受生，方得究竟。
但在聖者的現覺中，沒有數量可說，沒有動相可說，那裡會想到此來彼去？
聖者通達我法畢竟空，所以不但不會起實有自我的意念，就是自己的來去活動，也是了不可得。

◆佛接著又問：證了三果的阿那含，或許會自以為能證阿那含果吧？
阿那含，是不來的意思。
斷五下分結，即欲界的修惑斷淨，不再來欲界受生，所以名為阿那含——不來。
須菩提回答說：也不會的。
因為，沒有真實的不來者，是我空；
沒有真實的不來法，是法空。
阿那含深入法性，不但不著來相，也不著不來相。
一般以為來去是動的，沒有來去，那即是不來（不去）的靜止了。
其實，不來（不去）即是住；
如沒有來去的動相，那裡還有不來不去的靜止相！緣起法中，靜不能離動，離動的靜止不可得；
動也不離於靜，離靜的動相也不可得。
來與不來，無非是依緣假合，在通達性空離相的聖者，是不會自以為是不來的。

◆佛又問：已證極果的阿羅漢，會自以為我得阿羅漢道嗎？
須菩提答：不會這麼想。
阿羅漢，有三義：一、應供，二、殺賊，三、無生。
從阿那含而進斷五上分結，即上界的修所斷惑，得究竟解脫，名為阿羅漢。
約他的恩德說：應受人天供養，為世間作大福田，名為應供。
約他的斷德說：殺盡一切煩惱賊，名為殺賊。
約他的智德說：徹證無生寂滅性，名為無生（得無生智）。
凡夫為惑業所拘縛，流轉於生死中。
初二三果的聖者，還不免隨惑潤業，而說他還有幾番生死。
到阿羅漢，這才惑業乾枯，入於無生而不再感受生死，完成究竟的解脫。
這樣的聖者，於五眾的相續和合中，不見一毫的自性法可得，而可以依之稱為阿羅漢的。
徹悟一切法的生滅不可得，菩薩名為得無生法忍，聲聞即證無生阿羅漢。
生滅都不可得，更有什麼無生可取可得！如見無生，早就是生了！所以，如自以為我是阿羅漢，即有我為能證，無生法為所證，我法、能所的二見不除，就是執著我等四相的生死人，那裡還是真阿羅漢！不過增上慢人而已！
◆須菩提是阿羅漢，所以論到這裡，即依自己的體驗說：世尊不是說我在諸大弟子之中，所得的無諍三昧最為第一嗎？
不也說我是第一離欲（諸煩惱）的大阿羅漢嗎？
世尊這樣的稱歎，可是我從沒有這樣想：我是離欲的大阿羅漢，我能得無諍三昧。
假使我這樣隨相計著，那就在我見、法見、非法見的生死界中，佛也就不會說我是一個好樂修習阿蘭那行的人了。
反之，因為不執著實有無諍三昧可得可修，世尊才稱歎我行阿蘭那行呢！梵語阿蘭那，即無諍。
三昧，即繫心一境的正定。
無諍三昧，從表現於外的行相說，即不與他諍執，處處隨順眾生。
覺得人世間已夠苦了，我怎麼再與他諍論，加深他的苦迫呢？
如從無諍三昧的證境說，由於通達法法無自性，一切但是相依相緣的假名而來。
無我，才能大悲；
離去空三昧，還有什麼無諍行呢！
◆這一章，四番問答，須菩提多隨順空義說。
如隨順世俗，那麼，我得須陀洹……我是阿蘭那行，都是可以分別言說的。
不過，決不會執取實我與實法而作此念的。
^ck15【庚三　舉菩薩為證】　　辛一　正說　　壬一　得無生忍
^o@vcpp.10:1佛告須菩提：「於意云何？如來昔在然燈佛所，於法有所得不」？「不也，世尊！如來在然燈佛所，於法實無所得」。
◆前依聲聞的證境說，此下約得道的菩薩說。
佛告須菩提說：我——如來從前在修菩薩行時，在然燈佛的法會中，有沒有實在的法可得？
須菩提當然回答沒有的。
據說：釋迦在過去修菩薩行時——第二阿僧祇劫滿，曾在雪山修學。
學畢，出山。求得五百金錢，想去報答老師。
當時，見城中整飾市容，潔淨街道，問起路人，才知是預備歡迎然燈佛的。
他想：佛是一切智者，難逢難遇！不能錯失這見佛的機會。
於是，把所有的錢，買得五朵金色蓮華，至誠而歡喜的去見佛。
見佛及弟子的威儀庠序，動靜安和，從心靈深處生起虔誠的敬信；
以所得的五朵華，散向然燈佛。
進城的必經道上，有一窪汙水，他就伏在地上，散開自己的頭髮，掩蓋汙泥，讓佛踏過。
佛知他的信證法性，得無生忍，所以就替他授記：未來世中當得作佛，名釋迦牟尼。
或者以為釋迦——因地——當時在然燈佛處，得了什麼大法，像「別傳」，「秘授」之類，所以舉此問須菩提。
須菩提深見法性，所以說實無所得。
得無生忍，但是隨世俗說；
而實生滅不可得，不生不滅等也不可得，所謂「般若將入畢竟空，絕諸戲論」。
如以為有法可傳可得，那便落於魔道，而不是證於聖性了。

^ck16【壬二　嚴淨佛土】
^o@vcpp.10:3「須菩提！於意云何？菩薩莊嚴佛土不」？「不也，世尊！何以故？莊嚴佛土者，則非莊嚴，是名莊嚴」。「是故須菩提！諸菩薩摩訶薩，應如是生清淨心，不應住色生心，不應住聲、香、味、觸、法生心，應無所住而生其心！
◆得無生法忍的菩薩事業，有二：一、莊嚴佛土，二、成就眾生。
有情的根性不一，有僅能得人天功德的，菩薩即以人天的世間福利去成就他。
有能得二乘果的，即以出世解脫去成就他。
能發菩提心而成佛的，即以大乘的自利利他去成就他。
世間是不平等的，醜惡的，苦痛的，如何化濁惡的世界為清淨，轉苦痛的人生為解脫，這是菩薩的唯一事業。
濁惡世界的淨化，即莊嚴佛土，這以願力為本。
菩薩立大願，集合同行同願的道伴，實踐六度、四攝的善行去莊嚴他。
有以為一人成佛，世界即成清淨，這多少有點誤解的。
菩薩在因中教化眾生，以佛法攝集同行同願者，同行菩薩行。
結果，佛與所化眾生——主伴的功德，相攝相資，完成國土的圓滿莊嚴。
同行同願的菩薩，同住於莊嚴的國土中。
同中有不同，唯佛能究竟清淨、圓滿、自在。
沒有眾會莊嚴的佛土，不過是思辨的戲論！
◆如來以莊嚴國土問須菩提：菩薩發心莊嚴佛土，究竟有佛土可莊嚴，有佛土的莊嚴嗎？
須菩提本般若性空的正見，回答說：沒有真實的國土可莊嚴，也沒有真實的能莊嚴法。
因為，佛土與佛土莊嚴，如幻如化，勝義諦中是非莊嚴的，不過隨順世俗，稱之為莊嚴而已。
《般若經》說無莊嚴為莊嚴；
《華嚴經》說普莊嚴，都是由於性空慧的徹悟法性，淨願善行所成。
國土——世界是緣起假名，所以能廣大莊嚴。
沒有自性的世界，即沒有不變性，如遇穢惡的因緣，即成穢惡的世界；
如造集清淨的因緣，即自然會有清淨的世界出現。
假使，穢惡世界是實有定性而不可改易的，那就是塗抹一些清淨的上去，也不會清淨，反而更醜惡了！所以，世界無定，穢惡與清淨，全依眾生知見行為的邪正善惡而轉。
必須知道如此，才會發心轉穢惡的國土為清淨。
必須善悟國土莊嚴的非莊嚴，才能隨行願而集成國土的莊嚴。

◆眾生的三毒熏心，迷執此穢惡苦迫的世間，以為是安樂、清淨。
佛以呵責的法門，說國土無常、苦迫、不淨。
佛又以誘導的法門，令眾生不以此現實的世間為樂淨，而從無我大悲的利他行願中，創建嚴淨的世間。
但眾生的迷執，是深固的。
聽說莊嚴淨土，又在取著莊嚴，為尊貴的七寶，如意的衣食，美妙的香華音樂，不老不死的永生所迷惑了。
所以，佛告須菩提：如上所說的莊嚴，凡是修大乘行的菩薩，都應生清淨心，離去取相貪著穢惡根源，不要為淨土的莊嚴相——美麗的色相，宛轉的音聲，芬馥的香氣，可口的滋味，適意的樂觸，滿意的想像等而迷惑！要知色、聲、香、味、觸、法，都如幻如化，沒有真實的自性可得。
如取執色等有相可得，這即是三毒的根源，從此起貪、起瞋、起癡，即會幻起種種的苦痛和罪惡。
所以，應不住（著相）一切法，不住而住的住於空性，於無可住的法性而生淨心。
前說無我相、無法相、無非法相，能生一念清淨信心，即是這裡的生清淨心，無所住而生其心。
如此的離相而得淨心，這才能「心淨則國土淨」。
如取著淨土而不能淨心，即縱然進入莊嚴的淨土，那也還是苦痛的，還是穢惡的。
如上海，在物質方面，比較優美得多。
但他並不配稱為清淨，反而被人咒詛為罪惡的淵藪。
這可見莊嚴國土，要從清淨心中去開拓出來！
◆莊嚴佛土者，即非莊嚴，是名莊嚴。
像這一類型的三句論法，本經是頂多的。
或作三諦說；或約三性釋；
或約大乘揀別小乘說。
今依中觀者說：如莊嚴佛土，是討論觀察的對象。
這是緣起的，空無自性的，所以說即非莊嚴。
然而無自性空，並不破壞緣起施設，世出世法一切是宛然而有的，所以隨俗說是名莊嚴。
緣起，所以無性，無性所以待緣起，因此「即非」的必然「是名」，「是名」的必然「即非」，即二諦無礙的中道。
所以說：「諸佛依二諦，為眾生說法」。
^ck17【壬三　成法性身】
^o@vcpp.10:6須菩提！譬如有人身如須彌山王，於意云何？是身為大不」？須菩提言：「甚大，世尊！何以故？佛說非身，是名大身」。
◆這一問題，在說明菩薩的法性身。
未證諸法如實相的菩薩，他的身體，不過較我們強健、莊嚴，還是同樣的肉身。
體悟空相的菩薩身，從證得法性所引生，從大悲願力與功德善業所集成，名為法性生身，非常的殊勝莊嚴。
這不是凡夫能見的，凡夫所見的，是大菩薩的化身。
佛問：如菩薩的法性生身，如須彌山王——即妙高山，在小世界的中央，出海四萬二千由旬，七寶所成，那樣的高大又莊嚴，你以為大不大呢？
須菩提說：這當然大得很！身，梵語伽耶，即和合積聚的意義。
和合積聚，即緣起無自性的，所以即是非身。
非身，所以名為大身。
眾生取相執著，不達法性空，如棄大海而偏執一漚，拘礙局限而不能廣大。
菩薩以清淨因緣，達諸法無性而依緣相成，所以能得此清淨的大身。

◆上面的得無生忍，莊嚴佛土，成法性身，都以明心菩提的通達諸相非相為本，所以引此以證明心菩提的離相聖境。

^ck18【辛二　校德】
^o@vcpp.11:1「須菩提！如恆河中所有沙數，如是沙等恆河，於意云何？是諸恆河沙寧為多不」？須菩提言：「甚多，世尊！但諸恆河尚多無數，何況其沙」？「須菩提！我今實言告汝：若有善男子、善女人，以七寶滿爾所恆河沙數三千大千世界，以用布施，得福多不」？須菩提言：「甚多，世尊」！佛告須菩提：「若善男子善女人，於此經中乃至受持四句偈等，為他人說，而此福德勝前福德。復次，須菩提！隨說是經乃至四句偈等，當知此處一切世間天、人、阿修羅皆應供養如佛塔廟，何況有人盡能受持、讀誦！須菩提！當知是人成就最上第一希有之法！若是經典所在之處，則為有佛，若尊重弟子」。
◆本經校德，一層深一層。
如上用一三千大千世界的七寶布施來校量，這裡就用恆河沙數的大千世界的七寶布施來比較。

◆佛為顯示本經的殊勝，引人尊敬受持，特再問須菩提：如恆河中所有沙的數目，每一粒沙就是一條恆河，有這麼多的恆河中的沙數，算不算多呢？
須菩提答道：恆河已經多得不可計數了，何況是那些恆河中的沙？
這當然多極了！佛又對須菩提說：你不要以為希奇！我老實告訴你：假使有善男子善女人，以七寶充滿爾所——這麼多——恆河沙數的大千世界，拿來布施，你說他的功德多不多？
須菩提說：多極了！佛說：我再告訴你：有人對於這《般若經》，能全部，甚至受持一四句偈，或為人宣說一四句偈，這人所得的福德，勝過前七寶布施者的福德，何止百千萬萬倍？
受持宣說本經的功德，是怎樣的殊勝！
◆自己受持，或為人說一四句偈，有這麼多的福德，那應該怎樣的去尊重恭敬他！無論什麼時候，什麼地方，如有人為他宣說一四句偈，這個地方，就應為世間的眾生，是天、是人或是阿修羅——譯為非天，是有天的福報而沒有天的德性者——所當恭敬尊重的。
要用香、花、燈、樂等作供養，像供養佛的塔廟一樣。
受持演說一四句偈，尚且如此，何況有人能完全受持讀誦的，這當然要格外的尊敬了！
◆或許有人會懷疑：佛有大慈悲，大智慧，所以佛弟子為他建塔，供養舍利，表示尊敬與不忘佛恩。
般若法門所在的地方，與受持讀誦的人，為什麼要像塔廟一樣的供養？
要知道，佛在世時，三寶以佛為主：「佛為法本」，「法從佛出」；
有佛而後有法，而後有依法修行的僧伽。
佛滅後，聲聞佛教時代，三寶以僧伽為中心：有僧即有法，即法身慧命常在，有僧而後有各處塔廟的建立。
但到大乘佛教時代，三寶已轉移為正法中心：有法寶存在，即等於過去的有佛有僧。
般若為法本論的，所以要像供養佛塔廟一樣的恭敬供養他。

◆佛又接著說：能受持讀誦般若經典的，已成就第一殊勝希有的功德了！此般若經典（不必定作經卷看）所在的地方，就等於佛世有佛，及佛滅不久有尊重弟子在那裡。
有此般若，即等於具足三寶，佛法住世。
如此希有的般若大法，學者應怎樣的恭敬尊重他！
^ck19【丙二　勸發奉持】　　丁一　示奉持行相　　戊一　問
^o@vcpp.13:1爾時，須菩提白佛言：「世尊！當何名此經，我等云何奉持」？
◆菩薩的般若道體，已說畢。
此下，約般若功德的尊勝，讚歎以勸人受持。
如來校德完畢，須菩提起來問道：這部經應當叫什麼名稱？
我們應怎樣去受持奉行？
全經的內容，廣大甚深，而一經的名稱，卻能含攝全經的大意，或直示一經的精要。
這在大乘經，十九是如此的。
所以，學者如能於經名有相當的理解，對於全經的要義，也就容易憶持不忘！此一思想，影響於後代的佛教很大，如我國即有專門禮誦《大方廣佛華嚴經》為修行的。
西藏把各種經名，書在轉動的輪子上。
輪子一轉，即一切經名從眼前轉過一次，即以為轉法輪一次了。
日本的日蓮宗，專念「南無妙法蓮華經」。
其實，大乘本義，那裡要我們這樣的受持！要從經義的多多理解中，由博返約依經名而憶持全經的心要才是！
^ck20【戊二　答】　　己一　正說　　庚一　化法離言
^o@vcpp.13:2佛告須菩提：「是經名為金剛般若波羅蜜，以是名字，汝當奉持！所以者何？須菩提！佛說般若波羅蜜，則非般若波羅蜜。須菩提！於意云何？如來有所說法不」？須菩提白佛言：「世尊！如來無所說」。
◆從法門名義和受持的方法，進而論到說法者與說法處。
這些，唯有從如幻畢竟空中，才能如實悟解，知道應該怎樣的受持。

◆佛對須菩提說：這部經，能洗破一切如金剛的戲論妄執，而安住於法法本淨的金剛妙慧，所以名為金剛般若波羅蜜。
應以此經名而攝持經義，如法的受持！然而佛說的金剛般若波羅蜜，即非有般若波羅蜜可得的。
常人聽佛說法，聽到什麼就執著什麼，覺得此言說是能直詮法體的，確有此法如名言所表示的。
不知世俗心行與言說的法，必有名義二者。
名是能詮，義是所詮。
但名能詮義，而名並不能親得義的自性，不過世俗共許的符號。
義是隨名而轉的，似乎可指可說，而義實不一定由某名詮表的。
名不離義而不即是義，義不離名而非即是名；
有名有義的法，法實不在名中，不在義中，不在名義之間，也不離名義，世俗幻有而沒有自性可得。
佛說金剛般若，如取相為如何如何，早就不是了！這是隨順世俗，以名句文身為表示而已！法門名稱如此，全經的文句也如此，應這樣去受持奉行！說到這裡，佛問須菩提：我說金剛般若法門，到底有法可說嗎？
須菩提隨順如來的意思說，依我所理解的，如來是無法可說的；
什麼也不是語言可說的，何況離相的金剛般若？
◆無法可說，前在舉如來為證中說過。
但那裡講的，是約佛證離言以明無所說，這裡是約法的離言以說明的。

^ck21【庚二　化處非實】
^o@vcpp.13:5「須菩提！於意云何？三千大千世界所有微塵，是為多不」？須菩提言：「甚多，世尊」！「須菩提！諸微塵，如來說非微塵，是名微塵。如來說世界，非世界，是名世界。
◆說法，必有說法的地點，如祇樹給孤獨園。
依聲聞佛教說：佛以三千大千世界為化土，即於此大千世界說法度眾生。
大乘佛教，一佛所化的區域，就擴大得多了！本經密化聲聞，所以依大小共許的大千世界說。
開示化處的性空，從兩方面說：一、世界，二、微塵。
我們所住的世界，是由無數的微細物質集成的，世界為一組合體。
集成此世界的微細物質，名為——極微的微塵。
一般取相的聲聞學者，以世界為組合的假有——也有說實在的；
而能集成世界的極微，都說是實有的。
如現代的科學界，也以為此世界是由微細的物質組成的，一層層的分析，不論是分子、原子，或者是電子、量子，總之，都認為有某種實在物，為此世界組合的原素。
世俗的見解，由於自性見的無始迷惑，當然是這樣說的。
但佛法，要從自性非有的本性空中，觀察這微塵與世界。

◆佛問須菩提：一佛所化的三千大千世界內所有的微塵，算起來多不多？
這是多得幾乎不可計算的。
但佛說：這一切微塵，我說即非微塵，是名微塵。
如古代印度的勝論師等，佛教的一分聲聞學者，都主張色法——物質有極微細的塵粒，即是不可再分析的個體；
無論如何分析，終究有這最後的質素。
大乘佛教，不但中觀師說微塵即非微塵，就是唯識學者也說沒有實在微塵可得的。
世間的微塵，依唯識者說：是心識變現的，是由內心的色種子，變現這似乎外在的色法，而實不是離心有自相的。
中觀者說：一切法是因緣和合生的，緣生的諸法中，雖有顯現為色法的形態，而且是有粗有細的。
不論為粗的細的，都是無常、無我而自性空寂的。
如執有究極實體的極微，或不可分析、不可變異、不待他緣的極微，那是根本不可得的。
自性雖不可得，而緣起假名的色法，不但是有的，有粗的細的，而且還有相對的緣起外在性。
所以，不但不是心的產物，而且心識的現起，還不能離色法而存在！當然，也不會說心是色法產生的。
所以，如聽說微塵非微塵，即以為是緣起色法的否定，這才誤會了！微塵也是緣起的「是名微塵」呢！
◆同樣的理由，由於極微的緣起色等，為緣而和合為世界的形態，組成世界的微塵，還沒有自性可得，依之而集成的世界，當然也不會實有自性了！所以又說：如來說世界，即非世界。
而幻化的世界宛然，所以又是名世界。
如執極微為實而世界為假，這不但不知極微，也不會明白世界的性空與假名！
^ck22【庚三　化主無相】
^o@vcpp.13:8須菩提！於意云何？可以三十二相見如來不」？「不也，世尊！不可以三十二相得見如來，何以故？如來說三十二相，即是非相，是名三十二相」。
◆有所說的法，說法的處所，即有能說法者，這即是具諸相好的如來。
所以佛又問：可以三十二相而見說法的如來麼？
在明心菩提文中，曾論過可否以身相見如來。
但那是約見法即見如來說，現在約為眾說法者說。
須菩提答：不能。
因為如來說的三十二相，沒有自相可得，不過如幻如化的莊嚴身相，名為三十二相罷了。

◆所說法，所化處，能化主，一切是無性離相，如幻如化；
那麼金剛般若波羅蜜法門，即應當如法的受持奉行了！
^ck23【己二　校德】
^o@vcpp.13:10「須菩提！若有善男子善女人，以恆河沙等身命布施；若復有人，於此經中乃至受持四句偈等，為他人說，其福甚多」！
◆上面校德，第一以充滿三千大千世界的七寶布施，第二以充滿恆河沙數的世界七寶布施，現在以恆河沙數的身命布施，比校受持本經及為人說法的功德。

◆布施的精義，在犧牲自己所有的去利益他人。
自己所有的，最貴重的莫過生命。
捨財還容易，捨身可難了。
財物，是生存所必須的；
世人貪戀財物，本出於生存的要求。
但這畢竟是身外物，施捨了，不一定影響自己的生存。
身命即生命的當體，以此布施，生存立刻有問題，這大非容易。
但不是不可能的，如從前有孝敬父母的，二老病了，割股療養。
又有兄弟間互爭，願意犧牲自己，以救全兄弟的性命。
這都是以家族為對象的，或進而以國家民族為先，願為國家而死的。
如儒者所說「殺身成仁」，「捨生取義」，也即是身命布施的一端。
佛法以一切眾生，全體人類為悲濟的對象，所以本於慈悲的利他行——布施，不分人我，救濟一切，擴大到一切眾生界，不惜自己的身命。
這在菩薩的修道過程中，捨身利他的事實，經律中記載得很多。
身命布施，除了出於同情的悲心而外，也有為了真理的追求——求法而不惜捨身的。
身命布施的功德，雖比外財施大得多，但還是暫時的不究竟的救濟。
受持與講說般若，是思想的文化的救濟，能拯拔墮落的人格，開發錮蔽者的智慧，使他趨向光明，一直到究竟的解脫。
所以，比身命布施的功德，要多到無可計算了！
^ck24【丁二　歎奉持功德】　　戊一　空生歎法美人　　己一　深法難遇歎
^o@vcpp.14:1爾時，須菩提聞說是經，深解義趣，涕淚悲泣而白佛言：「希有世尊！佛說如是甚深經典，我從昔來所得慧眼，未曾得聞如是之經！
◆受持經典的功德，一切大乘經無不極力稱歎。
受持，含有讀誦、書寫、思惟、實行等。
經中常說受持一四句偈，得不思議功德，因此有人專以拜經，誦經為事，以為這功德夠大了！佛說是不錯的，學者是多少誤會的。
學佛的目的，在乎悟佛所悟，行佛所行。
然而，如沒有理解，怎能實行？
沒有讀誦，又從何去理解？
不聽不見，又怎麼知道去讀誦？
由見聞而讀誦、而理解、而實行、而證入，聽聞、讀誦，豈非為行證的根本嗎？
所以大乘經中，都極力稱歎讀誦等功德，以引人深入。
如神秘的讀誦禮拜，不求解，不起行，以為功德已大極了。
甚至稱讚誦持功德，成為變相的符咒，這怕不是功德，而反是無量罪惡呢！
◆空生，就是須菩提。
他深刻的理解到般若法門的義趣——義是義理，趣是意趣，感到法門的希有！想到過去流轉生死的情景，非常慚愧；
想到如來的慈悲救拔，得以超脫而聽聞菩薩行，又是無限的感激，所以就不自覺的涕淚悲泣起來。
他向佛說：希有！希有！如來所說的甚深微妙法門，我從過去所得慧眼以來，未曾聽說過這樣甚深的法門；
這次竟然聽到了，是多麼的欣幸！慧眼，即「知實相慧」，此慧能徹見諸法的如實相，所以名慧眼。
《阿含經》中，稱為法眼，法即實相的異名，與此所說的慧眼同一；
與大乘經中的法眼不同。
須菩提所說慧眼，即指聲聞的證智。
他說從來沒有聽過這樣的經，可作二釋：一、從大悲為本，無所得為方便的菩提心行說，聲聞行者確乎不知的。
二、從離相徹悟的實相說，須菩提久已正覺，而且能與佛共論，於此般若法門，何致驚奇如此！須知這是代表一般取相的聲聞行者的。
大弟子在法會中，不論是問是答，都有當機的領導作用。
現在代表那些取相的眾生，特別是執有諸法實性的增上慢聲聞，所以說從未得聞。
極力稱歎深法的難聞，使他們注意而受持這離相妙悟的般若。

◆玄奘譯及義淨譯，將須菩提請問法門名字一段，移在本節之下。
但流支，真諦等譯，又都與本譯相同。
奘譯與淨譯，似乎同於世親的釋論本。
而無著論的釋本，與本譯相近。
^ck25【已二　信者難能歎】
^o@vcpp.14:3世尊！若復有人得聞是經，信心清淨，則生實相，當知是人成就第一希有功德。世尊！是實相者，則是非相，是故如來說名實相。世尊！我今得聞如是經典，信解受持，不足為難。若當來世後五百歲，其有眾生得聞是經，信解受持，是人則為第一希有！何以故？此人無我相、人相、眾生相、壽者相。所以者何？我相即是非相，人相、眾生相、壽者相即是非相。何以故？離一切諸相，則名諸佛」。
◆空生稱歎深法難逢後，接著說：如有人聽了這深妙法門，能離一切妄相而清淨信心——生實相，這是極為難得的！是成就第一希有功德的！前文，空生疑未來眾生不能聽此經而生實信，現在是肯定的說有人能生實信。
信，以「心淨為性」。
但此中的淨信，是離戲論而顯的心自清淨，是如實相而知的證信，即清淨增上意樂或不壞信。
聞此經而能生淨信，即能生實相。
實相，異譯作實想。
想即智慧的別名，如經說無常想、無我想等。
所以，實相即如實相而知的般若；
生實相，即「一切法不生則般若生」。
但實相如何可說，所以須菩提隨即說：實相，實即是非相，是離一切名言測度的畢竟空寂；
從不為虛誑妄取相所惑亂，名之為實相。
諸法實相，即諸法的實相不可得；
因為一切法的實相不可得，所以名為實相。
這是般若法門的實相說，顯示般若的特色！
◆須菩提又說：我能聽深妙的經典而信解受持，還不算難。
當來世後五百歲中，如有眾生能聽此經而信解受持的，這才是第一希有哩！因為，我生逢佛世，佛說是那樣的善巧，一言一語都從實悟中來，格外親切有味！所以信解領受，不足為難。
佛後五百年，人根轉鈍，時間又經久了，佛法又是彼此展轉傳來。
所以，那時的眾生，如能信解受持般若深法，真是難中之難！經中每勸人發願，見佛聞法，理由也在此。

◆後五百歲的眾生，信解受持這《金剛般若經》，為什麼第一希有？
因為，這人已沒有我等四相的取執了。
這可見不問時代的正法、像法，不問地點的中國、邊地，能否信解般若，全在眾生自己，是否已多見佛，多聞法，多種善根，是否能離四相而定。
無我等四相，並非實有我等四相，而加以取消或摧毀。
要知道：我等本不可得，由於眾生的顛倒，無中執有；
所以無我等四相，只是顯明他的本相無所有而已。
能離我等四相，即能離法相與非法相，所以說：離虛妄顛倒的諸相，即名為佛。
這與上文的「若見諸相非相，即見如來」，完全同一。
離四相，或者以為與佛相差還遠。
不知約覺悟實相——無分別法性說，與諸佛一覺一解脫，平等平等，也得名為佛。
所以古人說：「須陀洹名初得法身」。
論說：「佛陀，是覺悟真實之義，此名通於聲聞、獨覺及無上菩提三者」。

^ck26【戊二　如來勸行歎勝】　　己一　略歎勸行　　庚一　正說　　辛一　略歎
^o@vcpp.14:8佛告須菩提：「如是！如是！若復有人得聞是經，不驚、不怖、不畏，當知是人甚為希有！何以故？須菩提！如來說第一波羅蜜，非第一波羅蜜，是名第一波羅蜜。
◆須菩提讚歎深法及信解者，非常合理，因此佛為之印證，更進一步的廣說。
佛說：是的！後五百歲中，假使有人得聞此經，能不驚、不怖、不畏，這的確是難得的！不但平常人，或是世間學者，或是神教的信徒，就是佛弟子，聽了諸法畢竟空的甚深法門，能不驚、不怖、不畏，也是極為希有的！眾生為普遍的成見——自性妄執所誑惑，聽見畢竟空，不能不驚慌而恐怖起來！神教徒怕動搖了他們的上帝，哲學家怕失去了他們所唯的物或心，學佛者怕流轉還滅無從安立，所以《智論》說：「五百部聞畢竟空，如刀傷心」。
《中論》青目釋：「若都畢竟空，云何分別有罪福報應等」？
《成唯識論》說：「若一切法皆非實有，菩薩不應為捨生死，精勤修集菩提資糧」！這唯有能於畢竟空中，成立無自性的如幻因果，心無所著，才能不落懷疑，不生邪見，不驚、不怖、不畏，這真可說是火裡青蓮！信解如此不易，可見般若的究竟第一，所以說：如來說第一波羅蜜。
然而，第一波羅蜜，即是無可取、無可說，也即是第一不可得，波羅蜜不可得。
唯其離相不可得，所以為諸法的究極本性，為萬行的宗導，而被十方諸佛讚歎為第一波羅蜜。

^ck27【辛二　勸行】　　壬一　忍辱離相勸
^o@vcpp.14:10須菩提！忍辱波羅蜜，如來說非忍辱波羅蜜。何以故？須菩提！如我昔為歌利王割截身體，我於爾時無我相、無人相、無眾生相、無壽者相。何以故？我於往昔節節支解時，若有我相、人相、眾生相、壽者相，應生瞋恨。須菩提！又念過去於五百世作忍辱仙人，於爾所世無我相、無人相、無眾生相、無壽者相。是故須菩提！菩薩應離一切相發阿耨多羅三藐三菩提心！不應住色生心，不應住聲、香、味、觸、法生心，應生無所住心！若心有住，則為非住，是故佛說菩薩心不應住色布施。須菩提！菩薩為利益一切眾生，應如是布施！如來說一切諸相，即是非相。又說一切眾生，則非眾生。
◆法門那樣深，淨信者的功德那樣大！所以佛告須菩提：學佛法者，應依此經所說而發心修行。
大乘般若波羅蜜，不偏於理證，而是與施、戒、忍等相應，表現般若大用的。
本經以大悲利他的菩提心為本，所以上文偏說布施，而此處又特別讚歎忍辱。

◆梵語羼提，即是忍。
忍不但忍辱，還忍苦耐勞，忍可（即認透確定）事理。
所以論說忍有三：忍受人事間的苦迫，叫生忍；
忍受身心的勞苦病苦，以及風雨寒熱等苦，叫法忍；
忍可諸法無生性，叫無生忍，無生忍即般若慧。
常人所不易忍的，即受人的欺虐等，所以經中多舉忍辱為例。
不論世間事或出世大事，在實行的過程中，身心的、自然的、人事的，都有種種的糾纏、困難。
尤其是菩薩發大心，行廣大難行，度無邊眾生，學無量佛法，艱苦是必然不免的。
為眾生而實行利濟，眾生或不知領受，或反而以怨報德，在這情形下，如不能安忍，那如何能度眾生？
所以為了度生，成佛大事，必須修大忍才能完成。
忍是強毅不拔的意解力；
菩薩修此忍力，即能不為一切外來或內在的惡環境，惡勢力所屈伏。
受得苦難，看得徹底，站得穩當，以無限的悲願熏心，般若相應，能不因種種而引起自己的煩惱，退失自己的本心。
所以，忍是內剛而外柔，能無限的忍耐，而內心能不變初衷，為了達成理想的目標而忍。
佛法勸人忍辱，是勸人學菩薩，是無我大悲的實踐，非奴隸式的忍辱！
◆佛告須菩提：般若是第一波羅蜜，即具足六波羅蜜。
例如忍辱波羅蜜，在與般若相應而能深忍時，即能忍的我，所忍的境與忍法，都不可得，所以即非忍辱波羅蜜。
能如此，才能名為忍波羅蜜。
關於忍辱，如來舉過去的本生來證明：如在過去生中，歌利王支解割截我的身體。
那時，我沒有我等四相。
假使執有我等四相，就要起極大的瞋恨心；
即使無力反抗，也必怨恨在心，這即不能忍辱了。
由此，可證明當時沒有我等四相；
無我，所以能大悲，能大忍！
◆歌利，譯為惡生。
傳說：歌利為北印的烏萇國王，殘暴得很！一次，王帶了宮女們，入山去遊獵。
宮女們趁國王休息入夢時，就自由去遊玩。
在深林中，見一修行忍辱的仙人——即印度過著隱遁生活的宗教徒。
仙人見他們來，就為他們說法。
國王一覺醒來，不見一人，到各處去尋找。
見他們圍著仙人在談話，不覺氣沖沖的責問仙人。
仙人說：我是在此修行忍辱的，宮女們自動的到這裡來問法。
國王聽說是忍辱仙人，就用刀砍下他的手腳，看他是否能忍。
當時，仙人毫沒有怨恨，神色不變。
這仙人，即釋迦佛的前生。
又如傳說：禪宗二祖慧可，被賊砍去臂膀，能以法印心，不覺痛苦，這也可說是忍辱波羅蜜了。

◆如來又說：我不但在歌利王時如此，在過去五百世中，作忍辱仙人，也是一樣的沒有我相、人相、眾生相、壽者相的。
這可見修菩薩行的，是怎樣的重視般若相應的忍辱波羅蜜了！
◆說到這裡，佛總結而勸告眾人說：菩薩發心，應離一切相而發無上遍正覺心！離相發心，即發勝義菩提心，也就是明心菩提。
一切相，雖無量無邊，但不出六塵境相。
所以離相發心，即不應該住色塵相而發心，不應住聲、香、味、觸、法相而發心，應一切無所住而生大菩提心。
假使發心的人，心有所住，即取相著相，就不能安住於阿耨多羅三藐三菩提心。
所以佛在前面，曾經說過：發無上遍正覺心的菩薩，不應住色等相而布施。
要利益眾生，應這樣的無住布施。
布施是法，眾生是人。
若執法相、人相，即不過人天施善，不能成為利益眾生的大行。
所以接著說：如來說的一切相，即是非相。
說的一切眾生，即非眾生。
通達非相非眾生，所以能布施，所以能忍辱。
^ck28【壬二　佛說無虛勸】
^o@vcpp.14:18須菩提！如來是真語者，實語者，如語者，不誑語者，不異語者。須菩提！如來所得法，此法無實無虛。須菩提！若菩薩心住於法而行布施，如人入闇，則無所見；若菩薩心不住法而行布施，如人有目，日光明照，見種種色。
◆世人說話，常不免與事理不符，所以不能過分的信任。
如來說法，一切是如實的，所以一切可信。
法門的甚深，本生的修行，無不是可信的。
真語等五句，別譯少不誑語一句。
此五句，都是真實可信的意思。
如從差別的字義說：真是不妄的，實是不虛的，如是一樣的；
不誑即是實的，不異即是如的，如來的梵語，本有如法相而說的意思，所以佛說是一切可信的。

◆如來以佛說的真實，勸人信受奉行。
但接著說：可不要誤會，以為如來說什麼宇宙的實體了！如來所證覺的，是無所謂實、無所謂虛的。
凡夫為無明所覆，於無所有中執為如是實有，不契法性，所以稱為虛誑妄取。
為遣此虛妄執相，所以又稱不虛誑相現的空性為實相。
眾生執著實有，佛責斥為虛妄的。
雖本無虛妄相可得，勸眾生離此取著，所以說離妄相而見實相。
以真去妄，為不得已的方便。
如真的虛妄淨盡，真實也不可得，如以雹擊草，草死雹消。
所以說：如來所得法無實無虛。
◆菩薩修菩薩行，應契會此無實無虛。
若心住於色等法而行布施，這如走入無光的闇室，一切都不能見；
反之，菩薩心不住於色等法而行布施，那就如明目人，在日光朗照的地方，能見種種的形色。
這說明布施要與般若相應，不著一切，即能利益眾生，趨入佛道，莊嚴無上的佛果。
修學般若，略有二行：一、入理，即於定中正觀法相，達自性空而離相生清淨心。
二、成行，即本著般若的妙悟，在種種利他行中，離妄執而隨順實相。
大乘般若的特色，更重於成行。
在成行中，本經特重於利他為先的布施。
這些，受持《金剛般若經》者，應有深刻的認識！
^ck29【庚二　校德】
^o@vcpp.14:22須菩提！當來之世，若有善男子善女人，能於此經受持、讀誦，則為如來以佛智慧悉知是人，悉見是人，皆得成就無量無邊功德。須菩提！若有善男子善女人，初日分以恆河沙等身布施，中日分復以恆河沙等身布施，後日分亦以恆河沙等身布施，如是無量百千萬億劫以身布施；若復有人聞此經典信心不逆，其福勝彼，何況書寫、受持、讀誦、為人解說！
◆此第四番校德。
先總括的說：將來如有善男子善女人，能受持、讀誦這般若妙典，那即為如來的大智慧眼，在一切時、一切處、一切事中，完全明確的知道、見到，能常為如來所護持，他的功德是無量無邊的。
為了顯示功德的無量，舉喻校量。
中國分一天為十二時，印度分為六時，日三時，夜三時。
白天的三時：約十點鐘以前為初日分，十點到下午二點為中日分，二點鐘以後是後日分。
假使有人，在每日三時中，三度以恆河沙數這麼多的身命，為有情而犧牲——布施；
而且不是一天兩天，又經過無量百千萬億劫這麼久；
這比上文所說的恆河沙等身命布施，功德更殊勝了！喻有實喻假喻，這是假設的比較，總之形容功德的不可勝算罷了！然而，如另有人，聽聞這般若經典，能生信心，隨順般若而不違逆，那功德即勝過前人多多了！單是「信順」的功德即如此，何況更進一步的書寫、受持、讀誦、為他人演說呢！功德當然更大了！這樣的稱歎受持等功德，實因本經的功德殊勝，如下文所說。

^ck30【己二　廣歎顯勝】　　庚一　正說　　辛一　獨被大乘勝
^o@vcpp.15:3須菩提！以要言之，是經有不可思議、不可稱量、無邊功德！如來為發大乘者說，為發最上乘者說。若有人能受持、讀誦、廣為人說，如來悉知是人、悉見是人，皆得成就不可量、不可稱、無有邊、不可思議功德。如是人等，則為荷擔如來阿耨多羅三藐三菩提。何以故？須菩提！若樂小法者，著我見、人見、眾生見、壽者見，則於此經不能聽受、讀誦、為人解說。
◆般若的功德，那裡說得盡？
若要略的說：本經有不可思議、不可稱量的無邊功德。
思是內心的計算，議是口頭的說明，稱量是衡度他的多少。
凡是可思可議可稱可量，無論如何多，總是有限的有邊的。
般若與空相應，所以是不可以思議稱量其邊際的。
這樣大功德的妙法，如來不為小乘行者說，為發大乘心者說，為發最上乘心者說。
大是廣大義，最上是究竟無上無容義；
形容法門的廣大無邊——含容大，至高無上——殊勝大。
雖說為二名，並無差別，同是形容菩薩乘——行果的殊勝。

◆這是但為菩薩說的妙法，所以如有人聽了能受持、讀誦、廣為人說，這就是菩薩。
就為如來知見，而得不可思議的功德。
這樣的人，即能荷擔如來的阿耨多羅三藐三菩提。
擔是擔在肩上，荷是負在背上。
意思說：能領受信解的人，對於無上正等菩提，就能擔當得起。
如來證得無上菩提，為了救度眾生；
為眾生種種教化，即是如來的廣大家財——弘法為家務，利生為事業。
能信受轉化，即是能負起這度生重任，紹隆佛種！無上正等菩提，為佛的大智慧，大功德，大事業，大責任，如無人擔當起來，就是斷佛種姓。
如來所以為發大乘者說，即希望他們能信解受持這般若大法，立大志願，起大悲心，以無所得為方便，負起度生的責任來！本來，無上正等菩提，「是法平等，無有高下」，眾生皆有此法寶藏分。
但問題不但是願承當或肯承當，而是能夠承當。
所以，發大乘心者，要能信解此甚深教授，從無我大悲中去承當，從利他無盡中去圓成！
◆繼承如來家業，這是第一等大事，所以如來不願為學小乘者說的。
因為好樂小法的人，住著在我見、人見、眾生見、壽者見，不能於此般若深法，聽受乃至為人解說的。
小乘人為己心重，急急於「逮得己利」。
他們但求解脫而已，何必修學廣大甚深的教法？
何必經三大阿僧祇劫？
何必廣行布施、忍辱，廣度眾生？
只顧自己，所以說他們住於我見。
他們既不求大乘，如來當然也不為他們說了！
◆聲聞者能得無我，這是佛教所共許的，這裡為什麼說樂小乘者住著我見呢？
本經上文說：不得法空，即著我見，這是約三乘同入一法性說，是如實說；
引導聲聞行者不著於法相，迴心大乘。
此處說樂小法者住於我見，約他們不能大悲利他說，是方便說；
是折抑小乘，使他們慚愧回心。
前約證理平等說，此約事行抑揚說。
^ck31【辛二　世間所尊勝】
^o@vcpp.15:8須菩提！在在處處若有此經，一切世間天、人、阿修羅所應供養；當知此處則為是塔，皆應恭敬作禮圍繞，以諸華香而散其處。
◆佛對須菩提說：不論什麼地方——在在處處，只要有此《般若經》在，世間眾生即應當尊敬供養。
因為，此經所在的地方，即等於佛塔的所在。
佛塔，本是供養佛身的；
僧伽藍——寺院，是住出家眾的。
中國的佛寺，混合了這二者。
反之，有些塔變成什麼鎮山鎖水、憑人遊眺了。
佛塔，主要是供養佛的舍利、像設，舍利是如來色身的遺留。
但佛說的教法，是如來法身的等流。
證法性者名為佛；
佛說的教典，是佛證覺法性而開示的，所以也稱為法身。
印度佛徒，每以緣起偈安塔中供養，名法身塔。
所以，有經的地方，就等於有佛塔了。
為了尊敬法身，所以應尊重恭敬供養。
供養佛塔，《四分律》等都有說明。
佛在世時，弟子來見佛，大都繞佛一匝或三匝，然後至誠頂禮。
在家佛弟子，每帶香花來供佛。
香有燒香、塗香、末香。
燒香即我國常用以焚供的。
塗香，也是末香，但以油調和後，塗在佛足上等。
末香是細香末，是散在佛身或佛住的地方。
供佛如此，供養塔——色身塔、法身塔也如此。
中國佛徒，對於佛經，也一向很尊重的。
如叢林裡的藏經，總說是請來供養的，這本來是不錯的。
不過，供養教法，除了敬禮，焚香、獻華而外，還要讀誦、思惟，廣為人說，這也是供養，而且是最勝的供養！
^ck32【辛三　轉滅罪業勝】
^o@vcpp.16:1復次、須菩提！善男子善女人，受持、讀誦此經，若為人輕賤，是人先世罪業應墮惡道，以今世人輕賤故，先世罪業則為消滅，當得阿耨多羅三藐三菩提。
◆依前所說，受持本經的，應該為人尊敬了！然而，有人從未為別人輕視，等到受持讀誦《金剛般若經》，不但不因此而受人尊敬，反而遇到別人的輕視，這是常使人退悔的。
然而不應為此而疑惑、退心！這即是前生惡業轉輕或消滅了的象徵。
我們現生人中，無論境遇如何，過去所造的惡業，潛在而未發的極多。
一遇因緣，就會感受應得的果報，或墮地獄、畜生等。
讀誦《般若經》者，所有過去應墮惡道的罪業，因受持此經的功德力，而現世輕受了；
受人輕視的微報，即不會再感惡道等報。
如人有痘毒，若先種痘，讓他輕微的發一下，就不致再發而有生命的危險了。
受人輕視，也是如此。
而且種下了般若種子，將來定可證得無上正等菩提。

◆佛法說業力，通於三世。
如專約現世說：有作惡的人，作事件件如意，多福多壽。
有作善事的人，反而什麼都不行，一切困難。
尤其是惡人迴心向善，境遇倒一天不如一天，家產一天天消失，使人懷疑老天的公道！若信佛教的三世因果說，知有業現受，有業當來，即能深信善因善果，惡因惡果，而轉惡行善了。
業是行為的餘勢，行為的善不善，以心為要因，所以如有強有力的智慧和願力，可以使業變質的。
業是可能性，不一定要發作，是可能轉變的。
因此，佛教主張有過去業，而不落於宿命論者。
^ck33【庚二　校德】
^o@vcpp.16:3須菩提！我念過去無量阿僧祇劫，於然燈佛前，得值八百四千萬億那由他諸佛，悉皆供養承事，無空過者。若復有人於後末世，能受持、讀誦此經所得功德，於我所供養諸佛功德，百分不及一，千萬億分乃至算數譬喻所不能及。
◆如來以自己經歷的事實，證明受持本經的功德。
如來說：我在過去無量阿僧祇劫前，即未見然燈佛以前，曾遇到過八百四千萬億那由他佛。
在這眾多佛前，都是一一的承事供養，沒有空過的；
所得的功德，真是無量無邊了。
釋迦佛在然燈佛前，授記作佛，即明心菩提。
以前，即從初發心以來的二大阿僧祇劫修行。
今說無量阿僧祇劫，約小劫說。
承事有二：一、侍奉供給，二、遵佛所說去行。
明心菩提以前的功德，還沒有徹悟離相，雖有智慧功德，都是取相的，有漏有限的。
所以，在末法時代，如有人能受持讀誦《金剛般若經》，隨順性空法門，或者得離相生清淨心，那他所得的功德，當然要比釋尊供養諸佛的功德，超勝得不可計算了。
於本經受持讀誦，順向離相，即能超勝有相修行無數阿僧祇劫，這可見功德的殊勝！菩薩發心修行，以離相無住為本，這才是解脫、成佛的要門，學者應以此為標極而求得之！
^ck34【己三　結歎難思】
^o@vcpp.16:6須菩提！若善男子善女人，於後末世，有受持、讀誦此經所得功德，我若具說者，或有人聞，心則狂亂，狐疑不信。須菩提！當知是經義不可思議，果報亦不可思議」！
◆上面雖廣讚功德，其實受持《般若經》所得的功德，是不可盡說的。
即使以如來無方辯才，無限神通，把他完全的說出來，人聽了或許會發狂，或許會疑惑不信，因為這太出於常人的境界了。
這與為井底之蛙，說虛空無邊廣大的那樣難以信受一樣。
總之，《般若經》的般若相應的大悲妙行，甚深廣大，是不可以心思言議的。
所以，聽聞、受持乃至為人解說等所得的果報，也出於常情的想像以外，不可思議！
^ck35【乙二　方便道次第】　　丙一　開示次第　　丁一　請問
^o@vcpp.17:1爾時，須菩提白佛言：「世尊！善男子善女人，發阿耨多羅三藐三菩提心，云何應住？云何降伏其心」？
◆上來講般若道，以下說方便道。
方便道即現證般若，進而到達佛果的階段。
須菩提的請問，及如來的答覆，與前一樣。
不同的，即在答發心的末後，多了「實無有法發阿耨多羅三藐三菩提心者」一句。
眾譯相同，唯有玄奘所譯，前文也有此一句。
上來說到明心菩提，約從凡入聖的悟證說，是成果；
但望於究竟佛果，這才是無相發心的起點，即是發勝義菩提心。
前文所問發心，以立願普度眾生而發，是世俗菩提心。
此處，由深悟無我，見如來法身，從悲智一如中發心，即諸經所說的「紹隆佛種」，「是真佛子」。
前後同樣的是發無上大菩提心，所以須菩提又重行拈出舊問題，請示佛陀：應怎樣安住？
怎樣的降伏其心？
^ck36【丁二　答說】　　戊一　明心菩提　　己一　真發菩提心
^o@vcpp.17:2佛告須菩提：「善男子善女人發阿耨多羅三藐三菩提心者，當生如是心：我應滅度一切眾生，滅度一切眾生已，而無有一眾生實滅度者。何以故？須菩提！若菩薩有我相、人相、眾生相、壽者相，則非菩薩。所以者何？須菩提！實無有法發阿耨多羅三藐三菩提心者。
◆我應滅度一切眾生，滅度一切眾生已，而無有一眾生實滅度者，與前發菩提心同。
因發勝義菩提心，即從畢竟空中，起無緣大悲以入世度生。
以大悲為本的菩提心，始終不二，僅有似悟與真悟的不同而已。
本文接著說：實無有法發阿耨多羅三藐三菩提心者。
前說所度的眾生實不可得，如有所得，即著於我等四相，是就所觀的所化境——眾生而說。
雖悟得補特伽羅無我，而在修證的實踐上，不一定能內觀無我，盡離薩迦耶見——我我所執。
此處，即不但外觀所化的眾生不可得，更能反觀自身，即能發心能度眾生的菩薩——我也不可得。
依修行的次第說：先觀所緣的一切，色聲等諸法，人、天等眾生，都無自性可得，不可取，不可著；
但因薩迦耶見相應的能觀者，未能遮遣，還未能現證。
進一步，反觀發菩提心者，修菩薩行者不可得，即心亦不可得，不見少許法——若色若心有自性，可為發阿耨多羅三藐三菩提心者。
這才薩迦耶見——生死根拔，盡一切戲論而悟入無分別法性。
中觀者廣明一切我法皆空，而以離薩迦耶見的我我所執，為入法的不二門，即是此義。
無所化的眾生相可得，無能發心的菩薩可得；
這樣的降伏其心，即能安住大菩提心，從三界中出，到一切智海中住。

◆多數學者，以為聲聞能破我執，而大乘才能破法執，這應先破我執而後離相！本經前後大段，一般也判為先破法執，後破我執，即為大矛盾處。
又，佛為眾生說法，多明空無我，信解者還多。
到了聖智親證，反而偏執真常大我。
所以，本經於此智證的方便道中，特重於無我的開示。
這即是說：即使是聖智現覺，也還是空無我的。
末法眾生，不聞大乘，如湛愚心燈錄之類，以「我」為開示修行的根本，與我見外道同流，可痛！
^ck37【己二　分證菩提果】
^o@vcpp.17:5須菩提！於意云何？如來於然燈佛所，有法得阿耨多羅三藐三菩提不」？「不也，世尊！如我解佛所說義，佛於然燈佛所，無有法得阿耨多羅三藐三菩提」。佛言：「如是！如是！須菩提！實無有法如來得阿耨多羅三藐三菩提。須菩提！若有法如來得阿耨多羅三藐三菩提者，然燈佛則不與我授記：『汝於來世當得作佛，號釋迦牟尼』。以實無有法得阿耨多羅三藐三菩提，是故然燈佛與我授記，作是言：『汝於來世當得作佛，號釋迦牟尼』。何以故？如來者，即諸法如義。若有人言：如來得阿耨多羅三藐三菩提，須菩提！實無有法佛得阿耨多羅三藐三菩提。須菩提！如來所得阿耨多羅三藐三菩提，於是中無實無虛，是故如來說一切法皆是佛法。須菩提！所言一切法者，即非一切法，是故名一切法。`)